; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/vauth/digest.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MD5_params = type { void (i8*)*, void (i8*, i8*, i32)*, void (i8*, i8*)*, i32, i32 }
%struct.Curl_easy = type { %struct.Curl_easy*, %struct.Curl_easy*, %struct.connectdata*, i32, i32, %struct.Curl_message, [5 x i32], i32, %struct.Names, %struct.Curl_multi*, %struct.Curl_multi*, %struct.Curl_share*, %struct.SingleRequest, %struct.UserDefined, %struct.DynamicStatic, %struct.CookieInfo*, %struct.Progress, %struct.UrlState, %struct.WildcardData, %struct.PureInfo, %struct.curl_tlssessioninfo, i32 }

!181 = !DIEnumerator(name: "IMAP_AUTHENTICATE", value: 5)
!182 = !DIEnumerator(name: "IMAP_LOGIN", value: 6)
!183 = !DIEnumerator(name: "IMAP_LIST", value: 7)
!184 = !DIEnumerator(name: "IMAP_SELECT", value: 8)
!185 = !DIEnumerator(name: "IMAP_FETCH", value: 9)
!186 = !DIEnumerator(name: "IMAP_FETCH_FINAL", value: 10)
!187 = !DIEnumerator(name: "IMAP_APPEND", value: 11)
!188 = !DIEnumerator(name: "IMAP_APPEND_FINAL", value: 12)
!189 = !DIEnumerator(name: "IMAP_SEARCH", value: 13)
!190 = !DIEnumerator(name: "IMAP_LOGOUT", value: 14)
!191 = !DIEnumerator(name: "IMAP_LAST", value: 15)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 58, size: 32, align: 32, elements: !194)
!193 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_sasl.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!195 = !DIEnumerator(name: "SASL_STOP", value: 0)
!196 = !DIEnumerator(name: "SASL_PLAIN", value: 1)
!197 = !DIEnumerator(name: "SASL_LOGIN", value: 2)
!198 = !DIEnumerator(name: "SASL_LOGIN_PASSWD", value: 3)
!199 = !DIEnumerator(name: "SASL_EXTERNAL", value: 4)
!200 = !DIEnumerator(name: "SASL_CRAMMD5", value: 5)
!201 = !DIEnumerator(name: "SASL_DIGESTMD5", value: 6)
!202 = !DIEnumerator(name: "SASL_DIGESTMD5_RESP", value: 7)
!203 = !DIEnumerator(name: "SASL_NTLM", value: 8)
!204 = !DIEnumerator(name: "SASL_NTLM_TYPE2MSG", value: 9)
!205 = !DIEnumerator(name: "SASL_GSSAPI", value: 10)
!206 = !DIEnumerator(name: "SASL_GSSAPI_TOKEN", value: 11)
!207 = !DIEnumerator(name: "SASL_GSSAPI_NO_DATA", value: 12)
!208 = !DIEnumerator(name: "SASL_OAUTH2", value: 13)
!209 = !DIEnumerator(name: "SASL_OAUTH2_RESP", value: 14)
!210 = !DIEnumerator(name: "SASL_CANCEL", value: 15)
!211 = !DIEnumerator(name: "SASL_FINAL", value: 16)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !213, line: 31, size: 32, align: 32, elements: !214)
!213 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/pop3.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!215 = !DIEnumerator(name: "POP3_STOP", value: 0)
!216 = !DIEnumerator(name: "POP3_SERVERGREET", value: 1)
!217 = !DIEnumerator(name: "POP3_CAPA", value: 2)
!218 = !DIEnumerator(name: "POP3_STARTTLS", value: 3)
!219 = !DIEnumerator(name: "POP3_UPGRADETLS", value: 4)
!220 = !DIEnumerator(name: "POP3_AUTH", value: 5)
!221 = !DIEnumerator(name: "POP3_APOP", value: 6)
!222 = !DIEnumerator(name: "POP3_USER", value: 7)
!223 = !DIEnumerator(name: "POP3_PASS", value: 8)
!224 = !DIEnumerator(name: "POP3_COMMAND", value: 9)
!225 = !DIEnumerator(name: "POP3_QUIT", value: 10)
!226 = !DIEnumerator(name: "POP3_LAST", value: 11)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !228, line: 31, size: 32, align: 32, elements: !229)
!228 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/smtp.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!230 = !DIEnumerator(name: "SMTP_STOP", value: 0)
!231 = !DIEnumerator(name: "SMTP_SERVERGREET", value: 1)
!232 = !DIEnumerator(name: "SMTP_EHLO", value: 2)
!233 = !DIEnumerator(name: "SMTP_HELO", value: 3)
!234 = !DIEnumerator(name: "SMTP_STARTTLS", value: 4)
!235 = !DIEnumerator(name: "SMTP_UPGRADETLS", value: 5)
!236 = !DIEnumerator(name: "SMTP_AUTH", value: 6)
!237 = !DIEnumerator(name: "SMTP_COMMAND", value: 7)
!238 = !DIEnumerator(name: "SMTP_MAIL", value: 8)
!239 = !DIEnumerator(name: "SMTP_RCPT", value: 9)
!240 = !DIEnumerator(name: "SMTP_DATA", value: 10)
!241 = !DIEnumerator(name: "SMTP_POSTDATA", value: 11)
!242 = !DIEnumerator(name: "SMTP_QUIT", value: 12)
!243 = !DIEnumerator(name: "SMTP_LAST", value: 13)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "smb_conn_state", file: !245, line: 25, size: 32, align: 32, elements: !246)
!245 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/smb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!246 = !{!247, !248, !249, !250, !251}
!247 = !DIEnumerator(name: "SMB_NOT_CONNECTED", value: 0)
!248 = !DIEnumerator(name: "SMB_CONNECTING", value: 1)
!249 = !DIEnumerator(name: "SMB_NEGOTIATE", value: 2)
!250 = !DIEnumerator(name: "SMB_SETUP", value: 3)
!251 = !DIEnumerator(name: "SMB_CONNECTED", value: 4)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !253, file: !121, line: 1133, size: 32, align: 32, elements: !1674)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "connectdata", file: !121, line: 895, size: 13440, align: 64, elements: !254)
!254 = !{!255, !1255, !1267, !1268, !1269, !1270, !1271, !1297, !1298, !1302, !1303, !1304, !1305, !1312, !1313, !1314, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1342, !1344, !1351, !1357, !1366, !1367, !1368, !1369, !1370, !1406, !1407, !1408, !1409, !1463, !1464, !1465, !1466, !1467, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1493, !1494, !1495, !1496, !1659, !1660, !1661, !1662, !1663, !1664, !1666, !1673}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !253, file: !121, line: 899, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_easy", file: !121, line: 1801, size: 160192, align: 64, elements: !258)
!258 = !{!259, !260, !261, !263, !288, !290, !313, !319, !320, !374, !450, !451, !454, !528, !1005, !1014, !1041, !1077, !1181, !1204, !1234, !1254}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !121, line: 1803, baseType: !256, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !257, file: !121, line: 1804, baseType: !256, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "easy_conn", scope: !257, file: !121, line: 1806, baseType: !262, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !257, file: !121, line: 1808, baseType: !264, size: 32, align: 32, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLMstate", file: !265, line: 59, baseType: !266)
!265 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/multihandle.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 35, size: 32, align: 32, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!268 = !DIEnumerator(name: "CURLM_STATE_INIT", value: 0)
!269 = !DIEnumerator(name: "CURLM_STATE_CONNECT_PEND", value: 1)
!270 = !DIEnumerator(name: "CURLM_STATE_CONNECT", value: 2)
!271 = !DIEnumerator(name: "CURLM_STATE_WAITRESOLVE", value: 3)
!272 = !DIEnumerator(name: "CURLM_STATE_WAITCONNECT", value: 4)
!273 = !DIEnumerator(name: "CURLM_STATE_WAITPROXYCONNECT", value: 5)
!274 = !DIEnumerator(name: "CURLM_STATE_SENDPROTOCONNECT", value: 6)
!275 = !DIEnumerator(name: "CURLM_STATE_PROTOCONNECT", value: 7)
!276 = !DIEnumerator(name: "CURLM_STATE_WAITDO", value: 8)
!277 = !DIEnumerator(name: "CURLM_STATE_DO", value: 9)
!278 = !DIEnumerator(name: "CURLM_STATE_DOING", value: 10)
!279 = !DIEnumerator(name: "CURLM_STATE_DO_MORE", value: 11)
!280 = !DIEnumerator(name: "CURLM_STATE_DO_DONE", value: 12)
!281 = !DIEnumerator(name: "CURLM_STATE_WAITPERFORM", value: 13)
!282 = !DIEnumerator(name: "CURLM_STATE_PERFORM", value: 14)
!283 = !DIEnumerator(name: "CURLM_STATE_TOOFAST", value: 15)
!284 = !DIEnumerator(name: "CURLM_STATE_DONE", value: 16)
!285 = !DIEnumerator(name: "CURLM_STATE_COMPLETED", value: 17)
!286 = !DIEnumerator(name: "CURLM_STATE_MSGSENT", value: 18)
!287 = !DIEnumerator(name: "CURLM_STATE_LAST", value: 19)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !257, file: !121, line: 1809, baseType: !289, size: 32, align: 32, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLcode", file: !4, line: 561, baseType: !3)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !257, file: !121, line: 1811, baseType: !291, size: 192, align: 64, offset: 256)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_message", file: !265, line: 27, size: 192, align: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "extmsg", scope: !291, file: !265, line: 29, baseType: !294, size: 192, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "CURLMsg", file: !295, line: 93, size: 192, align: 64, elements: !296)
!295 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/multi.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!296 = !{!297, !304, !307}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !294, file: !295, line: 94, baseType: !298, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLMSG", file: !295, line: 91, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 86, size: 32, align: 32, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIEnumerator(name: "CURLMSG_NONE", value: 0)
!302 = !DIEnumerator(name: "CURLMSG_DONE", value: 1)
!303 = !DIEnumerator(name: "CURLMSG_LAST", value: 2)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "easy_handle", scope: !294, file: !295, line: 95, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURL", file: !4, line: 100, baseType: !257)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !295, line: 99, baseType: !308, size: 64, align: 64, offset: 128)
!308 = !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !295, line: 96, size: 64, align: 64, elements: !309)
!309 = !{!310, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "whatever", scope: !308, file: !295, line: 97, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !308, file: !295, line: 98, baseType: !289, size: 32, align: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !257, file: !121, line: 1817, baseType: !314, size: 160, align: 32, offset: 448)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 160, align: 32, elements: !317)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socket_t", file: !4, line: 131, baseType: !316)
!316 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!317 = !{!318}
!318 = !DISubrange(count: 5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "numsocks", scope: !257, file: !121, line: 1818, baseType: !316, size: 32, align: 32, offset: 608)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dns", scope: !257, file: !121, line: 1820, baseType: !321, size: 128, align: 64, offset: 640)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Names", file: !121, line: 1781, size: 128, align: 64, elements: !322)
!322 = !{!323, !367}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hostcache", scope: !321, file: !121, line: 1782, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_hash", file: !326, line: 46, size: 384, align: 64, elements: !327)
!326 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/hash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!327 = !{!328, !350, !355, !360, !365, !366}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !325, file: !326, line: 47, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist", file: !331, line: 37, size: 256, align: 64, elements: !332)
!331 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/llist.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!332 = !{!333, !340, !341, !346}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !330, file: !331, line: 38, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist_element", file: !331, line: 30, size: 192, align: 64, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !335, file: !331, line: 31, baseType: !311, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !335, file: !331, line: 33, baseType: !334, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !335, file: !331, line: 34, baseType: !334, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !330, file: !331, line: 39, baseType: !334, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !330, file: !331, line: 41, baseType: !342, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_llist_dtor", file: !331, line: 28, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !311, !311}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !331, line: 43, baseType: !347, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !348, line: 62, baseType: !349)
!348 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!349 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !325, file: !326, line: 50, baseType: !351, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_function", file: !326, line: 32, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!347, !311, !347, !347}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "comp_func", scope: !325, file: !326, line: 53, baseType: !356, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "comp_function", file: !326, line: 39, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!347, !311, !347, !311, !347}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !325, file: !326, line: 54, baseType: !361, size: 64, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_hash_dtor", file: !326, line: 44, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !311}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !325, file: !326, line: 55, baseType: !316, size: 32, align: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !325, file: !326, line: 56, baseType: !347, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hostcachetype", scope: !321, file: !121, line: 1788, baseType: !368, size: 32, align: 32, offset: 64)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !321, file: !121, line: 1783, size: 32, align: 32, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIEnumerator(name: "HCACHE_NONE", value: 0)
!371 = !DIEnumerator(name: "HCACHE_GLOBAL", value: 1)
!372 = !DIEnumerator(name: "HCACHE_MULTI", value: 2)
!373 = !DIEnumerator(name: "HCACHE_SHARED", value: 3)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !257, file: !121, line: 1821, baseType: !375, size: 64, align: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_multi", file: !265, line: 70, size: 3840, align: 64, elements: !377)
!377 = !{!378, !380, !381, !382, !383, !384, !385, !386, !391, !392, !399, !400, !401, !420, !421, !422, !424, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !448, !449}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !265, line: 73, baseType: !379, size: 64, align: 64)
!379 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "easyp", scope: !376, file: !265, line: 76, baseType: !256, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "easylp", scope: !376, file: !265, line: 77, baseType: !256, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_easy", scope: !376, file: !265, line: 79, baseType: !316, size: 32, align: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "num_alive", scope: !376, file: !265, line: 80, baseType: !316, size: 32, align: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "msglist", scope: !376, file: !265, line: 83, baseType: !330, size: 256, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !376, file: !265, line: 85, baseType: !330, size: 256, align: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "socket_cb", scope: !376, file: !265, line: 89, baseType: !387, size: 64, align: 64, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socket_callback", file: !295, line: 268, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!316, !305, !315, !316, !311, !311}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "socket_userp", scope: !376, file: !265, line: 90, baseType: !311, size: 64, align: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "push_cb", scope: !376, file: !265, line: 93, baseType: !393, size: 64, align: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_push_callback", file: !295, line: 429, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!316, !305, !305, !347, !397, !311}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_pushheaders", file: !295, line: 422, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "push_userp", scope: !376, file: !265, line: 94, baseType: !311, size: 64, align: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hostcache", scope: !376, file: !265, line: 97, baseType: !325, size: 384, align: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "timetree", scope: !376, file: !265, line: 101, baseType: !402, size: 64, align: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_tree", file: !404, line: 26, size: 448, align: 64, elements: !405)
!404 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/splay.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!405 = !{!406, !407, !408, !409, !410, !419}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "smaller", scope: !403, file: !404, line: 27, baseType: !402, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "larger", scope: !403, file: !404, line: 28, baseType: !402, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "samen", scope: !403, file: !404, line: 29, baseType: !402, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "samep", scope: !403, file: !404, line: 30, baseType: !402, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !403, file: !404, line: 31, baseType: !411, size: 128, align: 64, offset: 256)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !412, line: 30, size: 128, align: 64, elements: !413)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!413 = !{!414, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !411, file: !412, line: 32, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !416, line: 139, baseType: !379)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !411, file: !412, line: 33, baseType: !418, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !416, line: 141, baseType: !379)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !403, file: !404, line: 32, baseType: !311, size: 64, align: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sockhash", scope: !376, file: !265, line: 106, baseType: !325, size: 384, align: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining", scope: !376, file: !265, line: 109, baseType: !379, size: 64, align: 64, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "recheckstate", scope: !376, file: !265, line: 111, baseType: !423, size: 8, align: 8, offset: 1920)
!423 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cache", scope: !376, file: !265, line: 114, baseType: !425, size: 640, align: 64, offset: 1984)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "conncache", file: !426, line: 26, size: 640, align: 64, elements: !427)
!426 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/conncache.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !425, file: !426, line: 27, baseType: !325, size: 384, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "num_connections", scope: !425, file: !426, line: 28, baseType: !347, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next_connection_id", scope: !425, file: !426, line: 29, baseType: !379, size: 64, align: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "last_cleanup", scope: !425, file: !426, line: 30, baseType: !411, size: 128, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "closure_handle", scope: !376, file: !265, line: 118, baseType: !256, size: 64, align: 64, offset: 2624)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "maxconnects", scope: !376, file: !265, line: 120, baseType: !379, size: 64, align: 64, offset: 2688)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "max_host_connections", scope: !376, file: !265, line: 123, baseType: !379, size: 64, align: 64, offset: 2752)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "max_total_connections", scope: !376, file: !265, line: 126, baseType: !379, size: 64, align: 64, offset: 2816)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "max_pipeline_length", scope: !376, file: !265, line: 129, baseType: !379, size: 64, align: 64, offset: 2880)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "content_length_penalty_size", scope: !376, file: !265, line: 132, baseType: !379, size: 64, align: 64, offset: 2944)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_length_penalty_size", scope: !376, file: !265, line: 137, baseType: !379, size: 64, align: 64, offset: 3008)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining_site_bl", scope: !376, file: !265, line: 141, baseType: !330, size: 256, align: 64, offset: 3072)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining_server_bl", scope: !376, file: !265, line: 144, baseType: !330, size: 256, align: 64, offset: 3328)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cb", scope: !376, file: !265, line: 148, baseType: !442, size: 64, align: 64, offset: 3584)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_multi_timer_callback", file: !295, line: 285, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!316, !446, !379, !311}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLM", file: !295, line: 56, baseType: !376)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "timer_userp", scope: !376, file: !265, line: 149, baseType: !311, size: 64, align: 64, offset: 3648)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "timer_lastcall", scope: !376, file: !265, line: 150, baseType: !411, size: 128, align: 64, offset: 3712)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "multi_easy", scope: !257, file: !121, line: 1824, baseType: !375, size: 64, align: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "share", scope: !257, file: !121, line: 1827, baseType: !452, size: 64, align: 64, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_share", file: !4, line: 101, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !257, file: !121, line: 1828, baseType: !455, size: 2496, align: 64, offset: 960)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "SingleRequest", file: !121, line: 658, size: 2496, align: 64, elements: !456)
!456 = !{!457, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !477, !478, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !497, !504, !505, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !522, !523, !524, !525, !526, !527}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !455, file: !121, line: 659, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_off_t", file: !459, line: 216, baseType: !379)
!459 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/curlbuild.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bytecountp", scope: !455, file: !121, line: 660, baseType: !461, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "maxdownload", scope: !455, file: !121, line: 662, baseType: !458, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "writebytecountp", scope: !455, file: !121, line: 664, baseType: !461, size: 64, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bytecount", scope: !455, file: !121, line: 666, baseType: !458, size: 64, align: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "writebytecount", scope: !455, file: !121, line: 667, baseType: !458, size: 64, align: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "headerbytecount", scope: !455, file: !121, line: 669, baseType: !379, size: 64, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "deductheadercount", scope: !455, file: !121, line: 670, baseType: !379, size: 64, align: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !455, file: !121, line: 676, baseType: !411, size: 128, align: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !455, file: !121, line: 677, baseType: !411, size: 128, align: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !455, file: !121, line: 678, baseType: !423, size: 8, align: 8, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "badheader", scope: !455, file: !121, line: 684, baseType: !472, size: 32, align: 32, offset: 800)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !455, file: !121, line: 679, size: 32, align: 32, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIEnumerator(name: "HEADER_NORMAL", value: 0)
!475 = !DIEnumerator(name: "HEADER_PARTHEADER", value: 1)
!476 = !DIEnumerator(name: "HEADER_ALLBAD", value: 2)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "headerline", scope: !455, file: !121, line: 686, baseType: !316, size: 32, align: 32, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hbufp", scope: !455, file: !121, line: 688, baseType: !479, size: 64, align: 64, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hbuflen", scope: !455, file: !121, line: 689, baseType: !347, size: 64, align: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !455, file: !121, line: 690, baseType: !479, size: 64, align: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "str_start", scope: !455, file: !121, line: 691, baseType: !479, size: 64, align: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "end_ptr", scope: !455, file: !121, line: 692, baseType: !479, size: 64, align: 64, offset: 1152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !455, file: !121, line: 693, baseType: !479, size: 64, align: 64, offset: 1216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "content_range", scope: !455, file: !121, line: 694, baseType: !423, size: 8, align: 8, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !455, file: !121, line: 695, baseType: !458, size: 64, align: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "httpcode", scope: !455, file: !121, line: 697, baseType: !316, size: 32, align: 32, offset: 1408)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start100", scope: !455, file: !121, line: 699, baseType: !411, size: 128, align: 64, offset: 1472)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "exp100", scope: !455, file: !121, line: 700, baseType: !491, size: 32, align: 32, offset: 1600)
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expect100", file: !121, line: 636, size: 32, align: 32, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIEnumerator(name: "EXP100_SEND_DATA", value: 0)
!494 = !DIEnumerator(name: "EXP100_AWAITING_CONTINUE", value: 1)
!495 = !DIEnumerator(name: "EXP100_SENDING_REQUEST", value: 2)
!496 = !DIEnumerator(name: "EXP100_FAILED", value: 3)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "upgr101", scope: !455, file: !121, line: 701, baseType: !498, size: 32, align: 32, offset: 1632)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "upgrade101", file: !121, line: 644, size: 32, align: 32, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIEnumerator(name: "UPGR101_INIT", value: 0)
!501 = !DIEnumerator(name: "UPGR101_REQUESTED", value: 1)
!502 = !DIEnumerator(name: "UPGR101_RECEIVED", value: 2)
!503 = !DIEnumerator(name: "UPGR101_WORKING", value: 3)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "auto_decoding", scope: !455, file: !121, line: 703, baseType: !316, size: 32, align: 32, offset: 1664)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "timeofdoc", scope: !455, file: !121, line: 715, baseType: !506, size: 64, align: 64, offset: 1728)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !507, line: 75, baseType: !415)
!507 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bodywrites", scope: !455, file: !121, line: 716, baseType: !379, size: 64, align: 64, offset: 1792)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !455, file: !121, line: 718, baseType: !479, size: 64, align: 64, offset: 1856)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "uploadbuf", scope: !455, file: !121, line: 719, baseType: !479, size: 64, align: 64, offset: 1920)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !455, file: !121, line: 720, baseType: !315, size: 32, align: 32, offset: 1984)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "keepon", scope: !455, file: !121, line: 722, baseType: !316, size: 32, align: 32, offset: 2016)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "upload_done", scope: !455, file: !121, line: 724, baseType: !423, size: 8, align: 8, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ignorebody", scope: !455, file: !121, line: 727, baseType: !423, size: 8, align: 8, offset: 2056)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ignorecl", scope: !455, file: !121, line: 728, baseType: !423, size: 8, align: 8, offset: 2064)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !455, file: !121, line: 731, baseType: !479, size: 64, align: 64, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "newurl", scope: !455, file: !121, line: 733, baseType: !479, size: 64, align: 64, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "upload_present", scope: !455, file: !121, line: 738, baseType: !519, size: 64, align: 64, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !520, line: 109, baseType: !521)
!520 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !416, line: 172, baseType: !379)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "upload_fromhere", scope: !455, file: !121, line: 744, baseType: !479, size: 64, align: 64, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !455, file: !121, line: 746, baseType: !423, size: 8, align: 8, offset: 2368)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "upload_chunky", scope: !455, file: !121, line: 747, baseType: !423, size: 8, align: 8, offset: 2376)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "getheader", scope: !455, file: !121, line: 749, baseType: !423, size: 8, align: 8, offset: 2384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "forbidchunk", scope: !455, file: !121, line: 751, baseType: !423, size: 8, align: 8, offset: 2392)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "protop", scope: !455, file: !121, line: 755, baseType: !311, size: 64, align: 64, offset: 2432)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !257, file: !121, line: 1829, baseType: !529, size: 13760, align: 64, offset: 3456)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserDefined", file: !121, line: 1558, size: 13760, align: 64, elements: !530)
!530 = !{!531, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !606, !607, !608, !609, !614, !615, !616, !618, !619, !620, !626, !631, !647, !659, !670, !671, !695, !696, !701, !702, !703, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !730, !731, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !770, !771, !783, !784, !820, !821, !825, !827, !828, !829, !830, !831, !832, !833, !840, !841, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !893, !894, !895, !896, !897, !898, !899, !900, !909, !917, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !941, !942, !943, !944, !945, !946, !963, !964, !965, !972, !977, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1004}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !529, file: !121, line: 1559, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !534, line: 48, baseType: !535)
!534 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !536, line: 245, size: 1728, align: 64, elements: !537)
!536 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !558, !559, !560, !561, !563, !565, !567, !571, !574, !576, !577, !578, !579, !580, !581, !582}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !535, file: !536, line: 246, baseType: !316, size: 32, align: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !535, file: !536, line: 251, baseType: !479, size: 64, align: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !535, file: !536, line: 252, baseType: !479, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !535, file: !536, line: 253, baseType: !479, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !535, file: !536, line: 254, baseType: !479, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !535, file: !536, line: 255, baseType: !479, size: 64, align: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !535, file: !536, line: 256, baseType: !479, size: 64, align: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !535, file: !536, line: 257, baseType: !479, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !535, file: !536, line: 258, baseType: !479, size: 64, align: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !535, file: !536, line: 260, baseType: !479, size: 64, align: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !535, file: !536, line: 261, baseType: !479, size: 64, align: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !535, file: !536, line: 262, baseType: !479, size: 64, align: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !535, file: !536, line: 264, baseType: !551, size: 64, align: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !536, line: 160, size: 192, align: 64, elements: !553)
!553 = !{!554, !555, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !552, file: !536, line: 161, baseType: !551, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !552, file: !536, line: 162, baseType: !556, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !552, file: !536, line: 166, baseType: !316, size: 32, align: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !535, file: !536, line: 266, baseType: !556, size: 64, align: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !535, file: !536, line: 268, baseType: !316, size: 32, align: 32, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !535, file: !536, line: 272, baseType: !316, size: 32, align: 32, offset: 928)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !535, file: !536, line: 274, baseType: !562, size: 64, align: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !416, line: 131, baseType: !379)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !535, file: !536, line: 278, baseType: !564, size: 16, align: 16, offset: 1024)
!564 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !535, file: !536, line: 279, baseType: !566, size: 8, align: 8, offset: 1040)
!566 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !535, file: !536, line: 280, baseType: !568, size: 8, align: 8, offset: 1048)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 8, align: 8, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 1)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !535, file: !536, line: 284, baseType: !572, size: 64, align: 64, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !536, line: 154, baseType: null)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !535, file: !536, line: 293, baseType: !575, size: 64, align: 64, offset: 1152)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !416, line: 132, baseType: !379)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !535, file: !536, line: 302, baseType: !311, size: 64, align: 64, offset: 1216)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !535, file: !536, line: 303, baseType: !311, size: 64, align: 64, offset: 1280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !535, file: !536, line: 304, baseType: !311, size: 64, align: 64, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !535, file: !536, line: 305, baseType: !311, size: 64, align: 64, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !535, file: !536, line: 306, baseType: !347, size: 64, align: 64, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !535, file: !536, line: 308, baseType: !316, size: 32, align: 32, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !535, file: !536, line: 310, baseType: !583, size: 160, align: 8, offset: 1568)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 160, align: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 20)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "debugdata", scope: !529, file: !121, line: 1560, baseType: !311, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "errorbuffer", scope: !529, file: !121, line: 1561, baseType: !479, size: 64, align: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "proxyport", scope: !529, file: !121, line: 1562, baseType: !379, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !529, file: !121, line: 1565, baseType: !311, size: 64, align: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "in_set", scope: !529, file: !121, line: 1566, baseType: !311, size: 64, align: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "writeheader", scope: !529, file: !121, line: 1567, baseType: !311, size: 64, align: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_out", scope: !529, file: !121, line: 1568, baseType: !311, size: 64, align: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "use_port", scope: !529, file: !121, line: 1569, baseType: !379, size: 64, align: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "httpauth", scope: !529, file: !121, line: 1570, baseType: !349, size: 64, align: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "proxyauth", scope: !529, file: !121, line: 1571, baseType: !349, size: 64, align: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "followlocation", scope: !529, file: !121, line: 1572, baseType: !379, size: 64, align: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "maxredirs", scope: !529, file: !121, line: 1573, baseType: !379, size: 64, align: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "keep_post", scope: !529, file: !121, line: 1576, baseType: !316, size: 32, align: 32, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "free_referer", scope: !529, file: !121, line: 1578, baseType: !423, size: 8, align: 8, offset: 864)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "postfields", scope: !529, file: !121, line: 1580, baseType: !311, size: 64, align: 64, offset: 896)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "seek_func", scope: !529, file: !121, line: 1581, baseType: !602, size: 64, align: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_seek_callback", file: !4, line: 324, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!316, !311, !458, !316}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "postfieldsize", scope: !529, file: !121, line: 1582, baseType: !458, size: 64, align: 64, offset: 1024)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "localport", scope: !529, file: !121, line: 1585, baseType: !564, size: 16, align: 16, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "localportrange", scope: !529, file: !121, line: 1586, baseType: !316, size: 32, align: 32, offset: 1120)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_func", scope: !529, file: !121, line: 1588, baseType: !610, size: 64, align: 64, offset: 1152)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_write_callback", file: !4, line: 223, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!347, !479, !347, !347, !311}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_header", scope: !529, file: !121, line: 1589, baseType: !610, size: 64, align: 64, offset: 1216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_rtp", scope: !529, file: !121, line: 1590, baseType: !610, size: 64, align: 64, offset: 1280)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fread_func_set", scope: !529, file: !121, line: 1591, baseType: !617, size: 64, align: 64, offset: 1344)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_read_callback", file: !4, line: 335, baseType: !611)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "is_fread_set", scope: !529, file: !121, line: 1592, baseType: !316, size: 32, align: 32, offset: 1408)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "is_fwrite_set", scope: !529, file: !121, line: 1593, baseType: !316, size: 32, align: 32, offset: 1440)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fprogress", scope: !529, file: !121, line: 1594, baseType: !621, size: 64, align: 64, offset: 1472)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_progress_callback", file: !4, line: 183, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!316, !311, !625, !625, !625, !625}
!625 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fxferinfo", scope: !529, file: !121, line: 1595, baseType: !627, size: 64, align: 64, offset: 1536)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_xferinfo_callback", file: !4, line: 191, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!316, !311, !458, !458, !458, !458}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fdebug", scope: !529, file: !121, line: 1596, baseType: !632, size: 64, align: 64, offset: 1600)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_debug_callback", file: !4, line: 420, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!316, !305, !636, !479, !347, !311}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_infotype", file: !4, line: 418, baseType: !637)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 409, size: 32, align: 32, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646}
!639 = !DIEnumerator(name: "CURLINFO_TEXT", value: 0)
!640 = !DIEnumerator(name: "CURLINFO_HEADER_IN", value: 1)
!641 = !DIEnumerator(name: "CURLINFO_HEADER_OUT", value: 2)
!642 = !DIEnumerator(name: "CURLINFO_DATA_IN", value: 3)
!643 = !DIEnumerator(name: "CURLINFO_DATA_OUT", value: 4)
!644 = !DIEnumerator(name: "CURLINFO_SSL_DATA_IN", value: 5)
!645 = !DIEnumerator(name: "CURLINFO_SSL_DATA_OUT", value: 6)
!646 = !DIEnumerator(name: "CURLINFO_END", value: 7)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl_func", scope: !529, file: !121, line: 1597, baseType: !648, size: 64, align: 64, offset: 1664)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ioctl_callback", file: !4, line: 388, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !305, !316, !311}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "curlioerr", file: !4, line: 380, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 375, size: 32, align: 32, elements: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DIEnumerator(name: "CURLIOE_OK", value: 0)
!656 = !DIEnumerator(name: "CURLIOE_UNKNOWNCMD", value: 1)
!657 = !DIEnumerator(name: "CURLIOE_FAILRESTART", value: 2)
!658 = !DIEnumerator(name: "CURLIOE_LAST", value: 3)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fsockopt", scope: !529, file: !121, line: 1598, baseType: !660, size: 64, align: 64, offset: 1728)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_sockopt_callback", file: !4, line: 353, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!316, !311, !315, !664}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "curlsocktype", file: !4, line: 344, baseType: !665)
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 340, size: 32, align: 32, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIEnumerator(name: "CURLSOCKTYPE_IPCXN", value: 0)
!668 = !DIEnumerator(name: "CURLSOCKTYPE_ACCEPT", value: 1)
!669 = !DIEnumerator(name: "CURLSOCKTYPE_LAST", value: 2)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sockopt_client", scope: !529, file: !121, line: 1599, baseType: !311, size: 64, align: 64, offset: 1792)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fopensocket", scope: !529, file: !121, line: 1600, baseType: !672, size: 64, align: 64, offset: 1856)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_opensocket_callback", file: !4, line: 368, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!315, !311, !664, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_sockaddr", file: !4, line: 357, size: 256, align: 32, elements: !678)
!678 = !{!679, !680, !681, !682, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !677, file: !4, line: 358, baseType: !316, size: 32, align: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "socktype", scope: !677, file: !4, line: 359, baseType: !316, size: 32, align: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !677, file: !4, line: 360, baseType: !316, size: 32, align: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "addrlen", scope: !677, file: !4, line: 361, baseType: !683, size: 32, align: 32, offset: 96)
!683 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !677, file: !4, line: 364, baseType: !685, size: 128, align: 16, offset: 128)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !686, line: 149, size: 128, align: 16, elements: !687)
!686 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!687 = !{!688, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !685, file: !686, line: 151, baseType: !689, size: 16, align: 16)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !690, line: 28, baseType: !564)
!690 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !685, file: !686, line: 152, baseType: !692, size: 112, align: 8, offset: 16)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 112, align: 8, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 14)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "opensocket_client", scope: !529, file: !121, line: 1603, baseType: !311, size: 64, align: 64, offset: 1920)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fclosesocket", scope: !529, file: !121, line: 1604, baseType: !697, size: 64, align: 64, offset: 1984)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_closesocket_callback", file: !4, line: 373, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!316, !311, !315}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "closesocket_client", scope: !529, file: !121, line: 1606, baseType: !311, size: 64, align: 64, offset: 2048)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "seek_client", scope: !529, file: !121, line: 1608, baseType: !311, size: 64, align: 64, offset: 2112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "convfromnetwork", scope: !529, file: !121, line: 1611, baseType: !704, size: 64, align: 64, offset: 2176)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_conv_callback", file: !4, line: 637, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!289, !479, !347}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "convtonetwork", scope: !529, file: !121, line: 1613, baseType: !704, size: 64, align: 64, offset: 2240)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "convfromutf8", scope: !529, file: !121, line: 1615, baseType: !704, size: 64, align: 64, offset: 2304)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "progress_client", scope: !529, file: !121, line: 1617, baseType: !311, size: 64, align: 64, offset: 2368)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl_client", scope: !529, file: !121, line: 1618, baseType: !311, size: 64, align: 64, offset: 2432)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !529, file: !121, line: 1619, baseType: !379, size: 64, align: 64, offset: 2496)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "connecttimeout", scope: !529, file: !121, line: 1620, baseType: !379, size: 64, align: 64, offset: 2560)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "accepttimeout", scope: !529, file: !121, line: 1621, baseType: !379, size: 64, align: 64, offset: 2624)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "server_response_timeout", scope: !529, file: !121, line: 1622, baseType: !379, size: 64, align: 64, offset: 2688)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_blksize", scope: !529, file: !121, line: 1623, baseType: !379, size: 64, align: 64, offset: 2752)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_no_options", scope: !529, file: !121, line: 1624, baseType: !423, size: 8, align: 8, offset: 2816)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !529, file: !121, line: 1625, baseType: !458, size: 64, align: 64, offset: 2880)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "low_speed_limit", scope: !529, file: !121, line: 1626, baseType: !379, size: 64, align: 64, offset: 2944)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "low_speed_time", scope: !529, file: !121, line: 1627, baseType: !379, size: 64, align: 64, offset: 3008)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "max_send_speed", scope: !529, file: !121, line: 1628, baseType: !458, size: 64, align: 64, offset: 3072)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "max_recv_speed", scope: !529, file: !121, line: 1629, baseType: !458, size: 64, align: 64, offset: 3136)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "set_resume_from", scope: !529, file: !121, line: 1631, baseType: !458, size: 64, align: 64, offset: 3200)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !529, file: !121, line: 1632, baseType: !725, size: 64, align: 64, offset: 3264)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_slist", file: !4, line: 2176, size: 128, align: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !726, file: !4, line: 2177, baseType: !479, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !4, line: 2178, baseType: !725, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "proxyheaders", scope: !529, file: !121, line: 1633, baseType: !725, size: 64, align: 64, offset: 3328)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "httppost", scope: !529, file: !121, line: 1634, baseType: !732, size: 64, align: 64, offset: 3392)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_httppost", file: !4, line: 137, size: 896, align: 64, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !733, file: !4, line: 138, baseType: !732, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !4, line: 139, baseType: !479, size: 64, align: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "namelength", scope: !733, file: !4, line: 140, baseType: !379, size: 64, align: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !733, file: !4, line: 141, baseType: !479, size: 64, align: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "contentslength", scope: !733, file: !4, line: 142, baseType: !379, size: 64, align: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !733, file: !4, line: 144, baseType: !479, size: 64, align: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bufferlength", scope: !733, file: !4, line: 145, baseType: !379, size: 64, align: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !733, file: !4, line: 146, baseType: !479, size: 64, align: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "contentheader", scope: !733, file: !4, line: 147, baseType: !725, size: 64, align: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "more", scope: !733, file: !4, line: 148, baseType: !732, size: 64, align: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !4, line: 151, baseType: !379, size: 64, align: 64, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "showfilename", scope: !733, file: !4, line: 171, baseType: !479, size: 64, align: 64, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "userp", scope: !733, file: !4, line: 174, baseType: !311, size: 64, align: 64, offset: 768)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "contentlen", scope: !733, file: !4, line: 176, baseType: !458, size: 64, align: 64, offset: 832)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sep_headers", scope: !529, file: !121, line: 1635, baseType: !423, size: 8, align: 8, offset: 3456)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cookiesession", scope: !529, file: !121, line: 1636, baseType: !423, size: 8, align: 8, offset: 3464)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "crlf", scope: !529, file: !121, line: 1637, baseType: !423, size: 8, align: 8, offset: 3472)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !529, file: !121, line: 1638, baseType: !725, size: 64, align: 64, offset: 3520)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "postquote", scope: !529, file: !121, line: 1639, baseType: !725, size: 64, align: 64, offset: 3584)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "prequote", scope: !529, file: !121, line: 1640, baseType: !725, size: 64, align: 64, offset: 3648)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "source_quote", scope: !529, file: !121, line: 1641, baseType: !725, size: 64, align: 64, offset: 3712)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "source_prequote", scope: !529, file: !121, line: 1642, baseType: !725, size: 64, align: 64, offset: 3776)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "source_postquote", scope: !529, file: !121, line: 1644, baseType: !725, size: 64, align: 64, offset: 3840)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "telnet_options", scope: !529, file: !121, line: 1646, baseType: !725, size: 64, align: 64, offset: 3904)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !529, file: !121, line: 1647, baseType: !725, size: 64, align: 64, offset: 3968)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "connect_to", scope: !529, file: !121, line: 1649, baseType: !725, size: 64, align: 64, offset: 4032)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "timecondition", scope: !529, file: !121, line: 1651, baseType: !762, size: 32, align: 32, offset: 4096)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_TimeCond", file: !4, line: 1929, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1921, size: 32, align: 32, elements: !764)
!764 = !{!765, !766, !767, !768, !769}
!765 = !DIEnumerator(name: "CURL_TIMECOND_NONE", value: 0)
!766 = !DIEnumerator(name: "CURL_TIMECOND_IFMODSINCE", value: 1)
!767 = !DIEnumerator(name: "CURL_TIMECOND_IFUNMODSINCE", value: 2)
!768 = !DIEnumerator(name: "CURL_TIMECOND_LASTMOD", value: 3)
!769 = !DIEnumerator(name: "CURL_TIMECOND_LAST", value: 4)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "timevalue", scope: !529, file: !121, line: 1652, baseType: !506, size: 64, align: 64, offset: 4160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "httpreq", scope: !529, file: !121, line: 1653, baseType: !772, size: 32, align: 32, offset: 4224)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_HttpReq", file: !121, line: 1249, baseType: !773)
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 1240, size: 32, align: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782}
!775 = !DIEnumerator(name: "HTTPREQ_NONE", value: 0)
!776 = !DIEnumerator(name: "HTTPREQ_GET", value: 1)
!777 = !DIEnumerator(name: "HTTPREQ_POST", value: 2)
!778 = !DIEnumerator(name: "HTTPREQ_POST_FORM", value: 3)
!779 = !DIEnumerator(name: "HTTPREQ_PUT", value: 4)
!780 = !DIEnumerator(name: "HTTPREQ_HEAD", value: 5)
!781 = !DIEnumerator(name: "HTTPREQ_CUSTOM", value: 6)
!782 = !DIEnumerator(name: "HTTPREQ_LAST", value: 7)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "httpversion", scope: !529, file: !121, line: 1654, baseType: !379, size: 64, align: 64, offset: 4288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !529, file: !121, line: 1656, baseType: !785, size: 1408, align: 64, offset: 4352)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_config_data", file: !121, line: 366, size: 1408, align: 64, elements: !786)
!786 = !{!787, !802, !803, !804, !805, !806, !807, !812, !813, !814, !815, !816, !817, !818, !819}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !785, file: !121, line: 367, baseType: !788, size: 640, align: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_primary_config", file: !121, line: 351, size: 640, align: 64, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !788, file: !121, line: 352, baseType: !379, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "version_max", scope: !788, file: !121, line: 353, baseType: !379, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "verifypeer", scope: !788, file: !121, line: 354, baseType: !423, size: 8, align: 8, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "verifyhost", scope: !788, file: !121, line: 355, baseType: !423, size: 8, align: 8, offset: 136)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "verifystatus", scope: !788, file: !121, line: 356, baseType: !423, size: 8, align: 8, offset: 144)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CApath", scope: !788, file: !121, line: 357, baseType: !479, size: 64, align: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "CAfile", scope: !788, file: !121, line: 358, baseType: !479, size: 64, align: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clientcert", scope: !788, file: !121, line: 359, baseType: !479, size: 64, align: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "random_file", scope: !788, file: !121, line: 360, baseType: !479, size: 64, align: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "egdsocket", scope: !788, file: !121, line: 361, baseType: !479, size: 64, align: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !788, file: !121, line: 362, baseType: !479, size: 64, align: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sessionid", scope: !788, file: !121, line: 363, baseType: !423, size: 8, align: 8, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "enable_beast", scope: !785, file: !121, line: 368, baseType: !423, size: 8, align: 8, offset: 640)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "no_revoke", scope: !785, file: !121, line: 370, baseType: !423, size: 8, align: 8, offset: 648)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "certverifyresult", scope: !785, file: !121, line: 371, baseType: !379, size: 64, align: 64, offset: 704)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CRLfile", scope: !785, file: !121, line: 372, baseType: !479, size: 64, align: 64, offset: 768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "issuercert", scope: !785, file: !121, line: 373, baseType: !479, size: 64, align: 64, offset: 832)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fsslctx", scope: !785, file: !121, line: 374, baseType: !808, size: 64, align: 64, offset: 896)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ssl_ctx_callback", file: !4, line: 639, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!289, !305, !311, !311}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fsslctxp", scope: !785, file: !121, line: 375, baseType: !311, size: 64, align: 64, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "certinfo", scope: !785, file: !121, line: 376, baseType: !423, size: 8, align: 8, offset: 1024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "falsestart", scope: !785, file: !121, line: 377, baseType: !423, size: 8, align: 8, offset: 1032)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !785, file: !121, line: 379, baseType: !479, size: 64, align: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !785, file: !121, line: 380, baseType: !479, size: 64, align: 64, offset: 1152)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !785, file: !121, line: 381, baseType: !479, size: 64, align: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "key_type", scope: !785, file: !121, line: 382, baseType: !479, size: 64, align: 64, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "key_passwd", scope: !785, file: !121, line: 383, baseType: !479, size: 64, align: 64, offset: 1344)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_ssl", scope: !529, file: !121, line: 1657, baseType: !785, size: 1408, align: 64, offset: 5760)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "general_ssl", scope: !529, file: !121, line: 1658, baseType: !822, size: 64, align: 64, offset: 7168)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_general_config", file: !121, line: 392, size: 64, align: 64, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "max_ssl_sessions", scope: !822, file: !121, line: 393, baseType: !347, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "proxytype", scope: !529, file: !121, line: 1659, baseType: !826, size: 32, align: 32, offset: 7232)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_proxytype", file: !4, line: 657, baseType: !111)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_timeout", scope: !529, file: !121, line: 1660, baseType: !379, size: 64, align: 64, offset: 7296)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !529, file: !121, line: 1661, baseType: !379, size: 64, align: 64, offset: 7360)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !529, file: !121, line: 1662, baseType: !311, size: 64, align: 64, offset: 7424)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "http200aliases", scope: !529, file: !121, line: 1664, baseType: !725, size: 64, align: 64, offset: 7488)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ipver", scope: !529, file: !121, line: 1666, baseType: !379, size: 64, align: 64, offset: 7552)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "max_filesize", scope: !529, file: !121, line: 1669, baseType: !458, size: 64, align: 64, offset: 7616)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_filemethod", scope: !529, file: !121, line: 1671, baseType: !834, size: 32, align: 32, offset: 7680)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpfile", file: !135, line: 98, baseType: !835)
!835 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 93, size: 32, align: 32, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIEnumerator(name: "FTPFILE_MULTICWD", value: 1)
!838 = !DIEnumerator(name: "FTPFILE_NOCWD", value: 2)
!839 = !DIEnumerator(name: "FTPFILE_SINGLECWD", value: 3)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_create_missing_dirs", scope: !529, file: !121, line: 1673, baseType: !316, size: 32, align: 32, offset: 7712)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_keyfunc", scope: !529, file: !121, line: 1677, baseType: !842, size: 64, align: 64, offset: 7744)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_sshkeycallback", file: !4, line: 739, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64, align: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!316, !305, !846, !846, !861, !311}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_khkey", file: !4, line: 711, size: 192, align: 64, elements: !849)
!849 = !{!850, !853, !854}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !848, file: !4, line: 712, baseType: !851, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !848, file: !4, line: 714, baseType: !347, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "keytype", scope: !848, file: !4, line: 715, baseType: !855, size: 32, align: 32, offset: 128)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "curl_khtype", file: !4, line: 704, size: 32, align: 32, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIEnumerator(name: "CURLKHTYPE_UNKNOWN", value: 0)
!858 = !DIEnumerator(name: "CURLKHTYPE_RSA1", value: 1)
!859 = !DIEnumerator(name: "CURLKHTYPE_RSA", value: 2)
!860 = !DIEnumerator(name: "CURLKHTYPE_DSS", value: 3)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "curl_khmatch", file: !4, line: 731, size: 32, align: 32, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIEnumerator(name: "CURLKHMATCH_OK", value: 0)
!864 = !DIEnumerator(name: "CURLKHMATCH_MISMATCH", value: 1)
!865 = !DIEnumerator(name: "CURLKHMATCH_MISSING", value: 2)
!866 = !DIEnumerator(name: "CURLKHMATCH_LAST", value: 3)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_keyfunc_userp", scope: !529, file: !121, line: 1678, baseType: !311, size: 64, align: 64, offset: 7808)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "printhost", scope: !529, file: !121, line: 1684, baseType: !423, size: 8, align: 8, offset: 7872)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "get_filetime", scope: !529, file: !121, line: 1685, baseType: !423, size: 8, align: 8, offset: 7880)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tunnel_thru_httpproxy", scope: !529, file: !121, line: 1686, baseType: !423, size: 8, align: 8, offset: 7888)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "prefer_ascii", scope: !529, file: !121, line: 1687, baseType: !423, size: 8, align: 8, offset: 7896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_append", scope: !529, file: !121, line: 1688, baseType: !423, size: 8, align: 8, offset: 7904)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_list_only", scope: !529, file: !121, line: 1689, baseType: !423, size: 8, align: 8, offset: 7912)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_port", scope: !529, file: !121, line: 1690, baseType: !423, size: 8, align: 8, offset: 7920)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "hide_progress", scope: !529, file: !121, line: 1691, baseType: !423, size: 8, align: 8, offset: 7928)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "http_fail_on_error", scope: !529, file: !121, line: 1692, baseType: !423, size: 8, align: 8, offset: 7936)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "http_keep_sending_on_error", scope: !529, file: !121, line: 1693, baseType: !423, size: 8, align: 8, offset: 7944)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "http_follow_location", scope: !529, file: !121, line: 1694, baseType: !423, size: 8, align: 8, offset: 7952)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "http_transfer_encoding", scope: !529, file: !121, line: 1695, baseType: !423, size: 8, align: 8, offset: 7960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "http_disable_hostname_check_before_authentication", scope: !529, file: !121, line: 1696, baseType: !423, size: 8, align: 8, offset: 7968)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "include_header", scope: !529, file: !121, line: 1697, baseType: !423, size: 8, align: 8, offset: 7976)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "http_set_referer", scope: !529, file: !121, line: 1698, baseType: !423, size: 8, align: 8, offset: 7984)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "http_auto_referer", scope: !529, file: !121, line: 1699, baseType: !423, size: 8, align: 8, offset: 7992)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "opt_no_body", scope: !529, file: !121, line: 1700, baseType: !423, size: 8, align: 8, offset: 8000)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !529, file: !121, line: 1701, baseType: !423, size: 8, align: 8, offset: 8008)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "use_netrc", scope: !529, file: !121, line: 1703, baseType: !887, size: 32, align: 32, offset: 8032)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CURL_NETRC_OPTION", file: !4, line: 1867, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIEnumerator(name: "CURL_NETRC_IGNORED", value: 0)
!890 = !DIEnumerator(name: "CURL_NETRC_OPTIONAL", value: 1)
!891 = !DIEnumerator(name: "CURL_NETRC_REQUIRED", value: 2)
!892 = !DIEnumerator(name: "CURL_NETRC_LAST", value: 3)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !529, file: !121, line: 1704, baseType: !423, size: 8, align: 8, offset: 8064)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "krb", scope: !529, file: !121, line: 1705, baseType: !423, size: 8, align: 8, offset: 8072)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_forbid", scope: !529, file: !121, line: 1706, baseType: !423, size: 8, align: 8, offset: 8080)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_fresh", scope: !529, file: !121, line: 1707, baseType: !423, size: 8, align: 8, offset: 8088)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_epsv", scope: !529, file: !121, line: 1708, baseType: !423, size: 8, align: 8, offset: 8096)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_eprt", scope: !529, file: !121, line: 1709, baseType: !423, size: 8, align: 8, offset: 8104)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_pret", scope: !529, file: !121, line: 1710, baseType: !423, size: 8, align: 8, offset: 8112)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "use_ssl", scope: !529, file: !121, line: 1712, baseType: !901, size: 32, align: 32, offset: 8128)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_usessl", file: !4, line: 752, baseType: !902)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 746, size: 32, align: 32, elements: !903)
!903 = !{!904, !905, !906, !907, !908}
!904 = !DIEnumerator(name: "CURLUSESSL_NONE", value: 0)
!905 = !DIEnumerator(name: "CURLUSESSL_TRY", value: 1)
!906 = !DIEnumerator(name: "CURLUSESSL_CONTROL", value: 2)
!907 = !DIEnumerator(name: "CURLUSESSL_ALL", value: 3)
!908 = !DIEnumerator(name: "CURLUSESSL_LAST", value: 4)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ftpsslauth", scope: !529, file: !121, line: 1714, baseType: !910, size: 32, align: 32, offset: 8160)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpauth", file: !4, line: 795, baseType: !911)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 790, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIEnumerator(name: "CURLFTPAUTH_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "CURLFTPAUTH_SSL", value: 1)
!915 = !DIEnumerator(name: "CURLFTPAUTH_TLS", value: 2)
!916 = !DIEnumerator(name: "CURLFTPAUTH_LAST", value: 3)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_ccc", scope: !529, file: !121, line: 1715, baseType: !918, size: 32, align: 32, offset: 8192)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpccc", file: !4, line: 787, baseType: !919)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 782, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "CURLFTPSSL_CCC_NONE", value: 0)
!922 = !DIEnumerator(name: "CURLFTPSSL_CCC_PASSIVE", value: 1)
!923 = !DIEnumerator(name: "CURLFTPSSL_CCC_ACTIVE", value: 2)
!924 = !DIEnumerator(name: "CURLFTPSSL_CCC_LAST", value: 3)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "no_signal", scope: !529, file: !121, line: 1716, baseType: !423, size: 8, align: 8, offset: 8224)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "global_dns_cache", scope: !529, file: !121, line: 1717, baseType: !423, size: 8, align: 8, offset: 8232)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !529, file: !121, line: 1718, baseType: !423, size: 8, align: 8, offset: 8240)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ignorecl", scope: !529, file: !121, line: 1719, baseType: !423, size: 8, align: 8, offset: 8248)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_skip_ip", scope: !529, file: !121, line: 1720, baseType: !423, size: 8, align: 8, offset: 8256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "connect_only", scope: !529, file: !121, line: 1722, baseType: !423, size: 8, align: 8, offset: 8264)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_auth_types", scope: !529, file: !121, line: 1723, baseType: !379, size: 64, align: 64, offset: 8320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "http_te_skip", scope: !529, file: !121, line: 1724, baseType: !423, size: 8, align: 8, offset: 8384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "http_ce_skip", scope: !529, file: !121, line: 1726, baseType: !423, size: 8, align: 8, offset: 8392)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "new_file_perms", scope: !529, file: !121, line: 1728, baseType: !379, size: 64, align: 64, offset: 8448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "new_directory_perms", scope: !529, file: !121, line: 1729, baseType: !379, size: 64, align: 64, offset: 8512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_transfer_mode", scope: !529, file: !121, line: 1730, baseType: !423, size: 8, align: 8, offset: 8576)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !529, file: !121, line: 1732, baseType: !938, size: 3584, align: 64, offset: 8640)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 3584, align: 64, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 56)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !529, file: !121, line: 1733, baseType: !683, size: 32, align: 32, offset: 12224)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_protocols", scope: !529, file: !121, line: 1734, baseType: !379, size: 64, align: 64, offset: 12288)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "redir_protocols", scope: !529, file: !121, line: 1735, baseType: !379, size: 64, align: 64, offset: 12352)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mail_rcpt", scope: !529, file: !121, line: 1739, baseType: !725, size: 64, align: 64, offset: 12416)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_ir", scope: !529, file: !121, line: 1740, baseType: !423, size: 8, align: 8, offset: 12480)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rtspreq", scope: !529, file: !121, line: 1742, baseType: !947, size: 32, align: 32, offset: 12512)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_RtspReq", file: !121, line: 1265, baseType: !948)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 1251, size: 32, align: 32, elements: !949)
!949 = !{!950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!950 = !DIEnumerator(name: "RTSPREQ_NONE", value: 0)
!951 = !DIEnumerator(name: "RTSPREQ_OPTIONS", value: 1)
!952 = !DIEnumerator(name: "RTSPREQ_DESCRIBE", value: 2)
!953 = !DIEnumerator(name: "RTSPREQ_ANNOUNCE", value: 3)
!954 = !DIEnumerator(name: "RTSPREQ_SETUP", value: 4)
!955 = !DIEnumerator(name: "RTSPREQ_PLAY", value: 5)
!956 = !DIEnumerator(name: "RTSPREQ_PAUSE", value: 6)
!957 = !DIEnumerator(name: "RTSPREQ_TEARDOWN", value: 7)
!958 = !DIEnumerator(name: "RTSPREQ_GET_PARAMETER", value: 8)
!959 = !DIEnumerator(name: "RTSPREQ_SET_PARAMETER", value: 9)
!960 = !DIEnumerator(name: "RTSPREQ_RECORD", value: 10)
!961 = !DIEnumerator(name: "RTSPREQ_RECEIVE", value: 11)
!962 = !DIEnumerator(name: "RTSPREQ_LAST", value: 12)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rtspversion", scope: !529, file: !121, line: 1743, baseType: !379, size: 64, align: 64, offset: 12544)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "wildcardmatch", scope: !529, file: !121, line: 1744, baseType: !423, size: 8, align: 8, offset: 12608)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_bgn", scope: !529, file: !121, line: 1745, baseType: !966, size: 64, align: 64, offset: 12672)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_chunk_bgn_callback", file: !4, line: 292, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!379, !970, !311, !316}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_end", scope: !529, file: !121, line: 1747, baseType: !973, size: 64, align: 64, offset: 12736)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_chunk_end_callback", file: !4, line: 306, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!379, !311}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "fnmatch", scope: !529, file: !121, line: 1749, baseType: !978, size: 64, align: 64, offset: 12800)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_fnmatch_callback", file: !4, line: 315, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!316, !311, !851, !851}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fnmatch_data", scope: !529, file: !121, line: 1751, baseType: !311, size: 64, align: 64, offset: 12864)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gssapi_delegation", scope: !529, file: !121, line: 1753, baseType: !379, size: 64, align: 64, offset: 12928)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepalive", scope: !529, file: !121, line: 1756, baseType: !423, size: 8, align: 8, offset: 12992)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepidle", scope: !529, file: !121, line: 1757, baseType: !379, size: 64, align: 64, offset: 13056)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepintvl", scope: !529, file: !121, line: 1758, baseType: !379, size: 64, align: 64, offset: 13120)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_fastopen", scope: !529, file: !121, line: 1759, baseType: !423, size: 8, align: 8, offset: 13184)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "maxconnects", scope: !529, file: !121, line: 1761, baseType: !347, size: 64, align: 64, offset: 13248)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_enable_npn", scope: !529, file: !121, line: 1763, baseType: !423, size: 8, align: 8, offset: 13312)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_enable_alpn", scope: !529, file: !121, line: 1764, baseType: !423, size: 8, align: 8, offset: 13320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "path_as_is", scope: !529, file: !121, line: 1765, baseType: !423, size: 8, align: 8, offset: 13328)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pipewait", scope: !529, file: !121, line: 1766, baseType: !423, size: 8, align: 8, offset: 13336)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "expect_100_timeout", scope: !529, file: !121, line: 1768, baseType: !379, size: 64, align: 64, offset: 13376)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_connect_headers", scope: !529, file: !121, line: 1769, baseType: !423, size: 8, align: 8, offset: 13440)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "stream_depends_on", scope: !529, file: !121, line: 1772, baseType: !256, size: 64, align: 64, offset: 13504)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "stream_depends_e", scope: !529, file: !121, line: 1773, baseType: !423, size: 8, align: 8, offset: 13568)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "stream_weight", scope: !529, file: !121, line: 1774, baseType: !316, size: 32, align: 32, offset: 13600)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "stream_dependents", scope: !529, file: !121, line: 1776, baseType: !999, size: 64, align: 64, offset: 13632)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_http2_dep", file: !121, line: 1292, size: 128, align: 64, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1000, file: !121, line: 1293, baseType: !999, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1000, file: !121, line: 1294, baseType: !256, size: 64, align: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_unix_socket", scope: !529, file: !121, line: 1778, baseType: !423, size: 8, align: 8, offset: 13696)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !257, file: !121, line: 1830, baseType: !1006, size: 384, align: 64, offset: 17216)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicStatic", file: !121, line: 1444, size: 384, align: 64, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1006, file: !121, line: 1445, baseType: !479, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "url_alloc", scope: !1006, file: !121, line: 1446, baseType: !423, size: 8, align: 8, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1006, file: !121, line: 1447, baseType: !479, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "referer_alloc", scope: !1006, file: !121, line: 1448, baseType: !423, size: 8, align: 8, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "cookielist", scope: !1006, file: !121, line: 1449, baseType: !725, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !1006, file: !121, line: 1451, baseType: !725, size: 64, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !257, file: !121, line: 1831, baseType: !1015, size: 64, align: 64, offset: 17600)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "CookieInfo", file: !1017, line: 48, size: 320, align: 64, elements: !1018)
!1017 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/cookie.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!1018 = !{!1019, !1037, !1038, !1039, !1040}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !1016, file: !1017, line: 50, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cookie", file: !1017, line: 28, size: 768, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !1017, line: 29, baseType: !1020, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1021, file: !1017, line: 30, baseType: !479, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1021, file: !1017, line: 31, baseType: !479, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1021, file: !1017, line: 32, baseType: !479, size: 64, align: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "spath", scope: !1021, file: !1017, line: 33, baseType: !479, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !1021, file: !1017, line: 34, baseType: !479, size: 64, align: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1021, file: !1017, line: 35, baseType: !458, size: 64, align: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "expirestr", scope: !1021, file: !1017, line: 36, baseType: !479, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "tailmatch", scope: !1021, file: !1017, line: 37, baseType: !423, size: 8, align: 8, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1021, file: !1017, line: 40, baseType: !479, size: 64, align: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "maxage", scope: !1021, file: !1017, line: 41, baseType: !479, size: 64, align: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !1021, file: !1017, line: 43, baseType: !423, size: 8, align: 8, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "livecookie", scope: !1021, file: !1017, line: 44, baseType: !423, size: 8, align: 8, offset: 712)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "httponly", scope: !1021, file: !1017, line: 45, baseType: !423, size: 8, align: 8, offset: 720)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1016, file: !1017, line: 52, baseType: !479, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !1016, file: !1017, line: 53, baseType: !423, size: 8, align: 8, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "numcookies", scope: !1016, file: !1017, line: 54, baseType: !379, size: 64, align: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "newsession", scope: !1016, file: !1017, line: 55, baseType: !423, size: 8, align: 8, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !257, file: !121, line: 1835, baseType: !1042, size: 3200, align: 64, offset: 17664)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "Progress", file: !121, line: 1195, size: 3200, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1074, !1076}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lastshow", scope: !1042, file: !121, line: 1196, baseType: !506, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "size_dl", scope: !1042, file: !121, line: 1198, baseType: !458, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "size_ul", scope: !1042, file: !121, line: 1199, baseType: !458, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "downloaded", scope: !1042, file: !121, line: 1200, baseType: !458, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "uploaded", scope: !1042, file: !121, line: 1201, baseType: !458, size: 64, align: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "current_speed", scope: !1042, file: !121, line: 1203, baseType: !458, size: 64, align: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1042, file: !121, line: 1205, baseType: !423, size: 8, align: 8, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1042, file: !121, line: 1206, baseType: !316, size: 32, align: 32, offset: 416)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1042, file: !121, line: 1207, baseType: !316, size: 32, align: 32, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "timespent", scope: !1042, file: !121, line: 1209, baseType: !625, size: 64, align: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "dlspeed", scope: !1042, file: !121, line: 1211, baseType: !458, size: 64, align: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ulspeed", scope: !1042, file: !121, line: 1212, baseType: !458, size: 64, align: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "t_nslookup", scope: !1042, file: !121, line: 1214, baseType: !625, size: 64, align: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "t_connect", scope: !1042, file: !121, line: 1215, baseType: !625, size: 64, align: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "t_appconnect", scope: !1042, file: !121, line: 1216, baseType: !625, size: 64, align: 64, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "t_pretransfer", scope: !1042, file: !121, line: 1217, baseType: !625, size: 64, align: 64, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "t_starttransfer", scope: !1042, file: !121, line: 1218, baseType: !625, size: 64, align: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "t_redirect", scope: !1042, file: !121, line: 1219, baseType: !625, size: 64, align: 64, offset: 1024)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1042, file: !121, line: 1221, baseType: !411, size: 128, align: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "t_startsingle", scope: !1042, file: !121, line: 1222, baseType: !411, size: 128, align: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "t_startop", scope: !1042, file: !121, line: 1223, baseType: !411, size: 128, align: 64, offset: 1344)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "t_acceptdata", scope: !1042, file: !121, line: 1224, baseType: !411, size: 128, align: 64, offset: 1472)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ul_limit_start", scope: !1042, file: !121, line: 1227, baseType: !411, size: 128, align: 64, offset: 1600)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ul_limit_size", scope: !1042, file: !121, line: 1228, baseType: !458, size: 64, align: 64, offset: 1728)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "dl_limit_start", scope: !1042, file: !121, line: 1230, baseType: !411, size: 128, align: 64, offset: 1792)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "dl_limit_size", scope: !1042, file: !121, line: 1231, baseType: !458, size: 64, align: 64, offset: 1920)
