; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/bftpdutmp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bftpdutmp = type { i8, i32, [31 x i8], [256 x i8], i64 }

@bftpdutmp = global %struct._IO_FILE* null, align 8
@bftpdutmp_offset = global i64 4294967295, align 8
@.str = private unnamed_addr constant [15 x i8] c"PATH_BFTPDUTMP\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"none\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"a\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"r+\00", align 1
@.str.4 = private unnamed_addr constant [29 x i8] c"Could not open log file %s.\0A\00", align 1
@.str.5 = private unnamed_addr constant [70 x i8] c"421-Could not open file %s\0D\0A421 Server disabled for security reasons.\00", align 1
@user = external global [31 x i8], align 16
@remotehostname = external global i8*, align 8
@.str.6 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@configpath = common global i8* null, align 8
@daemonmode = common global i32 0, align 4
@pre_write_script = common global i8* null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !34)
!1 = !DIFile(filename: "bftpdutmp.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !12, !15, !16, !19, !27, !30, !31}
!6 = distinct !DISubprogram(name: "bftpdutmp_create_dir", scope: !7, file: !7, line: 17, type: !8, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!7 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/bftpdutmp.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = distinct !DISubprogram(name: "bftpdutmp_init", scope: !7, file: !7, line: 38, type: !13, isLocal: false, isDefinition: true, scopeLine: 39, isOptimized: false, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{null}
!15 = distinct !DISubprogram(name: "bftpdutmp_end", scope: !7, file: !7, line: 67, type: !13, isLocal: false, isDefinition: true, scopeLine: 68, isOptimized: false, variables: !2)
!16 = distinct !DISubprogram(name: "bftpdutmp_log", scope: !7, file: !7, line: 77, type: !17, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !11}
!19 = distinct !DISubprogram(name: "bftpdutmp_pidexists", scope: !7, file: !7, line: 113, type: !20, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!11, !22}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !23, line: 98, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !25, line: 133, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = distinct !DISubprogram(name: "bftpdutmp_usercount", scope: !7, file: !7, line: 126, type: !28, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!28 = !DISubroutineType(types: !29)
!29 = !{!26, !10}
!30 = distinct !DISubprogram(name: "bftpdutmp_dup_ip_count", scope: !7, file: !7, line: 147, type: !28, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!31 = distinct !DISubprogram(name: "bftpdutmp_remove_pid", scope: !7, file: !7, line: 176, type: !32, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !26}
!34 = !{!35, !94, !95, !97, !98, !99}
!35 = !DIGlobalVariable(name: "bftpdutmp", scope: !0, file: !7, line: 14, type: !36, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @bftpdutmp)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 48, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !40, line: 245, size: 1728, align: 64, elements: !41)
!40 = !DIFile(filename: "/usr/include/libio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !62, !63, !64, !65, !68, !70, !72, !76, !79, !81, !82, !83, !84, !85, !89, !90}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !40, line: 246, baseType: !26, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !39, file: !40, line: 251, baseType: !10, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !39, file: !40, line: 252, baseType: !10, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !39, file: !40, line: 253, baseType: !10, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !39, file: !40, line: 254, baseType: !10, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !39, file: !40, line: 255, baseType: !10, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !39, file: !40, line: 256, baseType: !10, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !39, file: !40, line: 257, baseType: !10, size: 64, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !39, file: !40, line: 258, baseType: !10, size: 64, align: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !39, file: !40, line: 260, baseType: !10, size: 64, align: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !39, file: !40, line: 261, baseType: !10, size: 64, align: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !39, file: !40, line: 262, baseType: !10, size: 64, align: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !39, file: !40, line: 264, baseType: !55, size: 64, align: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !40, line: 160, size: 192, align: 64, elements: !57)
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !56, file: !40, line: 161, baseType: !55, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !56, file: !40, line: 162, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !56, file: !40, line: 166, baseType: !26, size: 32, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !39, file: !40, line: 266, baseType: !60, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !39, file: !40, line: 268, baseType: !26, size: 32, align: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !40, line: 272, baseType: !26, size: 32, align: 32, offset: 928)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !39, file: !40, line: 274, baseType: !66, size: 64, align: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !25, line: 131, baseType: !67)
!67 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !39, file: !40, line: 278, baseType: !69, size: 16, align: 16, offset: 1024)
!69 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !39, file: !40, line: 279, baseType: !71, size: 8, align: 8, offset: 1040)
!71 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !39, file: !40, line: 280, baseType: !73, size: 8, align: 8, offset: 1048)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !40, line: 284, baseType: !77, size: 64, align: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !40, line: 154, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !40, line: 293, baseType: !80, size: 64, align: 64, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !25, line: 132, baseType: !67)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !39, file: !40, line: 302, baseType: !4, size: 64, align: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !39, file: !40, line: 303, baseType: !4, size: 64, align: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !39, file: !40, line: 304, baseType: !4, size: 64, align: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !39, file: !40, line: 305, baseType: !4, size: 64, align: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !39, file: !40, line: 306, baseType: !86, size: 64, align: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 62, baseType: !88)
!87 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!88 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !39, file: !40, line: 308, baseType: !26, size: 32, align: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !39, file: !40, line: 310, baseType: !91, size: 160, align: 8, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DIGlobalVariable(name: "bftpdutmp_offset", scope: !0, file: !7, line: 15, type: !67, isLocal: false, isDefinition: true, variable: i64* @bftpdutmp_offset)
!95 = !DIGlobalVariable(name: "configpath", scope: !0, file: !96, line: 25, type: !10, isLocal: false, isDefinition: true, variable: i8** @configpath)
!96 = !DIFile(filename: "./main.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!97 = !DIGlobalVariable(name: "daemonmode", scope: !0, file: !96, line: 26, type: !26, isLocal: false, isDefinition: true, variable: i32* @daemonmode)
!98 = !DIGlobalVariable(name: "pre_write_script", scope: !0, file: !96, line: 29, type: !10, isLocal: false, isDefinition: true, variable: i8** @pre_write_script)
!99 = !DIGlobalVariable(name: "post_write_script", scope: !0, file: !96, line: 30, type: !10, isLocal: false, isDefinition: true, variable: i8** @post_write_script)
!100 = !{i32 2, !"Dwarf Version", i32 4}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!103 = !DILocalVariable(name: "path_to_file", arg: 1, scope: !6, file: !7, line: 17, type: !10)
!104 = !DIExpression()
!105 = !DILocation(line: 17, column: 33, scope: !6)
!106 = !DILocalVariable(name: "dir_name", scope: !6, file: !7, line: 19, type: !10)
!107 = !DILocation(line: 19, column: 11, scope: !6)
!108 = !DILocalVariable(name: "index", scope: !6, file: !7, line: 19, type: !10)
!109 = !DILocation(line: 19, column: 22, scope: !6)
!110 = !DILocation(line: 21, column: 11, scope: !111)
!111 = distinct !DILexicalBlock(scope: !6, file: !7, line: 21, column: 9)
!112 = !DILocation(line: 21, column: 9, scope: !6)
!113 = !DILocation(line: 21, column: 25, scope: !114)
!114 = !DILexicalBlockFile(scope: !111, file: !7, discriminator: 1)
!115 = !DILocation(line: 23, column: 23, scope: !6)
!116 = !DILocation(line: 23, column: 16, scope: !6)
!117 = !DILocation(line: 23, column: 14, scope: !6)
!118 = !DILocation(line: 24, column: 11, scope: !119)
!119 = distinct !DILexicalBlock(scope: !6, file: !7, line: 24, column: 9)
!120 = !DILocation(line: 24, column: 9, scope: !6)
!121 = !DILocation(line: 25, column: 8, scope: !119)
!122 = !DILocation(line: 27, column: 21, scope: !6)
!123 = !DILocation(line: 27, column: 13, scope: !6)
!124 = !DILocation(line: 27, column: 11, scope: !6)
!125 = !DILocation(line: 28, column: 9, scope: !126)
!126 = distinct !DILexicalBlock(scope: !6, file: !7, line: 28, column: 9)
!127 = !DILocation(line: 28, column: 9, scope: !6)
!128 = !DILocation(line: 30, column: 9, scope: !129)
!129 = distinct !DILexicalBlock(scope: !126, file: !7, line: 29, column: 5)
!130 = !DILocation(line: 30, column: 18, scope: !129)
!131 = !DILocation(line: 31, column: 15, scope: !129)
!132 = !DILocation(line: 31, column: 9, scope: !129)
!133 = !DILocation(line: 32, column: 5, scope: !129)
!134 = !DILocation(line: 33, column: 10, scope: !6)
!135 = !DILocation(line: 33, column: 5, scope: !6)
!136 = !DILocation(line: 34, column: 1, scope: !6)
!137 = !DILocation(line: 34, column: 1, scope: !138)
!138 = !DILexicalBlockFile(scope: !6, file: !7, discriminator: 1)
!139 = !DILocalVariable(name: "filename", scope: !12, file: !7, line: 40, type: !10)
!140 = !DILocation(line: 40, column: 8, scope: !12)
!141 = !DILocation(line: 40, column: 26, scope: !12)
!142 = !DILocation(line: 40, column: 19, scope: !143)
!143 = !DILexicalBlockFile(scope: !12, file: !7, discriminator: 1)
!144 = !DILocation(line: 42, column: 15, scope: !145)
!145 = distinct !DILexicalBlock(scope: !12, file: !7, line: 42, column: 13)
!146 = !DILocation(line: 42, column: 13, scope: !12)
!147 = !DILocation(line: 43, column: 13, scope: !145)
!148 = !DILocation(line: 45, column: 19, scope: !149)
!149 = distinct !DILexicalBlock(scope: !12, file: !7, line: 45, column: 6)
!150 = !DILocation(line: 45, column: 8, scope: !149)
!151 = !DILocation(line: 45, column: 38, scope: !149)
!152 = !DILocation(line: 45, column: 43, scope: !153)
!153 = !DILexicalBlockFile(scope: !149, file: !7, discriminator: 1)
!154 = !DILocation(line: 45, column: 6, scope: !153)
!155 = !DILocation(line: 46, column: 3, scope: !149)
!156 = !DILocation(line: 49, column: 26, scope: !12)
!157 = !DILocation(line: 49, column: 5, scope: !12)
!158 = !DILocation(line: 52, column: 23, scope: !12)
!159 = !DILocation(line: 52, column: 17, scope: !12)
!160 = !DILocation(line: 52, column: 15, scope: !12)
!161 = !DILocation(line: 53, column: 9, scope: !162)
!162 = distinct !DILexicalBlock(scope: !12, file: !7, line: 53, column: 9)
!163 = !DILocation(line: 53, column: 9, scope: !12)
!164 = !DILocation(line: 54, column: 16, scope: !162)
!165 = !DILocation(line: 54, column: 9, scope: !162)
!166 = !DILocation(line: 56, column: 29, scope: !167)
!167 = distinct !DILexicalBlock(scope: !12, file: !7, line: 56, column: 9)
!168 = !DILocation(line: 56, column: 23, scope: !167)
!169 = !DILocation(line: 56, column: 21, scope: !167)
!170 = !DILocation(line: 56, column: 9, scope: !12)
!171 = !DILocation(line: 57, column: 52, scope: !172)
!172 = distinct !DILexicalBlock(scope: !167, file: !7, line: 56, column: 47)
!173 = !DILocation(line: 57, column: 9, scope: !172)
!174 = !DILocation(line: 59, column: 63, scope: !172)
!175 = !DILocation(line: 58, column: 9, scope: !172)
!176 = !DILocation(line: 60, column: 9, scope: !172)
!177 = !DILocation(line: 62, column: 12, scope: !12)
!178 = !DILocation(line: 62, column: 5, scope: !12)
!179 = !DILocation(line: 64, column: 10, scope: !12)
!180 = !DILocation(line: 64, column: 5, scope: !12)
!181 = !DILocation(line: 65, column: 1, scope: !12)
!182 = !DILocation(line: 65, column: 1, scope: !143)
!183 = !DILocation(line: 69, column: 9, scope: !184)
!184 = distinct !DILexicalBlock(scope: !15, file: !7, line: 69, column: 9)
!185 = !DILocation(line: 69, column: 9, scope: !15)
!186 = !DILocation(line: 70, column: 13, scope: !187)
!187 = distinct !DILexicalBlock(scope: !188, file: !7, line: 70, column: 13)
!188 = distinct !DILexicalBlock(scope: !184, file: !7, line: 69, column: 20)
!189 = !DILocation(line: 70, column: 30, scope: !187)
!190 = !DILocation(line: 70, column: 13, scope: !188)
!191 = !DILocation(line: 71, column: 13, scope: !187)
!192 = !DILocation(line: 72, column: 16, scope: !188)
!193 = !DILocation(line: 72, column: 9, scope: !188)
!194 = !DILocation(line: 73, column: 19, scope: !188)
!195 = !DILocation(line: 74, column: 5, scope: !188)
!196 = !DILocation(line: 75, column: 1, scope: !15)
!197 = !DILocalVariable(name: "type", arg: 1, scope: !16, file: !7, line: 77, type: !11)
!198 = !DILocation(line: 77, column: 25, scope: !16)
!199 = !DILocalVariable(name: "ut", scope: !16, file: !7, line: 79, type: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "bftpdutmp", file: !201, line: 9, size: 2432, align: 64, elements: !202)
!201 = !DIFile(filename: "./bftpdutmp.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!202 = !{!203, !204, !205, !209, !213}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bu_type", scope: !200, file: !201, line: 10, baseType: !11, size: 8, align: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bu_pid", scope: !200, file: !201, line: 11, baseType: !22, size: 32, align: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bu_name", scope: !200, file: !201, line: 12, baseType: !206, size: 248, align: 8, offset: 64)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 248, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 31)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "bu_host", scope: !200, file: !201, line: 13, baseType: !210, size: 2048, align: 8, offset: 312)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bu_time", scope: !200, file: !201, line: 14, baseType: !214, size: 64, align: 64, offset: 2368)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !215, line: 75, baseType: !216)
!215 = !DIFile(filename: "/usr/include/time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !25, line: 139, baseType: !67)
!217 = !DILocation(line: 79, column: 22, scope: !16)
!218 = !DILocalVariable(name: "tmp", scope: !16, file: !7, line: 79, type: !200)
!219 = !DILocation(line: 79, column: 26, scope: !16)
!220 = !DILocalVariable(name: "i", scope: !16, file: !7, line: 80, type: !67)
!221 = !DILocation(line: 80, column: 10, scope: !16)
!222 = !DILocalVariable(name: "max_length", scope: !16, file: !7, line: 81, type: !26)
!223 = !DILocation(line: 81, column: 9, scope: !16)
!224 = !DILocation(line: 83, column: 10, scope: !225)
!225 = distinct !DILexicalBlock(scope: !16, file: !7, line: 83, column: 9)
!226 = !DILocation(line: 83, column: 9, scope: !16)
!227 = !DILocation(line: 84, column: 9, scope: !225)
!228 = !DILocation(line: 85, column: 5, scope: !16)
!229 = !DILocation(line: 86, column: 17, scope: !16)
!230 = !DILocation(line: 86, column: 8, scope: !16)
!231 = !DILocation(line: 86, column: 15, scope: !16)
!232 = !DILocation(line: 87, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !16, file: !7, line: 87, column: 9)
!234 = !DILocation(line: 87, column: 9, scope: !16)
!235 = !DILocation(line: 88, column: 12, scope: !236)
!236 = distinct !DILexicalBlock(scope: !233, file: !7, line: 87, column: 15)
!237 = !DILocation(line: 88, column: 20, scope: !236)
!238 = !DILocation(line: 89, column: 20, scope: !236)
!239 = !DILocation(line: 89, column: 17, scope: !236)
!240 = !DILocation(line: 89, column: 9, scope: !236)
!241 = !DILocation(line: 90, column: 20, scope: !236)
!242 = !DILocation(line: 91, column: 20, scope: !236)
!243 = !DILocation(line: 91, column: 17, scope: !236)
!244 = !DILocation(line: 91, column: 29, scope: !236)
!245 = !DILocation(line: 91, column: 45, scope: !236)
!246 = !DILocation(line: 91, column: 9, scope: !236)
!247 = !DILocation(line: 92, column: 20, scope: !236)
!248 = !DILocation(line: 92, column: 31, scope: !236)
!249 = !DILocation(line: 92, column: 9, scope: !236)
!250 = !DILocation(line: 92, column: 12, scope: !236)
!251 = !DILocation(line: 92, column: 36, scope: !236)
!252 = !DILocation(line: 94, column: 16, scope: !236)
!253 = !DILocation(line: 94, column: 9, scope: !236)
!254 = !DILocation(line: 95, column: 11, scope: !236)
!255 = !DILocation(line: 96, column: 9, scope: !236)
!256 = !DILocation(line: 96, column: 22, scope: !257)
!257 = !DILexicalBlockFile(scope: !236, file: !7, discriminator: 1)
!258 = !DILocation(line: 96, column: 53, scope: !257)
!259 = !DILocation(line: 96, column: 16, scope: !257)
!260 = !DILocation(line: 96, column: 9, scope: !257)
!261 = !DILocation(line: 97, column: 22, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !7, line: 97, column: 17)
!263 = distinct !DILexicalBlock(scope: !236, file: !7, line: 96, column: 65)
!264 = !DILocation(line: 97, column: 18, scope: !262)
!265 = !DILocation(line: 97, column: 17, scope: !263)
!266 = !DILocation(line: 98, column: 17, scope: !262)
!267 = !DILocation(line: 99, column: 14, scope: !263)
!268 = !DILocation(line: 96, column: 9, scope: !269)
!269 = !DILexicalBlockFile(scope: !236, file: !7, discriminator: 2)
!270 = !DILocation(line: 101, column: 28, scope: !236)
!271 = !DILocation(line: 101, column: 30, scope: !236)
!272 = !DILocation(line: 101, column: 26, scope: !236)
!273 = !DILocation(line: 102, column: 5, scope: !236)
!274 = !DILocation(line: 105, column: 12, scope: !233)
!275 = !DILocation(line: 105, column: 20, scope: !233)
!276 = !DILocation(line: 107, column: 15, scope: !16)
!277 = !DILocation(line: 107, column: 5, scope: !16)
!278 = !DILocation(line: 108, column: 11, scope: !16)
