; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/dirlist.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hidegroup = type { i32, %struct.hidegroup* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

@hidegroups = global %struct.hidegroup* null, align 8
@add_to_hidegroups.tmp = internal global %struct.hidegroup* null, align 8
@.str = private unnamed_addr constant [11 x i8] c"HIDE_GROUP\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c",\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"213-Error: %s.\0A\00", align 1
@.str.4 = private unnamed_addr constant [11 x i8] c"lrwxrwxrwx\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c" -> %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !124)
!1 = !DIFile(filename: "dirlist.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!2 = !{}
!3 = !{!4, !24, !47}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !6, line: 46, size: 1152, align: 64, elements: !7)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!7 = !{!8, !12, !14, !16, !19, !21, !23, !25, !26, !29, !31, !33, !41, !42, !43}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !5, file: !6, line: 48, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !10, line: 124, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!11 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !5, file: !6, line: 53, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !10, line: 127, baseType: !11)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !5, file: !6, line: 61, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !10, line: 130, baseType: !11)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !5, file: !6, line: 62, baseType: !17, size: 32, align: 32, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !10, line: 129, baseType: !18)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !5, file: !6, line: 64, baseType: !20, size: 32, align: 32, offset: 224)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !10, line: 125, baseType: !18)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !5, file: !6, line: 65, baseType: !22, size: 32, align: 32, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !10, line: 126, baseType: !18)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !5, file: !6, line: 67, baseType: !24, size: 32, align: 32, offset: 288)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !5, file: !6, line: 69, baseType: !9, size: 64, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !5, file: !6, line: 74, baseType: !27, size: 64, align: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 131, baseType: !28)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !5, file: !6, line: 78, baseType: !30, size: 64, align: 64, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !10, line: 153, baseType: !28)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !5, file: !6, line: 80, baseType: !32, size: 64, align: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !10, line: 158, baseType: !28)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !5, file: !6, line: 91, baseType: !34, size: 128, align: 64, offset: 576)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !35, line: 120, size: 128, align: 64, elements: !36)
!35 = !DIFile(filename: "/usr/include/time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !34, file: !35, line: 122, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 139, baseType: !28)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !34, file: !35, line: 123, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !10, line: 175, baseType: !28)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !5, file: !6, line: 92, baseType: !34, size: 128, align: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !5, file: !6, line: 93, baseType: !34, size: 128, align: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !5, file: !6, line: 106, baseType: !44, size: 192, align: 64, offset: 960)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, align: 64, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 3)
!47 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!48 = !{!49, !53, !56, !57, !118, !121}
!49 = distinct !DISubprogram(name: "add_to_hidegroups", scope: !50, file: !50, line: 55, type: !51, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!50 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/dirlist.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !24}
!53 = distinct !DISubprogram(name: "hidegroups_init", scope: !50, file: !50, line: 70, type: !54, isLocal: false, isDefinition: true, scopeLine: 71, isOptimized: false, variables: !2)
!54 = !DISubroutineType(types: !55)
!55 = !{null}
!56 = distinct !DISubprogram(name: "hidegroups_end", scope: !50, file: !50, line: 90, type: !54, isLocal: false, isDefinition: true, scopeLine: 91, isOptimized: false, variables: !2)
!57 = distinct !DISubprogram(name: "bftpd_stat", scope: !50, file: !50, line: 101, type: !58, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !62}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 48, baseType: !65)
!64 = !DIFile(filename: "/usr/include/stdio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 245, size: 1728, align: 64, elements: !67)
!66 = !DIFile(filename: "/usr/include/libio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !92, !94, !96, !100, !103, !105, !107, !108, !109, !110, !113, !114}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 246, baseType: !24, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 251, baseType: !60, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 252, baseType: !60, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 253, baseType: !60, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 254, baseType: !60, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 255, baseType: !60, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 256, baseType: !60, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 257, baseType: !60, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 258, baseType: !60, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 260, baseType: !60, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 261, baseType: !60, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 262, baseType: !60, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 264, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 160, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !66, line: 161, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !66, line: 162, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !66, line: 166, baseType: !24, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 266, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 268, baseType: !24, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 272, baseType: !24, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 274, baseType: !27, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 278, baseType: !93, size: 16, align: 16, offset: 1024)
!93 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 279, baseType: !95, size: 8, align: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 280, baseType: !97, size: 8, align: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 284, baseType: !101, size: 64, align: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 154, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 293, baseType: !104, size: 64, align: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !10, line: 132, baseType: !28)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !65, file: !66, line: 302, baseType: !106, size: 64, align: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !65, file: !66, line: 303, baseType: !106, size: 64, align: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !65, file: !66, line: 304, baseType: !106, size: 64, align: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !65, file: !66, line: 305, baseType: !106, size: 64, align: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 306, baseType: !111, size: 64, align: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 62, baseType: !11)
!112 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 308, baseType: !24, size: 32, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 310, baseType: !115, size: 160, align: 8, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = distinct !DISubprogram(name: "dirlist_one_file", scope: !50, file: !50, line: 166, type: !119, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !60, !62, !61}
!121 = distinct !DISubprogram(name: "dirlist", scope: !50, file: !50, line: 193, type: !122, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !60, !62, !61, !24}
!124 = !{!125, !132, !133, !135, !136, !137}
!125 = !DIGlobalVariable(name: "hidegroups", scope: !0, file: !50, line: 53, type: !126, isLocal: false, isDefinition: true, variable: %struct.hidegroup** @hidegroups)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "hidegroup", file: !128, line: 4, size: 128, align: 64, elements: !129)
!128 = !DIFile(filename: "./dirlist.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !128, line: 5, baseType: !24, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !128, line: 6, baseType: !126, size: 64, align: 64, offset: 64)
!132 = !DIGlobalVariable(name: "tmp", scope: !49, file: !50, line: 57, type: !126, isLocal: true, isDefinition: true, variable: %struct.hidegroup** @add_to_hidegroups.tmp)
!133 = !DIGlobalVariable(name: "configpath", scope: !0, file: !134, line: 25, type: !60, isLocal: false, isDefinition: true, variable: i8** @configpath)
!134 = !DIFile(filename: "./main.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!135 = !DIGlobalVariable(name: "daemonmode", scope: !0, file: !134, line: 26, type: !24, isLocal: false, isDefinition: true, variable: i32* @daemonmode)
!136 = !DIGlobalVariable(name: "pre_write_script", scope: !0, file: !134, line: 29, type: !60, isLocal: false, isDefinition: true, variable: i8** @pre_write_script)
!137 = !DIGlobalVariable(name: "post_write_script", scope: !0, file: !134, line: 30, type: !60, isLocal: false, isDefinition: true, variable: i8** @post_write_script)
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!141 = !DILocalVariable(name: "gid", arg: 1, scope: !49, file: !50, line: 55, type: !24)
!142 = !DIExpression()
!143 = !DILocation(line: 55, column: 28, scope: !49)
!144 = !DILocation(line: 58, column: 9, scope: !145)
!145 = distinct !DILexicalBlock(scope: !49, file: !50, line: 58, column: 9)
!146 = !DILocation(line: 58, column: 9, scope: !49)
!147 = !DILocation(line: 59, column: 27, scope: !145)
!148 = !DILocation(line: 59, column: 15, scope: !145)
!149 = !DILocation(line: 59, column: 20, scope: !145)
!150 = !DILocation(line: 59, column: 25, scope: !145)
!151 = !DILocation(line: 59, column: 13, scope: !145)
!152 = !DILocation(line: 59, column: 9, scope: !145)
!153 = !DILocation(line: 61, column: 28, scope: !145)
!154 = !DILocation(line: 61, column: 26, scope: !145)
!155 = !DILocation(line: 61, column: 20, scope: !145)
!156 = !DILocation(line: 63, column: 9, scope: !157)
!157 = distinct !DILexicalBlock(scope: !49, file: !50, line: 63, column: 9)
!158 = !DILocation(line: 63, column: 9, scope: !49)
!159 = !DILocation(line: 65, column: 7, scope: !160)
!160 = distinct !DILexicalBlock(scope: !157, file: !50, line: 64, column: 5)
!161 = !DILocation(line: 65, column: 12, scope: !160)
!162 = !DILocation(line: 65, column: 17, scope: !160)
!163 = !DILocation(line: 66, column: 19, scope: !160)
!164 = !DILocation(line: 66, column: 7, scope: !160)
!165 = !DILocation(line: 66, column: 12, scope: !160)
!166 = !DILocation(line: 66, column: 17, scope: !160)
!167 = !DILocation(line: 67, column: 5, scope: !160)
!168 = !DILocation(line: 68, column: 1, scope: !49)
!169 = !DILocalVariable(name: "foo", scope: !53, file: !50, line: 72, type: !60)
!170 = !DILocation(line: 72, column: 11, scope: !53)
!171 = !DILocation(line: 72, column: 24, scope: !53)
!172 = !DILocation(line: 72, column: 17, scope: !173)
!173 = !DILexicalBlockFile(scope: !53, file: !50, discriminator: 1)
!174 = !DILocalVariable(name: "foo_save", scope: !53, file: !50, line: 73, type: !60)
!175 = !DILocation(line: 73, column: 11, scope: !53)
!176 = !DILocation(line: 73, column: 22, scope: !53)
!177 = !DILocalVariable(name: "bar", scope: !53, file: !50, line: 74, type: !60)
!178 = !DILocation(line: 74, column: 11, scope: !53)
!179 = !DILocalVariable(name: "tmpgrp", scope: !53, file: !50, line: 75, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !182, line: 42, size: 256, align: 64, elements: !183)
!182 = !DIFile(filename: "/usr/include/grp.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !181, file: !182, line: 44, baseType: !60, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !181, file: !182, line: 45, baseType: !60, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !181, file: !182, line: 46, baseType: !22, size: 32, align: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !181, file: !182, line: 47, baseType: !188, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!189 = !DILocation(line: 75, column: 19, scope: !53)
!190 = !DILocation(line: 77, column: 5, scope: !53)
!191 = !DILocation(line: 77, column: 26, scope: !173)
!192 = !DILocation(line: 77, column: 19, scope: !173)
!193 = !DILocation(line: 77, column: 17, scope: !173)
!194 = !DILocation(line: 77, column: 5, scope: !173)
!195 = !DILocation(line: 78, column: 13, scope: !196)
!196 = distinct !DILexicalBlock(scope: !53, file: !50, line: 77, column: 38)
!197 = !DILocation(line: 79, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !196, file: !50, line: 79, column: 13)
!199 = !DILocation(line: 79, column: 14, scope: !198)
!200 = !DILocation(line: 79, column: 32, scope: !198)
!201 = !DILocation(line: 79, column: 45, scope: !202)
!202 = !DILexicalBlockFile(scope: !198, file: !50, discriminator: 1)
!203 = !DILocation(line: 79, column: 37, scope: !202)
!204 = !DILocation(line: 79, column: 13, scope: !202)
!205 = !DILocation(line: 81, column: 36, scope: !206)
!206 = distinct !DILexicalBlock(scope: !207, file: !50, line: 81, column: 17)
!207 = distinct !DILexicalBlock(scope: !198, file: !50, line: 79, column: 62)
!208 = !DILocation(line: 81, column: 27, scope: !206)
!209 = !DILocation(line: 81, column: 25, scope: !206)
!210 = !DILocation(line: 81, column: 17, scope: !207)
!211 = !DILocation(line: 82, column: 35, scope: !206)
!212 = !DILocation(line: 82, column: 43, scope: !206)
!213 = !DILocation(line: 82, column: 17, scope: !206)
!214 = !DILocation(line: 83, column: 9, scope: !207)
!215 = !DILocation(line: 84, column: 25, scope: !216)
!216 = distinct !DILexicalBlock(scope: !198, file: !50, line: 84, column: 17)
!217 = !DILocation(line: 84, column: 17, scope: !216)
!218 = !DILocation(line: 84, column: 17, scope: !198)
!219 = !DILocation(line: 85, column: 43, scope: !216)
!220 = !DILocation(line: 85, column: 35, scope: !216)
!221 = !DILocation(line: 85, column: 17, scope: !222)
!222 = !DILexicalBlockFile(scope: !216, file: !50, discriminator: 1)
!223 = !DILocation(line: 85, column: 17, scope: !216)
!224 = !DILocation(line: 77, column: 5, scope: !225)
!225 = !DILexicalBlockFile(scope: !53, file: !50, discriminator: 2)
!226 = !DILocation(line: 87, column: 7, scope: !53)
!227 = !DILocation(line: 87, column: 2, scope: !53)
!228 = !DILocation(line: 88, column: 1, scope: !53)
!229 = !DILocalVariable(name: "tmp", scope: !56, file: !50, line: 92, type: !126)
!230 = !DILocation(line: 92, column: 23, scope: !56)
!231 = !DILocation(line: 92, column: 29, scope: !56)
!232 = !DILocation(line: 93, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !56, file: !50, line: 93, column: 9)
!234 = !DILocation(line: 93, column: 9, scope: !56)
!235 = !DILocation(line: 94, column: 9, scope: !233)
!236 = !DILocation(line: 94, column: 16, scope: !237)
!237 = !DILexicalBlockFile(scope: !233, file: !50, discriminator: 1)
!238 = !DILocation(line: 94, column: 28, scope: !237)
!239 = !DILocation(line: 94, column: 9, scope: !237)
!240 = !DILocation(line: 95, column: 19, scope: !241)
!241 = distinct !DILexicalBlock(scope: !233, file: !50, line: 94, column: 34)
!242 = !DILocation(line: 95, column: 31, scope: !241)
!243 = !DILocation(line: 95, column: 17, scope: !241)
!244 = !DILocation(line: 96, column: 18, scope: !241)
!245 = !DILocation(line: 96, column: 13, scope: !241)
!246 = !DILocation(line: 97, column: 26, scope: !241)
!247 = !DILocation(line: 97, column: 24, scope: !241)
!248 = !DILocation(line: 94, column: 9, scope: !249)
!249 = !DILexicalBlockFile(scope: !233, file: !50, discriminator: 2)
!250 = !DILocation(line: 94, column: 9, scope: !251)
!251 = !DILexicalBlockFile(scope: !233, file: !50, discriminator: 3)
!252 = !DILocation(line: 99, column: 1, scope: !56)
!253 = !DILocalVariable(name: "name", arg: 1, scope: !57, file: !50, line: 101, type: !60)
!254 = !DILocation(line: 101, column: 23, scope: !57)
!255 = !DILocalVariable(name: "client", arg: 2, scope: !57, file: !50, line: 101, type: !62)
!256 = !DILocation(line: 101, column: 36, scope: !57)
!257 = !DILocalVariable(name: "statbuf", scope: !57, file: !50, line: 103, type: !5)
!258 = !DILocation(line: 103, column: 17, scope: !57)
!259 = !DILocalVariable(name: "temp", scope: !57, file: !50, line: 104, type: !260)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2064, align: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 258)
!263 = !DILocation(line: 104, column: 7, scope: !57)
!264 = !DILocalVariable(name: "linktarget", scope: !57, file: !50, line: 104, type: !265)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2080, align: 8, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 260)
!268 = !DILocation(line: 104, column: 25, scope: !57)
!269 = !DILocalVariable(name: "perm", scope: !57, file: !50, line: 104, type: !270)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 88, align: 8, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 11)
!273 = !DILocation(line: 104, column: 49, scope: !57)
!274 = !DILocalVariable(name: "timestr", scope: !57, file: !50, line: 104, type: !275)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 136, align: 8, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 17)
!278 = !DILocation(line: 104, column: 59, scope: !57)
!279 = !DILocalVariable(name: "uid", scope: !57, file: !50, line: 105, type: !280)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 248, align: 8, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 31)
!283 = !DILocation(line: 105, column: 3, scope: !57)
!284 = !DILocalVariable(name: "gid", scope: !57, file: !50, line: 105, type: !280)
!285 = !DILocation(line: 105, column: 21, scope: !57)
!286 = !DILocalVariable(name: "filetime", scope: !57, file: !50, line: 106, type: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !35, line: 133, size: 448, align: 64, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !287, file: !35, line: 135, baseType: !24, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !287, file: !35, line: 136, baseType: !24, size: 32, align: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !287, file: !35, line: 137, baseType: !24, size: 32, align: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !287, file: !35, line: 138, baseType: !24, size: 32, align: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !287, file: !35, line: 139, baseType: !24, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !287, file: !35, line: 140, baseType: !24, size: 32, align: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !287, file: !35, line: 141, baseType: !24, size: 32, align: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !287, file: !35, line: 142, baseType: !24, size: 32, align: 32, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !287, file: !35, line: 143, baseType: !24, size: 32, align: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !287, file: !35, line: 146, baseType: !28, size: 64, align: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !287, file: !35, line: 147, baseType: !300, size: 64, align: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!302 = !DILocation(line: 106, column: 15, scope: !57)
!303 = !DILocalVariable(name: "tea_time", scope: !57, file: !50, line: 107, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!305 = !DILocation(line: 107, column: 16, scope: !57)
!306 = !DILocalVariable(name: "local_time", scope: !57, file: !50, line: 107, type: !304)
!307 = !DILocation(line: 107, column: 27, scope: !57)
!308 = !DILocalVariable(name: "t", scope: !57, file: !50, line: 108, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !35, line: 75, baseType: !38)
!310 = !DILocation(line: 108, column: 12, scope: !57)
!311 = !DILocation(line: 110, column: 15, scope: !312)
!312 = distinct !DILexicalBlock(scope: !57, file: !50, line: 110, column: 9)
!313 = !DILocation(line: 110, column: 9, scope: !312)
!314 = !DILocation(line: 110, column: 47, scope: !312)
!315 = !DILocation(line: 110, column: 9, scope: !57)
!316 = !DILocation(line: 111, column: 17, scope: !317)
!317 = distinct !DILexicalBlock(scope: !312, file: !50, line: 110, column: 54)
!318 = !DILocation(line: 111, column: 54, scope: !317)
!319 = !DILocation(line: 111, column: 45, scope: !320)
!320 = !DILexicalBlockFile(scope: !317, file: !50, discriminator: 1)
!321 = !DILocation(line: 111, column: 9, scope: !322)
!322 = !DILexicalBlockFile(scope: !317, file: !50, discriminator: 2)
!323 = !DILocation(line: 112, column: 9, scope: !317)
!324 = !DILocation(line: 115, column: 6, scope: !325)
!325 = distinct !DILexicalBlock(scope: !57, file: !50, line: 115, column: 6)
!326 = !DILocation(line: 115, column: 6, scope: !57)
!327 = !DILocation(line: 116, column: 10, scope: !328)
!328 = distinct !DILexicalBlock(scope: !325, file: !50, line: 115, column: 32)
!329 = !DILocation(line: 116, column: 3, scope: !328)
!330 = !DILocation(line: 117, column: 17, scope: !328)
!331 = !DILocation(line: 117, column: 23, scope: !328)
!332 = !DILocation(line: 117, column: 8, scope: !328)
!333 = !DILocation(line: 117, column: 3, scope: !328)
!334 = !DILocation(line: 117, column: 48, scope: !328)
!335 = !DILocation(line: 118, column: 11, scope: !328)
!336 = !DILocation(line: 118, column: 33, scope: !328)
!337 = !DILocation(line: 118, column: 3, scope: !328)
!338 = !DILocation(line: 119, column: 2, scope: !328)
!339 = !DILocation(line: 121, column: 10, scope: !340)
!340 = distinct !DILexicalBlock(scope: !325, file: !50, line: 119, column: 9)
!341 = !DILocation(line: 121, column: 3, scope: !340)
!342 = !DILocation(line: 122, column: 7, scope: !343)
!343 = distinct !DILexicalBlock(scope: !340, file: !50, line: 122, column: 7)
!344 = !DILocation(line: 122, column: 7, scope: !340)
!345 = !DILocation(line: 123, column: 4, scope: !343)
!346 = !DILocation(line: 123, column: 12, scope: !343)
!347 = !DILocation(line: 124, column: 15, scope: !348)
!348 = distinct !DILexicalBlock(scope: !340, file: !50, line: 124, column: 7)
!349 = !DILocation(line: 124, column: 23, scope: !348)
!350 = !DILocation(line: 124, column: 7, scope: !340)
!351 = !DILocation(line: 125, column: 4, scope: !348)
!352 = !DILocation(line: 125, column: 12, scope: !348)
!353 = !DILocation(line: 126, column: 15, scope: !354)
!354 = distinct !DILexicalBlock(scope: !340, file: !50, line: 126, column: 7)
!355 = !DILocation(line: 126, column: 23, scope: !354)
!356 = !DILocation(line: 126, column: 7, scope: !340)
!357 = !DILocation(line: 127, column: 4, scope: !354)
!358 = !DILocation(line: 127, column: 12, scope: !354)
!359 = !DILocation(line: 128, column: 15, scope: !360)
!360 = distinct !DILexicalBlock(scope: !340, file: !50, line: 128, column: 7)
!361 = !DILocation(line: 128, column: 23, scope: !360)
!362 = !DILocation(line: 128, column: 7, scope: !340)
!363 = !DILocation(line: 129, column: 4, scope: !360)
!364 = !DILocation(line: 129, column: 12, scope: !360)
!365 = !DILocation(line: 130, column: 15, scope: !366)
!366 = distinct !DILexicalBlock(scope: !340, file: !50, line: 130, column: 7)
!367 = !DILocation(line: 130, column: 23, scope: !366)
!368 = !DILocation(line: 130, column: 7, scope: !340)
!369 = !DILocation(line: 131, column: 4, scope: !366)
!370 = !DILocation(line: 131, column: 12, scope: !366)
!371 = !DILocation(line: 132, column: 15, scope: !372)
!372 = distinct !DILexicalBlock(scope: !340, file: !50, line: 132, column: 7)
!373 = !DILocation(line: 132, column: 23, scope: !372)
!374 = !DILocation(line: 132, column: 7, scope: !340)
!375 = !DILocation(line: 133, column: 4, scope: !372)
!376 = !DILocation(line: 133, column: 12, scope: !372)
!377 = !DILocation(line: 134, column: 15, scope: !378)
!378 = distinct !DILexicalBlock(scope: !340, file: !50, line: 134, column: 7)
!379 = !DILocation(line: 134, column: 23, scope: !378)
!380 = !DILocation(line: 134, column: 7, scope: !340)
!381 = !DILocation(line: 135, column: 4, scope: !378)
!382 = !DILocation(line: 135, column: 12, scope: !378)
!383 = !DILocation(line: 136, column: 15, scope: !384)
!384 = distinct !DILexicalBlock(scope: !340, file: !50, line: 136, column: 7)
!385 = !DILocation(line: 136, column: 23, scope: !384)
!386 = !DILocation(line: 136, column: 7, scope: !340)
!387 = !DILocation(line: 137, column: 4, scope: !384)
!388 = !DILocation(line: 137, column: 12, scope: !384)
!389 = !DILocation(line: 138, column: 15, scope: !390)
!390 = distinct !DILexicalBlock(scope: !340, file: !50, line: 138, column: 7)
!391 = !DILocation(line: 138, column: 23, scope: !390)
!392 = !DILocation(line: 138, column: 7, scope: !340)
!393 = !DILocation(line: 139, column: 4, scope: !390)
!394 = !DILocation(line: 139, column: 12, scope: !390)
!395 = !DILocation(line: 140, column: 15, scope: !396)
!396 = distinct !DILexicalBlock(scope: !340, file: !50, line: 140, column: 7)
!397 = !DILocation(line: 140, column: 23, scope: !396)
!398 = !DILocation(line: 140, column: 7, scope: !340)
!399 = !DILocation(line: 141, column: 4, scope: !396)
!400 = !DILocation(line: 141, column: 12, scope: !396)
!401 = !DILocation(line: 142, column: 3, scope: !340)
!402 = !DILocation(line: 142, column: 17, scope: !340)
!403 = !DILocation(line: 147, column: 38, scope: !57)
!404 = !DILocation(line: 147, column: 18, scope: !57)
!405 = !DILocation(line: 147, column: 16, scope: !57)
!406 = !DILocation(line: 148, column: 11, scope: !407)
!407 = distinct !DILexicalBlock(scope: !57, file: !50, line: 148, column: 9)
!408 = !DILocation(line: 148, column: 9, scope: !57)
!409 = !DILocation(line: 148, column: 23, scope: !410)
!410 = !DILexicalBlockFile(scope: !407, file: !50, discriminator: 1)
!411 = !DILocation(line: 149, column: 5, scope: !57)
!412 = !DILocation(line: 149, column: 23, scope: !57)
!413 = !DILocation(line: 150, column: 5, scope: !57)
!414 = !DILocation(line: 151, column: 16, scope: !57)
!415 = !DILocation(line: 151, column: 14, scope: !57)
!416 = !DILocation(line: 152, column: 11, scope: !417)
!417 = distinct !DILexicalBlock(scope: !57, file: !50, line: 152, column: 9)
!418 = !DILocation(line: 152, column: 9, scope: !57)
!419 = !DILocation(line: 152, column: 21, scope: !420)
!420 = !DILexicalBlockFile(scope: !417, file: !50, discriminator: 1)
!421 = !DILocation(line: 154, column: 18, scope: !422)
!422 = distinct !DILexicalBlock(scope: !57, file: !50, line: 154, column: 9)
!423 = !DILocation(line: 154, column: 29, scope: !422)
!424 = !DILocation(line: 154, column: 39, scope: !422)
!425 = !DILocation(line: 154, column: 26, scope: !422)
!426 = !DILocation(line: 154, column: 9, scope: !57)
!427 = !DILocation(line: 155, column: 16, scope: !422)
!428 = !DILocation(line: 155, column: 41, scope: !422)
!429 = !DILocation(line: 155, column: 25, scope: !422)
!430 = !DILocation(line: 155, column: 52, scope: !422)
!431 = !DILocation(line: 155, column: 6, scope: !432)
!432 = !DILexicalBlockFile(scope: !422, file: !50, discriminator: 1)
!433 = !DILocation(line: 155, column: 6, scope: !422)
!434 = !DILocation(line: 157, column: 18, scope: !422)
!435 = !DILocation(line: 157, column: 9, scope: !422)
!436 = !DILocation(line: 158, column: 24, scope: !57)
!437 = !DILocation(line: 158, column: 32, scope: !57)
!438 = !DILocation(line: 158, column: 44, scope: !57)
!439 = !DILocation(line: 158, column: 5, scope: !57)
!440 = !DILocation(line: 158, column: 52, scope: !57)
!441 = !DILocation(line: 159, column: 24, scope: !57)
!442 = !DILocation(line: 159, column: 32, scope: !57)
!443 = !DILocation(line: 159, column: 43, scope: !57)
!444 = !DILocation(line: 159, column: 5, scope: !57)
!445 = !DILocation(line: 159, column: 51, scope: !57)
!446 = !DILocation(line: 160, column: 10, scope: !57)
!447 = !DILocation(line: 160, column: 55, scope: !57)
!448 = !DILocation(line: 161, column: 18, scope: !57)
!449 = !DILocation(line: 161, column: 4, scope: !57)
!450 = !DILocation(line: 161, column: 28, scope: !57)
!451 = !DILocation(line: 161, column: 33, scope: !57)
!452 = !DILocation(line: 162, column: 33, scope: !57)
!453 = !DILocation(line: 163, column: 4, scope: !57)
!454 = !DILocation(line: 163, column: 13, scope: !57)
!455 = !DILocation(line: 163, column: 19, scope: !57)
!456 = !DILocation(line: 160, column: 2, scope: !57)
!457 = !DILocation(line: 164, column: 1, scope: !57)
!458 = !DILocation(line: 164, column: 1, scope: !459)
!459 = !DILexicalBlockFile(scope: !57, file: !50, discriminator: 1)
!460 = !DILocalVariable(name: "name", arg: 1, scope: !118, file: !50, line: 166, type: !60)
!461 = !DILocation(line: 166, column: 29, scope: !118)
!462 = !DILocalVariable(name: "client", arg: 2, scope: !118, file: !50, line: 166, type: !62)
!463 = !DILocation(line: 166, column: 41, scope: !118)
!464 = !DILocalVariable(name: "verbose", arg: 3, scope: !118, file: !50, line: 166, type: !61)
!465 = !DILocation(line: 166, column: 54, scope: !118)
!466 = !DILocalVariable(name: "statbuf", scope: !118, file: !50, line: 168, type: !5)
!467 = !DILocation(line: 168, column: 17, scope: !118)
!468 = !DILocalVariable(name: "tmp", scope: !118, file: !50, line: 169, type: !126)
!469 = !DILocation(line: 169, column: 23, scope: !118)
!470 = !DILocation(line: 169, column: 29, scope: !118)
!471 = !DILocalVariable(name: "filename_index", scope: !118, file: !50, line: 170, type: !60)
!472 = !DILocation(line: 170, column: 11, scope: !118)
!473 = !DILocation(line: 172, column: 15, scope: !474)
!474 = distinct !DILexicalBlock(scope: !118, file: !50, line: 172, column: 9)
!475 = !DILocation(line: 172, column: 10, scope: !474)
!476 = !DILocation(line: 172, column: 9, scope: !118)
!477 = !DILocation(line: 173, column: 13, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !50, line: 173, column: 13)
!479 = distinct !DILexicalBlock(scope: !474, file: !50, line: 172, column: 48)
!480 = !DILocation(line: 173, column: 13, scope: !479)
!481 = !DILocation(line: 174, column: 13, scope: !478)
!482 = !DILocation(line: 175, column: 29, scope: !483)
!483 = distinct !DILexicalBlock(scope: !484, file: !50, line: 175, column: 21)
!484 = distinct !DILexicalBlock(scope: !478, file: !50, line: 174, column: 16)
!485 = !DILocation(line: 175, column: 39, scope: !483)
!486 = !DILocation(line: 175, column: 44, scope: !483)
!487 = !DILocation(line: 175, column: 36, scope: !483)
!488 = !DILocation(line: 175, column: 21, scope: !484)
!489 = !DILocation(line: 176, column: 21, scope: !483)
!490 = !DILocation(line: 177, column: 13, scope: !484)
!491 = !DILocation(line: 177, column: 29, scope: !492)
!492 = !DILexicalBlockFile(scope: !478, file: !50, discriminator: 1)
!493 = !DILocation(line: 177, column: 34, scope: !492)
!494 = !DILocation(line: 177, column: 27, scope: !492)
!495 = !DILocation(line: 177, column: 13, scope: !492)
!496 = !DILocation(line: 177, column: 13, scope: !497)
!497 = !DILexicalBlockFile(scope: !484, file: !50, discriminator: 2)
!498 = !DILocation(line: 178, column: 5, scope: !479)
!499 = !DILocation(line: 181, column: 30, scope: !118)
!500 = !DILocation(line: 181, column: 22, scope: !118)
!501 = !DILocation(line: 181, column: 20, scope: !118)
!502 = !DILocation(line: 182, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !118, file: !50, line: 182, column: 9)
!504 = !DILocation(line: 182, column: 9, scope: !118)
!505 = !DILocation(line: 183, column: 22, scope: !503)
!506 = !DILocation(line: 183, column: 8, scope: !503)
!507 = !DILocation(line: 185, column: 25, scope: !503)
!508 = !DILocation(line: 185, column: 23, scope: !503)
!509 = !DILocation(line: 187, column: 9, scope: !510)
!510 = distinct !DILexicalBlock(scope: !118, file: !50, line: 187, column: 9)
!511 = !DILocation(line: 187, column: 9, scope: !118)
!512 = !DILocation(line: 188, column: 20, scope: !510)
!513 = !DILocation(line: 188, column: 26, scope: !510)
!514 = !DILocation(line: 188, column: 9, scope: !510)
!515 = !DILocation(line: 190, column: 17, scope: !510)
!516 = !DILocation(line: 190, column: 35, scope: !510)
!517 = !DILocation(line: 190, column: 9, scope: !510)
!518 = !DILocation(line: 191, column: 1, scope: !118)
!519 = !DILocalVariable(name: "name", arg: 1, scope: !121, file: !50, line: 193, type: !60)
!520 = !DILocation(line: 193, column: 20, scope: !121)
!521 = !DILocalVariable(name: "client", arg: 2, scope: !121, file: !50, line: 193, type: !62)
!522 = !DILocation(line: 193, column: 33, scope: !121)
!523 = !DILocalVariable(name: "verbose", arg: 3, scope: !121, file: !50, line: 193, type: !61)
!524 = !DILocation(line: 193, column: 46, scope: !121)
!525 = !DILocalVariable(name: "show_hidden", arg: 4, scope: !121, file: !50, line: 193, type: !24)
!526 = !DILocation(line: 193, column: 59, scope: !121)
!527 = !DILocalVariable(name: "directory", scope: !121, file: !50, line: 195, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !530, line: 127, baseType: !531)
!530 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !530, line: 127, flags: DIFlagFwdDecl)
!532 = !DILocation(line: 195, column: 10, scope: !121)
!533 = !DILocalVariable(name: "can_see_file", scope: !121, file: !50, line: 196, type: !62)
!534 = !DILocation(line: 196, column: 11, scope: !121)
!535 = !DILocalVariable(name: "show_nonreadable_files", scope: !121, file: !50, line: 197, type: !24)
!536 = !DILocation(line: 197, column: 9, scope: !121)
!537 = !DILocalVariable(name: "show_hidden_files", scope: !121, file: !50, line: 198, type: !24)
!538 = !DILocation(line: 198, column: 9, scope: !121)
!539 = !DILocalVariable(name: "skip_file", scope: !121, file: !50, line: 199, type: !24)
!540 = !DILocation(line: 199, column: 9, scope: !121)
!541 = !DILocalVariable(name: "file_is_hidden", scope: !121, file: !50, line: 199, type: !24)
!542 = !DILocation(line: 199, column: 20, scope: !121)
!543 = !DILocalVariable(name: "local_cwd", scope: !121, file: !50, line: 200, type: !60)
!544 = !DILocation(line: 200, column: 11, scope: !121)
!545 = !DILocalVariable(name: "pattern", scope: !121, file: !50, line: 201, type: !60)
!546 = !DILocation(line: 201, column: 11, scope: !121)
!547 = !DILocalVariable(name: "short_pattern", scope: !121, file: !50, line: 201, type: !60)
!548 = !DILocation(line: 201, column: 28, scope: !121)
!549 = !DILocalVariable(name: "dir_entry", scope: !121, file: !50, line: 203, type: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !552, line: 22, size: 2240, align: 64, elements: !553)
!552 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!553 = !{!554, !556, !557, !558, !560}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !551, file: !552, line: 28, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !10, line: 128, baseType: !11)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !551, file: !552, line: 29, baseType: !104, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !551, file: !552, line: 31, baseType: !93, size: 16, align: 16, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !551, file: !552, line: 32, baseType: !559, size: 8, align: 8, offset: 144)
!559 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !551, file: !552, line: 33, baseType: !561, size: 2048, align: 8, offset: 152)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, align: 8, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 256)
!564 = !DILocation(line: 203, column: 20, scope: !121)
!565 = !DILocation(line: 206, column: 11, scope: !566)
!566 = distinct !DILexicalBlock(scope: !121, file: !50, line: 206, column: 10)
!567 = !DILocation(line: 206, column: 10, scope: !566)
!568 = !DILocation(line: 206, column: 24, scope: !566)
!569 = !DILocation(line: 207, column: 25, scope: !566)
!570 = !DILocation(line: 207, column: 13, scope: !571)
!571 = !DILexicalBlockFile(scope: !566, file: !50, discriminator: 1)
!572 = !DILocation(line: 207, column: 13, scope: !566)
!573 = !DILocation(line: 206, column: 10, scope: !574)
!574 = !DILexicalBlockFile(scope: !121, file: !50, discriminator: 1)
!575 = !DILocation(line: 208, column: 26, scope: !566)
!576 = !DILocation(line: 208, column: 8, scope: !566)
!577 = !DILocation(line: 211, column: 23, scope: !578)
!578 = distinct !DILexicalBlock(scope: !121, file: !50, line: 211, column: 9)
!579 = !DILocation(line: 211, column: 11, scope: !580)
!580 = !DILexicalBlockFile(scope: !578, file: !50, discriminator: 1)
!581 = !DILocation(line: 211, column: 11, scope: !578)
!582 = !DILocation(line: 211, column: 9, scope: !121)
!583 = !DILocation(line: 212, column: 26, scope: !578)
!584 = !DILocation(line: 212, column: 8, scope: !578)
!585 = !DILocation(line: 214, column: 23, scope: !586)
!586 = distinct !DILexicalBlock(scope: !121, file: !50, line: 214, column: 9)
!587 = !DILocation(line: 214, column: 11, scope: !588)
!588 = !DILexicalBlockFile(scope: !586, file: !50, discriminator: 1)
!589 = !DILocation(line: 214, column: 11, scope: !586)
!590 = !DILocation(line: 214, column: 9, scope: !121)
!591 = !DILocation(line: 215, column: 31, scope: !586)
!592 = !DILocation(line: 215, column: 8, scope: !586)
!593 = !DILocation(line: 217, column: 17, scope: !594)
!594 = distinct !DILexicalBlock(scope: !121, file: !50, line: 217, column: 9)
!595 = !DILocation(line: 217, column: 10, scope: !594)
!596 = !DILocation(line: 217, column: 30, scope: !594)
!597 = !DILocation(line: 217, column: 40, scope: !598)
!598 = !DILexicalBlockFile(scope: !594, file: !50, discriminator: 1)
!599 = !DILocation(line: 217, column: 33, scope: !598)
!600 = !DILocation(line: 217, column: 9, scope: !598)
!601 = !DILocation(line: 218, column: 9, scope: !594)
!602 = !DILocation(line: 220, column: 31, scope: !603)
!603 = distinct !DILexicalBlock(scope: !121, file: !50, line: 220, column: 10)
!604 = !DILocation(line: 220, column: 23, scope: !603)
!605 = !DILocation(line: 220, column: 21, scope: !603)
!606 = !DILocation(line: 220, column: 10, scope: !121)
!607 = !DILocation(line: 222, column: 18, scope: !608)
!608 = distinct !DILexicalBlock(scope: !603, file: !50, line: 221, column: 6)
!609 = !DILocation(line: 222, column: 9, scope: !608)
!610 = !DILocation(line: 223, column: 21, scope: !608)
!611 = !DILocation(line: 223, column: 19, scope: !608)
!612 = !DILocation(line: 224, column: 15, scope: !608)
!613 = !DILocation(line: 224, column: 9, scope: !608)
!614 = !DILocation(line: 225, column: 6, scope: !608)
!615 = !DILocation(line: 227, column: 18, scope: !603)
!616 = !DILocation(line: 227, column: 16, scope: !603)
!617 = !DILocation(line: 262, column: 21, scope: !121)
!618 = !DILocation(line: 262, column: 19, scope: !121)
!619 = !DILocation(line: 263, column: 13, scope: !620)
!620 = distinct !DILexicalBlock(scope: !121, file: !50, line: 263, column: 13)
!621 = !DILocation(line: 263, column: 13, scope: !121)
!622 = !DILocation(line: 265, column: 31, scope: !623)
!623 = distinct !DILexicalBlock(scope: !620, file: !50, line: 264, column: 9)
!624 = !DILocation(line: 265, column: 23, scope: !623)
!625 = !DILocation(line: 265, column: 21, scope: !623)
!626 = !DILocation(line: 266, column: 11, scope: !623)
