; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/main.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bftpd_list_element = type { i8*, %struct.bftpd_list_element* }
%struct.hostent = type { i8*, i8**, i32, i32, i8** }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.bftpd_childpid = type { i32, i32 }
%struct.sockaddr = type { i16, [14 x i8] }

@isparent = global i32 1, align 4
@passwdfile = global %struct._IO_FILE* null, align 8
@groupfile = global %struct._IO_FILE* null, align 8
@alarm_type = global i32 0, align 4
@.str = private unnamed_addr constant [16 x i8] c"/etc/bftpd.conf\00", align 1
@configpath = global i8* getelementptr inbounds ([16 x i8], [16 x i8]* @.str, i32 0, i32 0), align 8
@daemonmode = global i32 0, align 4
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"%i-%s\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"Quitting.\0A\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"quit\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !15, subprograms: !36, globals: !57)
!1 = !DIFile(filename: "main.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!7 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!8 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!9 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!10 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!11 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!12 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!13 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!14 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!15 = !{!16, !17, !22, !35}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !18, line: 30, baseType: !19)
!18 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 51, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdint.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!21 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !24, line: 149, size: 128, align: 16, elements: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!25 = !{!26, !30}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !23, file: !24, line: 151, baseType: !27, size: 16, align: 16)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !28, line: 28, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!29 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !23, file: !24, line: 152, baseType: !31, size: 112, align: 8, offset: 16)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 112, align: 8, elements: !33)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !{!34}
!34 = !DISubrange(count: 14)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!36 = !{!37, !43, !46, !49, !50, !51, !52, !53}
!37 = distinct !DISubprogram(name: "print_file", scope: !38, file: !38, line: 80, type: !39, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, variables: !42)
!38 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/main.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !35}
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !{}
!43 = distinct !DISubprogram(name: "end_child", scope: !38, file: !38, line: 94, type: !44, isLocal: false, isDefinition: true, scopeLine: 95, isOptimized: false, variables: !42)
!44 = !DISubroutineType(types: !45)
!45 = !{null}
!46 = distinct !DISubprogram(name: "handler_sighup", scope: !38, file: !38, line: 124, type: !47, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, variables: !42)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !41}
!49 = distinct !DISubprogram(name: "handler_sigchld", scope: !38, file: !38, line: 134, type: !47, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, variables: !42)
!50 = distinct !DISubprogram(name: "handler_sigterm", scope: !38, file: !38, line: 159, type: !47, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, variables: !42)
!51 = distinct !DISubprogram(name: "handler_sigalrm", scope: !38, file: !38, line: 165, type: !47, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, variables: !42)
!52 = distinct !DISubprogram(name: "init_everything", scope: !38, file: !38, line: 183, type: !44, isLocal: false, isDefinition: true, scopeLine: 184, isOptimized: false, variables: !42)
!53 = distinct !DISubprogram(name: "main", scope: !38, file: !38, line: 196, type: !54, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, variables: !42)
!54 = !DISubroutineType(types: !55)
!55 = !{!41, !41, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!57 = !{!58, !59, !118, !119, !120, !121, !122, !132, !134, !135, !136, !137, !138, !154, !155, !156, !157, !158, !159, !160, !161}
!58 = !DIGlobalVariable(name: "isparent", scope: !0, file: !38, line: 66, type: !41, isLocal: false, isDefinition: true, variable: i32* @isparent)
!59 = !DIGlobalVariable(name: "passwdfile", scope: !0, file: !38, line: 68, type: !60, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @passwdfile)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 245, size: 1728, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/libio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !93, !94, !96, !100, !103, !105, !106, !107, !108, !109, !113, !114}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 246, baseType: !41, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 251, baseType: !35, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 252, baseType: !35, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 253, baseType: !35, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 254, baseType: !35, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 255, baseType: !35, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 256, baseType: !35, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 257, baseType: !35, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 258, baseType: !35, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 260, baseType: !35, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 261, baseType: !35, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 262, baseType: !35, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 264, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 160, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !64, line: 161, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !64, line: 162, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !64, line: 166, baseType: !41, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 266, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 268, baseType: !41, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 272, baseType: !41, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 274, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !91, line: 131, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 278, baseType: !29, size: 16, align: 16, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 279, baseType: !95, size: 8, align: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 280, baseType: !97, size: 8, align: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 284, baseType: !101, size: 64, align: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 154, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 293, baseType: !104, size: 64, align: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !91, line: 132, baseType: !92)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !63, file: !64, line: 302, baseType: !16, size: 64, align: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !63, file: !64, line: 303, baseType: !16, size: 64, align: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !63, file: !64, line: 304, baseType: !16, size: 64, align: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !63, file: !64, line: 305, baseType: !16, size: 64, align: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 306, baseType: !110, size: 64, align: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !112)
!111 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 308, baseType: !41, size: 32, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 310, baseType: !115, size: 160, align: 8, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DIGlobalVariable(name: "groupfile", scope: !0, file: !38, line: 68, type: !60, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @groupfile)
!119 = !DIGlobalVariable(name: "alarm_type", scope: !0, file: !38, line: 72, type: !41, isLocal: false, isDefinition: true, variable: i32* @alarm_type)
!120 = !DIGlobalVariable(name: "configpath", scope: !0, file: !38, line: 77, type: !35, isLocal: false, isDefinition: true, variable: i8** @configpath)
!121 = !DIGlobalVariable(name: "daemonmode", scope: !0, file: !38, line: 78, type: !41, isLocal: false, isDefinition: true, variable: i32* @daemonmode)
!122 = !DIGlobalVariable(name: "he", scope: !53, file: !38, line: 199, type: !123, isLocal: true, isDefinition: true, variable: %struct.hostent** @main.he)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !125, line: 100, size: 256, align: 64, elements: !126)
!125 = !DIFile(filename: "/usr/include/netdb.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !124, file: !125, line: 102, baseType: !35, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !124, file: !125, line: 103, baseType: !56, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !124, file: !125, line: 104, baseType: !41, size: 32, align: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !124, file: !125, line: 105, baseType: !41, size: 32, align: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !124, file: !125, line: 106, baseType: !56, size: 64, align: 64, offset: 192)
!132 = !DIGlobalVariable(name: "pre_write_script", scope: !0, file: !133, line: 29, type: !35, isLocal: false, isDefinition: true, variable: i8** @pre_write_script)
!133 = !DIFile(filename: "./main.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!134 = !DIGlobalVariable(name: "post_write_script", scope: !0, file: !133, line: 30, type: !35, isLocal: false, isDefinition: true, variable: i8** @post_write_script)
!135 = !DIGlobalVariable(name: "global_argc", scope: !0, file: !38, line: 62, type: !41, isLocal: false, isDefinition: true, variable: i32* @global_argc)
!136 = !DIGlobalVariable(name: "global_argv", scope: !0, file: !38, line: 63, type: !56, isLocal: false, isDefinition: true, variable: i8*** @global_argv)
!137 = !DIGlobalVariable(name: "my_argv_list", scope: !0, file: !38, line: 64, type: !56, isLocal: false, isDefinition: true, variable: i8*** @my_argv_list)
!138 = !DIGlobalVariable(name: "name", scope: !0, file: !38, line: 65, type: !139, isLocal: false, isDefinition: true, variable: %struct.sockaddr_in* @name)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !18, line: 237, size: 128, align: 32, elements: !140)
!140 = !{!141, !142, !145, !149}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !139, file: !18, line: 239, baseType: !27, size: 16, align: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !139, file: !18, line: 240, baseType: !143, size: 16, align: 16, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !18, line: 117, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 49, baseType: !29)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !139, file: !18, line: 241, baseType: !146, size: 32, align: 32, offset: 32)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !18, line: 31, size: 32, align: 32, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !146, file: !18, line: 33, baseType: !17, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !139, file: !18, line: 244, baseType: !150, size: 64, align: 8, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, align: 8, elements: !152)
!151 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!152 = !{!153}
!153 = !DISubrange(count: 8)
!154 = !DIGlobalVariable(name: "listensocket", scope: !0, file: !38, line: 67, type: !41, isLocal: false, isDefinition: true, variable: i32* @listensocket)
!155 = !DIGlobalVariable(name: "sock", scope: !0, file: !38, line: 67, type: !41, isLocal: false, isDefinition: true, variable: i32* @sock)
!156 = !DIGlobalVariable(name: "devnull", scope: !0, file: !38, line: 68, type: !60, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @devnull)
!157 = !DIGlobalVariable(name: "remotename", scope: !0, file: !38, line: 69, type: !139, isLocal: false, isDefinition: true, variable: %struct.sockaddr_in* @remotename)
!158 = !DIGlobalVariable(name: "remotehostname", scope: !0, file: !38, line: 70, type: !35, isLocal: false, isDefinition: true, variable: i8** @remotehostname)
!159 = !DIGlobalVariable(name: "control_timeout", scope: !0, file: !38, line: 71, type: !41, isLocal: false, isDefinition: true, variable: i32* @control_timeout)
!160 = !DIGlobalVariable(name: "data_timeout", scope: !0, file: !38, line: 71, type: !41, isLocal: false, isDefinition: true, variable: i32* @data_timeout)
!161 = !DIGlobalVariable(name: "child_list", scope: !0, file: !38, line: 74, type: !162, isLocal: false, isDefinition: true, variable: %struct.bftpd_list_element** @child_list)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "bftpd_list_element", file: !164, line: 6, size: 128, align: 64, elements: !165)
!164 = !DIFile(filename: "./list.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 7, baseType: !16, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !164, line: 8, baseType: !162, size: 64, align: 64, offset: 64)
!168 = !{i32 2, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!171 = !DILocalVariable(name: "number", arg: 1, scope: !37, file: !38, line: 80, type: !41)
!172 = !DIExpression()
!173 = !DILocation(line: 80, column: 21, scope: !37)
!174 = !DILocalVariable(name: "filename", arg: 2, scope: !37, file: !38, line: 80, type: !35)
!175 = !DILocation(line: 80, column: 35, scope: !37)
!176 = !DILocalVariable(name: "phile", scope: !37, file: !38, line: 82, type: !60)
!177 = !DILocation(line: 82, column: 8, scope: !37)
!178 = !DILocalVariable(name: "foo", scope: !37, file: !38, line: 83, type: !179)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 4096, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 512)
!182 = !DILocation(line: 83, column: 7, scope: !37)
!183 = !DILocation(line: 84, column: 16, scope: !37)
!184 = !DILocation(line: 84, column: 10, scope: !37)
!185 = !DILocation(line: 84, column: 8, scope: !37)
!186 = !DILocation(line: 85, column: 6, scope: !187)
!187 = distinct !DILexicalBlock(scope: !37, file: !38, line: 85, column: 6)
!188 = !DILocation(line: 85, column: 6, scope: !37)
!189 = !DILocation(line: 86, column: 3, scope: !190)
!190 = distinct !DILexicalBlock(scope: !187, file: !38, line: 85, column: 13)
!191 = !DILocation(line: 86, column: 16, scope: !192)
!192 = !DILexicalBlockFile(scope: !190, file: !38, discriminator: 1)
!193 = !DILocation(line: 86, column: 40, scope: !192)
!194 = !DILocation(line: 86, column: 10, scope: !192)
!195 = !DILocation(line: 86, column: 3, scope: !192)
!196 = !DILocation(line: 87, column: 15, scope: !197)
!197 = distinct !DILexicalBlock(scope: !190, file: !38, line: 86, column: 48)
!198 = !DILocation(line: 87, column: 8, scope: !197)
!199 = !DILocation(line: 87, column: 20, scope: !197)
!200 = !DILocation(line: 87, column: 4, scope: !197)
!201 = !DILocation(line: 87, column: 25, scope: !197)
!202 = !DILocation(line: 88, column: 40, scope: !197)
!203 = !DILocation(line: 88, column: 48, scope: !197)
!204 = !DILocation(line: 88, column: 4, scope: !197)
!205 = !DILocation(line: 86, column: 3, scope: !206)
!206 = !DILexicalBlockFile(scope: !190, file: !38, discriminator: 2)
!207 = !DILocation(line: 90, column: 10, scope: !190)
!208 = !DILocation(line: 90, column: 3, scope: !190)
!209 = !DILocation(line: 91, column: 2, scope: !190)
!210 = !DILocation(line: 92, column: 1, scope: !37)
!211 = !DILocation(line: 96, column: 5, scope: !43)
!212 = !DILocation(line: 97, column: 6, scope: !213)
!213 = distinct !DILexicalBlock(scope: !43, file: !38, line: 97, column: 6)
!214 = !DILocation(line: 97, column: 6, scope: !43)
!215 = !DILocation(line: 98, column: 10, scope: !213)
!216 = !DILocation(line: 98, column: 3, scope: !213)
!217 = !DILocation(line: 99, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !43, file: !38, line: 99, column: 6)
!219 = !DILocation(line: 99, column: 6, scope: !43)
!220 = !DILocation(line: 100, column: 10, scope: !218)
!221 = !DILocation(line: 100, column: 3, scope: !218)
!222 = !DILocation(line: 101, column: 2, scope: !43)
!223 = !DILocation(line: 102, column: 2, scope: !43)
!224 = !DILocation(line: 103, column: 5, scope: !43)
!225 = !DILocation(line: 104, column: 5, scope: !43)
!226 = !DILocation(line: 105, column: 2, scope: !43)
!227 = !DILocation(line: 106, column: 2, scope: !43)
!228 = !DILocation(line: 107, column: 2, scope: !43)
!229 = !DILocation(line: 108, column: 6, scope: !230)
!230 = distinct !DILexicalBlock(scope: !43, file: !38, line: 108, column: 6)
!231 = !DILocation(line: 108, column: 6, scope: !43)
!232 = !DILocation(line: 109, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !230, file: !38, line: 108, column: 18)
!234 = !DILocation(line: 109, column: 3, scope: !233)
!235 = !DILocation(line: 110, column: 3, scope: !233)
!236 = !DILocation(line: 111, column: 3, scope: !233)
!237 = !DILocation(line: 112, column: 3, scope: !233)
!238 = !DILocation(line: 113, column: 2, scope: !233)
!239 = !DILocation(line: 114, column: 1, scope: !43)
!240 = !DILocalVariable(name: "sig", arg: 1, scope: !46, file: !38, line: 124, type: !41)
!241 = !DILocation(line: 124, column: 25, scope: !46)
!242 = !DILocation(line: 126, column: 4, scope: !46)
!243 = !DILocation(line: 127, column: 4, scope: !46)
!244 = !DILocation(line: 128, column: 11, scope: !46)
!245 = !DILocation(line: 128, column: 4, scope: !46)
!246 = !DILocation(line: 129, column: 1, scope: !46)
!247 = !DILocalVariable(name: "sig", arg: 1, scope: !49, file: !38, line: 134, type: !41)
!248 = !DILocation(line: 134, column: 26, scope: !49)
!249 = !DILocalVariable(name: "pid", scope: !49, file: !38, line: 136, type: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !251, line: 98, baseType: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !91, line: 133, baseType: !41)
!253 = !DILocation(line: 136, column: 8, scope: !49)
!254 = !DILocalVariable(name: "i", scope: !49, file: !38, line: 137, type: !41)
!255 = !DILocation(line: 137, column: 6, scope: !49)
!256 = !DILocalVariable(name: "childpid", scope: !49, file: !38, line: 138, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "bftpd_childpid", file: !133, line: 10, size: 64, align: 32, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !258, file: !133, line: 11, baseType: !250, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !258, file: !133, line: 12, baseType: !41, size: 32, align: 32, offset: 32)
!262 = !DILocation(line: 138, column: 25, scope: !49)
!263 = !DILocation(line: 142, column: 15, scope: !49)
!264 = !DILocation(line: 142, column: 13, scope: !49)
!265 = !DILocation(line: 143, column: 9, scope: !49)
!266 = !DILocation(line: 143, column: 16, scope: !267)
!267 = !DILexicalBlockFile(scope: !49, file: !38, discriminator: 1)
!268 = !DILocation(line: 143, column: 20, scope: !267)
!269 = !DILocation(line: 143, column: 9, scope: !267)
!270 = !DILocation(line: 145, column: 14, scope: !271)
!271 = distinct !DILexicalBlock(scope: !272, file: !38, line: 145, column: 7)
!272 = distinct !DILexicalBlock(scope: !49, file: !38, line: 144, column: 9)
!273 = !DILocation(line: 145, column: 12, scope: !271)
!274 = !DILocation(line: 145, column: 19, scope: !275)
!275 = !DILexicalBlockFile(scope: !276, file: !38, discriminator: 1)
!276 = distinct !DILexicalBlock(scope: !271, file: !38, line: 145, column: 7)
!277 = !DILocation(line: 145, column: 40, scope: !275)
!278 = !DILocation(line: 145, column: 23, scope: !275)
!279 = !DILocation(line: 145, column: 21, scope: !275)
!280 = !DILocation(line: 145, column: 7, scope: !275)
!281 = !DILocation(line: 146, column: 29, scope: !282)
!282 = distinct !DILexicalBlock(scope: !276, file: !38, line: 145, column: 58)
!283 = !DILocation(line: 146, column: 41, scope: !282)
!284 = !DILocation(line: 146, column: 14, scope: !282)
!285 = !DILocation(line: 146, column: 12, scope: !282)
!286 = !DILocation(line: 147, column: 9, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !38, line: 147, column: 8)
!288 = !DILocation(line: 147, column: 8, scope: !287)
!289 = !DILocation(line: 147, column: 19, scope: !287)
!290 = !DILocation(line: 147, column: 23, scope: !291)
!291 = !DILexicalBlockFile(scope: !287, file: !38, discriminator: 1)
!292 = !DILocation(line: 147, column: 33, scope: !291)
!293 = !DILocation(line: 147, column: 40, scope: !291)
!294 = !DILocation(line: 147, column: 37, scope: !291)
!295 = !DILocation(line: 147, column: 8, scope: !291)
!296 = !DILocation(line: 148, column: 10, scope: !297)
!297 = distinct !DILexicalBlock(scope: !287, file: !38, line: 147, column: 47)
!298 = !DILocation(line: 148, column: 20, scope: !297)
!299 = !DILocation(line: 148, column: 4, scope: !297)
!300 = !DILocation(line: 149, column: 32, scope: !297)
!301 = !DILocation(line: 149, column: 4, scope: !297)
!302 = !DILocation(line: 150, column: 9, scope: !297)
!303 = !DILocation(line: 150, column: 4, scope: !297)
!304 = !DILocation(line: 152, column: 46, scope: !297)
!305 = !DILocation(line: 152, column: 25, scope: !297)
!306 = !DILocation(line: 153, column: 3, scope: !297)
!307 = !DILocation(line: 154, column: 7, scope: !282)
!308 = !DILocation(line: 145, column: 54, scope: !309)
!309 = !DILexicalBlockFile(scope: !276, file: !38, discriminator: 2)
!310 = !DILocation(line: 145, column: 7, scope: !309)
!311 = !DILocation(line: 155, column: 20, scope: !272)
!312 = !DILocation(line: 155, column: 18, scope: !272)
!313 = !DILocation(line: 143, column: 9, scope: !314)
!314 = !DILexicalBlockFile(scope: !49, file: !38, discriminator: 2)
!315 = !DILocation(line: 157, column: 1, scope: !49)
!316 = !DILocalVariable(name: "signum", arg: 1, scope: !50, file: !38, line: 159, type: !41)
!317 = !DILocation(line: 159, column: 26, scope: !50)
!318 = !DILocation(line: 161, column: 9, scope: !50)
!319 = !DILocation(line: 162, column: 2, scope: !50)
!320 = !DILocation(line: 163, column: 1, scope: !50)
!321 = !DILocalVariable(name: "signum", arg: 1, scope: !51, file: !38, line: 165, type: !41)
!322 = !DILocation(line: 165, column: 26, scope: !51)
!323 = !DILocation(line: 168, column: 5, scope: !51)
!324 = !DILocation(line: 171, column: 9, scope: !325)
!325 = distinct !DILexicalBlock(scope: !51, file: !38, line: 171, column: 9)
!326 = !DILocation(line: 171, column: 9, scope: !51)
