; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/options.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.group_of_users = type { %struct.list_of_struct_passwd*, %struct.list_of_struct_group*, i8*, %struct.bftpd_option*, %struct.directory*, %struct.group_of_users* }
%struct.list_of_struct_passwd = type { %struct.passwd, %struct.list_of_struct_passwd* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.list_of_struct_group = type { %struct.group, %struct.list_of_struct_group* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.bftpd_option = type { i8*, i8*, %struct.bftpd_option* }
%struct.directory = type { i8*, %struct.bftpd_option*, %struct.directory* }
%struct.global = type { %struct.bftpd_option*, %struct.directory* }
%struct.user = type { i8*, %struct.bftpd_option*, %struct.directory*, %struct.user* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@config_read_line.str = internal global [512 x i8] zeroinitializer, align 16
@.str = private unnamed_addr constant [10 x i8] c"directory\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !152)
!1 = !DIFile(filename: "options.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !{!7, !72, !90, !93, !94, !97, !100, !143, !146, !147, !148, !149, !150, !151}
!7 = distinct !DISubprogram(name: "config_read_line", scope: !8, file: !8, line: 23, type: !9, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!8 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd/options.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!9 = !DISubroutineType(types: !10)
!10 = !{!4, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !15, line: 245, size: 1728, align: 64, elements: !16)
!15 = !DIFile(filename: "/usr/include/libio.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!16 = !{!17, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !60, !61, !62, !63, !67, !68}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !15, line: 246, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !14, file: !15, line: 251, baseType: !4, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !14, file: !15, line: 252, baseType: !4, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !14, file: !15, line: 253, baseType: !4, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !14, file: !15, line: 254, baseType: !4, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !14, file: !15, line: 255, baseType: !4, size: 64, align: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !14, file: !15, line: 256, baseType: !4, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !14, file: !15, line: 257, baseType: !4, size: 64, align: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !14, file: !15, line: 258, baseType: !4, size: 64, align: 64, offset: 512)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !14, file: !15, line: 260, baseType: !4, size: 64, align: 64, offset: 576)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !14, file: !15, line: 261, baseType: !4, size: 64, align: 64, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !14, file: !15, line: 262, baseType: !4, size: 64, align: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !14, file: !15, line: 264, baseType: !31, size: 64, align: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !15, line: 160, size: 192, align: 64, elements: !33)
!33 = !{!34, !35, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !32, file: !15, line: 161, baseType: !31, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !32, file: !15, line: 162, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !32, file: !15, line: 166, baseType: !18, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !14, file: !15, line: 266, baseType: !36, size: 64, align: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !14, file: !15, line: 268, baseType: !18, size: 32, align: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !14, file: !15, line: 272, baseType: !18, size: 32, align: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !14, file: !15, line: 274, baseType: !42, size: 64, align: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 131, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !14, file: !15, line: 278, baseType: !46, size: 16, align: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !14, file: !15, line: 279, baseType: !48, size: 8, align: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !14, file: !15, line: 280, baseType: !50, size: 8, align: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, align: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !14, file: !15, line: 284, baseType: !54, size: 64, align: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !15, line: 154, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !15, line: 293, baseType: !57, size: 64, align: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 132, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !14, file: !15, line: 302, baseType: !59, size: 64, align: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !14, file: !15, line: 303, baseType: !59, size: 64, align: 64, offset: 1280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !14, file: !15, line: 304, baseType: !59, size: 64, align: 64, offset: 1344)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !14, file: !15, line: 305, baseType: !59, size: 64, align: 64, offset: 1408)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !14, file: !15, line: 306, baseType: !64, size: 64, align: 64, offset: 1472)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 62, baseType: !66)
!65 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!66 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !14, file: !15, line: 308, baseType: !18, size: 32, align: 32, offset: 1536)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !14, file: !15, line: 310, baseType: !69, size: 160, align: 8, offset: 1568)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 20)
!72 = distinct !DISubprogram(name: "create_options", scope: !8, file: !8, line: 44, type: !73, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !11, !75, !83}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "bftpd_option", file: !78, line: 21, size: 192, align: 64, elements: !79)
!78 = !DIFile(filename: "./options.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !78, line: 22, baseType: !4, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !77, file: !78, line: 22, baseType: !4, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !78, line: 23, baseType: !76, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "directory", file: !78, line: 34, size: 192, align: 64, elements: !86)
!86 = !{!87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !85, file: !78, line: 35, baseType: !4, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !85, file: !78, line: 36, baseType: !76, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !78, line: 37, baseType: !84, size: 64, align: 64, offset: 128)
!90 = distinct !DISubprogram(name: "expand_groups", scope: !8, file: !8, line: 99, type: !91, isLocal: false, isDefinition: true, scopeLine: 100, isOptimized: false, variables: !2)
!91 = !DISubroutineType(types: !92)
!92 = !{null}
!93 = distinct !DISubprogram(name: "config_init", scope: !8, file: !8, line: 163, type: !91, isLocal: false, isDefinition: true, scopeLine: 164, isOptimized: false, variables: !2)
!94 = distinct !DISubprogram(name: "getoption", scope: !8, file: !8, line: 233, type: !95, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!95 = !DISubroutineType(types: !96)
!96 = !{!4, !76, !4}
!97 = distinct !DISubprogram(name: "getoption_directories", scope: !8, file: !8, line: 251, type: !98, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!98 = !DISubroutineType(types: !99)
!99 = !{!4, !84, !4}
!100 = distinct !DISubprogram(name: "user_is_in_group", scope: !8, file: !8, line: 283, type: !101, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!101 = !DISubroutineType(types: !102)
!102 = !{!5, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "group_of_users", file: !78, line: 43, size: 384, align: 64, elements: !105)
!105 = !{!106, !125, !139, !140, !141, !142}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !104, file: !78, line: 44, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "list_of_struct_passwd", file: !78, line: 25, size: 448, align: 64, elements: !109)
!109 = !{!110, !124}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !108, file: !78, line: 26, baseType: !111, size: 384, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !112, line: 49, size: 384, align: 64, elements: !113)
!112 = !DIFile(filename: "/usr/include/pwd.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!113 = !{!114, !115, !116, !119, !121, !122, !123}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !111, file: !112, line: 51, baseType: !4, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !111, file: !112, line: 52, baseType: !4, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !111, file: !112, line: 53, baseType: !117, size: 32, align: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !43, line: 125, baseType: !118)
!118 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !111, file: !112, line: 54, baseType: !120, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !43, line: 126, baseType: !118)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !111, file: !112, line: 55, baseType: !4, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !111, file: !112, line: 56, baseType: !4, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !111, file: !112, line: 57, baseType: !4, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !78, line: 27, baseType: !107, size: 64, align: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !104, file: !78, line: 45, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "list_of_struct_group", file: !78, line: 29, size: 320, align: 64, elements: !128)
!128 = !{!129, !138}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !127, file: !78, line: 30, baseType: !130, size: 256, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !131, line: 42, size: 256, align: 64, elements: !132)
!131 = !DIFile(filename: "/usr/include/grp.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !130, file: !131, line: 44, baseType: !4, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !130, file: !131, line: 45, baseType: !4, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !130, file: !131, line: 46, baseType: !120, size: 32, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !130, file: !131, line: 47, baseType: !137, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !78, line: 31, baseType: !126, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "temp_members", scope: !104, file: !78, line: 46, baseType: !4, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !104, file: !78, line: 47, baseType: !76, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "directories", scope: !104, file: !78, line: 48, baseType: !84, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !78, line: 49, baseType: !103, size: 64, align: 64, offset: 320)
!143 = distinct !DISubprogram(name: "getoption_group", scope: !8, file: !8, line: 308, type: !144, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!144 = !DISubroutineType(types: !145)
!145 = !{!4, !4}
!146 = distinct !DISubprogram(name: "getoption_user", scope: !8, file: !8, line: 325, type: !144, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!147 = distinct !DISubprogram(name: "getoption_global", scope: !8, file: !8, line: 342, type: !144, isLocal: false, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!148 = distinct !DISubprogram(name: "config_getoption", scope: !8, file: !8, line: 356, type: !144, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!149 = distinct !DISubprogram(name: "config_end", scope: !8, file: !8, line: 372, type: !91, isLocal: false, isDefinition: true, scopeLine: 373, isOptimized: false, variables: !2)
!150 = distinct !DISubprogram(name: "config_getoption_reread", scope: !8, file: !8, line: 389, type: !144, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!151 = distinct !DISubprogram(name: "Reread_Config_File", scope: !8, file: !8, line: 409, type: !91, isLocal: false, isDefinition: true, scopeLine: 410, isOptimized: false, variables: !2)
!152 = !{!153, !157, !158, !159, !161, !162, !163, !164, !169, !170}
!153 = !DIGlobalVariable(name: "str", scope: !7, file: !8, line: 25, type: !154, isLocal: true, isDefinition: true, variable: [512 x i8]* @config_read_line.str)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 4096, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 512)
!157 = !DIGlobalVariable(name: "empty", scope: !148, file: !8, line: 358, type: !5, isLocal: true, isDefinition: true, variable: i8* @config_getoption.empty)
!158 = !DIGlobalVariable(name: "empty_string", scope: !150, file: !8, line: 392, type: !5, isLocal: true, isDefinition: true, variable: i8* @config_getoption_reread.empty_string)
!159 = !DIGlobalVariable(name: "configpath", scope: !0, file: !160, line: 25, type: !4, isLocal: false, isDefinition: true, variable: i8** @configpath)
!160 = !DIFile(filename: "./main.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/bftpd/bftpd")
!161 = !DIGlobalVariable(name: "daemonmode", scope: !0, file: !160, line: 26, type: !18, isLocal: false, isDefinition: true, variable: i32* @daemonmode)
!162 = !DIGlobalVariable(name: "pre_write_script", scope: !0, file: !160, line: 29, type: !4, isLocal: false, isDefinition: true, variable: i8** @pre_write_script)
!163 = !DIGlobalVariable(name: "post_write_script", scope: !0, file: !160, line: 30, type: !4, isLocal: false, isDefinition: true, variable: i8** @post_write_script)
!164 = !DIGlobalVariable(name: "config_global", scope: !0, file: !8, line: 14, type: !165, isLocal: false, isDefinition: true, variable: %struct.global* @config_global)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "global", file: !78, line: 39, size: 128, align: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !165, file: !78, line: 40, baseType: !76, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "directories", scope: !165, file: !78, line: 41, baseType: !84, size: 64, align: 64, offset: 64)
!169 = !DIGlobalVariable(name: "config_groups", scope: !0, file: !8, line: 15, type: !103, isLocal: false, isDefinition: true, variable: %struct.group_of_users** @config_groups)
!170 = !DIGlobalVariable(name: "config_users", scope: !0, file: !8, line: 16, type: !171, isLocal: false, isDefinition: true, variable: %struct.user** @config_users)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "user", file: !78, line: 51, size: 256, align: 64, elements: !173)
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !78, line: 52, baseType: !4, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !172, file: !78, line: 53, baseType: !76, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "directories", scope: !172, file: !78, line: 54, baseType: !84, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !78, line: 55, baseType: !171, size: 64, align: 64, offset: 192)
!178 = !{i32 2, !"Dwarf Version", i32 4}
!179 = !{i32 2, !"Debug Info Version", i32 3}
!180 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!181 = !DILocalVariable(name: "configfile", arg: 1, scope: !7, file: !8, line: 23, type: !11)
!182 = !DIExpression()
!183 = !DILocation(line: 23, column: 30, scope: !7)
!184 = !DILocalVariable(name: "s", scope: !7, file: !8, line: 26, type: !4)
!185 = !DILocation(line: 26, column: 8, scope: !7)
!186 = !DILocation(line: 27, column: 31, scope: !187)
!187 = distinct !DILexicalBlock(scope: !7, file: !8, line: 27, column: 6)
!188 = !DILocation(line: 27, column: 7, scope: !187)
!189 = !DILocation(line: 27, column: 6, scope: !7)
!190 = !DILocation(line: 28, column: 3, scope: !187)
!191 = !DILocation(line: 29, column: 2, scope: !7)
!192 = !DILocation(line: 29, column: 17, scope: !193)
!193 = !DILexicalBlockFile(scope: !7, file: !8, discriminator: 1)
!194 = !DILocation(line: 29, column: 10, scope: !193)
!195 = !DILocation(line: 29, column: 34, scope: !193)
!196 = !DILocation(line: 29, column: 27, scope: !197)
!197 = !DILexicalBlockFile(scope: !193, file: !8, discriminator: 5)
!198 = !DILocation(line: 29, column: 25, scope: !193)
!199 = !DILocation(line: 29, column: 43, scope: !193)
!200 = !DILocation(line: 29, column: 53, scope: !201)
!201 = !DILexicalBlockFile(scope: !7, file: !8, discriminator: 2)
!202 = !DILocation(line: 29, column: 46, scope: !201)
!203 = !DILocation(line: 29, column: 43, scope: !201)
!204 = !DILocation(line: 29, column: 2, scope: !205)
!205 = !DILexicalBlockFile(scope: !7, file: !8, discriminator: 3)
!206 = !DILocation(line: 30, column: 21, scope: !207)
!207 = distinct !DILexicalBlock(scope: !7, file: !8, line: 29, column: 62)
!208 = !DILocation(line: 30, column: 14, scope: !207)
!209 = !DILocation(line: 30, column: 29, scope: !207)
!210 = !DILocation(line: 30, column: 7, scope: !211)
!211 = !DILexicalBlockFile(scope: !207, file: !8, discriminator: 1)
!212 = !DILocation(line: 30, column: 5, scope: !207)
!213 = !DILocation(line: 31, column: 8, scope: !214)
!214 = distinct !DILexicalBlock(scope: !207, file: !8, line: 31, column: 7)
!215 = !DILocation(line: 31, column: 7, scope: !207)
!216 = !DILocation(line: 32, column: 11, scope: !217)
!217 = distinct !DILexicalBlock(scope: !214, file: !8, line: 31, column: 11)
!218 = !DILocation(line: 33, column: 4, scope: !217)
!219 = !DILocation(line: 29, column: 2, scope: !220)
!220 = !DILexicalBlockFile(scope: !7, file: !8, discriminator: 4)
!221 = !DILocation(line: 36, column: 13, scope: !222)
!222 = distinct !DILexicalBlock(scope: !7, file: !8, line: 36, column: 6)
!223 = !DILocation(line: 36, column: 6, scope: !222)
!224 = !DILocation(line: 36, column: 6, scope: !7)
!225 = !DILocation(line: 37, column: 11, scope: !222)
!226 = !DILocation(line: 37, column: 4, scope: !222)
!227 = !DILocation(line: 37, column: 19, scope: !222)
!228 = !DILocation(line: 37, column: 3, scope: !222)
!229 = !DILocation(line: 38, column: 4, scope: !7)
!230 = !DILocation(line: 39, column: 2, scope: !7)
!231 = !DILocation(line: 39, column: 10, scope: !193)
!232 = !DILocation(line: 39, column: 15, scope: !193)
!233 = !DILocation(line: 39, column: 23, scope: !193)
!234 = !DILocation(line: 39, column: 27, scope: !201)
!235 = !DILocation(line: 39, column: 32, scope: !201)
!236 = !DILocation(line: 39, column: 23, scope: !201)
!237 = !DILocation(line: 39, column: 2, scope: !205)
!238 = !DILocation(line: 40, column: 4, scope: !7)
!239 = !DILocation(line: 39, column: 2, scope: !220)
!240 = !DILocation(line: 41, column: 9, scope: !7)
!241 = !DILocation(line: 41, column: 2, scope: !7)
!242 = !DILocation(line: 42, column: 1, scope: !7)
!243 = !DILocalVariable(name: "configfile", arg: 1, scope: !72, file: !8, line: 44, type: !11)
!244 = !DILocation(line: 44, column: 27, scope: !72)
