; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmlparse.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.XML_Feature = type { i32, i8*, i64 }

!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 20, size: 32, align: 32, elements: !98)
!97 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmlrole.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!99 = !DIEnumerator(name: "XML_ROLE_ERROR", value: -1)
!100 = !DIEnumerator(name: "XML_ROLE_NONE", value: 0)
!101 = !DIEnumerator(name: "XML_ROLE_XML_DECL", value: 1)
!102 = !DIEnumerator(name: "XML_ROLE_INSTANCE_START", value: 2)
!103 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_NONE", value: 3)
!104 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_NAME", value: 4)
!105 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_SYSTEM_ID", value: 5)
!106 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_PUBLIC_ID", value: 6)
!107 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_INTERNAL_SUBSET", value: 7)
!108 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_CLOSE", value: 8)
!109 = !DIEnumerator(name: "XML_ROLE_GENERAL_ENTITY_NAME", value: 9)
!110 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_NAME", value: 10)
!111 = !DIEnumerator(name: "XML_ROLE_ENTITY_NONE", value: 11)
!112 = !DIEnumerator(name: "XML_ROLE_ENTITY_VALUE", value: 12)
!113 = !DIEnumerator(name: "XML_ROLE_ENTITY_SYSTEM_ID", value: 13)
!114 = !DIEnumerator(name: "XML_ROLE_ENTITY_PUBLIC_ID", value: 14)
!115 = !DIEnumerator(name: "XML_ROLE_ENTITY_COMPLETE", value: 15)
!116 = !DIEnumerator(name: "XML_ROLE_ENTITY_NOTATION_NAME", value: 16)
!117 = !DIEnumerator(name: "XML_ROLE_NOTATION_NONE", value: 17)
!118 = !DIEnumerator(name: "XML_ROLE_NOTATION_NAME", value: 18)
!119 = !DIEnumerator(name: "XML_ROLE_NOTATION_SYSTEM_ID", value: 19)
!120 = !DIEnumerator(name: "XML_ROLE_NOTATION_NO_SYSTEM_ID", value: 20)
!121 = !DIEnumerator(name: "XML_ROLE_NOTATION_PUBLIC_ID", value: 21)
!122 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NAME", value: 22)
!123 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_CDATA", value: 23)
!124 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ID", value: 24)
!125 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREF", value: 25)
!126 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREFS", value: 26)
!127 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITY", value: 27)
!128 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITIES", value: 28)
!129 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKEN", value: 29)
!130 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKENS", value: 30)
!131 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_ENUM_VALUE", value: 31)
!132 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NOTATION_VALUE", value: 32)
!133 = !DIEnumerator(name: "XML_ROLE_ATTLIST_NONE", value: 33)
!134 = !DIEnumerator(name: "XML_ROLE_ATTLIST_ELEMENT_NAME", value: 34)
!135 = !DIEnumerator(name: "XML_ROLE_IMPLIED_ATTRIBUTE_VALUE", value: 35)
!136 = !DIEnumerator(name: "XML_ROLE_REQUIRED_ATTRIBUTE_VALUE", value: 36)
!137 = !DIEnumerator(name: "XML_ROLE_DEFAULT_ATTRIBUTE_VALUE", value: 37)
!138 = !DIEnumerator(name: "XML_ROLE_FIXED_ATTRIBUTE_VALUE", value: 38)
!139 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NONE", value: 39)
!140 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NAME", value: 40)
!141 = !DIEnumerator(name: "XML_ROLE_CONTENT_ANY", value: 41)
!142 = !DIEnumerator(name: "XML_ROLE_CONTENT_EMPTY", value: 42)
!143 = !DIEnumerator(name: "XML_ROLE_CONTENT_PCDATA", value: 43)
!144 = !DIEnumerator(name: "XML_ROLE_GROUP_OPEN", value: 44)
!145 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE", value: 45)
!146 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_REP", value: 46)
!147 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_OPT", value: 47)
!148 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_PLUS", value: 48)
!149 = !DIEnumerator(name: "XML_ROLE_GROUP_CHOICE", value: 49)
!150 = !DIEnumerator(name: "XML_ROLE_GROUP_SEQUENCE", value: 50)
!151 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT", value: 51)
!152 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_REP", value: 52)
!153 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_OPT", value: 53)
!154 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_PLUS", value: 54)
!155 = !DIEnumerator(name: "XML_ROLE_PI", value: 55)
!156 = !DIEnumerator(name: "XML_ROLE_COMMENT", value: 56)
!157 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_REF", value: 57)
!158 = !{!159, !161, !162, !223, !303, !169, !646, !359, !202, !523, !443, !591, !295, !203, !594, !647, !648, !212, !434, !477, !471, !623, !519, !160, !483, !511, !552, !180, !532, !182, !533, !575}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Bool", file: !4, line: 28, baseType: !160)
!160 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Parser", file: !4, line: 25, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "XML_ParserStruct", file: !1, line: 466, size: 7232, align: 64, elements: !165)
!165 = !{!166, !167, !168, !171, !191, !194, !195, !196, !200, !201, !204, !205, !213, !218, !224, !229, !231, !233, !235, !237, !242, !244, !249, !254, !256, !258, !263, !268, !269, !271, !290, !305, !310, !315, !320, !398, !405, !406, !407, !408, !409, !410, !411, !412, !413, !424, !429, !430, !431, !432, !433, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !518, !520, !521, !522, !592, !593, !615, !616, !617, !618, !619, !620, !621, !622, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !645}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "m_userData", scope: !164, file: !1, line: 469, baseType: !161, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "m_handlerArg", scope: !164, file: !1, line: 470, baseType: !161, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_buffer", scope: !164, file: !1, line: 471, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "m_mem", scope: !164, file: !1, line: 472, baseType: !172, size: 192, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Memory_Handling_Suite", file: !4, line: 200, baseType: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 196, size: 192, align: 64, elements: !175)
!175 = !{!176, !183, !187}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fcn", scope: !174, file: !4, line: 197, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!161, !180}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !181, line: 62, baseType: !182)
!181 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!182 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_fcn", scope: !174, file: !4, line: 198, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!161, !161, !180}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "free_fcn", scope: !174, file: !4, line: 199, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !161}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "m_bufferPtr", scope: !164, file: !1, line: 474, baseType: !192, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "m_bufferEnd", scope: !164, file: !1, line: 476, baseType: !169, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "m_bufferLim", scope: !164, file: !1, line: 478, baseType: !192, size: 64, align: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "m_parseEndByteIndex", scope: !164, file: !1, line: 479, baseType: !197, size: 64, align: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Index", file: !198, line: 123, baseType: !199)
!198 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/expat_external.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "m_parseEndPtr", scope: !164, file: !1, line: 480, baseType: !192, size: 64, align: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "m_dataBuf", scope: !164, file: !1, line: 481, baseType: !202, size: 64, align: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Char", file: !198, line: 110, baseType: !170)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "m_dataBufEnd", scope: !164, file: !1, line: 482, baseType: !202, size: 64, align: 64, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "m_startElementHandler", scope: !164, file: !1, line: 483, baseType: !206, size: 64, align: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartElementHandler", file: !4, line: 252, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !161, !210, !212}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "m_endElementHandler", scope: !164, file: !1, line: 484, baseType: !214, size: 64, align: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndElementHandler", file: !4, line: 256, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !161, !210}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "m_characterDataHandler", scope: !164, file: !1, line: 485, baseType: !219, size: 64, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_CharacterDataHandler", file: !4, line: 261, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !161, !210, !223}
!223 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "m_processingInstructionHandler", scope: !164, file: !1, line: 486, baseType: !225, size: 64, align: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ProcessingInstructionHandler", file: !4, line: 266, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !161, !210, !210}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "m_commentHandler", scope: !164, file: !1, line: 487, baseType: !230, size: 64, align: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_CommentHandler", file: !4, line: 272, baseType: !215)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "m_startCdataSectionHandler", scope: !164, file: !1, line: 488, baseType: !232, size: 64, align: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartCdataSectionHandler", file: !4, line: 275, baseType: !188)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "m_endCdataSectionHandler", scope: !164, file: !1, line: 489, baseType: !234, size: 64, align: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndCdataSectionHandler", file: !4, line: 276, baseType: !188)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "m_defaultHandler", scope: !164, file: !1, line: 490, baseType: !236, size: 64, align: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_DefaultHandler", file: !4, line: 291, baseType: !220)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "m_startDoctypeDeclHandler", scope: !164, file: !1, line: 491, baseType: !238, size: 64, align: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartDoctypeDeclHandler", file: !4, line: 298, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !161, !210, !210, !210, !223}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "m_endDoctypeDeclHandler", scope: !164, file: !1, line: 492, baseType: !243, size: 64, align: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndDoctypeDeclHandler", file: !4, line: 309, baseType: !188)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "m_unparsedEntityDeclHandler", scope: !164, file: !1, line: 493, baseType: !245, size: 64, align: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_UnparsedEntityDeclHandler", file: !4, line: 353, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !161, !210, !210, !210, !210, !210}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "m_notationDeclHandler", scope: !164, file: !1, line: 494, baseType: !250, size: 64, align: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_NotationDeclHandler", file: !4, line: 365, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !161, !210, !210, !210, !210}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "m_startNamespaceDeclHandler", scope: !164, file: !1, line: 495, baseType: !255, size: 64, align: 64, offset: 1600)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartNamespaceDeclHandler", file: !4, line: 378, baseType: !226)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "m_endNamespaceDeclHandler", scope: !164, file: !1, line: 496, baseType: !257, size: 64, align: 64, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndNamespaceDeclHandler", file: !4, line: 383, baseType: !215)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "m_notStandaloneHandler", scope: !164, file: !1, line: 497, baseType: !259, size: 64, align: 64, offset: 1728)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_NotStandaloneHandler", file: !4, line: 396, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!223, !161}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "m_externalEntityRefHandler", scope: !164, file: !1, line: 498, baseType: !264, size: 64, align: 64, offset: 1792)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ExternalEntityRefHandler", file: !4, line: 432, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!223, !162, !210, !210, !210, !210}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "m_externalEntityRefHandlerArg", scope: !164, file: !1, line: 499, baseType: !162, size: 64, align: 64, offset: 1856)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "m_skippedEntityHandler", scope: !164, file: !1, line: 500, baseType: !270, size: 64, align: 64, offset: 1920)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_SkippedEntityHandler", file: !4, line: 449, baseType: !220)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingHandler", scope: !164, file: !1, line: 501, baseType: !272, size: 64, align: 64, offset: 1984)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_UnknownEncodingHandler", file: !4, line: 528, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!223, !161, !210, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Encoding", file: !4, line: 511, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 506, size: 8384, align: 64, elements: !279)
!279 = !{!280, !284, !285, !289}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !278, file: !4, line: 507, baseType: !281, size: 8192, align: 32)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 8192, align: 32, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !4, line: 508, baseType: !161, size: 64, align: 64, offset: 8192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !278, file: !4, line: 509, baseType: !286, size: 64, align: 64, offset: 8256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!223, !161, !192}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !278, file: !4, line: 510, baseType: !188, size: 64, align: 64, offset: 8320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "m_elementDeclHandler", scope: !164, file: !1, line: 502, baseType: !291, size: 64, align: 64, offset: 2048)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ElementDeclHandler", file: !4, line: 150, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !161, !210, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Content", file: !4, line: 135, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "XML_cp", file: !4, line: 137, size: 256, align: 64, elements: !298)
!298 = !{!299, !300, !301, !302, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !4, line: 138, baseType: !3, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "quant", scope: !297, file: !4, line: 139, baseType: !12, size: 32, align: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !4, line: 140, baseType: !202, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "numchildren", scope: !297, file: !4, line: 141, baseType: !303, size: 32, align: 32, offset: 128)
!303 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !297, file: !4, line: 142, baseType: !295, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "m_attlistDeclHandler", scope: !164, file: !1, line: 503, baseType: !306, size: 64, align: 64, offset: 2112)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_AttlistDeclHandler", file: !4, line: 166, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !161, !210, !210, !210, !210, !223}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "m_entityDeclHandler", scope: !164, file: !1, line: 504, baseType: !311, size: 64, align: 64, offset: 2176)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EntityDeclHandler", file: !4, line: 329, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !161, !210, !223, !210, !223, !210, !210, !210, !210}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "m_xmlDeclHandler", scope: !164, file: !1, line: 505, baseType: !316, size: 64, align: 64, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_XmlDeclHandler", file: !4, line: 186, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !161, !210, !210, !223}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "m_encoding", scope: !164, file: !1, line: 506, baseType: !321, size: 64, align: 64, offset: 2304)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENCODING", file: !19, line: 126, baseType: !324)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "encoding", file: !19, line: 139, size: 1088, align: 64, elements: !325)
!325 = !{!326, !335, !339, !343, !347, !351, !355, !367, !368, !369, !380, !381, !386, !395, !396, !397}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scanners", scope: !324, file: !19, line: 140, baseType: !327, size: 192, align: 64)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 192, align: 64, elements: !333)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCANNER", file: !19, line: 128, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!223, !321, !192, !192, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!333 = !{!334}
!334 = !DISubrange(count: 3)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "literalScanners", scope: !324, file: !19, line: 141, baseType: !336, size: 128, align: 64, offset: 192)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 128, align: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 2)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sameName", scope: !324, file: !19, line: 142, baseType: !340, size: 64, align: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!223, !321, !192, !192}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nameMatchesAscii", scope: !324, file: !19, line: 145, baseType: !344, size: 64, align: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!223, !321, !192, !192, !192}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !324, file: !19, line: 149, baseType: !348, size: 64, align: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!223, !321, !192}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "skipS", scope: !324, file: !19, line: 150, baseType: !352, size: 64, align: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!192, !321, !192}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "getAtts", scope: !324, file: !19, line: 151, baseType: !356, size: 64, align: 64, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!223, !321, !192, !223, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE", file: !19, line: 123, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 118, size: 256, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !19, line: 119, baseType: !192, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !361, file: !19, line: 120, baseType: !192, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "valueEnd", scope: !361, file: !19, line: 121, baseType: !192, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !361, file: !19, line: 122, baseType: !170, size: 8, align: 8, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "charRefNumber", scope: !324, file: !19, line: 155, baseType: !348, size: 64, align: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "predefinedEntityName", scope: !324, file: !19, line: 156, baseType: !340, size: 64, align: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "updatePosition", scope: !324, file: !19, line: 159, baseType: !370, size: 64, align: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !321, !192, !192, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "POSITION", file: !19, line: 116, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "position", file: !19, line: 112, size: 128, align: 64, elements: !376)
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !375, file: !19, line: 114, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Size", file: !198, line: 124, baseType: !182)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "columnNumber", scope: !375, file: !19, line: 115, baseType: !378, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "isPublicId", scope: !324, file: !19, line: 163, baseType: !329, size: 64, align: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Convert", scope: !324, file: !19, line: 167, baseType: !382, size: 64, align: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!18, !321, !332, !192, !385, !192}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "utf16Convert", scope: !324, file: !19, line: 172, baseType: !387, size: 64, align: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!18, !321, !332, !192, !390, !393}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "minBytesPerChar", scope: !324, file: !19, line: 177, baseType: !223, size: 32, align: 32, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf8", scope: !324, file: !19, line: 178, baseType: !170, size: 8, align: 8, offset: 1056)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf16", scope: !324, file: !19, line: 179, baseType: !170, size: 8, align: 8, offset: 1064)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "m_initEncoding", scope: !164, file: !1, line: 507, baseType: !399, size: 1152, align: 64, offset: 2368)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "INIT_ENCODING", file: !19, line: 270, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 267, size: 1152, align: 64, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "initEnc", scope: !400, file: !19, line: 268, baseType: !323, size: 1088, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "encPtr", scope: !400, file: !19, line: 269, baseType: !404, size: 64, align: 64, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "m_internalEncoding", scope: !164, file: !1, line: 508, baseType: !321, size: 64, align: 64, offset: 3520)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "m_protocolEncodingName", scope: !164, file: !1, line: 509, baseType: !210, size: 64, align: 64, offset: 3584)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "m_ns", scope: !164, file: !1, line: 510, baseType: !159, size: 8, align: 8, offset: 3648)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "m_ns_triplets", scope: !164, file: !1, line: 511, baseType: !159, size: 8, align: 8, offset: 3656)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingMem", scope: !164, file: !1, line: 512, baseType: !161, size: 64, align: 64, offset: 3712)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingData", scope: !164, file: !1, line: 513, baseType: !161, size: 64, align: 64, offset: 3776)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingHandlerData", scope: !164, file: !1, line: 514, baseType: !161, size: 64, align: 64, offset: 3840)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingRelease", scope: !164, file: !1, line: 515, baseType: !188, size: 64, align: 64, offset: 3904)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "m_prologState", scope: !164, file: !1, line: 516, baseType: !414, size: 128, align: 64, offset: 3968)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROLOG_STATE", file: !97, line: 100, baseType: !415)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "prolog_state", file: !97, line: 87, size: 128, align: 64, elements: !416)
!416 = !{!417, !422, !423}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !415, file: !97, line: 88, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!223, !421, !223, !192, !192, !321}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !415, file: !97, line: 93, baseType: !303, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "role_none", scope: !415, file: !97, line: 94, baseType: !223, size: 32, align: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "m_processor", scope: !164, file: !1, line: 517, baseType: !425, size: 64, align: 64, offset: 4096)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Processor", file: !1, line: 307, baseType: !427)
!427 = !DISubroutineType(types: !428)
!428 = !{!24, !162, !192, !192, !332}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "m_errorCode", scope: !164, file: !1, line: 518, baseType: !24, size: 32, align: 32, offset: 4160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "m_eventPtr", scope: !164, file: !1, line: 519, baseType: !192, size: 64, align: 64, offset: 4224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "m_eventEndPtr", scope: !164, file: !1, line: 520, baseType: !192, size: 64, align: 64, offset: 4288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "m_positionPtr", scope: !164, file: !1, line: 521, baseType: !192, size: 64, align: 64, offset: 4352)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "m_openInternalEntities", scope: !164, file: !1, line: 522, baseType: !434, size: 64, align: 64, offset: 4416)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPEN_INTERNAL_ENTITY", file: !1, line: 305, baseType: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "open_internal_entity", file: !1, line: 298, size: 320, align: 64, elements: !437)
!437 = !{!438, !439, !440, !442, !458, !459}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "internalEventPtr", scope: !436, file: !1, line: 299, baseType: !192, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "internalEventEndPtr", scope: !436, file: !1, line: 300, baseType: !192, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !1, line: 301, baseType: !441, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "entity", scope: !436, file: !1, line: 302, baseType: !443, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTITY", file: !1, line: 210, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 198, size: 512, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !1, line: 199, baseType: !210, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "textPtr", scope: !445, file: !1, line: 200, baseType: !210, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "textLen", scope: !445, file: !1, line: 201, baseType: !223, size: 32, align: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "processed", scope: !445, file: !1, line: 202, baseType: !223, size: 32, align: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "systemId", scope: !445, file: !1, line: 203, baseType: !210, size: 64, align: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !445, file: !1, line: 204, baseType: !210, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "publicId", scope: !445, file: !1, line: 205, baseType: !210, size: 64, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "notation", scope: !445, file: !1, line: 206, baseType: !210, size: 64, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !445, file: !1, line: 207, baseType: !159, size: 8, align: 8, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "is_param", scope: !445, file: !1, line: 208, baseType: !159, size: 8, align: 8, offset: 456)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal", scope: !445, file: !1, line: 209, baseType: !159, size: 8, align: 8, offset: 464)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "startTagLevel", scope: !436, file: !1, line: 303, baseType: !223, size: 32, align: 32, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "betweenDecl", scope: !436, file: !1, line: 304, baseType: !159, size: 8, align: 8, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "m_freeInternalEntities", scope: !164, file: !1, line: 523, baseType: !434, size: 64, align: 64, offset: 4480)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "m_defaultExpandInternalEntities", scope: !164, file: !1, line: 524, baseType: !159, size: 8, align: 8, offset: 4544)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "m_tagLevel", scope: !164, file: !1, line: 525, baseType: !223, size: 32, align: 32, offset: 4576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "m_declEntity", scope: !164, file: !1, line: 526, baseType: !443, size: 64, align: 64, offset: 4608)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "m_doctypeName", scope: !164, file: !1, line: 527, baseType: !210, size: 64, align: 64, offset: 4672)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "m_doctypeSysid", scope: !164, file: !1, line: 528, baseType: !210, size: 64, align: 64, offset: 4736)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "m_doctypePubid", scope: !164, file: !1, line: 529, baseType: !210, size: 64, align: 64, offset: 4800)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeType", scope: !164, file: !1, line: 530, baseType: !210, size: 64, align: 64, offset: 4864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "m_declNotationName", scope: !164, file: !1, line: 531, baseType: !210, size: 64, align: 64, offset: 4928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "m_declNotationPublicId", scope: !164, file: !1, line: 532, baseType: !210, size: 64, align: 64, offset: 4992)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "m_declElementType", scope: !164, file: !1, line: 533, baseType: !471, size: 64, align: 64, offset: 5056)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT_TYPE", file: !1, line: 267, baseType: !473)
!473 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 260, size: 320, align: 64, elements: !474)
!474 = !{!475, !476, !504, !508, !509, !510}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !1, line: 261, baseType: !210, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !473, file: !1, line: 262, baseType: !477, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PREFIX", file: !1, line: 164, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "prefix", file: !1, line: 161, size: 128, align: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !1, line: 162, baseType: !210, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !479, file: !1, line: 163, baseType: !483, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "BINDING", file: !1, line: 159, baseType: !485)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "binding", file: !1, line: 151, size: 384, align: 64, elements: !486)
!486 = !{!487, !489, !491, !492, !501, !502, !503}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !485, file: !1, line: 152, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nextTagBinding", scope: !485, file: !1, line: 153, baseType: !490, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prevPrefixBinding", scope: !485, file: !1, line: 154, baseType: !490, size: 64, align: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "attId", scope: !485, file: !1, line: 155, baseType: !493, size: 64, align: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_id", file: !1, line: 241, size: 192, align: 64, elements: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !1, line: 242, baseType: !202, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !495, file: !1, line: 243, baseType: !477, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "maybeTokenized", scope: !495, file: !1, line: 244, baseType: !159, size: 8, align: 8, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "xmlns", scope: !495, file: !1, line: 245, baseType: !159, size: 8, align: 8, offset: 136)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !485, file: !1, line: 156, baseType: !202, size: 64, align: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "uriLen", scope: !485, file: !1, line: 157, baseType: !223, size: 32, align: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uriAlloc", scope: !485, file: !1, line: 158, baseType: !223, size: 32, align: 32, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "idAtt", scope: !473, file: !1, line: 263, baseType: !505, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE_ID", file: !1, line: 246, baseType: !495)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nDefaultAtts", scope: !473, file: !1, line: 264, baseType: !223, size: 32, align: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "allocDefaultAtts", scope: !473, file: !1, line: 265, baseType: !223, size: 32, align: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "defaultAtts", scope: !473, file: !1, line: 266, baseType: !511, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEFAULT_ATTRIBUTE", file: !1, line: 252, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 248, size: 192, align: 64, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !513, file: !1, line: 249, baseType: !505, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "isCdata", scope: !513, file: !1, line: 250, baseType: !159, size: 8, align: 8, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !513, file: !1, line: 251, baseType: !210, size: 64, align: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeId", scope: !164, file: !1, line: 534, baseType: !519, size: 64, align: 64, offset: 5120)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeIsCdata", scope: !164, file: !1, line: 535, baseType: !159, size: 8, align: 8, offset: 5184)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeIsId", scope: !164, file: !1, line: 536, baseType: !159, size: 8, align: 8, offset: 5192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "m_dtd", scope: !164, file: !1, line: 537, baseType: !523, size: 64, align: 64, offset: 5248)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "DTD", file: !1, line: 296, baseType: !525)
!525 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 269, size: 2560, align: 64, elements: !526)
!526 = !{!527, !544, !545, !546, !547, !568, !569, !570, !571, !572, !573, !574, !586, !587, !588, !589, !590}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "generalEntities", scope: !525, file: !1, line: 270, baseType: !528, size: 320, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASH_TABLE", file: !1, line: 110, baseType: !529)
!529 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 104, size: 320, align: 64, elements: !530)
!530 = !{!531, !539, !540, !541, !542}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !529, file: !1, line: 105, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAMED", file: !1, line: 102, baseType: !535)
!535 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 100, size: 64, align: 64, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !1, line: 101, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEY", file: !1, line: 98, baseType: !210)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !529, file: !1, line: 106, baseType: !160, size: 8, align: 8, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !1, line: 107, baseType: !180, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !529, file: !1, line: 108, baseType: !180, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !529, file: !1, line: 109, baseType: !543, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "elementTypes", scope: !525, file: !1, line: 271, baseType: !528, size: 320, align: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "attributeIds", scope: !525, file: !1, line: 272, baseType: !528, size: 320, align: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !525, file: !1, line: 273, baseType: !528, size: 320, align: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !525, file: !1, line: 274, baseType: !548, size: 384, align: 64, offset: 1280)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_POOL", file: !1, line: 237, baseType: !549)
!549 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 230, size: 384, align: 64, elements: !550)
!550 = !{!551, !563, !564, !565, !566, !567}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !549, file: !1, line: 231, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLOCK", file: !1, line: 228, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "block", file: !1, line: 224, size: 128, align: 64, elements: !555)
!555 = !{!556, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !1, line: 225, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !554, file: !1, line: 226, baseType: !223, size: 32, align: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !554, file: !1, line: 227, baseType: !560, size: 8, align: 8, offset: 96)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 8, align: 8, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 1)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "freeBlocks", scope: !549, file: !1, line: 232, baseType: !552, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !549, file: !1, line: 233, baseType: !210, size: 64, align: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !549, file: !1, line: 234, baseType: !202, size: 64, align: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !549, file: !1, line: 235, baseType: !202, size: 64, align: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !549, file: !1, line: 236, baseType: !543, size: 64, align: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "entityValuePool", scope: !525, file: !1, line: 275, baseType: !548, size: 384, align: 64, offset: 1664)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "keepProcessing", scope: !525, file: !1, line: 277, baseType: !159, size: 8, align: 8, offset: 2048)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hasParamEntityRefs", scope: !525, file: !1, line: 280, baseType: !159, size: 8, align: 8, offset: 2056)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !525, file: !1, line: 281, baseType: !159, size: 8, align: 8, offset: 2064)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "defaultPrefix", scope: !525, file: !1, line: 287, baseType: !478, size: 128, align: 64, offset: 2112)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "in_eldecl", scope: !525, file: !1, line: 289, baseType: !159, size: 8, align: 8, offset: 2240)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scaffold", scope: !525, file: !1, line: 290, baseType: !575, size: 64, align: 64, offset: 2304)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONTENT_SCAFFOLD", file: !1, line: 220, baseType: !577)
!577 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 212, size: 256, align: 64, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !1, line: 213, baseType: !3, size: 32, align: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "quant", scope: !577, file: !1, line: 214, baseType: !12, size: 32, align: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !577, file: !1, line: 215, baseType: !210, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "firstchild", scope: !577, file: !1, line: 216, baseType: !223, size: 32, align: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "lastchild", scope: !577, file: !1, line: 217, baseType: !223, size: 32, align: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "childcnt", scope: !577, file: !1, line: 218, baseType: !223, size: 32, align: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nextsib", scope: !577, file: !1, line: 219, baseType: !223, size: 32, align: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "contentStringLen", scope: !525, file: !1, line: 291, baseType: !303, size: 32, align: 32, offset: 2368)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "scaffSize", scope: !525, file: !1, line: 292, baseType: !303, size: 32, align: 32, offset: 2400)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "scaffCount", scope: !525, file: !1, line: 293, baseType: !303, size: 32, align: 32, offset: 2432)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scaffLevel", scope: !525, file: !1, line: 294, baseType: !223, size: 32, align: 32, offset: 2464)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "scaffIndex", scope: !525, file: !1, line: 295, baseType: !591, size: 64, align: 64, offset: 2496)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "m_curBase", scope: !164, file: !1, line: 538, baseType: !210, size: 64, align: 64, offset: 5312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "m_tagStack", scope: !164, file: !1, line: 539, baseType: !594, size: 64, align: 64, offset: 5376)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAG", file: !1, line: 196, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "tag", file: !1, line: 188, size: 704, align: 64, elements: !597)
!597 = !{!598, !600, !601, !602, !612, !613, !614}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !596, file: !1, line: 189, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rawName", scope: !596, file: !1, line: 190, baseType: !192, size: 64, align: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rawNameLength", scope: !596, file: !1, line: 191, baseType: !223, size: 32, align: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !1, line: 192, baseType: !603, size: 320, align: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAG_NAME", file: !1, line: 173, baseType: !604)
!604 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 166, size: 320, align: 64, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !604, file: !1, line: 167, baseType: !210, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "localPart", scope: !604, file: !1, line: 168, baseType: !210, size: 64, align: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !604, file: !1, line: 169, baseType: !210, size: 64, align: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "strLen", scope: !604, file: !1, line: 170, baseType: !223, size: 32, align: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "uriLen", scope: !604, file: !1, line: 171, baseType: !223, size: 32, align: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "prefixLen", scope: !604, file: !1, line: 172, baseType: !223, size: 32, align: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !596, file: !1, line: 193, baseType: !169, size: 64, align: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bufEnd", scope: !596, file: !1, line: 194, baseType: !169, size: 64, align: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bindings", scope: !596, file: !1, line: 195, baseType: !483, size: 64, align: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "m_freeTagList", scope: !164, file: !1, line: 540, baseType: !594, size: 64, align: 64, offset: 5440)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "m_inheritedBindings", scope: !164, file: !1, line: 541, baseType: !483, size: 64, align: 64, offset: 5504)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "m_freeBindingList", scope: !164, file: !1, line: 542, baseType: !483, size: 64, align: 64, offset: 5568)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "m_attsSize", scope: !164, file: !1, line: 543, baseType: !223, size: 32, align: 32, offset: 5632)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "m_nSpecifiedAtts", scope: !164, file: !1, line: 544, baseType: !223, size: 32, align: 32, offset: 5664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "m_idAttIndex", scope: !164, file: !1, line: 545, baseType: !223, size: 32, align: 32, offset: 5696)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "m_atts", scope: !164, file: !1, line: 546, baseType: !359, size: 64, align: 64, offset: 5760)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "m_nsAtts", scope: !164, file: !1, line: 547, baseType: !623, size: 64, align: 64, offset: 5824)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "NS_ATT", file: !1, line: 258, baseType: !625)
!625 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 254, size: 192, align: 64, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !625, file: !1, line: 255, baseType: !182, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !625, file: !1, line: 256, baseType: !182, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uriName", scope: !625, file: !1, line: 257, baseType: !210, size: 64, align: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m_nsAttsVersion", scope: !164, file: !1, line: 548, baseType: !182, size: 64, align: 64, offset: 5888)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "m_nsAttsPower", scope: !164, file: !1, line: 549, baseType: !160, size: 8, align: 8, offset: 5952)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m_position", scope: !164, file: !1, line: 553, baseType: !374, size: 128, align: 64, offset: 6016)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "m_tempPool", scope: !164, file: !1, line: 554, baseType: !548, size: 384, align: 64, offset: 6144)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m_temp2Pool", scope: !164, file: !1, line: 555, baseType: !548, size: 384, align: 64, offset: 6528)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m_groupConnector", scope: !164, file: !1, line: 556, baseType: !169, size: 64, align: 64, offset: 6912)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m_groupSize", scope: !164, file: !1, line: 557, baseType: !303, size: 32, align: 32, offset: 6976)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m_namespaceSeparator", scope: !164, file: !1, line: 558, baseType: !203, size: 8, align: 8, offset: 7008)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m_parentParser", scope: !164, file: !1, line: 559, baseType: !162, size: 64, align: 64, offset: 7040)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m_parsingStatus", scope: !164, file: !1, line: 560, baseType: !640, size: 64, align: 32, offset: 7104)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ParsingStatus", file: !4, line: 845, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 842, size: 64, align: 32, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "parsing", scope: !641, file: !4, line: 843, baseType: !67, size: 32, align: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "finalBuffer", scope: !641, file: !4, line: 844, baseType: !159, size: 8, align: 8, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "m_hash_secret_salt", scope: !164, file: !1, line: 566, baseType: !182, size: 64, align: 64, offset: 7168)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ICHAR", file: !1, line: 51, baseType: !170)
!650 = !{!651, !655, !658, !661, !664, !667, !670, !673, !674, !677, !680, !683, !684, !687, !690, !691, !694, !697, !700, !703, !706, !709, !712, !715, !718, !721, !722, !725, !728, !731, !734, !737, !740, !743, !746, !749, !752, !753, !756, !759, !762, !765, !768, !771, !774, !777, !780, !783, !786, !789, !792, !796, !799, !802, !803, !806, !809, !810, !813, !816, !819, !820, !821, !827, !830, !839, !850, !853, !856, !860, !864, !867, !870, !871, !872, !875, !876, !879, !882, !885, !888, !889, !892, !895, !896, !897, !908, !911, !916, !919, !922, !923, !926, !927, !928, !931, !934, !937, !940, !941, !944, !947, !950, !951, !954, !957, !960, !963, !964, !967, !972, !975, !976, !977, !980, !981, !984, !987, !988, !989, !990, !991, !994, !995, !998, !1001, !1004, !1005, !1010, !1013, !1016, !1019, !1020}
!651 = distinct !DISubprogram(name: "XML_ParserCreate", scope: !1, file: !1, line: 678, type: !652, isLocal: false, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!652 = !DISubroutineType(types: !653)
!653 = !{!162, !210}
!654 = !{}
!655 = distinct !DISubprogram(name: "XML_ParserCreateNS", scope: !1, file: !1, line: 684, type: !656, isLocal: false, isDefinition: true, scopeLine: 685, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!656 = !DISubroutineType(types: !657)
!657 = !{!162, !210, !203}
!658 = distinct !DISubprogram(name: "XML_ParserCreate_MM", scope: !1, file: !1, line: 751, type: !659, isLocal: false, isDefinition: true, scopeLine: 754, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!659 = !DISubroutineType(types: !660)
!660 = !{!162, !210, !543, !210}
!661 = distinct !DISubprogram(name: "XML_ParserReset", scope: !1, file: !1, line: 959, type: !662, isLocal: false, isDefinition: true, scopeLine: 960, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!662 = !DISubroutineType(types: !663)
!663 = !{!159, !162, !210}
!664 = distinct !DISubprogram(name: "XML_SetEncoding", scope: !1, file: !1, line: 995, type: !665, isLocal: false, isDefinition: true, scopeLine: 996, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!665 = !DISubroutineType(types: !666)
!666 = !{!73, !162, !210}
!667 = distinct !DISubprogram(name: "XML_ExternalEntityParserCreate", scope: !1, file: !1, line: 1014, type: !668, isLocal: false, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!668 = !DISubroutineType(types: !669)
!669 = !{!162, !162, !210, !210}
!670 = distinct !DISubprogram(name: "XML_ParserFree", scope: !1, file: !1, line: 1164, type: !671, isLocal: false, isDefinition: true, scopeLine: 1165, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !162}
!673 = distinct !DISubprogram(name: "XML_UseParserAsHandlerArg", scope: !1, file: !1, line: 1229, type: !671, isLocal: false, isDefinition: true, scopeLine: 1230, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!674 = distinct !DISubprogram(name: "XML_UseForeignDTD", scope: !1, file: !1, line: 1235, type: !675, isLocal: false, isDefinition: true, scopeLine: 1236, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!675 = !DISubroutineType(types: !676)
!676 = !{!24, !162, !159}
!677 = distinct !DISubprogram(name: "XML_SetReturnNSTriplet", scope: !1, file: !1, line: 1249, type: !678, isLocal: false, isDefinition: true, scopeLine: 1250, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !162, !223}
!680 = distinct !DISubprogram(name: "XML_SetUserData", scope: !1, file: !1, line: 1258, type: !681, isLocal: false, isDefinition: true, scopeLine: 1259, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !162, !161}
!683 = distinct !DISubprogram(name: "XML_SetBase", scope: !1, file: !1, line: 1267, type: !665, isLocal: false, isDefinition: true, scopeLine: 1268, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!684 = distinct !DISubprogram(name: "XML_GetBase", scope: !1, file: !1, line: 1281, type: !685, isLocal: false, isDefinition: true, scopeLine: 1282, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!685 = !DISubroutineType(types: !686)
!686 = !{!210, !162}
!687 = distinct !DISubprogram(name: "XML_GetSpecifiedAttributeCount", scope: !1, file: !1, line: 1287, type: !688, isLocal: false, isDefinition: true, scopeLine: 1288, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!688 = !DISubroutineType(types: !689)
!689 = !{!223, !162}
!690 = distinct !DISubprogram(name: "XML_GetIdAttributeIndex", scope: !1, file: !1, line: 1293, type: !688, isLocal: false, isDefinition: true, scopeLine: 1294, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!691 = distinct !DISubprogram(name: "XML_SetElementHandler", scope: !1, file: !1, line: 1307, type: !692, isLocal: false, isDefinition: true, scopeLine: 1310, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !162, !206, !214}
!694 = distinct !DISubprogram(name: "XML_SetStartElementHandler", scope: !1, file: !1, line: 1316, type: !695, isLocal: false, isDefinition: true, scopeLine: 1317, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !162, !206}
!697 = distinct !DISubprogram(name: "XML_SetEndElementHandler", scope: !1, file: !1, line: 1322, type: !698, isLocal: false, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !162, !214}
!700 = distinct !DISubprogram(name: "XML_SetCharacterDataHandler", scope: !1, file: !1, line: 1328, type: !701, isLocal: false, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !162, !219}
!703 = distinct !DISubprogram(name: "XML_SetProcessingInstructionHandler", scope: !1, file: !1, line: 1335, type: !704, isLocal: false, isDefinition: true, scopeLine: 1337, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !162, !225}
!706 = distinct !DISubprogram(name: "XML_SetCommentHandler", scope: !1, file: !1, line: 1342, type: !707, isLocal: false, isDefinition: true, scopeLine: 1344, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !162, !230}
!709 = distinct !DISubprogram(name: "XML_SetCdataSectionHandler", scope: !1, file: !1, line: 1349, type: !710, isLocal: false, isDefinition: true, scopeLine: 1352, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !162, !232, !234}
!712 = distinct !DISubprogram(name: "XML_SetStartCdataSectionHandler", scope: !1, file: !1, line: 1358, type: !713, isLocal: false, isDefinition: true, scopeLine: 1359, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !162, !232}
!715 = distinct !DISubprogram(name: "XML_SetEndCdataSectionHandler", scope: !1, file: !1, line: 1364, type: !716, isLocal: false, isDefinition: true, scopeLine: 1365, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !162, !234}
!718 = distinct !DISubprogram(name: "XML_SetDefaultHandler", scope: !1, file: !1, line: 1370, type: !719, isLocal: false, isDefinition: true, scopeLine: 1372, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !162, !236}
!721 = distinct !DISubprogram(name: "XML_SetDefaultHandlerExpand", scope: !1, file: !1, line: 1378, type: !719, isLocal: false, isDefinition: true, scopeLine: 1380, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!722 = distinct !DISubprogram(name: "XML_SetDoctypeDeclHandler", scope: !1, file: !1, line: 1386, type: !723, isLocal: false, isDefinition: true, scopeLine: 1389, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !162, !238, !243}
!725 = distinct !DISubprogram(name: "XML_SetStartDoctypeDeclHandler", scope: !1, file: !1, line: 1395, type: !726, isLocal: false, isDefinition: true, scopeLine: 1396, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !162, !238}
!728 = distinct !DISubprogram(name: "XML_SetEndDoctypeDeclHandler", scope: !1, file: !1, line: 1401, type: !729, isLocal: false, isDefinition: true, scopeLine: 1402, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !162, !243}
!731 = distinct !DISubprogram(name: "XML_SetUnparsedEntityDeclHandler", scope: !1, file: !1, line: 1407, type: !732, isLocal: false, isDefinition: true, scopeLine: 1409, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !162, !245}
!734 = distinct !DISubprogram(name: "XML_SetNotationDeclHandler", scope: !1, file: !1, line: 1414, type: !735, isLocal: false, isDefinition: true, scopeLine: 1416, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !162, !250}
!737 = distinct !DISubprogram(name: "XML_SetNamespaceDeclHandler", scope: !1, file: !1, line: 1421, type: !738, isLocal: false, isDefinition: true, scopeLine: 1424, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !162, !255, !257}
!740 = distinct !DISubprogram(name: "XML_SetStartNamespaceDeclHandler", scope: !1, file: !1, line: 1430, type: !741, isLocal: false, isDefinition: true, scopeLine: 1431, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !162, !255}
!743 = distinct !DISubprogram(name: "XML_SetEndNamespaceDeclHandler", scope: !1, file: !1, line: 1436, type: !744, isLocal: false, isDefinition: true, scopeLine: 1437, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !162, !257}
!746 = distinct !DISubprogram(name: "XML_SetNotStandaloneHandler", scope: !1, file: !1, line: 1442, type: !747, isLocal: false, isDefinition: true, scopeLine: 1444, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !162, !259}
!749 = distinct !DISubprogram(name: "XML_SetExternalEntityRefHandler", scope: !1, file: !1, line: 1449, type: !750, isLocal: false, isDefinition: true, scopeLine: 1451, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !162, !264}
!752 = distinct !DISubprogram(name: "XML_SetExternalEntityRefHandlerArg", scope: !1, file: !1, line: 1456, type: !681, isLocal: false, isDefinition: true, scopeLine: 1457, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!753 = distinct !DISubprogram(name: "XML_SetSkippedEntityHandler", scope: !1, file: !1, line: 1465, type: !754, isLocal: false, isDefinition: true, scopeLine: 1467, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !162, !270}
!756 = distinct !DISubprogram(name: "XML_SetUnknownEncodingHandler", scope: !1, file: !1, line: 1472, type: !757, isLocal: false, isDefinition: true, scopeLine: 1475, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !162, !272, !161}
!759 = distinct !DISubprogram(name: "XML_SetElementDeclHandler", scope: !1, file: !1, line: 1481, type: !760, isLocal: false, isDefinition: true, scopeLine: 1483, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !162, !291}
!762 = distinct !DISubprogram(name: "XML_SetAttlistDeclHandler", scope: !1, file: !1, line: 1488, type: !763, isLocal: false, isDefinition: true, scopeLine: 1490, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !162, !306}
!765 = distinct !DISubprogram(name: "XML_SetEntityDeclHandler", scope: !1, file: !1, line: 1495, type: !766, isLocal: false, isDefinition: true, scopeLine: 1497, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !162, !311}
!768 = distinct !DISubprogram(name: "XML_SetXmlDeclHandler", scope: !1, file: !1, line: 1502, type: !769, isLocal: false, isDefinition: true, scopeLine: 1503, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !162, !316}
!771 = distinct !DISubprogram(name: "XML_SetParamEntityParsing", scope: !1, file: !1, line: 1508, type: !772, isLocal: false, isDefinition: true, scopeLine: 1510, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!772 = !DISubroutineType(types: !773)
!773 = !{!223, !162, !78}
!774 = distinct !DISubprogram(name: "XML_SetHashSalt", scope: !1, file: !1, line: 1523, type: !775, isLocal: false, isDefinition: true, scopeLine: 1525, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!775 = !DISubroutineType(types: !776)
!776 = !{!223, !162, !182}
!777 = distinct !DISubprogram(name: "XML_Parse", scope: !1, file: !1, line: 1534, type: !778, isLocal: false, isDefinition: true, scopeLine: 1535, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!778 = !DISubroutineType(types: !779)
!779 = !{!73, !162, !192, !223, !223}
!780 = distinct !DISubprogram(name: "XML_ParseBuffer", scope: !1, file: !1, line: 1657, type: !781, isLocal: false, isDefinition: true, scopeLine: 1658, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!781 = !DISubroutineType(types: !782)
!782 = !{!73, !162, !223, !223}
!783 = distinct !DISubprogram(name: "XML_GetBuffer", scope: !1, file: !1, line: 1713, type: !784, isLocal: false, isDefinition: true, scopeLine: 1714, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!784 = !DISubroutineType(types: !785)
!785 = !{!161, !162, !223}
!786 = distinct !DISubprogram(name: "XML_StopParser", scope: !1, file: !1, line: 1809, type: !787, isLocal: false, isDefinition: true, scopeLine: 1810, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!787 = !DISubroutineType(types: !788)
!788 = !{!73, !162, !159}
!789 = distinct !DISubprogram(name: "XML_ResumeParser", scope: !1, file: !1, line: 1839, type: !790, isLocal: false, isDefinition: true, scopeLine: 1840, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!790 = !DISubroutineType(types: !791)
!791 = !{!73, !162}
!792 = distinct !DISubprogram(name: "XML_GetParsingStatus", scope: !1, file: !1, line: 1877, type: !793, isLocal: false, isDefinition: true, scopeLine: 1878, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !162, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!796 = distinct !DISubprogram(name: "XML_GetErrorCode", scope: !1, file: !1, line: 1884, type: !797, isLocal: false, isDefinition: true, scopeLine: 1885, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!797 = !DISubroutineType(types: !798)
!798 = !{!24, !162}
!799 = distinct !DISubprogram(name: "XML_GetCurrentByteIndex", scope: !1, file: !1, line: 1890, type: !800, isLocal: false, isDefinition: true, scopeLine: 1891, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!800 = !DISubroutineType(types: !801)
!801 = !{!197, !162}
!802 = distinct !DISubprogram(name: "XML_GetCurrentByteCount", scope: !1, file: !1, line: 1898, type: !688, isLocal: false, isDefinition: true, scopeLine: 1899, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!803 = distinct !DISubprogram(name: "XML_GetInputContext", scope: !1, file: !1, line: 1906, type: !804, isLocal: false, isDefinition: true, scopeLine: 1907, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!804 = !DISubroutineType(types: !805)
!805 = !{!192, !162, !591, !591}
!806 = distinct !DISubprogram(name: "XML_GetCurrentLineNumber", scope: !1, file: !1, line: 1919, type: !807, isLocal: false, isDefinition: true, scopeLine: 1920, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!807 = !DISubroutineType(types: !808)
!808 = !{!378, !162}
!809 = distinct !DISubprogram(name: "XML_GetCurrentColumnNumber", scope: !1, file: !1, line: 1929, type: !807, isLocal: false, isDefinition: true, scopeLine: 1930, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!810 = distinct !DISubprogram(name: "XML_FreeContentModel", scope: !1, file: !1, line: 1939, type: !811, isLocal: false, isDefinition: true, scopeLine: 1940, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !162, !295}
!813 = distinct !DISubprogram(name: "XML_MemMalloc", scope: !1, file: !1, line: 1945, type: !814, isLocal: false, isDefinition: true, scopeLine: 1946, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!814 = !DISubroutineType(types: !815)
!815 = !{!161, !162, !180}
!816 = distinct !DISubprogram(name: "XML_MemRealloc", scope: !1, file: !1, line: 1951, type: !817, isLocal: false, isDefinition: true, scopeLine: 1952, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!817 = !DISubroutineType(types: !818)
!818 = !{!161, !162, !161, !180}
!819 = distinct !DISubprogram(name: "XML_MemFree", scope: !1, file: !1, line: 1957, type: !681, isLocal: false, isDefinition: true, scopeLine: 1958, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!820 = distinct !DISubprogram(name: "XML_DefaultCurrent", scope: !1, file: !1, line: 1963, type: !671, isLocal: false, isDefinition: true, scopeLine: 1964, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!821 = distinct !DISubprogram(name: "XML_ErrorString", scope: !1, file: !1, line: 1977, type: !822, isLocal: false, isDefinition: true, scopeLine: 1978, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!822 = !DISubroutineType(types: !823)
!823 = !{!824, !24}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_LChar", file: !198, line: 111, baseType: !170)
!827 = distinct !DISubprogram(name: "XML_ExpatVersion", scope: !1, file: !1, line: 2028, type: !828, isLocal: false, isDefinition: true, scopeLine: 2028, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!828 = !DISubroutineType(types: !829)
!829 = !{!824}
!830 = distinct !DISubprogram(name: "XML_ExpatVersionInfo", scope: !1, file: !1, line: 2048, type: !831, isLocal: false, isDefinition: true, scopeLine: 2049, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!831 = !DISubroutineType(types: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Expat_Version", file: !4, line: 1003, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 999, size: 96, align: 32, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !834, file: !4, line: 1000, baseType: !223, size: 32, align: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !834, file: !4, line: 1001, baseType: !223, size: 32, align: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "micro", scope: !834, file: !4, line: 1002, baseType: !223, size: 32, align: 32, offset: 64)
!839 = distinct !DISubprogram(name: "XML_GetFeatureList", scope: !1, file: !1, line: 2060, type: !840, isLocal: false, isDefinition: true, scopeLine: 2061, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!840 = !DISubroutineType(types: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Feature", file: !4, line: 1031, baseType: !845)
!845 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1027, size: 192, align: 64, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "feature", scope: !845, file: !4, line: 1028, baseType: !83, size: 32, align: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !4, line: 1029, baseType: !824, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !845, file: !4, line: 1030, baseType: !199, size: 64, align: 64, offset: 128)
!850 = distinct !DISubprogram(name: "parserCreate", scope: !1, file: !1, line: 759, type: !851, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!851 = !DISubroutineType(types: !852)
!852 = !{!162, !210, !543, !210, !523}
!853 = distinct !DISubprogram(name: "dtdCreate", scope: !1, file: !1, line: 5699, type: !854, isLocal: true, isDefinition: true, scopeLine: 5700, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!854 = !DISubroutineType(types: !855)
!855 = !{!523, !543}
!856 = distinct !DISubprogram(name: "hashTableInit", scope: !1, file: !1, line: 6123, type: !857, isLocal: true, isDefinition: true, scopeLine: 6124, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !859, !543}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!860 = distinct !DISubprogram(name: "poolInit", scope: !1, file: !1, line: 6151, type: !861, isLocal: true, isDefinition: true, scopeLine: 6152, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !863, !543}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!864 = distinct !DISubprogram(name: "moveToFreeBindingList", scope: !1, file: !1, line: 948, type: !865, isLocal: true, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !162, !483}
!867 = distinct !DISubprogram(name: "parserInit", scope: !1, file: !1, line: 874, type: !868, isLocal: true, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !162, !210}
!870 = distinct !DISubprogram(name: "prologInitProcessor", scope: !1, file: !1, line: 3598, type: !427, isLocal: true, isDefinition: true, scopeLine: 3602, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!871 = distinct !DISubprogram(name: "initializeEncoding", scope: !1, file: !1, line: 3441, type: !797, isLocal: true, isDefinition: true, scopeLine: 3442, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!872 = distinct !DISubprogram(name: "handleUnknownEncoding", scope: !1, file: !1, line: 3559, type: !873, isLocal: true, isDefinition: true, scopeLine: 3560, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!873 = !DISubroutineType(types: !874)
!874 = !{!24, !162, !210}
!875 = distinct !DISubprogram(name: "prologProcessor", scope: !1, file: !1, line: 3783, type: !427, isLocal: true, isDefinition: true, scopeLine: 3787, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!876 = distinct !DISubprogram(name: "doProlog", scope: !1, file: !1, line: 3795, type: !877, isLocal: true, isDefinition: true, scopeLine: 3803, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!877 = !DISubroutineType(types: !878)
!878 = !{!24, !162, !321, !192, !192, !223, !192, !332, !159}
!879 = distinct !DISubprogram(name: "processXmlDecl", scope: !1, file: !1, line: 3470, type: !880, isLocal: true, isDefinition: true, scopeLine: 3472, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!880 = !DISubroutineType(types: !881)
!881 = !{!24, !162, !223, !192, !192}
!882 = distinct !DISubprogram(name: "poolStoreString", scope: !1, file: !1, line: 6252, type: !883, isLocal: true, isDefinition: true, scopeLine: 6254, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!883 = !DISubroutineType(types: !884)
!884 = !{!202, !863, !321, !192, !192}
!885 = distinct !DISubprogram(name: "normalizePublicId", scope: !1, file: !1, line: 5677, type: !886, isLocal: true, isDefinition: true, scopeLine: 5678, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !202}
!888 = distinct !DISubprogram(name: "contentProcessor", scope: !1, file: !1, line: 2149, type: !427, isLocal: true, isDefinition: true, scopeLine: 2153, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!889 = distinct !DISubprogram(name: "doContent", scope: !1, file: !1, line: 2280, type: !890, isLocal: true, isDefinition: true, scopeLine: 2287, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!890 = !DISubroutineType(types: !891)
!891 = !{!24, !162, !223, !321, !192, !192, !332, !159}
!892 = distinct !DISubprogram(name: "processInternalEntity", scope: !1, file: !1, line: 4846, type: !893, isLocal: true, isDefinition: true, scopeLine: 4848, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!893 = !DISubroutineType(types: !894)
!894 = !{!24, !162, !443, !159}
!895 = distinct !DISubprogram(name: "internalEntityProcessor", scope: !1, file: !1, line: 4903, type: !427, isLocal: true, isDefinition: true, scopeLine: 4907, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!896 = distinct !DISubprogram(name: "getContext", scope: !1, file: !1, line: 5547, type: !685, isLocal: true, isDefinition: true, scopeLine: 5548, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!897 = distinct !DISubprogram(name: "hashTableIterInit", scope: !1, file: !1, line: 6133, type: !898, isLocal: true, isDefinition: true, scopeLine: 6134, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !900, !906}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASH_TABLE_ITER", file: !1, line: 140, baseType: !902)
!902 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 137, size: 128, align: 64, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !902, file: !1, line: 138, baseType: !532, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !902, file: !1, line: 139, baseType: !532, size: 64, align: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!908 = distinct !DISubprogram(name: "hashTableIterNext", scope: !1, file: !1, line: 6140, type: !909, isLocal: true, isDefinition: true, scopeLine: 6141, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!909 = !DISubroutineType(types: !910)
!910 = !{!533, !900}
!911 = distinct !DISubprogram(name: "storeAtts", scope: !1, file: !1, line: 2747, type: !912, isLocal: true, isDefinition: true, scopeLine: 2750, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!912 = !DISubroutineType(types: !913)
!913 = !{!24, !162, !321, !192, !914, !915}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!916 = distinct !DISubprogram(name: "setElementTypePrefix", scope: !1, file: !1, line: 5452, type: !917, isLocal: true, isDefinition: true, scopeLine: 5453, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!917 = !DISubroutineType(types: !918)
!918 = !{!223, !162, !471}
!919 = distinct !DISubprogram(name: "addBinding", scope: !1, file: !1, line: 3101, type: !920, isLocal: true, isDefinition: true, scopeLine: 3103, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!920 = !DISubroutineType(types: !921)
!921 = !{!24, !162, !477, !505, !210, !915}
!922 = distinct !DISubprogram(name: "epilogProcessor", scope: !1, file: !1, line: 4779, type: !427, isLocal: true, isDefinition: true, scopeLine: 4783, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!923 = distinct !DISubprogram(name: "doCdataSection", scope: !1, file: !1, line: 3244, type: !924, isLocal: true, isDefinition: true, scopeLine: 3250, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!924 = !DISubroutineType(types: !925)
!925 = !{!24, !162, !321, !332, !192, !332, !159}
!926 = distinct !DISubprogram(name: "cdataSectionProcessor", scope: !1, file: !1, line: 3218, type: !427, isLocal: true, isDefinition: true, scopeLine: 3222, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!927 = distinct !DISubprogram(name: "externalEntityContentProcessor", scope: !1, file: !1, line: 2265, type: !427, isLocal: true, isDefinition: true, scopeLine: 2269, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!928 = distinct !DISubprogram(name: "storeRawNames", scope: !1, file: !1, line: 2104, type: !929, isLocal: true, isDefinition: true, scopeLine: 2105, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!929 = !DISubroutineType(types: !930)
!930 = !{!159, !162}
!931 = distinct !DISubprogram(name: "getElementType", scope: !1, file: !1, line: 6444, type: !932, isLocal: true, isDefinition: true, scopeLine: 6448, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!932 = !DISubroutineType(types: !933)
!933 = !{!471, !162, !321, !192, !192}
!934 = distinct !DISubprogram(name: "getAttributeId", scope: !1, file: !1, line: 5482, type: !935, isLocal: true, isDefinition: true, scopeLine: 5484, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!935 = !DISubroutineType(types: !936)
!936 = !{!519, !162, !321, !192, !192}
!937 = distinct !DISubprogram(name: "poolAppendString", scope: !1, file: !1, line: 6241, type: !938, isLocal: true, isDefinition: true, scopeLine: 6242, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!938 = !DISubroutineType(types: !939)
!939 = !{!210, !863, !210}
!940 = distinct !DISubprogram(name: "poolAppend", scope: !1, file: !1, line: 6199, type: !883, isLocal: true, isDefinition: true, scopeLine: 6201, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!941 = distinct !DISubprogram(name: "defineAttribute", scope: !1, file: !1, line: 5408, type: !942, isLocal: true, isDefinition: true, scopeLine: 5410, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!942 = !DISubroutineType(types: !943)
!943 = !{!223, !471, !519, !159, !159, !210, !162}
!944 = distinct !DISubprogram(name: "poolGrow", scope: !1, file: !1, line: 6264, type: !945, isLocal: true, isDefinition: true, scopeLine: 6265, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!945 = !DISubroutineType(types: !946)
!946 = !{!159, !863}
!947 = distinct !DISubprogram(name: "storeAttributeValue", scope: !1, file: !1, line: 4973, type: !948, isLocal: true, isDefinition: true, scopeLine: 4976, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!948 = !DISubroutineType(types: !949)
!949 = !{!24, !162, !321, !159, !192, !192, !863}
!950 = distinct !DISubprogram(name: "appendAttributeValue", scope: !1, file: !1, line: 4989, type: !948, isLocal: true, isDefinition: true, scopeLine: 4992, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!951 = distinct !DISubprogram(name: "storeEntityValue", scope: !1, file: !1, line: 5139, type: !952, isLocal: true, isDefinition: true, scopeLine: 5143, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!952 = !DISubroutineType(types: !953)
!953 = !{!24, !162, !321, !192, !192}
!954 = distinct !DISubprogram(name: "lookup", scope: !1, file: !1, line: 6024, type: !955, isLocal: true, isDefinition: true, scopeLine: 6025, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!955 = !DISubroutineType(types: !956)
!956 = !{!533, !162, !859, !538, !180}
!957 = distinct !DISubprogram(name: "hash", scope: !1, file: !1, line: 6015, type: !958, isLocal: true, isDefinition: true, scopeLine: 6016, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!958 = !DISubroutineType(types: !959)
!959 = !{!182, !162, !538}
!960 = distinct !DISubprogram(name: "keyeq", scope: !1, file: !1, line: 6006, type: !961, isLocal: true, isDefinition: true, scopeLine: 6007, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!961 = !DISubroutineType(types: !962)
!962 = !{!159, !538, !538}
!963 = distinct !DISubprogram(name: "nextScaffoldPart", scope: !1, file: !1, line: 6337, type: !688, isLocal: true, isDefinition: true, scopeLine: 6338, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!964 = distinct !DISubprogram(name: "build_model", scope: !1, file: !1, line: 6423, type: !965, isLocal: true, isDefinition: true, scopeLine: 6424, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!965 = !DISubroutineType(types: !966)
!966 = !{!295, !162}
!967 = distinct !DISubprogram(name: "build_node", scope: !1, file: !1, line: 6385, type: !968, isLocal: true, isDefinition: true, scopeLine: 6390, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !162, !223, !295, !970, !971}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!972 = distinct !DISubprogram(name: "reportProcessingInstruction", scope: !1, file: !1, line: 5328, type: !973, isLocal: true, isDefinition: true, scopeLine: 5330, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!973 = !DISubroutineType(types: !974)
!974 = !{!223, !162, !321, !192, !192}
!975 = distinct !DISubprogram(name: "normalizeLines", scope: !1, file: !1, line: 5305, type: !886, isLocal: true, isDefinition: true, scopeLine: 5306, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!976 = distinct !DISubprogram(name: "reportComment", scope: !1, file: !1, line: 5357, type: !973, isLocal: true, isDefinition: true, scopeLine: 5359, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!977 = distinct !DISubprogram(name: "destroyBindings", scope: !1, file: !1, line: 1151, type: !978, isLocal: true, isDefinition: true, scopeLine: 1152, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !483, !162}
!980 = distinct !DISubprogram(name: "startParsing", scope: !1, file: !1, line: 736, type: !929, isLocal: true, isDefinition: true, scopeLine: 737, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!981 = distinct !DISubprogram(name: "generate_hash_secret_salt", scope: !1, file: !1, line: 720, type: !982, isLocal: true, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!982 = !DISubroutineType(types: !983)
!983 = !{!182, !162}
!984 = distinct !DISubprogram(name: "gather_time_entropy", scope: !1, file: !1, line: 701, type: !985, isLocal: true, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!985 = !DISubroutineType(types: !986)
!986 = !{!182}
!987 = distinct !DISubprogram(name: "externalEntityInitProcessor", scope: !1, file: !1, line: 2164, type: !427, isLocal: true, isDefinition: true, scopeLine: 2168, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!988 = distinct !DISubprogram(name: "externalEntityInitProcessor2", scope: !1, file: !1, line: 2177, type: !427, isLocal: true, isDefinition: true, scopeLine: 2181, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!989 = distinct !DISubprogram(name: "externalEntityInitProcessor3", scope: !1, file: !1, line: 2217, type: !427, isLocal: true, isDefinition: true, scopeLine: 2221, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!990 = distinct !DISubprogram(name: "errorProcessor", scope: !1, file: !1, line: 4964, type: !427, isLocal: true, isDefinition: true, scopeLine: 4968, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!991 = distinct !DISubprogram(name: "reportDefault", scope: !1, file: !1, line: 5379, type: !992, isLocal: true, isDefinition: true, scopeLine: 5381, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !162, !321, !192, !192}
!994 = distinct !DISubprogram(name: "setContext", scope: !1, file: !1, line: 5616, type: !662, isLocal: true, isDefinition: true, scopeLine: 5617, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!995 = distinct !DISubprogram(name: "dtdReset", scope: !1, file: !1, line: 5732, type: !996, isLocal: true, isDefinition: true, scopeLine: 5733, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !523, !543}
!998 = distinct !DISubprogram(name: "hashTableClear", scope: !1, file: !1, line: 6103, type: !999, isLocal: true, isDefinition: true, scopeLine: 6104, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !859}
!1001 = distinct !DISubprogram(name: "dtdDestroy", scope: !1, file: !1, line: 5774, type: !1002, isLocal: true, isDefinition: true, scopeLine: 5775, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !523, !159, !543}
!1004 = distinct !DISubprogram(name: "hashTableDestroy", scope: !1, file: !1, line: 6114, type: !999, isLocal: true, isDefinition: true, scopeLine: 6115, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1005 = distinct !DISubprogram(name: "dtdCopy", scope: !1, file: !1, line: 5805, type: !1006, isLocal: true, isDefinition: true, scopeLine: 5806, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!223, !162, !523, !1008, !543}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!1010 = distinct !DISubprogram(name: "copyEntityTable", scope: !1, file: !1, line: 5937, type: !1011, isLocal: true, isDefinition: true, scopeLine: 5941, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!223, !162, !859, !863, !906}
!1013 = distinct !DISubprogram(name: "poolCopyStringN", scope: !1, file: !1, line: 6227, type: !1014, isLocal: true, isDefinition: true, scopeLine: 6228, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!210, !863, !210, !223}
!1016 = distinct !DISubprogram(name: "poolClear", scope: !1, file: !1, line: 6162, type: !1017, isLocal: true, isDefinition: true, scopeLine: 6163, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !863}
!1019 = distinct !DISubprogram(name: "poolDestroy", scope: !1, file: !1, line: 6182, type: !1017, isLocal: true, isDefinition: true, scopeLine: 6183, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1020 = distinct !DISubprogram(name: "poolCopyString", scope: !1, file: !1, line: 6215, type: !938, isLocal: true, isDefinition: true, scopeLine: 6216, flags: DIFlagPrototyped, isOptimized: false, variables: !654)
!1021 = !{!1022, !1027, !1031, !1035, !1037, !1038, !1042, !1043, !1047, !1051, !1052, !1056, !1058, !1059, !1063, !1065, !1069, !1070}
!1022 = !DIGlobalVariable(name: "message", scope: !821, file: !1, line: 1979, type: !1023, isLocal: true, isDefinition: true, variable: [41 x i8*]* @XML_ErrorString.message)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 2624, align: 64, elements: !1025)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!1025 = !{!1026}
!1026 = !DISubrange(count: 41)
!1027 = !DIGlobalVariable(name: "features", scope: !839, file: !1, line: 2062, type: !1028, isLocal: true, isDefinition: true, variable: [4 x %struct.XML_Feature]* @XML_GetFeatureList.features)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 768, align: 64, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 4)
!1031 = !DIGlobalVariable(name: "atypeCDATA", scope: !876, file: !1, line: 3807, type: !1032, isLocal: true, isDefinition: true, variable: [6 x i8]* @doProlog.atypeCDATA)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 48, align: 8, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 6)
!1035 = !DIGlobalVariable(name: "atypeID", scope: !876, file: !1, line: 3809, type: !1036, isLocal: true, isDefinition: true, variable: [3 x i8]* @doProlog.atypeID)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 24, align: 8, elements: !333)
!1037 = !DIGlobalVariable(name: "atypeIDREF", scope: !876, file: !1, line: 3810, type: !1032, isLocal: true, isDefinition: true, variable: [6 x i8]* @doProlog.atypeIDREF)
