; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmlrole.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.prolog_state = type { i32 (%struct.prolog_state*, i32, i8*, i8*, %struct.encoding*)*, i32, i32 }
%struct.encoding = type { [3 x i32 (%struct.encoding*, i8*, i8*, i8**)*], [2 x i32 (%struct.encoding*, i8*, i8*, i8**)*], i32 (%struct.encoding*, i8*, i8*)*, i32 (%struct.encoding*, i8*, i8*, i8*)*, i32 (%struct.encoding*, i8*)*, i8* (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i8*)*, void (%struct.encoding*, i8*, i8*, %struct.position*)*, i32 (%struct.encoding*, i8*, i8*, i8**)*, i32 (%struct.encoding*, i8**, i8*, i8**, i8*)*, i32 (%struct.encoding*, i8**, i8*, i16**, i16*)*, i32, i8, i8 }
%struct.ATTRIBUTE = type { i8*, i8*, i8*, i8 }
%struct.position = type { i64, i64 }

@KW_DOCTYPE = internal constant [8 x i8] c"DOCTYPE\00", align 1
@KW_SYSTEM = internal constant [7 x i8] c"SYSTEM\00", align 1
@KW_PUBLIC = internal constant [7 x i8] c"PUBLIC\00", align 1
@KW_ENTITY = internal constant [7 x i8] c"ENTITY\00", align 1
@KW_ATTLIST = internal constant [8 x i8] c"ATTLIST\00", align 1
@KW_ELEMENT = internal constant [8 x i8] c"ELEMENT\00", align 1
@KW_NOTATION = internal constant [9 x i8] c"NOTATION\00", align 1
@KW_NDATA = internal constant [6 x i8] c"NDATA\00", align 1

!21 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_CLOSE", value: 8)
!22 = !DIEnumerator(name: "XML_ROLE_GENERAL_ENTITY_NAME", value: 9)
!23 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_NAME", value: 10)
!24 = !DIEnumerator(name: "XML_ROLE_ENTITY_NONE", value: 11)
!25 = !DIEnumerator(name: "XML_ROLE_ENTITY_VALUE", value: 12)
!26 = !DIEnumerator(name: "XML_ROLE_ENTITY_SYSTEM_ID", value: 13)
!27 = !DIEnumerator(name: "XML_ROLE_ENTITY_PUBLIC_ID", value: 14)
!28 = !DIEnumerator(name: "XML_ROLE_ENTITY_COMPLETE", value: 15)
!29 = !DIEnumerator(name: "XML_ROLE_ENTITY_NOTATION_NAME", value: 16)
!30 = !DIEnumerator(name: "XML_ROLE_NOTATION_NONE", value: 17)
!31 = !DIEnumerator(name: "XML_ROLE_NOTATION_NAME", value: 18)
!32 = !DIEnumerator(name: "XML_ROLE_NOTATION_SYSTEM_ID", value: 19)
!33 = !DIEnumerator(name: "XML_ROLE_NOTATION_NO_SYSTEM_ID", value: 20)
!34 = !DIEnumerator(name: "XML_ROLE_NOTATION_PUBLIC_ID", value: 21)
!35 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NAME", value: 22)
!36 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_CDATA", value: 23)
!37 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ID", value: 24)
!38 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREF", value: 25)
!39 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREFS", value: 26)
!40 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITY", value: 27)
!41 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITIES", value: 28)
!42 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKEN", value: 29)
!43 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKENS", value: 30)
!44 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_ENUM_VALUE", value: 31)
!45 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NOTATION_VALUE", value: 32)
!46 = !DIEnumerator(name: "XML_ROLE_ATTLIST_NONE", value: 33)
!47 = !DIEnumerator(name: "XML_ROLE_ATTLIST_ELEMENT_NAME", value: 34)
!48 = !DIEnumerator(name: "XML_ROLE_IMPLIED_ATTRIBUTE_VALUE", value: 35)
!49 = !DIEnumerator(name: "XML_ROLE_REQUIRED_ATTRIBUTE_VALUE", value: 36)
!50 = !DIEnumerator(name: "XML_ROLE_DEFAULT_ATTRIBUTE_VALUE", value: 37)
!51 = !DIEnumerator(name: "XML_ROLE_FIXED_ATTRIBUTE_VALUE", value: 38)
!52 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NONE", value: 39)
!53 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NAME", value: 40)
!54 = !DIEnumerator(name: "XML_ROLE_CONTENT_ANY", value: 41)
!55 = !DIEnumerator(name: "XML_ROLE_CONTENT_EMPTY", value: 42)
!56 = !DIEnumerator(name: "XML_ROLE_CONTENT_PCDATA", value: 43)
!57 = !DIEnumerator(name: "XML_ROLE_GROUP_OPEN", value: 44)
!58 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE", value: 45)
!59 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_REP", value: 46)
!60 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_OPT", value: 47)
!61 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_PLUS", value: 48)
!62 = !DIEnumerator(name: "XML_ROLE_GROUP_CHOICE", value: 49)
!63 = !DIEnumerator(name: "XML_ROLE_GROUP_SEQUENCE", value: 50)
!64 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT", value: 51)
!65 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_REP", value: 52)
!66 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_OPT", value: 53)
!67 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_PLUS", value: 54)
!68 = !DIEnumerator(name: "XML_ROLE_PI", value: 55)
!69 = !DIEnumerator(name: "XML_ROLE_COMMENT", value: 56)
!70 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_REF", value: 57)
!71 = !{!72}
!72 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!73 = !{!74, !173, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!74 = distinct !DISubprogram(name: "XmlPrologStateInit", scope: !1, file: !1, line: 1316, type: !75, isLocal: false, isDefinition: true, scopeLine: 1317, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROLOG_STATE", file: !10, line: 100, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "prolog_state", file: !10, line: 87, size: 128, align: 64, elements: !80)
!80 = !{!81, !169, !171}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !79, file: !10, line: 88, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!72, !85, !72, !86, !86, !89}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENCODING", file: !4, line: 126, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "encoding", file: !4, line: 139, size: 1088, align: 64, elements: !93)
!93 = !{!94, !103, !107, !111, !115, !119, !123, !135, !136, !137, !150, !151, !157, !166, !167, !168}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "scanners", scope: !92, file: !4, line: 140, baseType: !95, size: 192, align: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 192, align: 64, elements: !101)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCANNER", file: !4, line: 128, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!72, !89, !86, !86, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!101 = !{!102}
!102 = !DISubrange(count: 3)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "literalScanners", scope: !92, file: !4, line: 141, baseType: !104, size: 128, align: 64, offset: 192)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, align: 64, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 2)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sameName", scope: !92, file: !4, line: 142, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!72, !89, !86, !86}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nameMatchesAscii", scope: !92, file: !4, line: 145, baseType: !112, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!72, !89, !86, !86, !86}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !92, file: !4, line: 149, baseType: !116, size: 64, align: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!72, !89, !86}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "skipS", scope: !92, file: !4, line: 150, baseType: !120, size: 64, align: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!86, !89, !86}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "getAtts", scope: !92, file: !4, line: 151, baseType: !124, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!72, !89, !86, !72, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE", file: !4, line: 123, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 118, size: 256, align: 64, elements: !130)
!130 = !{!131, !132, !133, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !4, line: 119, baseType: !86, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !129, file: !4, line: 120, baseType: !86, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "valueEnd", scope: !129, file: !4, line: 121, baseType: !86, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !129, file: !4, line: 122, baseType: !88, size: 8, align: 8, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "charRefNumber", scope: !92, file: !4, line: 155, baseType: !116, size: 64, align: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "predefinedEntityName", scope: !92, file: !4, line: 156, baseType: !108, size: 64, align: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "updatePosition", scope: !92, file: !4, line: 159, baseType: !138, size: 64, align: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !89, !86, !86, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "POSITION", file: !4, line: 116, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "position", file: !4, line: 112, size: 128, align: 64, elements: !144)
!144 = !{!145, !149}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !143, file: !4, line: 114, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Size", file: !147, line: 124, baseType: !148)
!147 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/expat_external.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!148 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "columnNumber", scope: !143, file: !4, line: 115, baseType: !146, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "isPublicId", scope: !92, file: !4, line: 163, baseType: !97, size: 64, align: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Convert", scope: !92, file: !4, line: 167, baseType: !152, size: 64, align: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!3, !89, !100, !86, !155, !86}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "utf16Convert", scope: !92, file: !4, line: 172, baseType: !158, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!3, !89, !100, !86, !161, !164}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "minBytesPerChar", scope: !92, file: !4, line: 177, baseType: !72, size: 32, align: 32, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf8", scope: !92, file: !4, line: 178, baseType: !88, size: 8, align: 8, offset: 1056)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf16", scope: !92, file: !4, line: 179, baseType: !88, size: 8, align: 8, offset: 1064)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !79, file: !10, line: 93, baseType: !170, size: 32, align: 32, offset: 64)
!170 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "role_none", scope: !79, file: !10, line: 94, baseType: !72, size: 32, align: 32, offset: 96)
!172 = !{}
!173 = distinct !DISubprogram(name: "prolog0", scope: !1, file: !1, line: 128, type: !174, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!174 = !DISubroutineType(types: !175)
!175 = !{!72, !77, !72, !86, !86, !89}
!176 = distinct !DISubprogram(name: "prolog1", scope: !1, file: !1, line: 165, type: !174, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!177 = distinct !DISubprogram(name: "doctype0", scope: !1, file: !1, line: 217, type: !174, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!178 = distinct !DISubprogram(name: "doctype1", scope: !1, file: !1, line: 235, type: !174, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!179 = distinct !DISubprogram(name: "internalSubset", scope: !1, file: !1, line: 336, type: !174, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!180 = distinct !DISubprogram(name: "entity0", scope: !1, file: !1, line: 438, type: !174, isLocal: true, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!181 = distinct !DISubprogram(name: "entity1", scope: !1, file: !1, line: 458, type: !174, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!182 = distinct !DISubprogram(name: "entity7", scope: !1, file: !1, line: 578, type: !174, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!183 = distinct !DISubprogram(name: "entity9", scope: !1, file: !1, line: 623, type: !174, isLocal: true, isDefinition: true, scopeLine: 628, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!184 = distinct !DISubprogram(name: "entity10", scope: !1, file: !1, line: 640, type: !174, isLocal: true, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!185 = distinct !DISubprogram(name: "entity8", scope: !1, file: !1, line: 606, type: !174, isLocal: true, isDefinition: true, scopeLine: 611, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!186 = distinct !DISubprogram(name: "declClose", scope: !1, file: !1, line: 1278, type: !174, isLocal: true, isDefinition: true, scopeLine: 1283, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!187 = distinct !DISubprogram(name: "entity2", scope: !1, file: !1, line: 475, type: !174, isLocal: true, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!188 = distinct !DISubprogram(name: "entity4", scope: !1, file: !1, line: 520, type: !174, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!189 = distinct !DISubprogram(name: "entity5", scope: !1, file: !1, line: 537, type: !174, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!190 = distinct !DISubprogram(name: "entity6", scope: !1, file: !1, line: 560, type: !174, isLocal: true, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!191 = distinct !DISubprogram(name: "entity3", scope: !1, file: !1, line: 503, type: !174, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!192 = distinct !DISubprogram(name: "attlist0", scope: !1, file: !1, line: 754, type: !174, isLocal: true, isDefinition: true, scopeLine: 759, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
