; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmltok.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.normal_encoding = type { %struct.encoding, [256 x i8], i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)* }
%struct.encoding = type { [3 x i32 (%struct.encoding*, i8*, i8*, i8**)*], [2 x i32 (%struct.encoding*, i8*, i8*, i8**)*], i32 (%struct.encoding*, i8*, i8*)*, i32 (%struct.encoding*, i8*, i8*, i8*)*, i32 (%struct.encoding*, i8*)*, i8* (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i8*)*, void (%struct.encoding*, i8*, i8*, %struct.position*)*, i32 (%struct.encoding*, i8*, i8*, i8**)*, i32 (%struct.encoding*, i8**, i8*, i8**, i8*)*, i32 (%struct.encoding*, i8**, i8*, i16**, i16*)*, i32, i8, i8 }
%struct.ATTRIBUTE = type { i8*, i8*, i8*, i8 }
%struct.position = type { i64, i64 }
%struct.unknown_encoding = type { %struct.normal_encoding, i32 (i8*, i8*)*, i8*, [256 x i16], [256 x [4 x i8]] }
%struct.INIT_ENCODING = type { %struct.encoding, %struct.encoding** }


!4 = distinct !DISubprogram(name: "XmlUtf8Encode", scope: !1, file: !1, line: 1288, type: !5, isLocal: false, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !7, !8}
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !{}
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "min2", value: 128)
!13 = !DIEnumerator(name: "min3", value: 2048)
!14 = !DIEnumerator(name: "min4", value: 65536)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 325, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "UTF8_cval1", value: 0)
!18 = !DIEnumerator(name: "UTF8_cval2", value: 192)
!19 = !DIEnumerator(name: "UTF8_cval3", value: 224)
!20 = !DIEnumerator(name: "UTF8_cval4", value: 240)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XML_Convert_Result", file: !22, line: 133, size: 32, align: 32, elements: !23)
!22 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmltok.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "XML_CONVERT_COMPLETED", value: 0)
!25 = !DIEnumerator(name: "XML_CONVERT_INPUT_INCOMPLETE", value: 1)
!26 = !DIEnumerator(name: "XML_CONVERT_OUTPUT_EXHAUSTED", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 6, size: 32, align: 32, elements: !29)
!28 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmltok_impl.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!30 = !DIEnumerator(name: "BT_NONXML", value: 0)
!31 = !DIEnumerator(name: "BT_MALFORM", value: 1)
!32 = !DIEnumerator(name: "BT_LT", value: 2)
!33 = !DIEnumerator(name: "BT_AMP", value: 3)
!34 = !DIEnumerator(name: "BT_RSQB", value: 4)
!35 = !DIEnumerator(name: "BT_LEAD2", value: 5)
!36 = !DIEnumerator(name: "BT_LEAD3", value: 6)
!37 = !DIEnumerator(name: "BT_LEAD4", value: 7)
!38 = !DIEnumerator(name: "BT_TRAIL", value: 8)
!39 = !DIEnumerator(name: "BT_CR", value: 9)
!40 = !DIEnumerator(name: "BT_LF", value: 10)
!41 = !DIEnumerator(name: "BT_GT", value: 11)
!42 = !DIEnumerator(name: "BT_QUOT", value: 12)
!43 = !DIEnumerator(name: "BT_APOS", value: 13)
!44 = !DIEnumerator(name: "BT_EQUALS", value: 14)
!45 = !DIEnumerator(name: "BT_QUEST", value: 15)
!46 = !DIEnumerator(name: "BT_EXCL", value: 16)
!47 = !DIEnumerator(name: "BT_SOL", value: 17)
!48 = !DIEnumerator(name: "BT_SEMI", value: 18)
!49 = !DIEnumerator(name: "BT_NUM", value: 19)
!50 = !DIEnumerator(name: "BT_LSQB", value: 20)
!51 = !DIEnumerator(name: "BT_S", value: 21)
!52 = !DIEnumerator(name: "BT_NMSTRT", value: 22)
!53 = !DIEnumerator(name: "BT_COLON", value: 23)
!54 = !DIEnumerator(name: "BT_HEX", value: 24)
!55 = !DIEnumerator(name: "BT_DIGIT", value: 25)
!56 = !DIEnumerator(name: "BT_NAME", value: 26)
!57 = !DIEnumerator(name: "BT_MINUS", value: 27)
!58 = !DIEnumerator(name: "BT_OTHER", value: 28)
!59 = !DIEnumerator(name: "BT_NONASCII", value: 29)
!60 = !DIEnumerator(name: "BT_PERCNT", value: 30)
!61 = !DIEnumerator(name: "BT_LPAR", value: 31)
!62 = !DIEnumerator(name: "BT_RPAR", value: 32)
!63 = !DIEnumerator(name: "BT_AST", value: 33)
!64 = !DIEnumerator(name: "BT_PLUS", value: 34)
!65 = !DIEnumerator(name: "BT_COMMA", value: 35)
!66 = !DIEnumerator(name: "BT_VERBAR", value: 36)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 1526, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76}
!69 = !DIEnumerator(name: "UNKNOWN_ENC", value: -1)
!70 = !DIEnumerator(name: "ISO_8859_1_ENC", value: 0)
!71 = !DIEnumerator(name: "US_ASCII_ENC", value: 1)
!72 = !DIEnumerator(name: "UTF_8_ENC", value: 2)
!73 = !DIEnumerator(name: "UTF_16_ENC", value: 3)
!74 = !DIEnumerator(name: "UTF_16BE_ENC", value: 4)
!75 = !DIEnumerator(name: "UTF_16LE_ENC", value: 5)
!76 = !DIEnumerator(name: "NO_ENC", value: 6)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !79, file: !78, line: 1426, size: 32, align: 32, elements: !161)
!78 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmltok_impl.c", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!79 = distinct !DISubprogram(name: "normal_getAtts", scope: !78, file: !78, line: 1423, type: !80, isLocal: true, isDefinition: true, scopeLine: 1425, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!80 = !DISubroutineType(types: !81)
!81 = !{!7, !82, !93, !7, !153}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENCODING", file: !22, line: 126, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "encoding", file: !22, line: 139, size: 1088, align: 64, elements: !86)
!86 = !{!87, !98, !102, !106, !110, !114, !118, !120, !121, !122, !135, !136, !141, !150, !151, !152}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "scanners", scope: !85, file: !22, line: 140, baseType: !88, size: 192, align: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 192, align: 64, elements: !96)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCANNER", file: !22, line: 128, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!7, !82, !93, !93, !95}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "literalScanners", scope: !85, file: !22, line: 141, baseType: !99, size: 128, align: 64, offset: 192)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, align: 64, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 2)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sameName", scope: !85, file: !22, line: 142, baseType: !103, size: 64, align: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!7, !82, !93, !93}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nameMatchesAscii", scope: !85, file: !22, line: 145, baseType: !107, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!7, !82, !93, !93, !93}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !85, file: !22, line: 149, baseType: !111, size: 64, align: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!7, !82, !93}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "skipS", scope: !85, file: !22, line: 150, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!93, !82, !93}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "getAtts", scope: !85, file: !22, line: 151, baseType: !119, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "charRefNumber", scope: !85, file: !22, line: 155, baseType: !111, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "predefinedEntityName", scope: !85, file: !22, line: 156, baseType: !103, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "updatePosition", scope: !85, file: !22, line: 159, baseType: !123, size: 64, align: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !82, !93, !93, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "POSITION", file: !22, line: 116, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "position", file: !22, line: 112, size: 128, align: 64, elements: !129)
!129 = !{!130, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !128, file: !22, line: 114, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Size", file: !132, line: 124, baseType: !133)
!132 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/expat_external.h", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!133 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "columnNumber", scope: !128, file: !22, line: 115, baseType: !131, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "isPublicId", scope: !85, file: !22, line: 163, baseType: !90, size: 64, align: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Convert", scope: !85, file: !22, line: 167, baseType: !137, size: 64, align: 64, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!21, !82, !95, !93, !140, !93}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "utf16Convert", scope: !85, file: !22, line: 172, baseType: !142, size: 64, align: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!21, !82, !95, !93, !145, !148}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "minBytesPerChar", scope: !85, file: !22, line: 177, baseType: !7, size: 32, align: 32, offset: 1024)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf8", scope: !85, file: !22, line: 178, baseType: !9, size: 8, align: 8, offset: 1056)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf16", scope: !85, file: !22, line: 179, baseType: !9, size: 8, align: 8, offset: 1064)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE", file: !22, line: 123, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 118, size: 256, align: 64, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !22, line: 119, baseType: !93, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !155, file: !22, line: 120, baseType: !93, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "valueEnd", scope: !155, file: !22, line: 121, baseType: !93, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !155, file: !22, line: 122, baseType: !9, size: 8, align: 8, offset: 192)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "other", value: 0)
!163 = !DIEnumerator(name: "inName", value: 1)
!164 = !DIEnumerator(name: "inValue", value: 2)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !166, file: !78, line: 1426, size: 32, align: 32, elements: !161)
!166 = distinct !DISubprogram(name: "little2_getAtts", scope: !78, file: !78, line: 1423, type: !80, isLocal: true, isDefinition: true, scopeLine: 1425, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !168, file: !78, line: 1426, size: 32, align: 32, elements: !161)
!168 = distinct !DISubprogram(name: "big2_getAtts", scope: !78, file: !78, line: 1423, type: !80, isLocal: true, isDefinition: true, scopeLine: 1425, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!169 = !{!170, !9, !147, !171, !7, !8, !204, !205, !131, !207, !209, !196, !211}
!170 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "unknown_encoding", file: !1, line: 1342, size: 16128, align: 64, elements: !173)
!173 = !{!174, !191, !197, !198, !200}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !172, file: !1, line: 1343, baseType: !175, size: 3712, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "normal_encoding", file: !1, line: 176, size: 3712, align: 64, elements: !176)
!176 = !{!177, !178, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !175, file: !1, line: 177, baseType: !84, size: 1088, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !1, line: 178, baseType: !179, size: 2048, align: 8, offset: 1088)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 2048, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "isName2", scope: !175, file: !1, line: 186, baseType: !111, size: 64, align: 64, offset: 3136)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "isName3", scope: !175, file: !1, line: 187, baseType: !111, size: 64, align: 64, offset: 3200)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "isName4", scope: !175, file: !1, line: 188, baseType: !111, size: 64, align: 64, offset: 3264)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "isNmstrt2", scope: !175, file: !1, line: 189, baseType: !111, size: 64, align: 64, offset: 3328)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "isNmstrt3", scope: !175, file: !1, line: 190, baseType: !111, size: 64, align: 64, offset: 3392)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "isNmstrt4", scope: !175, file: !1, line: 191, baseType: !111, size: 64, align: 64, offset: 3456)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "isInvalid2", scope: !175, file: !1, line: 192, baseType: !111, size: 64, align: 64, offset: 3520)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "isInvalid3", scope: !175, file: !1, line: 193, baseType: !111, size: 64, align: 64, offset: 3584)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "isInvalid4", scope: !175, file: !1, line: 194, baseType: !111, size: 64, align: 64, offset: 3648)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !172, file: !1, line: 1344, baseType: !192, size: 64, align: 64, offset: 3712)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONVERTER", file: !22, line: 291, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!7, !196, !93}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !172, file: !1, line: 1345, baseType: !196, size: 64, align: 64, offset: 3776)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "utf16", scope: !172, file: !1, line: 1346, baseType: !199, size: 4096, align: 16, offset: 3840)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 4096, align: 16, elements: !180)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !172, file: !1, line: 1347, baseType: !201, size: 8192, align: 8, offset: 7936)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8192, align: 8, elements: !202)
!202 = !{!181, !203}
!203 = !DISubrange(count: 4)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "INIT_ENCODING", file: !22, line: 270, baseType: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 267, size: 1152, align: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "initEnc", scope: !214, file: !22, line: 268, baseType: !84, size: 1088, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "encPtr", scope: !214, file: !22, line: 269, baseType: !218, size: 64, align: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!219 = !{!220, !4, !223, !226, !229, !234, !238, !239, !243, !246, !247, !250, !251, !252, !253, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !79, !273, !274, !275, !276, !277, !278, !279, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !166, !323, !324, !325, !326, !327, !328, !329, !332, !335, !336, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !168, !365, !366, !367, !368, !369, !370, !371, !372, !373, !379, !382, !383, !384}
!220 = distinct !DISubprogram(name: "align_limit_to_full_utf8_characters", scope: !1, file: !1, line: 333, type: !221, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !93, !95}
!223 = distinct !DISubprogram(name: "XmlUtf16Encode", scope: !1, file: !1, line: 1325, type: !224, isLocal: false, isDefinition: true, scopeLine: 1326, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!224 = !DISubroutineType(types: !225)
!225 = !{!7, !7, !146}
!226 = distinct !DISubprogram(name: "XmlSizeOfUnknownEncoding", scope: !1, file: !1, line: 1353, type: !227, isLocal: false, isDefinition: true, scopeLine: 1354, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!227 = !DISubroutineType(types: !228)
!228 = !{!7}
!229 = distinct !DISubprogram(name: "XmlInitUnknownEncoding", scope: !1, file: !1, line: 1446, type: !230, isLocal: false, isDefinition: true, scopeLine: 1450, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !196, !233, !192, !196}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!234 = distinct !DISubprogram(name: "XmlGetUtf8InternalEncoding", scope: !235, file: !235, line: 9, type: !236, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!235 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmexpat/lib/xmltok_ns.c", directory: "/data/download/cmake/cmake-master/Utilities/cmexpat")
!236 = !DISubroutineType(types: !237)
!237 = !{!82}
!238 = distinct !DISubprogram(name: "XmlGetUtf16InternalEncoding", scope: !235, file: !235, line: 15, type: !236, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!239 = distinct !DISubprogram(name: "XmlInitEncoding", scope: !235, file: !235, line: 56, type: !240, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!240 = !DISubroutineType(types: !241)
!241 = !{!7, !242, !218, !93}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!243 = distinct !DISubprogram(name: "XmlParseXmlDecl", scope: !235, file: !235, line: 91, type: !244, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
!244 = !DISubroutineType(types: !245)
!245 = !{!7, !7, !82, !93, !93, !95, !95, !95, !95, !218, !233}
!246 = distinct !DISubprogram(name: "normal_prologTok", scope: !78, file: !78, line: 967, type: !91, isLocal: true, isDefinition: true, scopeLine: 969, flags: DIFlagPrototyped, isOptimized: false, variables: !10)
