; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmzlib/inflate.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.code = type { i8, i8, i16 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct.inflate_state = type { i32, i32, i32, i32, i32, i32, i64, i64, %struct.gz_header_s*, i32, i32, i32, i32, i8*, i64, i32, i32, i32, i32, %struct.code*, %struct.code*, i32, i32, i32, i32, i32, i32, %struct.code*, [320 x i16], [288 x i16], [2048 x %struct.code] }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"1.2.3\00", align 1
@cm_zlib_inflate.order = internal constant [19 x i16] [i16 16, i16 17, i16 18, i16 0, i16 8, i16 7, i16 9, i16 6, i16 10, i16 5, i16 11, i16 4, i16 12, i16 3, i16 13, i16 2, i16 14, i16 1, i16 15], align 16
@.str.1 = private unnamed_addr constant [23 x i8] c"incorrect header check\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"unknown compression method\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"invalid window size\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"unknown header flags set\00", align 1
@.str.5 = private unnamed_addr constant [20 x i8] c"header crc mismatch\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !42, subprograms: !141, globals: !203)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/inflate.c", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!2 = !{!3, !36}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 20, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/inflate.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!6 = !DIEnumerator(name: "HEAD", value: 0)
!7 = !DIEnumerator(name: "FLAGS", value: 1)
!8 = !DIEnumerator(name: "TIME", value: 2)
!9 = !DIEnumerator(name: "OS", value: 3)
!10 = !DIEnumerator(name: "EXLEN", value: 4)
!11 = !DIEnumerator(name: "EXTRA", value: 5)
!12 = !DIEnumerator(name: "NAME", value: 6)
!13 = !DIEnumerator(name: "COMMENT", value: 7)
!14 = !DIEnumerator(name: "HCRC", value: 8)
!15 = !DIEnumerator(name: "DICTID", value: 9)
!16 = !DIEnumerator(name: "DICT", value: 10)
!17 = !DIEnumerator(name: "TYPE", value: 11)
!18 = !DIEnumerator(name: "TYPEDO", value: 12)
!19 = !DIEnumerator(name: "STORED", value: 13)
!20 = !DIEnumerator(name: "COPY", value: 14)
!21 = !DIEnumerator(name: "TABLE", value: 15)
!22 = !DIEnumerator(name: "LENLENS", value: 16)
!23 = !DIEnumerator(name: "CODELENS", value: 17)
!24 = !DIEnumerator(name: "LEN", value: 18)
!25 = !DIEnumerator(name: "LENEXT", value: 19)
!26 = !DIEnumerator(name: "DIST", value: 20)
!27 = !DIEnumerator(name: "DISTEXT", value: 21)
!28 = !DIEnumerator(name: "MATCH", value: 22)
!29 = !DIEnumerator(name: "LIT", value: 23)
!30 = !DIEnumerator(name: "CHECK", value: 24)
!31 = !DIEnumerator(name: "LENGTH", value: 25)
!32 = !DIEnumerator(name: "DONE", value: 26)
!33 = !DIEnumerator(name: "BAD", value: 27)
!34 = !DIEnumerator(name: "MEM", value: 28)
!35 = !DIEnumerator(name: "SYNC", value: 29)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 47, size: 32, align: 32, elements: !38)
!37 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/inftrees.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "CODES", value: 0)
!40 = !DIEnumerator(name: "LENS", value: 1)
!41 = !DIEnumerator(name: "DISTS", value: 2)
!42 = !{!43, !49, !127, !131, !133, !137, !54, !56, !75, !139, !105, !97, !90}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "inflate_state", file: !4, line: 77, size: 76416, align: 64, elements: !45)
!45 = !{!46, !48, !50, !51, !52, !53, !55, !57, !58, !85, !86, !87, !88, !89, !91, !92, !93, !94, !95, !96, !106, !107, !108, !109, !110, !111, !112, !113, !115, !119, !123}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !44, file: !4, line: 78, baseType: !47, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "inflate_mode", file: !4, line: 51, baseType: !3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !44, file: !4, line: 79, baseType: !49, size: 32, align: 32, offset: 32)
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !44, file: !4, line: 80, baseType: !49, size: 32, align: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !44, file: !4, line: 81, baseType: !49, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !4, line: 82, baseType: !49, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !44, file: !4, line: 83, baseType: !54, size: 32, align: 32, offset: 160)
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !44, file: !4, line: 84, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !44, file: !4, line: 85, baseType: !56, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !44, file: !4, line: 86, baseType: !59, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !60, line: 126, baseType: !61)
!60 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !60, line: 124, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !60, line: 109, size: 640, align: 64, elements: !64)
!64 = !{!65, !66, !69, !70, !71, !76, !78, !79, !80, !81, !82, !83, !84}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !63, file: !60, line: 110, baseType: !49, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !63, file: !60, line: 111, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !68, line: 270, baseType: !56)
!68 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zconf.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !63, file: !60, line: 112, baseType: !49, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !63, file: !60, line: 113, baseType: !49, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !63, file: !60, line: 114, baseType: !72, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !68, line: 276, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !68, line: 267, baseType: !75)
!75 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !63, file: !60, line: 115, baseType: !77, size: 32, align: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !68, line: 269, baseType: !54)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !63, file: !60, line: 116, baseType: !77, size: 32, align: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !60, line: 117, baseType: !72, size: 64, align: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !63, file: !60, line: 118, baseType: !77, size: 32, align: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !63, file: !60, line: 119, baseType: !72, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !63, file: !60, line: 120, baseType: !77, size: 32, align: 32, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !63, file: !60, line: 121, baseType: !49, size: 32, align: 32, offset: 544)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !63, file: !60, line: 122, baseType: !49, size: 32, align: 32, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "wbits", scope: !44, file: !4, line: 88, baseType: !54, size: 32, align: 32, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "wsize", scope: !44, file: !4, line: 89, baseType: !54, size: 32, align: 32, offset: 416)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "whave", scope: !44, file: !4, line: 90, baseType: !54, size: 32, align: 32, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !44, file: !4, line: 91, baseType: !54, size: 32, align: 32, offset: 480)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !44, file: !4, line: 92, baseType: !90, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !44, file: !4, line: 94, baseType: !56, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !44, file: !4, line: 95, baseType: !54, size: 32, align: 32, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !4, line: 97, baseType: !54, size: 32, align: 32, offset: 672)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !44, file: !4, line: 98, baseType: !54, size: 32, align: 32, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !44, file: !4, line: 100, baseType: !54, size: 32, align: 32, offset: 736)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lencode", scope: !44, file: !4, line: 102, baseType: !97, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "code", file: !37, line: 28, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 24, size: 32, align: 16, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !100, file: !37, line: 25, baseType: !75, size: 8, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !100, file: !37, line: 26, baseType: !75, size: 8, align: 8, offset: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !100, file: !37, line: 27, baseType: !105, size: 16, align: 16, offset: 16)
!105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "distcode", scope: !44, file: !4, line: 103, baseType: !97, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "lenbits", scope: !44, file: !4, line: 104, baseType: !54, size: 32, align: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "distbits", scope: !44, file: !4, line: 105, baseType: !54, size: 32, align: 32, offset: 928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ncode", scope: !44, file: !4, line: 107, baseType: !54, size: 32, align: 32, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nlen", scope: !44, file: !4, line: 108, baseType: !54, size: 32, align: 32, offset: 992)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ndist", scope: !44, file: !4, line: 109, baseType: !54, size: 32, align: 32, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !44, file: !4, line: 110, baseType: !54, size: 32, align: 32, offset: 1056)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !4, line: 111, baseType: !114, size: 64, align: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !44, file: !4, line: 112, baseType: !116, size: 5120, align: 16, offset: 1152)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 5120, align: 16, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !44, file: !4, line: 113, baseType: !120, size: 4608, align: 16, offset: 6272)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 4608, align: 16, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !44, file: !4, line: 114, baseType: !124, size: 65536, align: 16, offset: 10880)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 65536, align: 16, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 2048)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !60, line: 77, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !131, !77, !77}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !68, line: 285, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !60, line: 78, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !131, !131}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !60, line: 80, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!141 = !{!142, !165, !168, !173, !176, !179, !180, !185, !188, !189, !190, !193, !196, !199}
!142 = distinct !DISubprogram(name: "cm_zlib_inflateReset", scope: !1, file: !1, line: 103, type: !143, isLocal: false, isDefinition: true, scopeLine: 105, isOptimized: false, variables: !164)
!143 = !DISubroutineType(types: !144)
!144 = !{!49, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !60, line: 103, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !60, line: 101, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !60, line: 82, size: 896, align: 64, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !148, file: !60, line: 83, baseType: !72, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !148, file: !60, line: 84, baseType: !77, size: 32, align: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !148, file: !60, line: 85, baseType: !67, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !148, file: !60, line: 87, baseType: !72, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !148, file: !60, line: 88, baseType: !77, size: 32, align: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !148, file: !60, line: 89, baseType: !67, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !148, file: !60, line: 91, baseType: !139, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !148, file: !60, line: 92, baseType: !137, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !148, file: !60, line: 94, baseType: !127, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !148, file: !60, line: 95, baseType: !133, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !148, file: !60, line: 96, baseType: !131, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !148, file: !60, line: 98, baseType: !49, size: 32, align: 32, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !148, file: !60, line: 99, baseType: !67, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !148, file: !60, line: 100, baseType: !67, size: 64, align: 64, offset: 832)
!164 = !{}
!165 = distinct !DISubprogram(name: "cm_zlib_inflatePrime", scope: !1, file: !1, line: 128, type: !166, isLocal: false, isDefinition: true, scopeLine: 132, isOptimized: false, variables: !164)
!166 = !DISubroutineType(types: !167)
!167 = !{!49, !145, !49, !49}
!168 = distinct !DISubprogram(name: "cm_zlib_inflateInit2_", scope: !1, file: !1, line: 144, type: !169, isLocal: false, isDefinition: true, scopeLine: 149, isOptimized: false, variables: !164)
!169 = !DISubroutineType(types: !170)
!170 = !{!49, !145, !49, !171, !49}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!173 = distinct !DISubprogram(name: "cm_zlib_inflateInit_", scope: !1, file: !1, line: 187, type: !174, isLocal: false, isDefinition: true, scopeLine: 191, isOptimized: false, variables: !164)
!174 = !DISubroutineType(types: !175)
!175 = !{!49, !145, !171, !49}
!176 = distinct !DISubprogram(name: "cm_zlib_inflate", scope: !1, file: !1, line: 554, type: !177, isLocal: false, isDefinition: true, scopeLine: 557, isOptimized: false, variables: !164)
!177 = !DISubroutineType(types: !178)
!178 = !{!49, !145, !49}
!179 = distinct !DISubprogram(name: "cm_zlib_inflateEnd", scope: !1, file: !1, line: 1155, type: !143, isLocal: false, isDefinition: true, scopeLine: 1157, isOptimized: false, variables: !164)
!180 = distinct !DISubprogram(name: "cm_zlib_inflateSetDictionary", scope: !1, file: !1, line: 1169, type: !181, isLocal: false, isDefinition: true, scopeLine: 1173, isOptimized: false, variables: !164)
!181 = !DISubroutineType(types: !182)
!182 = !{!49, !145, !183, !77}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!185 = distinct !DISubprogram(name: "cm_zlib_inflateGetHeader", scope: !1, file: !1, line: 1211, type: !186, isLocal: false, isDefinition: true, scopeLine: 1214, isOptimized: false, variables: !164)
!186 = !DISubroutineType(types: !187)
!187 = !{!49, !145, !59}
!188 = distinct !DISubprogram(name: "cm_zlib_inflateSync", scope: !1, file: !1, line: 1262, type: !143, isLocal: false, isDefinition: true, scopeLine: 1264, isOptimized: false, variables: !164)
!189 = distinct !DISubprogram(name: "cm_zlib_inflateSyncPoint", scope: !1, file: !1, line: 1313, type: !143, isLocal: false, isDefinition: true, scopeLine: 1315, isOptimized: false, variables: !164)
!190 = distinct !DISubprogram(name: "cm_zlib_inflateCopy", scope: !1, file: !1, line: 1323, type: !191, isLocal: false, isDefinition: true, scopeLine: 1326, isOptimized: false, variables: !164)
!191 = !DISubroutineType(types: !192)
!192 = !{!49, !145, !145}
!193 = distinct !DISubprogram(name: "fixedtables", scope: !1, file: !1, line: 205, type: !194, isLocal: true, isDefinition: true, scopeLine: 207, isOptimized: false, variables: !164)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !43}
!196 = distinct !DISubprogram(name: "updatewindow", scope: !1, file: !1, line: 323, type: !197, isLocal: true, isDefinition: true, scopeLine: 326, isOptimized: false, variables: !164)
!197 = !DISubroutineType(types: !198)
!198 = !{!49, !145, !54}
!199 = distinct !DISubprogram(name: "syncsearch", scope: !1, file: !1, line: 1239, type: !200, isLocal: true, isDefinition: true, scopeLine: 1243, isOptimized: false, variables: !164)
!200 = !DISubroutineType(types: !201)
!201 = !{!54, !202, !90, !54}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!203 = !{!204, !209, !214}
!204 = !DIGlobalVariable(name: "order", scope: !176, file: !1, line: 574, type: !205, isLocal: true, isDefinition: true, variable: [19 x i16]* @cm_zlib_inflate.order)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 304, align: 16, elements: !207)
