; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmzlib/trees.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.static_tree_desc_s = type { %struct.ct_data_s*, i32*, i32, i32, i32 }
%struct.ct_data_s = type { %union.anon, %union.anon.0 }
%union.anon = type { i16 }
%union.anon.0 = type { i16 }
%struct.internal_state = type { %struct.z_stream_s*, i32, i8*, i64, i8*, i32, i32, %struct.gz_header_s*, i32, i8, i32, i32, i32, i32, i8*, i64, i16*, i16*, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [573 x %struct.ct_data_s], [61 x %struct.ct_data_s], [39 x %struct.ct_data_s], %struct.tree_desc_s, %struct.tree_desc_s, %struct.tree_desc_s, [16 x i16], [573 x i32], i32, i32, [573 x i8], i8*, i32, i32, i16*, i64, i64, i32, i32, i16, i32 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }
%struct.tree_desc_s = type { %struct.ct_data_s*, i32, %struct.static_tree_desc_s* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !54, globals: !239)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/trees.c", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!2 = !{}
!3 = !{!4, !5, !8, !10, !11, !48, !17, !50, !52, !53}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !6, line: 47, baseType: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zutil.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ush", file: !6, line: 49, baseType: !9)
!9 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!10 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree_desc", file: !13, line: 84, baseType: !14)
!13 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/deflate.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc_s", file: !13, line: 80, size: 192, align: 64, elements: !15)
!15 = !{!16, !31, !32}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !14, file: !13, line: 81, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !13, line: 71, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data_s", file: !13, line: 62, size: 32, align: 16, elements: !20)
!20 = !{!21, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !19, file: !13, line: 66, baseType: !22, size: 16, align: 16)
!22 = !DICompositeType(tag: DW_TAG_union_type, scope: !19, file: !13, line: 63, size: 16, align: 16, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !22, file: !13, line: 64, baseType: !8, size: 16, align: 16)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !22, file: !13, line: 65, baseType: !8, size: 16, align: 16)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !19, file: !13, line: 70, baseType: !27, size: 16, align: 16, offset: 16)
!27 = !DICompositeType(tag: DW_TAG_union_type, scope: !19, file: !13, line: 67, size: 16, align: 16, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !27, file: !13, line: 68, baseType: !8, size: 16, align: 16)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, file: !13, line: 69, baseType: !8, size: 16, align: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !14, file: !13, line: 82, baseType: !4, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stat_desc", scope: !14, file: !13, line: 83, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_tree_desc", file: !13, line: 78, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "static_tree_desc_s", file: !1, line: 121, size: 256, align: 64, elements: !36)
!36 = !{!37, !40, !45, !46, !47}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "static_tree", scope: !35, file: !1, line: 122, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "extra_bits", scope: !35, file: !1, line: 123, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "intf", file: !44, line: 279, baseType: !4)
!44 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zconf.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "extra_base", scope: !35, file: !1, line: 124, baseType: !4, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !35, file: !1, line: 125, baseType: !4, size: 32, align: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !35, file: !1, line: 126, baseType: !4, size: 32, align: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !6, line: 51, baseType: !51)
!51 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !44, line: 267, baseType: !7)
!54 = !{!55, !195, !200, !201, !202, !205, !208, !209, !212, !215, !216, !219, !222, !225, !226, !229, !230, !233, !234, !235, !236}
!55 = distinct !DISubprogram(name: "cm_zlib__tr_init", scope: !1, file: !1, line: 382, type: !56, isLocal: false, isDefinition: true, scopeLine: 384, isOptimized: false, variables: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "deflate_state", file: !13, line: 263, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !13, line: 94, size: 47424, align: 64, elements: !61)
!61 = !{!62, !98, !99, !100, !101, !102, !103, !104, !123, !124, !125, !126, !127, !128, !129, !130, !131, !135, !136, !137, !138, !139, !140, !141, !142, !143, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !160, !164, !168, !169, !170, !171, !175, !177, !178, !179, !181, !184, !185, !186, !189, !190, !191, !192, !193, !194}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !60, file: !13, line: 95, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !64, line: 103, baseType: !65)
!64 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmzlib")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !64, line: 101, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !64, line: 82, size: 896, align: 64, elements: !68)
!68 = !{!69, !72, !74, !76, !77, !78, !79, !80, !82, !89, !94, !95, !96, !97}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !67, file: !64, line: 83, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !44, line: 276, baseType: !53)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !67, file: !64, line: 84, baseType: !73, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !44, line: 269, baseType: !10)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !67, file: !64, line: 85, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !44, line: 270, baseType: !51)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !67, file: !64, line: 87, baseType: !70, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !67, file: !64, line: 88, baseType: !73, size: 32, align: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !67, file: !64, line: 89, baseType: !75, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !67, file: !64, line: 91, baseType: !48, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !67, file: !64, line: 92, baseType: !81, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !67, file: !64, line: 94, baseType: !83, size: 64, align: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !64, line: 77, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !87, !73, !73}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !44, line: 285, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !67, file: !64, line: 95, baseType: !90, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !64, line: 78, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !87, !87}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !67, file: !64, line: 96, baseType: !87, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !67, file: !64, line: 98, baseType: !4, size: 32, align: 32, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !67, file: !64, line: 99, baseType: !75, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !67, file: !64, line: 100, baseType: !75, size: 64, align: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !60, file: !13, line: 96, baseType: !4, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf", scope: !60, file: !13, line: 97, baseType: !70, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf_size", scope: !60, file: !13, line: 98, baseType: !50, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pending_out", scope: !60, file: !13, line: 99, baseType: !70, size: 64, align: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !60, file: !13, line: 100, baseType: !73, size: 32, align: 32, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !60, file: !13, line: 101, baseType: !4, size: 32, align: 32, offset: 352)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "gzhead", scope: !60, file: !13, line: 102, baseType: !105, size: 64, align: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !64, line: 126, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !64, line: 124, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !64, line: 109, size: 640, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !108, file: !64, line: 110, baseType: !4, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !108, file: !64, line: 111, baseType: !75, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !108, file: !64, line: 112, baseType: !4, size: 32, align: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !108, file: !64, line: 113, baseType: !4, size: 32, align: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !108, file: !64, line: 114, baseType: !70, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !108, file: !64, line: 115, baseType: !73, size: 32, align: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !108, file: !64, line: 116, baseType: !73, size: 32, align: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !64, line: 117, baseType: !70, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !108, file: !64, line: 118, baseType: !73, size: 32, align: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !108, file: !64, line: 119, baseType: !70, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !108, file: !64, line: 120, baseType: !73, size: 32, align: 32, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !108, file: !64, line: 121, baseType: !4, size: 32, align: 32, offset: 544)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !108, file: !64, line: 122, baseType: !4, size: 32, align: 32, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "gzindex", scope: !60, file: !13, line: 103, baseType: !73, size: 32, align: 32, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !60, file: !13, line: 104, baseType: !53, size: 8, align: 8, offset: 480)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "last_flush", scope: !60, file: !13, line: 105, baseType: !4, size: 32, align: 32, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "w_size", scope: !60, file: !13, line: 109, baseType: !73, size: 32, align: 32, offset: 544)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "w_bits", scope: !60, file: !13, line: 110, baseType: !73, size: 32, align: 32, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "w_mask", scope: !60, file: !13, line: 111, baseType: !73, size: 32, align: 32, offset: 608)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !60, file: !13, line: 113, baseType: !70, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !60, file: !13, line: 123, baseType: !50, size: 64, align: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !60, file: !13, line: 128, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "Posf", file: !13, line: 87, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !13, line: 86, baseType: !8)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !60, file: !13, line: 134, baseType: !132, size: 64, align: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ins_h", scope: !60, file: !13, line: 136, baseType: !73, size: 32, align: 32, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !60, file: !13, line: 137, baseType: !73, size: 32, align: 32, offset: 928)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !60, file: !13, line: 138, baseType: !73, size: 32, align: 32, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !60, file: !13, line: 139, baseType: !73, size: 32, align: 32, offset: 992)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hash_shift", scope: !60, file: !13, line: 141, baseType: !73, size: 32, align: 32, offset: 1024)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !60, file: !13, line: 148, baseType: !52, size: 64, align: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "match_length", scope: !60, file: !13, line: 153, baseType: !73, size: 32, align: 32, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev_match", scope: !60, file: !13, line: 154, baseType: !144, size: 32, align: 32, offset: 1184)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !13, line: 88, baseType: !10)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "match_available", scope: !60, file: !13, line: 155, baseType: !4, size: 32, align: 32, offset: 1216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "strstart", scope: !60, file: !13, line: 156, baseType: !73, size: 32, align: 32, offset: 1248)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "match_start", scope: !60, file: !13, line: 157, baseType: !73, size: 32, align: 32, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead", scope: !60, file: !13, line: 158, baseType: !73, size: 32, align: 32, offset: 1312)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev_length", scope: !60, file: !13, line: 160, baseType: !73, size: 32, align: 32, offset: 1344)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain_length", scope: !60, file: !13, line: 165, baseType: !73, size: 32, align: 32, offset: 1376)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy_match", scope: !60, file: !13, line: 171, baseType: !73, size: 32, align: 32, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !60, file: !13, line: 182, baseType: !4, size: 32, align: 32, offset: 1440)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !60, file: !13, line: 183, baseType: !4, size: 32, align: 32, offset: 1472)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "good_match", scope: !60, file: !13, line: 185, baseType: !73, size: 32, align: 32, offset: 1504)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nice_match", scope: !60, file: !13, line: 188, baseType: !4, size: 32, align: 32, offset: 1536)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_ltree", scope: !60, file: !13, line: 192, baseType: !157, size: 18336, align: 16, offset: 1568)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 18336, align: 16, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 573)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dtree", scope: !60, file: !13, line: 193, baseType: !161, size: 1952, align: 16, offset: 19904)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1952, align: 16, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 61)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bl_tree", scope: !60, file: !13, line: 194, baseType: !165, size: 1248, align: 16, offset: 21856)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1248, align: 16, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 39)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "l_desc", scope: !60, file: !13, line: 196, baseType: !14, size: 192, align: 64, offset: 23104)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "d_desc", scope: !60, file: !13, line: 197, baseType: !14, size: 192, align: 64, offset: 23296)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bl_desc", scope: !60, file: !13, line: 198, baseType: !14, size: 192, align: 64, offset: 23488)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bl_count", scope: !60, file: !13, line: 200, baseType: !172, size: 256, align: 16, offset: 23680)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, align: 16, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !60, file: !13, line: 203, baseType: !176, size: 18336, align: 32, offset: 23936)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 18336, align: 32, elements: !158)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "heap_len", scope: !60, file: !13, line: 204, baseType: !4, size: 32, align: 32, offset: 42272)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "heap_max", scope: !60, file: !13, line: 205, baseType: !4, size: 32, align: 32, offset: 42304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !60, file: !13, line: 210, baseType: !180, size: 4584, align: 8, offset: 42336)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 4584, align: 8, elements: !158)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "l_buf", scope: !60, file: !13, line: 214, baseType: !182, size: 64, align: 64, offset: 46976)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchf", file: !6, line: 48, baseType: !5)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lit_bufsize", scope: !60, file: !13, line: 216, baseType: !73, size: 32, align: 32, offset: 47040)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "last_lit", scope: !60, file: !13, line: 236, baseType: !73, size: 32, align: 32, offset: 47072)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "d_buf", scope: !60, file: !13, line: 238, baseType: !187, size: 64, align: 64, offset: 47104)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ushf", file: !6, line: 50, baseType: !8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !60, file: !13, line: 244, baseType: !50, size: 64, align: 64, offset: 47168)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "static_len", scope: !60, file: !13, line: 245, baseType: !50, size: 64, align: 64, offset: 47232)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !60, file: !13, line: 246, baseType: !73, size: 32, align: 32, offset: 47296)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "last_eob_len", scope: !60, file: !13, line: 247, baseType: !4, size: 32, align: 32, offset: 47328)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bi_buf", scope: !60, file: !13, line: 254, baseType: !8, size: 16, align: 16, offset: 47360)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bi_valid", scope: !60, file: !13, line: 258, baseType: !4, size: 32, align: 32, offset: 47392)
!195 = distinct !DISubprogram(name: "cm_zlib__tr_stored_block", scope: !1, file: !1, line: 867, type: !196, isLocal: false, isDefinition: true, scopeLine: 872, isOptimized: false, variables: !2)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !58, !198, !50, !4}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "charf", file: !44, line: 278, baseType: !49)
!200 = distinct !DISubprogram(name: "cm_zlib__tr_align", scope: !1, file: !1, line: 892, type: !56, isLocal: false, isDefinition: true, scopeLine: 894, isOptimized: false, variables: !2)
!201 = distinct !DISubprogram(name: "cm_zlib__tr_flush_block", scope: !1, file: !1, line: 921, type: !196, isLocal: false, isDefinition: true, scopeLine: 926, isOptimized: false, variables: !2)
!202 = distinct !DISubprogram(name: "cm_zlib__tr_tally", scope: !1, file: !1, line: 1022, type: !203, isLocal: false, isDefinition: true, scopeLine: 1026, isOptimized: false, variables: !2)
!203 = !DISubroutineType(types: !204)
!204 = !{!4, !58, !10, !10}
!205 = distinct !DISubprogram(name: "tr_static_init", scope: !1, file: !1, line: 238, type: !206, isLocal: true, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = distinct !DISubprogram(name: "init_block", scope: !1, file: !1, line: 411, type: !56, isLocal: true, isDefinition: true, scopeLine: 413, isOptimized: false, variables: !2)
!209 = distinct !DISubprogram(name: "build_tree", scope: !1, file: !1, line: 619, type: !210, isLocal: true, isDefinition: true, scopeLine: 622, isOptimized: false, variables: !2)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !58, !11}
!212 = distinct !DISubprogram(name: "pqdownheap", scope: !1, file: !1, line: 455, type: !213, isLocal: true, isDefinition: true, scopeLine: 459, isOptimized: false, variables: !2)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !58, !17, !4}
!215 = distinct !DISubprogram(name: "gen_bitlen", scope: !1, file: !1, line: 490, type: !210, isLocal: true, isDefinition: true, scopeLine: 493, isOptimized: false, variables: !2)
!216 = distinct !DISubprogram(name: "gen_codes", scope: !1, file: !1, line: 577, type: !217, isLocal: true, isDefinition: true, scopeLine: 581, isOptimized: false, variables: !2)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !17, !4, !187}
!219 = distinct !DISubprogram(name: "bi_reverse", scope: !1, file: !1, line: 1146, type: !220, isLocal: true, isDefinition: true, scopeLine: 1149, isOptimized: false, variables: !2)
!220 = !DISubroutineType(types: !221)
!221 = !{!10, !10, !4}
!222 = distinct !DISubprogram(name: "build_bl_tree", scope: !1, file: !1, line: 803, type: !223, isLocal: true, isDefinition: true, scopeLine: 805, isOptimized: false, variables: !2)
!223 = !DISubroutineType(types: !224)
!224 = !{!4, !58}
!225 = distinct !DISubprogram(name: "scan_tree", scope: !1, file: !1, line: 707, type: !213, isLocal: true, isDefinition: true, scopeLine: 711, isOptimized: false, variables: !2)
!226 = distinct !DISubprogram(name: "send_all_trees", scope: !1, file: !1, line: 838, type: !227, isLocal: true, isDefinition: true, scopeLine: 841, isOptimized: false, variables: !2)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !58, !4, !4, !4}
!229 = distinct !DISubprogram(name: "send_tree", scope: !1, file: !1, line: 752, type: !213, isLocal: true, isDefinition: true, scopeLine: 756, isOptimized: false, variables: !2)
!230 = distinct !DISubprogram(name: "compress_block", scope: !1, file: !1, line: 1072, type: !231, isLocal: true, isDefinition: true, scopeLine: 1076, isOptimized: false, variables: !2)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !58, !17, !17}
