; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/alone_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i32, i8, i64, i64, i64, i64, %struct.lzma_options_lzma }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_filter_info_s = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !190, subprograms: !191, globals: !227)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/alone_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !133, !140, !158, !69, !86, !172}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 21, size: 32, align: 32, elements: !166)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 18, size: 1728, align: 64, elements: !20)
!20 = !{!21, !111, !112, !114, !115, !116, !117, !118}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !1, line: 19, baseType: !22, size: 512, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !23, line: 75, baseType: !24)
!23 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !23, line: 119, size: 512, align: 64, elements: !25)
!25 = !{!26, !29, !35, !37, !75, !80, !94, !99}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !24, file: !23, line: 121, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !23, line: 73, baseType: !19)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !24, file: !23, line: 125, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !31, line: 63, baseType: !32)
!31 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !24, file: !23, line: 131, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 122, baseType: !34)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !24, file: !23, line: 134, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !23, line: 89, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !27, !43, !59, !64, !52, !66, !64, !52, !68}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !46)
!46 = !{!47, !54, !58}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !45, file: !4, line: 376, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !51, !52, !52}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 62, baseType: !34)
!53 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !45, file: !4, line: 390, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !51, !51}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !45, file: !4, line: 401, baseType: !51, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!72 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!73 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!74 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !24, file: !23, line: 139, baseType: !76, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !23, line: 97, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !27, !43}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !24, file: !23, line: 143, baseType: !81, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !92}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !85, line: 55, baseType: !86)
!85 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 27, size: 32, align: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!89 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!90 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!91 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !24, file: !23, line: 147, baseType: !95, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!42, !27, !98, !98, !32}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !24, file: !23, line: 152, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!42, !27, !43, !103, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !106, line: 65, baseType: !107)
!106 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!107 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 43, size: 128, align: 64, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !106, line: 54, baseType: !30, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !106, line: 63, baseType: !51, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 27, baseType: !18, size: 32, align: 32, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "picky", scope: !19, file: !1, line: 32, baseType: !113, size: 8, align: 8, offset: 544)
!113 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !1, line: 35, baseType: !52, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !19, file: !1, line: 38, baseType: !30, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !19, file: !1, line: 41, baseType: !32, size: 64, align: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !19, file: !1, line: 44, baseType: !32, size: 64, align: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !19, file: !1, line: 48, baseType: !119, size: 896, align: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !120, line: 399, baseType: !121)
!120 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 185, size: 896, align: 64, elements: !122)
!122 = !{!123, !126, !127, !128, !129, !130, !131, !137, !138, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !161, !162, !163, !164, !165}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !121, file: !120, line: 217, baseType: !124, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !125)
!125 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !121, file: !120, line: 240, baseType: !60, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !121, file: !120, line: 254, baseType: !124, size: 32, align: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !121, file: !120, line: 281, baseType: !124, size: 32, align: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !121, file: !120, line: 293, baseType: !124, size: 32, align: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !121, file: !120, line: 316, baseType: !124, size: 32, align: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !121, file: !120, line: 322, baseType: !132, size: 32, align: 32, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !120, line: 155, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 138, size: 32, align: 32, elements: !134)
!134 = !{!135, !136}
!135 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!136 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !121, file: !120, line: 342, baseType: !124, size: 32, align: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !121, file: !120, line: 345, baseType: !139, size: 32, align: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !120, line: 111, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 58, size: 32, align: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146}
!142 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!143 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!144 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!145 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!146 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !121, file: !120, line: 375, baseType: !124, size: 32, align: 32, offset: 352)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !121, file: !120, line: 384, baseType: !124, size: 32, align: 32, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !121, file: !120, line: 385, baseType: !124, size: 32, align: 32, offset: 416)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !121, file: !120, line: 386, baseType: !124, size: 32, align: 32, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !121, file: !120, line: 387, baseType: !124, size: 32, align: 32, offset: 480)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !121, file: !120, line: 388, baseType: !124, size: 32, align: 32, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !121, file: !120, line: 389, baseType: !124, size: 32, align: 32, offset: 544)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !121, file: !120, line: 390, baseType: !124, size: 32, align: 32, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !121, file: !120, line: 391, baseType: !124, size: 32, align: 32, offset: 608)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !121, file: !120, line: 392, baseType: !157, size: 32, align: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !158)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !159)
!159 = !{!160}
!160 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !121, file: !120, line: 393, baseType: !157, size: 32, align: 32, offset: 672)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !121, file: !120, line: 394, baseType: !157, size: 32, align: 32, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !121, file: !120, line: 395, baseType: !157, size: 32, align: 32, offset: 736)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !121, file: !120, line: 396, baseType: !51, size: 64, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !121, file: !120, line: 397, baseType: !51, size: 64, align: 64, offset: 832)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIEnumerator(name: "SEQ_PROPERTIES", value: 0)
!168 = !DIEnumerator(name: "SEQ_DICTIONARY_SIZE", value: 1)
!169 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_SIZE", value: 2)
!170 = !DIEnumerator(name: "SEQ_CODER_INIT", value: 3)
!171 = !DIEnumerator(name: "SEQ_CODE", value: 4)
!172 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !173, file: !23, line: 182, size: 32, align: 32, elements: !183)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !23, line: 174, size: 704, align: 64, elements: !174)
!174 = !{!175, !176, !177, !178, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !23, line: 176, baseType: !22, size: 512, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !173, file: !23, line: 189, baseType: !172, size: 32, align: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !173, file: !23, line: 194, baseType: !52, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !173, file: !23, line: 197, baseType: !179, size: 32, align: 8, offset: 640)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 32, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 4)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !173, file: !23, line: 201, baseType: !113, size: 8, align: 8, offset: 672)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!185 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!186 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!187 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!188 = !DIEnumerator(name: "ISEQ_END", value: 4)
!189 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!190 = !{!36, !51, !52, !30}
!191 = !{!192, !197, !224, !225, !226}
!192 = distinct !DISubprogram(name: "lzma_alone_decoder_init", scope: !1, file: !1, line: 194, type: !193, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, variables: !196)
!193 = !DISubroutineType(types: !194)
!194 = !{!42, !195, !43, !32, !113}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!196 = !{}
!197 = distinct !DISubprogram(name: "lzma_alone_decoder", scope: !1, file: !1, line: 228, type: !198, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, variables: !196)
!198 = !DISubroutineType(types: !199)
!199 = !{!42, !200, !32}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !202, file: !4, line: 454, baseType: !60, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !202, file: !4, line: 455, baseType: !52, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !202, file: !4, line: 456, baseType: !32, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !202, file: !4, line: 458, baseType: !67, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !202, file: !4, line: 459, baseType: !52, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !202, file: !4, line: 460, baseType: !32, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !202, file: !4, line: 468, baseType: !43, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !202, file: !4, line: 471, baseType: !212, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !173)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !202, file: !4, line: 479, baseType: !51, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !202, file: !4, line: 480, baseType: !51, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !202, file: !4, line: 481, baseType: !51, size: 64, align: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !202, file: !4, line: 482, baseType: !51, size: 64, align: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !202, file: !4, line: 483, baseType: !32, size: 64, align: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !202, file: !4, line: 484, baseType: !32, size: 64, align: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !202, file: !4, line: 485, baseType: !52, size: 64, align: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !202, file: !4, line: 486, baseType: !52, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !202, file: !4, line: 487, baseType: !157, size: 32, align: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !202, file: !4, line: 488, baseType: !157, size: 32, align: 32, offset: 1056)
!224 = distinct !DISubprogram(name: "alone_decode", scope: !1, file: !1, line: 53, type: !40, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, variables: !196)
!225 = distinct !DISubprogram(name: "alone_decoder_end", scope: !1, file: !1, line: 167, type: !78, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, variables: !196)
!226 = distinct !DISubprogram(name: "alone_decoder_memconfig", scope: !1, file: !1, line: 176, type: !96, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, variables: !196)
!227 = !{!228}
!228 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !23, line: 159, type: !229, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!230 = !{i32 2, !"Dwarf Version", i32 4}
!231 = !{i32 2, !"Debug Info Version", i32 3}
!232 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!233 = !DILocalVariable(name: "next", arg: 1, scope: !192, file: !1, line: 194, type: !195)
!234 = !DIExpression()
!235 = !DILocation(line: 194, column: 42, scope: !192)
!236 = !DILocalVariable(name: "allocator", arg: 2, scope: !192, file: !1, line: 194, type: !43)
!237 = !DILocation(line: 194, column: 64, scope: !192)
!238 = !DILocalVariable(name: "memlimit", arg: 3, scope: !192, file: !1, line: 195, type: !32)
!239 = !DILocation(line: 195, column: 12, scope: !192)
!240 = !DILocalVariable(name: "picky", arg: 4, scope: !192, file: !1, line: 195, type: !113)
!241 = !DILocation(line: 195, column: 27, scope: !192)
!242 = !DILocation(line: 197, column: 2, scope: !192)
!243 = !DILocation(line: 197, column: 2, scope: !244)
!244 = !DILexicalBlockFile(scope: !245, file: !1, discriminator: 1)
!245 = distinct !DILexicalBlock(scope: !246, file: !1, line: 197, column: 2)
!246 = distinct !DILexicalBlock(scope: !192, file: !1, line: 197, column: 2)
!247 = !DILocation(line: 197, column: 2, scope: !248)
!248 = !DILexicalBlockFile(scope: !245, file: !1, discriminator: 2)
!249 = !DILocation(line: 197, column: 2, scope: !250)
!250 = !DILexicalBlockFile(scope: !246, file: !1, discriminator: 3)
!251 = !DILocation(line: 199, column: 6, scope: !252)
!252 = distinct !DILexicalBlock(scope: !192, file: !1, line: 199, column: 6)
!253 = !DILocation(line: 199, column: 15, scope: !252)
!254 = !DILocation(line: 199, column: 6, scope: !192)
!255 = !DILocation(line: 200, column: 3, scope: !252)
!256 = !DILocation(line: 202, column: 6, scope: !257)
!257 = distinct !DILexicalBlock(scope: !192, file: !1, line: 202, column: 6)
!258 = !DILocation(line: 202, column: 12, scope: !257)
!259 = !DILocation(line: 202, column: 18, scope: !257)
!260 = !DILocation(line: 202, column: 6, scope: !192)
!261 = !DILocation(line: 203, column: 48, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !1, line: 202, column: 27)
!263 = !DILocation(line: 203, column: 17, scope: !262)
!264 = !DILocation(line: 203, column: 3, scope: !262)
!265 = !DILocation(line: 203, column: 9, scope: !262)
!266 = !DILocation(line: 203, column: 15, scope: !262)
!267 = !DILocation(line: 204, column: 7, scope: !268)
!268 = distinct !DILexicalBlock(scope: !262, file: !1, line: 204, column: 7)
!269 = !DILocation(line: 204, column: 13, scope: !268)
!270 = !DILocation(line: 204, column: 19, scope: !268)
!271 = !DILocation(line: 204, column: 7, scope: !262)
!272 = !DILocation(line: 205, column: 4, scope: !268)
!273 = !DILocation(line: 207, column: 3, scope: !262)
!274 = !DILocation(line: 207, column: 9, scope: !262)
!275 = !DILocation(line: 207, column: 14, scope: !262)
!276 = !DILocation(line: 208, column: 3, scope: !262)
!277 = !DILocation(line: 208, column: 9, scope: !262)
!278 = !DILocation(line: 208, column: 13, scope: !262)
!279 = !DILocation(line: 209, column: 3, scope: !262)
!280 = !DILocation(line: 209, column: 9, scope: !262)
!281 = !DILocation(line: 209, column: 19, scope: !262)
!282 = !DILocation(line: 210, column: 3, scope: !262)
!283 = !DILocation(line: 210, column: 9, scope: !262)
!284 = !DILocation(line: 210, column: 16, scope: !262)
!285 = !DILocation(line: 210, column: 23, scope: !262)
!286 = !DILocation(line: 211, column: 2, scope: !262)
!287 = !DILocation(line: 213, column: 2, scope: !192)
!288 = !DILocation(line: 213, column: 8, scope: !192)
!289 = !DILocation(line: 213, column: 15, scope: !192)
!290 = !DILocation(line: 213, column: 24, scope: !192)
!291 = !DILocation(line: 214, column: 23, scope: !192)
!292 = !DILocation(line: 214, column: 2, scope: !192)
!293 = !DILocation(line: 214, column: 8, scope: !192)
!294 = !DILocation(line: 214, column: 15, scope: !192)
!295 = !DILocation(line: 214, column: 21, scope: !192)
!296 = !DILocation(line: 215, column: 2, scope: !192)
!297 = !DILocation(line: 215, column: 8, scope: !192)
!298 = !DILocation(line: 215, column: 15, scope: !192)
!299 = !DILocation(line: 215, column: 19, scope: !192)
!300 = !DILocation(line: 216, column: 2, scope: !192)
!301 = !DILocation(line: 216, column: 8, scope: !192)
!302 = !DILocation(line: 216, column: 15, scope: !192)
!303 = !DILocation(line: 216, column: 23, scope: !192)
!304 = !DILocation(line: 216, column: 33, scope: !192)
!305 = !DILocation(line: 217, column: 2, scope: !192)
!306 = !DILocation(line: 217, column: 8, scope: !192)
!307 = !DILocation(line: 217, column: 15, scope: !192)
!308 = !DILocation(line: 217, column: 23, scope: !192)
!309 = !DILocation(line: 217, column: 35, scope: !192)
!310 = !DILocation(line: 218, column: 2, scope: !192)
!311 = !DILocation(line: 218, column: 8, scope: !192)
!312 = !DILocation(line: 218, column: 15, scope: !192)
!313 = !DILocation(line: 218, column: 23, scope: !192)
!314 = !DILocation(line: 218, column: 40, scope: !192)
!315 = !DILocation(line: 219, column: 2, scope: !192)
!316 = !DILocation(line: 219, column: 8, scope: !192)
!317 = !DILocation(line: 219, column: 15, scope: !192)
!318 = !DILocation(line: 219, column: 33, scope: !192)
!319 = !DILocation(line: 220, column: 26, scope: !192)
!320 = !DILocation(line: 220, column: 2, scope: !192)
!321 = !DILocation(line: 220, column: 8, scope: !192)
!322 = !DILocation(line: 220, column: 15, scope: !192)
!323 = !DILocation(line: 220, column: 24, scope: !192)
!324 = !DILocation(line: 221, column: 2, scope: !192)
!325 = !DILocation(line: 221, column: 8, scope: !192)
!326 = !DILocation(line: 221, column: 15, scope: !192)
!327 = !DILocation(line: 221, column: 24, scope: !192)
!328 = !DILocation(line: 223, column: 2, scope: !192)
!329 = !DILocation(line: 224, column: 1, scope: !192)
!330 = !DILocalVariable(name: "coder", arg: 1, scope: !224, file: !1, line: 53, type: !27)
!331 = !DILocation(line: 53, column: 26, scope: !224)
!332 = !DILocalVariable(name: "allocator", arg: 2, scope: !224, file: !1, line: 54, type: !43)
!333 = !DILocation(line: 54, column: 19, scope: !224)
!334 = !DILocalVariable(name: "in", arg: 3, scope: !224, file: !1, line: 55, type: !59)
!335 = !DILocation(line: 55, column: 32, scope: !224)
!336 = !DILocalVariable(name: "in_pos", arg: 4, scope: !224, file: !1, line: 55, type: !64)
!337 = !DILocation(line: 55, column: 58, scope: !224)
!338 = !DILocalVariable(name: "in_size", arg: 5, scope: !224, file: !1, line: 56, type: !52)
!339 = !DILocation(line: 56, column: 10, scope: !224)
!340 = !DILocalVariable(name: "out", arg: 6, scope: !224, file: !1, line: 56, type: !66)
!341 = !DILocation(line: 56, column: 42, scope: !224)
!342 = !DILocalVariable(name: "out_pos", arg: 7, scope: !224, file: !1, line: 57, type: !64)
!343 = !DILocation(line: 57, column: 25, scope: !224)
!344 = !DILocalVariable(name: "out_size", arg: 8, scope: !224, file: !1, line: 57, type: !52)
!345 = !DILocation(line: 57, column: 41, scope: !224)
!346 = !DILocalVariable(name: "action", arg: 9, scope: !224, file: !1, line: 58, type: !68)
!347 = !DILocation(line: 58, column: 15, scope: !224)
!348 = !DILocation(line: 60, column: 2, scope: !224)
!349 = !DILocation(line: 60, column: 10, scope: !350)
!350 = !DILexicalBlockFile(scope: !224, file: !1, discriminator: 1)
!351 = !DILocation(line: 60, column: 9, scope: !350)
!352 = !DILocation(line: 60, column: 20, scope: !350)
!353 = !DILocation(line: 60, column: 18, scope: !350)
!354 = !DILocation(line: 61, column: 4, scope: !224)
!355 = !DILocation(line: 61, column: 8, scope: !350)
!356 = !DILocation(line: 61, column: 15, scope: !350)
!357 = !DILocation(line: 61, column: 24, scope: !350)
!358 = !DILocation(line: 61, column: 36, scope: !350)
!359 = !DILocation(line: 61, column: 40, scope: !360)
!360 = !DILexicalBlockFile(scope: !224, file: !1, discriminator: 2)
!361 = !DILocation(line: 61, column: 39, scope: !360)
!362 = !DILocation(line: 61, column: 49, scope: !360)
!363 = !DILocation(line: 61, column: 47, scope: !360)
!364 = !DILocation(line: 61, column: 36, scope: !360)
!365 = !DILocation(line: 60, column: 2, scope: !360)
!366 = !DILocation(line: 62, column: 10, scope: !224)
!367 = !DILocation(line: 62, column: 17, scope: !224)
!368 = !DILocation(line: 62, column: 2, scope: !224)
!369 = !DILocation(line: 64, column: 32, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !1, line: 64, column: 7)
!371 = distinct !DILexicalBlock(scope: !224, file: !1, line: 62, column: 27)
!372 = !DILocation(line: 64, column: 39, scope: !370)
!373 = !DILocation(line: 64, column: 52, scope: !370)
!374 = !DILocation(line: 64, column: 51, scope: !370)
!375 = !DILocation(line: 64, column: 48, scope: !370)
!376 = !DILocation(line: 64, column: 7, scope: !370)
!377 = !DILocation(line: 64, column: 7, scope: !371)
!378 = !DILocation(line: 65, column: 4, scope: !370)
!379 = !DILocation(line: 67, column: 3, scope: !371)
!380 = !DILocation(line: 67, column: 10, scope: !371)
!381 = !DILocation(line: 67, column: 19, scope: !371)
!382 = !DILocation(line: 68, column: 6, scope: !371)
!383 = !DILocation(line: 68, column: 3, scope: !371)
!384 = !DILocation(line: 69, column: 3, scope: !371)
!385 = !DILocation(line: 73, column: 21, scope: !371)
!386 = !DILocation(line: 73, column: 20, scope: !371)
!387 = !DILocation(line: 73, column: 17, scope: !371)
!388 = !DILocation(line: 73, column: 8, scope: !371)
!389 = !DILocation(line: 73, column: 34, scope: !371)
!390 = !DILocation(line: 73, column: 41, scope: !371)
!391 = !DILocation(line: 73, column: 45, scope: !371)
!392 = !DILocation(line: 73, column: 30, scope: !371)
!393 = !DILocation(line: 72, column: 3, scope: !371)
!394 = !DILocation(line: 72, column: 10, scope: !371)
!395 = !DILocation(line: 72, column: 18, scope: !371)
!396 = !DILocation(line: 73, column: 5, scope: !371)
!397 = !DILocation(line: 75, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !371, file: !1, line: 75, column: 7)
!399 = !DILocation(line: 75, column: 16, scope: !398)
!400 = !DILocation(line: 75, column: 7, scope: !398)
!401 = !DILocation(line: 75, column: 20, scope: !398)
!402 = !DILocation(line: 75, column: 7, scope: !371)
!403 = !DILocation(line: 76, column: 8, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !1, line: 76, column: 8)
!405 = distinct !DILexicalBlock(scope: !398, file: !1, line: 75, column: 26)
!406 = !DILocation(line: 76, column: 15, scope: !404)
!407 = !DILocation(line: 76, column: 21, scope: !404)
!408 = !DILocation(line: 76, column: 24, scope: !409)
!409 = !DILexicalBlockFile(scope: !404, file: !1, discriminator: 1)
!410 = !DILocation(line: 76, column: 31, scope: !409)
!411 = !DILocation(line: 76, column: 39, scope: !409)
!412 = !DILocation(line: 77, column: 6, scope: !404)
!413 = !DILocation(line: 76, column: 8, scope: !409)
!414 = !DILocalVariable(name: "d", scope: !415, file: !1, line: 83, type: !124)
!415 = distinct !DILexicalBlock(scope: !404, file: !1, line: 77, column: 21)
!416 = !DILocation(line: 83, column: 14, scope: !415)
!417 = !DILocation(line: 83, column: 18, scope: !415)
!418 = !DILocation(line: 83, column: 25, scope: !415)
!419 = !DILocation(line: 83, column: 33, scope: !415)
!420 = !DILocation(line: 83, column: 43, scope: !415)
!421 = !DILocation(line: 84, column: 10, scope: !415)
!422 = !DILocation(line: 84, column: 12, scope: !415)
!423 = !DILocation(line: 84, column: 7, scope: !415)
!424 = !DILocation(line: 85, column: 10, scope: !415)
!425 = !DILocation(line: 85, column: 12, scope: !415)
!426 = !DILocation(line: 85, column: 7, scope: !415)
!427 = !DILocation(line: 86, column: 10, scope: !415)
!428 = !DILocation(line: 86, column: 12, scope: !415)
!429 = !DILocation(line: 86, column: 7, scope: !415)
!430 = !DILocation(line: 87, column: 10, scope: !415)
!431 = !DILocation(line: 87, column: 12, scope: !415)
!432 = !DILocation(line: 87, column: 7, scope: !415)
!433 = !DILocation(line: 88, column: 10, scope: !415)
!434 = !DILocation(line: 88, column: 12, scope: !415)
!435 = !DILocation(line: 88, column: 7, scope: !415)
!436 = !DILocation(line: 89, column: 5, scope: !415)
!437 = !DILocation(line: 91, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !415, file: !1, line: 91, column: 9)
!439 = !DILocation(line: 91, column: 14, scope: !438)
!440 = !DILocation(line: 91, column: 21, scope: !438)
!441 = !DILocation(line: 91, column: 29, scope: !438)
!442 = !DILocation(line: 91, column: 11, scope: !438)
!443 = !DILocation(line: 91, column: 9, scope: !415)
!444 = !DILocation(line: 92, column: 6, scope: !438)
!445 = !DILocation(line: 93, column: 4, scope: !415)
!446 = !DILocation(line: 95, column: 4, scope: !405)
!447 = !DILocation(line: 95, column: 11, scope: !405)
!448 = !DILocation(line: 95, column: 15, scope: !405)
!449 = !DILocation(line: 96, column: 4, scope: !405)
!450 = !DILocation(line: 96, column: 11, scope: !405)
!451 = !DILocation(line: 96, column: 20, scope: !405)
!452 = !DILocation(line: 97, column: 3, scope: !405)
!453 = !DILocation(line: 99, column: 6, scope: !371)
!454 = !DILocation(line: 99, column: 3, scope: !371)
!455 = !DILocation(line: 100, column: 3, scope: !371)
!456 = !DILocation(line: 104, column: 23, scope: !371)
!457 = !DILocation(line: 104, column: 22, scope: !371)
!458 = !DILocation(line: 104, column: 19, scope: !371)
!459 = !DILocation(line: 104, column: 8, scope: !371)
!460 = !DILocation(line: 104, column: 36, scope: !371)
!461 = !DILocation(line: 104, column: 43, scope: !371)
!462 = !DILocation(line: 104, column: 47, scope: !371)
!463 = !DILocation(line: 104, column: 32, scope: !371)
!464 = !DILocation(line: 103, column: 3, scope: !371)
!465 = !DILocation(line: 103, column: 10, scope: !371)
!466 = !DILocation(line: 104, column: 5, scope: !371)
!467 = !DILocation(line: 105, column: 6, scope: !371)
!468 = !DILocation(line: 105, column: 3, scope: !371)
!469 = !DILocation(line: 106, column: 9, scope: !470)
!470 = distinct !DILexicalBlock(scope: !371, file: !1, line: 106, column: 7)
!471 = !DILocation(line: 106, column: 16, scope: !470)
!472 = !DILocation(line: 106, column: 7, scope: !470)
!473 = !DILocation(line: 106, column: 20, scope: !470)
!474 = !DILocation(line: 106, column: 7, scope: !371)
!475 = !DILocation(line: 107, column: 4, scope: !470)
!476 = !DILocation(line: 112, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !371, file: !1, line: 112, column: 7)
!478 = !DILocation(line: 112, column: 14, scope: !477)
!479 = !DILocation(line: 113, column: 5, scope: !477)
!480 = !DILocation(line: 113, column: 8, scope: !481)
!481 = !DILexicalBlockFile(scope: !477, file: !1, discriminator: 1)
!482 = !DILocation(line: 113, column: 15, scope: !481)
!483 = !DILocation(line: 113, column: 33, scope: !481)
!484 = !DILocation(line: 114, column: 5, scope: !477)
!485 = !DILocation(line: 114, column: 8, scope: !481)
!486 = !DILocation(line: 114, column: 15, scope: !481)
!487 = !DILocation(line: 115, column: 6, scope: !477)
!488 = !DILocation(line: 112, column: 7, scope: !489)
!489 = !DILexicalBlockFile(scope: !371, file: !1, discriminator: 1)
!490 = !DILocation(line: 116, column: 4, scope: !477)
!491 = !DILocation(line: 120, column: 49, scope: !371)
!492 = !DILocation(line: 120, column: 56, scope: !371)
!493 = !DILocation(line: 120, column: 48, scope: !371)
!494 = !DILocation(line: 120, column: 21, scope: !371)
!495 = !DILocation(line: 121, column: 5, scope: !371)
!496 = !DILocation(line: 120, column: 3, scope: !371)
!497 = !DILocation(line: 120, column: 10, scope: !371)
!498 = !DILocation(line: 120, column: 19, scope: !371)
!499 = !DILocation(line: 123, column: 3, scope: !371)
!500 = !DILocation(line: 123, column: 10, scope: !371)
!501 = !DILocation(line: 123, column: 14, scope: !371)
!502 = !DILocation(line: 124, column: 3, scope: !371)
!503 = !DILocation(line: 124, column: 10, scope: !371)
!504 = !DILocation(line: 124, column: 19, scope: !371)
!505 = !DILocalVariable(name: "ret", scope: !506, file: !1, line: 129, type: !42)
!506 = distinct !DILexicalBlock(scope: !371, file: !1, line: 128, column: 23)
!507 = !DILocation(line: 129, column: 12, scope: !506)
!508 = !DILocalVariable(name: "filters", scope: !506, file: !1, line: 131, type: !509)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 384, align: 64, elements: !522)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !23, line: 77, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !23, line: 104, size: 192, align: 64, elements: !512)
!512 = !{!513, !514, !521}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !511, file: !23, line: 107, baseType: !30, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !511, file: !23, line: 111, baseType: !515, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !23, line: 81, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!42, !195, !43, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !511, file: !23, line: 114, baseType: !51, size: 64, align: 64, offset: 128)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DILocation(line: 131, column: 20, scope: !506)
!525 = !DILocation(line: 131, column: 33, scope: !506)
!526 = !DILocation(line: 132, column: 4, scope: !506)
!527 = !DILocation(line: 132, column: 35, scope: !506)
!528 = !DILocation(line: 132, column: 42, scope: !506)
!529 = !DILocation(line: 132, column: 34, scope: !506)
!530 = !DILocation(line: 133, column: 4, scope: !506)
!531 = !DILocation(line: 136, column: 7, scope: !532)
!532 = distinct !DILexicalBlock(scope: !506, file: !1, line: 136, column: 7)
!533 = !DILocation(line: 136, column: 14, scope: !532)
!534 = !DILocation(line: 136, column: 25, scope: !532)
!535 = !DILocation(line: 136, column: 32, scope: !532)
!536 = !DILocation(line: 136, column: 23, scope: !532)
!537 = !DILocation(line: 136, column: 7, scope: !506)
!538 = !DILocation(line: 137, column: 4, scope: !532)
!539 = !DILocation(line: 139, column: 32, scope: !506)
!540 = !DILocation(line: 139, column: 39, scope: !506)
!541 = !DILocation(line: 140, column: 5, scope: !506)
!542 = !DILocation(line: 140, column: 16, scope: !506)
!543 = !DILocation(line: 139, column: 9, scope: !506)
!544 = !DILocation(line: 139, column: 7, scope: !506)
!545 = !DILocation(line: 141, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !506, file: !1, line: 141, column: 7)
!547 = !DILocation(line: 141, column: 11, scope: !546)
!548 = !DILocation(line: 141, column: 7, scope: !506)
!549 = !DILocation(line: 142, column: 11, scope: !546)
!550 = !DILocation(line: 142, column: 4, scope: !546)
!551 = !DILocation(line: 145, column: 32, scope: !506)
!552 = !DILocation(line: 145, column: 39, scope: !506)
!553 = !DILocation(line: 145, column: 44, scope: !506)
!554 = !DILocation(line: 146, column: 5, scope: !506)
!555 = !DILocation(line: 146, column: 12, scope: !506)
!556 = !DILocation(line: 145, column: 3, scope: !506)
!557 = !DILocation(line: 148, column: 3, scope: !506)
!558 = !DILocation(line: 148, column: 10, scope: !506)
!559 = !DILocation(line: 148, column: 19, scope: !506)
!560 = !DILocation(line: 149, column: 3, scope: !506)
!561 = !DILocation(line: 153, column: 10, scope: !562)
!562 = distinct !DILexicalBlock(scope: !371, file: !1, line: 152, column: 17)
!563 = !DILocation(line: 153, column: 17, scope: !562)
!564 = !DILocation(line: 153, column: 22, scope: !562)
!565 = !DILocation(line: 153, column: 27, scope: !562)
!566 = !DILocation(line: 153, column: 34, scope: !562)
!567 = !DILocation(line: 153, column: 39, scope: !562)
!568 = !DILocation(line: 154, column: 5, scope: !562)
!569 = !DILocation(line: 154, column: 16, scope: !562)
!570 = !DILocation(line: 154, column: 20, scope: !562)
!571 = !DILocation(line: 154, column: 28, scope: !562)
!572 = !DILocation(line: 155, column: 5, scope: !562)
!573 = !DILocation(line: 155, column: 10, scope: !562)
!574 = !DILocation(line: 155, column: 19, scope: !562)
!575 = !DILocation(line: 155, column: 29, scope: !562)
!576 = !DILocation(line: 153, column: 3, scope: !562)
!577 = !DILocation(line: 159, column: 3, scope: !371)
!578 = !DILocation(line: 60, column: 2, scope: !579)
!579 = !DILexicalBlockFile(scope: !224, file: !1, discriminator: 3)
!580 = !DILocation(line: 162, column: 2, scope: !224)
!581 = !DILocation(line: 163, column: 1, scope: !224)
!582 = !DILocalVariable(name: "coder", arg: 1, scope: !225, file: !1, line: 167, type: !27)
!583 = !DILocation(line: 167, column: 31, scope: !225)
!584 = !DILocalVariable(name: "allocator", arg: 2, scope: !225, file: !1, line: 167, type: !43)
!585 = !DILocation(line: 167, column: 54, scope: !225)
!586 = !DILocation(line: 169, column: 17, scope: !225)
!587 = !DILocation(line: 169, column: 24, scope: !225)
!588 = !DILocation(line: 169, column: 30, scope: !225)
!589 = !DILocation(line: 169, column: 2, scope: !225)
!590 = !DILocation(line: 170, column: 12, scope: !225)
