; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/alone_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i32, i64, [13 x i8] }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_filter_info_s = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !154, subprograms: !158, globals: !229)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/alone_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !69, !86, !120, !139, !142, !147}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 23, size: 32, align: 32, elements: !117)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 20, size: 768, align: 64, elements: !20)
!20 = !{!21, !111, !112, !113}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !1, line: 21, baseType: !22, size: 512, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !23, line: 75, baseType: !24)
!23 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !23, line: 119, size: 512, align: 64, elements: !25)
!25 = !{!26, !29, !35, !37, !75, !80, !94, !99}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !24, file: !23, line: 121, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !23, line: 73, baseType: !19)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !24, file: !23, line: 125, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !31, line: 63, baseType: !32)
!31 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !24, file: !23, line: 131, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 122, baseType: !34)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !24, file: !23, line: 134, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !23, line: 89, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !27, !43, !59, !64, !52, !66, !64, !52, !68}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !46)
!46 = !{!47, !54, !58}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !45, file: !4, line: 376, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !51, !52, !52}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 62, baseType: !34)
!53 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !45, file: !4, line: 390, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !51, !51}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !45, file: !4, line: 401, baseType: !51, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!72 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!73 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!74 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !24, file: !23, line: 139, baseType: !76, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !23, line: 97, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !27, !43}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !24, file: !23, line: 143, baseType: !81, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !92}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !85, line: 55, baseType: !86)
!85 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 27, size: 32, align: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!89 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!90 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!91 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !24, file: !23, line: 147, baseType: !95, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!42, !27, !98, !98, !32}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !24, file: !23, line: 152, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!42, !27, !43, !103, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !106, line: 65, baseType: !107)
!106 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!107 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 43, size: 128, align: 64, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !106, line: 54, baseType: !30, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !106, line: 63, baseType: !51, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 26, baseType: !18, size: 32, align: 32, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "header_pos", scope: !19, file: !1, line: 28, baseType: !52, size: 64, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !19, file: !1, line: 29, baseType: !114, size: 104, align: 8, offset: 640)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 104, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 13)
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "SEQ_HEADER", value: 0)
!119 = !DIEnumerator(name: "SEQ_CODE", value: 1)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !121, file: !23, line: 182, size: 32, align: 32, elements: !132)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !23, line: 174, size: 704, align: 64, elements: !122)
!122 = !{!123, !124, !125, !126, !131}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !23, line: 176, baseType: !22, size: 512, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !121, file: !23, line: 189, baseType: !120, size: 32, align: 32, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !121, file: !23, line: 194, baseType: !52, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !121, file: !23, line: 197, baseType: !127, size: 32, align: 8, offset: 640)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 32, align: 8, elements: !129)
!128 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!129 = !{!130}
!130 = !DISubrange(count: 4)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !121, file: !23, line: 201, baseType: !128, size: 8, align: 8, offset: 672)
!132 = !{!133, !134, !135, !136, !137, !138}
!133 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!134 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!135 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!136 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!137 = !DIEnumerator(name: "ISEQ_END", value: 4)
!138 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !140)
!140 = !{!141}
!141 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 138, size: 32, align: 32, elements: !144)
!143 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!144 = !{!145, !146}
!145 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!146 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 58, size: 32, align: 32, elements: !148)
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!150 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!151 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!152 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!153 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!154 = !{!51, !36, !155, !157}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !156)
!156 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!158 = !{!159, !219, !223, !224, !225}
!159 = distinct !DISubprogram(name: "lzma_alone_encoder", scope: !1, file: !1, line: 147, type: !160, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, variables: !218)
!160 = !DISubroutineType(types: !161)
!161 = !{!42, !162, !187}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !164, file: !4, line: 454, baseType: !60, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !164, file: !4, line: 455, baseType: !52, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !164, file: !4, line: 456, baseType: !32, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !164, file: !4, line: 458, baseType: !67, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !164, file: !4, line: 459, baseType: !52, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !164, file: !4, line: 460, baseType: !32, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !164, file: !4, line: 468, baseType: !43, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !164, file: !4, line: 471, baseType: !174, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !121)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !164, file: !4, line: 479, baseType: !51, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !164, file: !4, line: 480, baseType: !51, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !164, file: !4, line: 481, baseType: !51, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !164, file: !4, line: 482, baseType: !51, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !164, file: !4, line: 483, baseType: !32, size: 64, align: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !164, file: !4, line: 484, baseType: !32, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !164, file: !4, line: 485, baseType: !52, size: 64, align: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !164, file: !4, line: 486, baseType: !52, size: 64, align: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !164, file: !4, line: 487, baseType: !185, size: 32, align: 32, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !139)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !164, file: !4, line: 488, baseType: !185, size: 32, align: 32, offset: 1056)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !143, line: 399, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 185, size: 896, align: 64, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !200, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !190, file: !143, line: 217, baseType: !155, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !190, file: !143, line: 240, baseType: !60, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !190, file: !143, line: 254, baseType: !155, size: 32, align: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !190, file: !143, line: 281, baseType: !155, size: 32, align: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !190, file: !143, line: 293, baseType: !155, size: 32, align: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !190, file: !143, line: 316, baseType: !155, size: 32, align: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !190, file: !143, line: 322, baseType: !199, size: 32, align: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !143, line: 155, baseType: !142)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !190, file: !143, line: 342, baseType: !155, size: 32, align: 32, offset: 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !190, file: !143, line: 345, baseType: !202, size: 32, align: 32, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !143, line: 111, baseType: !147)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !190, file: !143, line: 375, baseType: !155, size: 32, align: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !190, file: !143, line: 384, baseType: !155, size: 32, align: 32, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !190, file: !143, line: 385, baseType: !155, size: 32, align: 32, offset: 416)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !190, file: !143, line: 386, baseType: !155, size: 32, align: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !190, file: !143, line: 387, baseType: !155, size: 32, align: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !190, file: !143, line: 388, baseType: !155, size: 32, align: 32, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !190, file: !143, line: 389, baseType: !155, size: 32, align: 32, offset: 544)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !190, file: !143, line: 390, baseType: !155, size: 32, align: 32, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !190, file: !143, line: 391, baseType: !155, size: 32, align: 32, offset: 608)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !190, file: !143, line: 392, baseType: !185, size: 32, align: 32, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !190, file: !143, line: 393, baseType: !185, size: 32, align: 32, offset: 672)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !190, file: !143, line: 394, baseType: !185, size: 32, align: 32, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !190, file: !143, line: 395, baseType: !185, size: 32, align: 32, offset: 736)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !190, file: !143, line: 396, baseType: !51, size: 64, align: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !190, file: !143, line: 397, baseType: !51, size: 64, align: 64, offset: 832)
!218 = !{}
!219 = distinct !DISubprogram(name: "alone_encoder_init", scope: !1, file: !1, line: 78, type: !220, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, variables: !218)
!220 = !DISubroutineType(types: !221)
!221 = !{!42, !222, !43, !187}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!223 = distinct !DISubprogram(name: "alone_encode", scope: !1, file: !1, line: 34, type: !40, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, variables: !218)
!224 = distinct !DISubprogram(name: "alone_encoder_end", scope: !1, file: !1, line: 68, type: !78, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, variables: !218)
!225 = distinct !DISubprogram(name: "write32ne", scope: !226, file: !226, line: 255, type: !227, isLocal: true, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: false, variables: !218)
!226 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/common/tuklib_integer.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!227 = !DISubroutineType(types: !228)
!228 = !{null, !67, !155}
!229 = !{!230}
!230 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !23, line: 159, type: !231, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!232 = !{i32 2, !"Dwarf Version", i32 4}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!235 = !DILocalVariable(name: "strm", arg: 1, scope: !159, file: !1, line: 147, type: !162)
!236 = !DIExpression()
!237 = !DILocation(line: 147, column: 33, scope: !159)
!238 = !DILocalVariable(name: "options", arg: 2, scope: !159, file: !1, line: 147, type: !187)
!239 = !DILocation(line: 147, column: 64, scope: !159)
!240 = !DILocation(line: 149, column: 2, scope: !159)
!241 = !DILocalVariable(name: "ret_", scope: !242, file: !1, line: 149, type: !42)
!242 = distinct !DILexicalBlock(scope: !159, file: !1, line: 149, column: 2)
!243 = !DILocation(line: 149, column: 2, scope: !242)
!244 = !DILocation(line: 149, column: 2, scope: !245)
!245 = !DILexicalBlockFile(scope: !242, file: !1, discriminator: 1)
!246 = !DILocalVariable(name: "ret_", scope: !247, file: !1, line: 149, type: !248)
!247 = distinct !DILexicalBlock(scope: !242, file: !1, line: 149, column: 2)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!249 = !DILocation(line: 149, column: 2, scope: !247)
!250 = !DILocation(line: 149, column: 2, scope: !251)
!251 = !DILexicalBlockFile(scope: !247, file: !1, discriminator: 2)
!252 = !DILocation(line: 149, column: 2, scope: !253)
!253 = !DILexicalBlockFile(scope: !254, file: !1, discriminator: 3)
!254 = distinct !DILexicalBlock(scope: !247, file: !1, line: 149, column: 2)
!255 = !DILocation(line: 149, column: 2, scope: !256)
!256 = !DILexicalBlockFile(scope: !247, file: !1, discriminator: 4)
!257 = !DILocation(line: 149, column: 2, scope: !258)
!258 = !DILexicalBlockFile(scope: !242, file: !1, discriminator: 5)
!259 = !DILocation(line: 149, column: 2, scope: !260)
!260 = !DILexicalBlockFile(scope: !261, file: !1, discriminator: 6)
!261 = distinct !DILexicalBlock(scope: !262, file: !1, line: 149, column: 2)
!262 = distinct !DILexicalBlock(scope: !242, file: !1, line: 149, column: 2)
!263 = !DILocation(line: 149, column: 2, scope: !264)
!264 = !DILexicalBlockFile(scope: !242, file: !1, discriminator: 7)
!265 = !DILocation(line: 151, column: 2, scope: !159)
!266 = !DILocation(line: 151, column: 8, scope: !159)
!267 = !DILocation(line: 151, column: 18, scope: !159)
!268 = !DILocation(line: 151, column: 46, scope: !159)
!269 = !DILocation(line: 152, column: 2, scope: !159)
!270 = !DILocation(line: 152, column: 8, scope: !159)
!271 = !DILocation(line: 152, column: 18, scope: !159)
!272 = !DILocation(line: 152, column: 49, scope: !159)
!273 = !DILocation(line: 154, column: 2, scope: !159)
!274 = !DILocation(line: 155, column: 1, scope: !159)
!275 = !DILocalVariable(name: "next", arg: 1, scope: !219, file: !1, line: 78, type: !222)
!276 = !DILocation(line: 78, column: 37, scope: !219)
!277 = !DILocalVariable(name: "allocator", arg: 2, scope: !219, file: !1, line: 78, type: !43)
!278 = !DILocation(line: 78, column: 59, scope: !219)
!279 = !DILocalVariable(name: "options", arg: 3, scope: !219, file: !1, line: 79, type: !187)
!280 = !DILocation(line: 79, column: 28, scope: !219)
!281 = !DILocalVariable(name: "d", scope: !219, file: !1, line: 81, type: !155)
!282 = !DILocation(line: 81, column: 11, scope: !219)
!283 = !DILocalVariable(name: "filters", scope: !219, file: !1, line: 84, type: !284)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 384, align: 64, elements: !297)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !23, line: 77, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !23, line: 104, size: 192, align: 64, elements: !288)
!288 = !{!289, !290, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !287, file: !23, line: 107, baseType: !30, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !287, file: !23, line: 111, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !23, line: 81, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!42, !222, !43, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !287, file: !23, line: 114, baseType: !51, size: 64, align: 64, offset: 128)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DILocation(line: 84, column: 25, scope: !219)
!300 = !DILocation(line: 84, column: 38, scope: !219)
!301 = !DILocation(line: 85, column: 6, scope: !219)
!302 = !DILocation(line: 85, column: 45, scope: !219)
!303 = !DILocation(line: 85, column: 36, scope: !219)
!304 = !DILocation(line: 86, column: 6, scope: !219)
!305 = !DILocation(line: 89, column: 2, scope: !219)
!306 = !DILocation(line: 89, column: 2, scope: !307)
!307 = !DILexicalBlockFile(scope: !308, file: !1, discriminator: 1)
!308 = distinct !DILexicalBlock(scope: !309, file: !1, line: 89, column: 2)
!309 = distinct !DILexicalBlock(scope: !219, file: !1, line: 89, column: 2)
!310 = !DILocation(line: 89, column: 2, scope: !311)
!311 = !DILexicalBlockFile(scope: !308, file: !1, discriminator: 2)
!312 = !DILocation(line: 89, column: 2, scope: !313)
!313 = !DILexicalBlockFile(scope: !309, file: !1, discriminator: 3)
!314 = !DILocation(line: 91, column: 6, scope: !315)
!315 = distinct !DILexicalBlock(scope: !219, file: !1, line: 91, column: 6)
!316 = !DILocation(line: 91, column: 12, scope: !315)
!317 = !DILocation(line: 91, column: 18, scope: !315)
!318 = !DILocation(line: 91, column: 6, scope: !219)
!319 = !DILocation(line: 92, column: 48, scope: !320)
!320 = distinct !DILexicalBlock(scope: !315, file: !1, line: 91, column: 27)
!321 = !DILocation(line: 92, column: 17, scope: !320)
!322 = !DILocation(line: 92, column: 3, scope: !320)
!323 = !DILocation(line: 92, column: 9, scope: !320)
!324 = !DILocation(line: 92, column: 15, scope: !320)
!325 = !DILocation(line: 93, column: 7, scope: !326)
!326 = distinct !DILexicalBlock(scope: !320, file: !1, line: 93, column: 7)
!327 = !DILocation(line: 93, column: 13, scope: !326)
!328 = !DILocation(line: 93, column: 19, scope: !326)
!329 = !DILocation(line: 93, column: 7, scope: !320)
!330 = !DILocation(line: 94, column: 4, scope: !326)
!331 = !DILocation(line: 96, column: 3, scope: !320)
!332 = !DILocation(line: 96, column: 9, scope: !320)
!333 = !DILocation(line: 96, column: 14, scope: !320)
!334 = !DILocation(line: 97, column: 3, scope: !320)
!335 = !DILocation(line: 97, column: 9, scope: !320)
!336 = !DILocation(line: 97, column: 13, scope: !320)
!337 = !DILocation(line: 98, column: 3, scope: !320)
!338 = !DILocation(line: 98, column: 9, scope: !320)
!339 = !DILocation(line: 98, column: 16, scope: !320)
!340 = !DILocation(line: 98, column: 23, scope: !320)
!341 = !DILocation(line: 99, column: 2, scope: !320)
!342 = !DILocation(line: 102, column: 2, scope: !219)
!343 = !DILocation(line: 102, column: 8, scope: !219)
!344 = !DILocation(line: 102, column: 15, scope: !219)
!345 = !DILocation(line: 102, column: 24, scope: !219)
!346 = !DILocation(line: 103, column: 2, scope: !219)
!347 = !DILocation(line: 103, column: 8, scope: !219)
!348 = !DILocation(line: 103, column: 15, scope: !219)
!349 = !DILocation(line: 103, column: 26, scope: !219)
!350 = !DILocation(line: 107, column: 30, scope: !351)
!351 = distinct !DILexicalBlock(scope: !219, file: !1, line: 107, column: 6)
!352 = !DILocation(line: 107, column: 39, scope: !351)
!353 = !DILocation(line: 107, column: 45, scope: !351)
!354 = !DILocation(line: 107, column: 52, scope: !351)
!355 = !DILocation(line: 107, column: 6, scope: !351)
!356 = !DILocation(line: 107, column: 6, scope: !219)
!357 = !DILocation(line: 108, column: 3, scope: !351)
!358 = !DILocation(line: 111, column: 6, scope: !359)
!359 = distinct !DILexicalBlock(scope: !219, file: !1, line: 111, column: 6)
!360 = !DILocation(line: 111, column: 15, scope: !359)
!361 = !DILocation(line: 111, column: 25, scope: !359)
!362 = !DILocation(line: 111, column: 6, scope: !219)
!363 = !DILocation(line: 112, column: 3, scope: !359)
!364 = !DILocation(line: 118, column: 6, scope: !219)
!365 = !DILocation(line: 118, column: 15, scope: !219)
