; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/auto_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !142, subprograms: !143, globals: !181)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/auto_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !69, !86, !120, !139}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 24, size: 32, align: 32, elements: !116)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 17, size: 640, align: 64, elements: !20)
!20 = !{!21, !111, !112, !115}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !1, line: 19, baseType: !22, size: 512, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !23, line: 75, baseType: !24)
!23 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !23, line: 119, size: 512, align: 64, elements: !25)
!25 = !{!26, !29, !35, !37, !75, !80, !94, !99}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !24, file: !23, line: 121, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !23, line: 73, baseType: !19)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !24, file: !23, line: 125, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !31, line: 63, baseType: !32)
!31 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !24, file: !23, line: 131, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 122, baseType: !34)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !24, file: !23, line: 134, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !23, line: 89, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !27, !43, !59, !64, !52, !66, !64, !52, !68}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !46)
!46 = !{!47, !54, !58}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !45, file: !4, line: 376, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !51, !52, !52}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 62, baseType: !34)
!53 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !45, file: !4, line: 390, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !51, !51}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !45, file: !4, line: 401, baseType: !51, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!72 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!73 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!74 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !24, file: !23, line: 139, baseType: !76, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !23, line: 97, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !27, !43}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !24, file: !23, line: 143, baseType: !81, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !92}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !85, line: 55, baseType: !86)
!85 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 27, size: 32, align: 32, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!89 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!90 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!91 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !24, file: !23, line: 147, baseType: !95, size: 64, align: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!42, !27, !98, !98, !32}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !24, file: !23, line: 152, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!42, !27, !43, !103, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !106, line: 65, baseType: !107)
!106 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!107 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 43, size: 128, align: 64, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !106, line: 54, baseType: !30, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !106, line: 63, baseType: !51, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !19, file: !1, line: 21, baseType: !32, size: 64, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !1, line: 22, baseType: !113, size: 32, align: 32, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !114)
!114 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 28, baseType: !18, size: 32, align: 32, offset: 608)
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "SEQ_INIT", value: 0)
!118 = !DIEnumerator(name: "SEQ_CODE", value: 1)
!119 = !DIEnumerator(name: "SEQ_FINISH", value: 2)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !121, file: !23, line: 182, size: 32, align: 32, elements: !132)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !23, line: 174, size: 704, align: 64, elements: !122)
!122 = !{!123, !124, !125, !126, !131}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !23, line: 176, baseType: !22, size: 512, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !121, file: !23, line: 189, baseType: !120, size: 32, align: 32, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !121, file: !23, line: 194, baseType: !52, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !121, file: !23, line: 197, baseType: !127, size: 32, align: 8, offset: 640)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 32, align: 8, elements: !129)
!128 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!129 = !{!130}
!130 = !DISubrange(count: 4)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !121, file: !23, line: 201, baseType: !128, size: 8, align: 8, offset: 672)
!132 = !{!133, !134, !135, !136, !137, !138}
!133 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!134 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!135 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!136 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!137 = !DIEnumerator(name: "ISEQ_END", value: 4)
!138 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !140)
!140 = !{!141}
!141 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!142 = !{!36, !51}
!143 = !{!144, !173, !177, !178, !179, !180}
!144 = distinct !DISubprogram(name: "lzma_auto_decoder", scope: !1, file: !1, line: 178, type: !145, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!145 = !DISubroutineType(types: !146)
!146 = !{!42, !147, !32, !113}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !161, !162, !163, !164, !165, !166, !167, !168, !169, !171}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !149, file: !4, line: 454, baseType: !60, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !149, file: !4, line: 455, baseType: !52, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !149, file: !4, line: 456, baseType: !32, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !149, file: !4, line: 458, baseType: !67, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !149, file: !4, line: 459, baseType: !52, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !149, file: !4, line: 460, baseType: !32, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !149, file: !4, line: 468, baseType: !43, size: 64, align: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !149, file: !4, line: 471, baseType: !159, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !121)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !149, file: !4, line: 479, baseType: !51, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !149, file: !4, line: 480, baseType: !51, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !149, file: !4, line: 481, baseType: !51, size: 64, align: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !149, file: !4, line: 482, baseType: !51, size: 64, align: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !149, file: !4, line: 483, baseType: !32, size: 64, align: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !149, file: !4, line: 484, baseType: !32, size: 64, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !149, file: !4, line: 485, baseType: !52, size: 64, align: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !149, file: !4, line: 486, baseType: !52, size: 64, align: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !149, file: !4, line: 487, baseType: !170, size: 32, align: 32, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !139)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !149, file: !4, line: 488, baseType: !170, size: 32, align: 32, offset: 1056)
!172 = !{}
!173 = distinct !DISubprogram(name: "auto_decoder_init", scope: !1, file: !1, line: 146, type: !174, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!174 = !DISubroutineType(types: !175)
!175 = !{!42, !176, !43, !32, !113}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!177 = distinct !DISubprogram(name: "auto_decode", scope: !1, file: !1, line: 33, type: !40, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!178 = distinct !DISubprogram(name: "auto_decoder_end", scope: !1, file: !1, line: 103, type: !78, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!179 = distinct !DISubprogram(name: "auto_decoder_get_check", scope: !1, file: !1, line: 112, type: !82, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!180 = distinct !DISubprogram(name: "auto_decoder_memconfig", scope: !1, file: !1, line: 121, type: !96, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, variables: !172)
!181 = !{!182}
!182 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !23, line: 159, type: !183, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!184 = !{i32 2, !"Dwarf Version", i32 4}
!185 = !{i32 2, !"Debug Info Version", i32 3}
!186 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!187 = !DILocalVariable(name: "strm", arg: 1, scope: !144, file: !1, line: 178, type: !147)
!188 = !DIExpression()
!189 = !DILocation(line: 178, column: 32, scope: !144)
!190 = !DILocalVariable(name: "memlimit", arg: 2, scope: !144, file: !1, line: 178, type: !32)
!191 = !DILocation(line: 178, column: 47, scope: !144)
!192 = !DILocalVariable(name: "flags", arg: 3, scope: !144, file: !1, line: 178, type: !113)
!193 = !DILocation(line: 178, column: 66, scope: !144)
!194 = !DILocation(line: 180, column: 2, scope: !144)
!195 = !DILocalVariable(name: "ret_", scope: !196, file: !1, line: 180, type: !42)
!196 = distinct !DILexicalBlock(scope: !144, file: !1, line: 180, column: 2)
!197 = !DILocation(line: 180, column: 2, scope: !196)
!198 = !DILocation(line: 180, column: 2, scope: !199)
!199 = !DILexicalBlockFile(scope: !196, file: !1, discriminator: 1)
!200 = !DILocalVariable(name: "ret_", scope: !201, file: !1, line: 180, type: !202)
!201 = distinct !DILexicalBlock(scope: !196, file: !1, line: 180, column: 2)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!203 = !DILocation(line: 180, column: 2, scope: !201)
!204 = !DILocation(line: 180, column: 2, scope: !205)
!205 = !DILexicalBlockFile(scope: !201, file: !1, discriminator: 2)
!206 = !DILocation(line: 180, column: 2, scope: !207)
!207 = !DILexicalBlockFile(scope: !208, file: !1, discriminator: 3)
!208 = distinct !DILexicalBlock(scope: !201, file: !1, line: 180, column: 2)
!209 = !DILocation(line: 180, column: 2, scope: !210)
!210 = !DILexicalBlockFile(scope: !201, file: !1, discriminator: 4)
!211 = !DILocation(line: 180, column: 2, scope: !212)
!212 = !DILexicalBlockFile(scope: !196, file: !1, discriminator: 5)
!213 = !DILocation(line: 180, column: 2, scope: !214)
!214 = !DILexicalBlockFile(scope: !215, file: !1, discriminator: 6)
!215 = distinct !DILexicalBlock(scope: !216, file: !1, line: 180, column: 2)
!216 = distinct !DILexicalBlock(scope: !196, file: !1, line: 180, column: 2)
!217 = !DILocation(line: 180, column: 2, scope: !218)
!218 = !DILexicalBlockFile(scope: !196, file: !1, discriminator: 7)
!219 = !DILocation(line: 182, column: 2, scope: !144)
!220 = !DILocation(line: 182, column: 8, scope: !144)
