; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, %struct.lzma_block*, i32, i64, i64, i64, %struct.lzma_check_state }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !213, subprograms: !214, globals: !250)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !25, !28, !79, !194}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 27, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!22 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!24 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !29, file: !1, line: 27, size: 32, align: 32, elements: !190)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 18, size: 1664, align: 64, elements: !30)
!30 = !{!31, !114, !158, !159, !160, !161, !162}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !1, line: 20, baseType: !32, size: 512, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 75, baseType: !34)
!33 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 119, size: 512, align: 64, elements: !35)
!35 = !{!36, !39, !45, !47, !85, !90, !97, !102}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !34, file: !33, line: 121, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 73, baseType: !29)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !34, file: !33, line: 125, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !41, line: 63, baseType: !42)
!41 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !43, line: 55, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!44 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !34, file: !33, line: 131, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !43, line: 122, baseType: !44)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !34, file: !33, line: 134, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 89, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !37, !53, !69, !74, !62, !76, !74, !62, !78}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !56)
!56 = !{!57, !64, !68}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !55, file: !4, line: 376, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !61, !62, !62}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 62, baseType: !44)
!63 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !55, file: !4, line: 390, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !61, !61}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !55, file: !4, line: 401, baseType: !61, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 48, baseType: !73)
!73 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!74 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!82 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!83 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!84 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !34, file: !33, line: 139, baseType: !86, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 97, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !37, !53}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !34, file: !33, line: 143, baseType: !91, size: 64, align: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !19, line: 55, baseType: !18)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !34, file: !33, line: 147, baseType: !98, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!52, !37, !101, !101, !42}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !34, file: !33, line: 152, baseType: !103, size: 64, align: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!52, !37, !53, !106, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !109, line: 65, baseType: !110)
!109 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 43, size: 128, align: 64, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !109, line: 54, baseType: !40, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !110, file: !109, line: 63, baseType: !61, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !29, file: !1, line: 25, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !117, line: 245, baseType: !118)
!117 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 30, size: 1664, align: 64, elements: !119)
!119 = !{!120, !123, !124, !125, !126, !127, !129, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !146, !147, !148, !149, !151, !152, !153, !154, !155, !156, !157}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !118, file: !117, line: 47, baseType: !121, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 51, baseType: !122)
!122 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !118, file: !117, line: 67, baseType: !121, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !118, file: !117, line: 88, baseType: !94, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !118, file: !117, line: 143, baseType: !40, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !118, file: !117, line: 167, baseType: !40, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !118, file: !117, line: 195, baseType: !128, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !118, file: !117, line: 212, baseType: !130, size: 512, align: 8, offset: 320)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 512, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !118, file: !117, line: 221, baseType: !61, size: 64, align: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !118, file: !117, line: 222, baseType: !61, size: 64, align: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !118, file: !117, line: 223, baseType: !61, size: 64, align: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !118, file: !117, line: 224, baseType: !121, size: 32, align: 32, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !118, file: !117, line: 225, baseType: !121, size: 32, align: 32, offset: 1056)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !118, file: !117, line: 226, baseType: !40, size: 64, align: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !118, file: !117, line: 227, baseType: !40, size: 64, align: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !118, file: !117, line: 228, baseType: !40, size: 64, align: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !118, file: !117, line: 229, baseType: !40, size: 64, align: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !118, file: !117, line: 230, baseType: !40, size: 64, align: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !118, file: !117, line: 231, baseType: !40, size: 64, align: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !118, file: !117, line: 232, baseType: !145, size: 32, align: 32, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !25)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !118, file: !117, line: 233, baseType: !145, size: 32, align: 32, offset: 1504)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !118, file: !117, line: 234, baseType: !145, size: 32, align: 32, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !118, file: !117, line: 235, baseType: !145, size: 32, align: 32, offset: 1568)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !118, file: !117, line: 236, baseType: !150, size: 8, align: 8, offset: 1600)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !73)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !118, file: !117, line: 237, baseType: !150, size: 8, align: 8, offset: 1608)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !118, file: !117, line: 238, baseType: !150, size: 8, align: 8, offset: 1616)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !118, file: !117, line: 239, baseType: !150, size: 8, align: 8, offset: 1624)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !118, file: !117, line: 240, baseType: !150, size: 8, align: 8, offset: 1632)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !118, file: !117, line: 241, baseType: !150, size: 8, align: 8, offset: 1640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !118, file: !117, line: 242, baseType: !150, size: 8, align: 8, offset: 1648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !118, file: !117, line: 243, baseType: !150, size: 8, align: 8, offset: 1656)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !29, file: !1, line: 31, baseType: !28, size: 32, align: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !29, file: !1, line: 34, baseType: !40, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !29, file: !1, line: 37, baseType: !40, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !29, file: !1, line: 40, baseType: !62, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !29, file: !1, line: 43, baseType: !163, size: 832, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !164, line: 56, baseType: !165)
!164 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/check/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!165 = !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 34, size: 832, align: 64, elements: !166)
!166 = !{!167, !179}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !165, file: !164, line: 40, baseType: !168, size: 512, align: 64)
!168 = !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !164, line: 36, size: 512, align: 64, elements: !169)
!169 = !{!170, !171, !175}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !168, file: !164, line: 37, baseType: !130, size: 512, align: 8)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !168, file: !164, line: 38, baseType: !172, size: 512, align: 32)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, align: 32, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !168, file: !164, line: 39, baseType: !176, size: 512, align: 64)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, align: 64, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !165, file: !164, line: 54, baseType: !180, size: 320, align: 64, offset: 512)
!180 = !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !164, line: 43, size: 320, align: 64, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !180, file: !164, line: 44, baseType: !121, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !180, file: !164, line: 45, baseType: !42, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !180, file: !164, line: 53, baseType: !185, size: 320, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !164, line: 47, size: 320, align: 64, elements: !186)
!186 = !{!187, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !185, file: !164, line: 49, baseType: !188, size: 256, align: 32)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 256, align: 32, elements: !177)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !185, file: !164, line: 52, baseType: !42, size: 64, align: 64, offset: 256)
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "SEQ_CODE", value: 0)
!192 = !DIEnumerator(name: "SEQ_PADDING", value: 1)
!193 = !DIEnumerator(name: "SEQ_CHECK", value: 2)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !195, file: !33, line: 182, size: 32, align: 32, elements: !206)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 174, size: 704, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !33, line: 176, baseType: !32, size: 512, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !195, file: !33, line: 189, baseType: !194, size: 32, align: 32, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !195, file: !33, line: 194, baseType: !62, size: 64, align: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !195, file: !33, line: 197, baseType: !201, size: 32, align: 8, offset: 640)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 32, align: 8, elements: !203)
!202 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!203 = !{!204}
!204 = !DISubrange(count: 4)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !195, file: !33, line: 201, baseType: !202, size: 8, align: 8, offset: 672)
!206 = !{!207, !208, !209, !210, !211, !212}
!207 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!208 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!209 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!210 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!211 = !DIEnumerator(name: "ISEQ_END", value: 4)
!212 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!213 = !{!46, !61, !122}
!214 = !{!215, !220, !247, !248, !249}
!215 = distinct !DISubprogram(name: "lzma_block_encoder_init", scope: !1, file: !1, line: 159, type: !216, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!216 = !DISubroutineType(types: !217)
!217 = !{!52, !218, !53, !115}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!219 = !{}
!220 = distinct !DISubprogram(name: "lzma_block_encoder", scope: !1, file: !1, line: 209, type: !221, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!221 = !DISubroutineType(types: !222)
!222 = !{!52, !223, !115}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !225, file: !4, line: 454, baseType: !70, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !225, file: !4, line: 455, baseType: !62, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !225, file: !4, line: 456, baseType: !42, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !225, file: !4, line: 458, baseType: !77, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !225, file: !4, line: 459, baseType: !62, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !225, file: !4, line: 460, baseType: !42, size: 64, align: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !225, file: !4, line: 468, baseType: !53, size: 64, align: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !225, file: !4, line: 471, baseType: !235, size: 64, align: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !195)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !225, file: !4, line: 479, baseType: !61, size: 64, align: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !225, file: !4, line: 480, baseType: !61, size: 64, align: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !225, file: !4, line: 481, baseType: !61, size: 64, align: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !225, file: !4, line: 482, baseType: !61, size: 64, align: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !225, file: !4, line: 483, baseType: !42, size: 64, align: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !225, file: !4, line: 484, baseType: !42, size: 64, align: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !225, file: !4, line: 485, baseType: !62, size: 64, align: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !225, file: !4, line: 486, baseType: !62, size: 64, align: 64, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !225, file: !4, line: 487, baseType: !145, size: 32, align: 32, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !225, file: !4, line: 488, baseType: !145, size: 32, align: 32, offset: 1056)
!247 = distinct !DISubprogram(name: "block_encode", scope: !1, file: !1, line: 48, type: !50, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!248 = distinct !DISubprogram(name: "block_encoder_end", scope: !1, file: !1, line: 137, type: !88, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!249 = distinct !DISubprogram(name: "block_encoder_update", scope: !1, file: !1, line: 146, type: !104, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!250 = !{!251}
!251 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !33, line: 159, type: !252, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!253 = !{i32 2, !"Dwarf Version", i32 4}
!254 = !{i32 2, !"Debug Info Version", i32 3}
!255 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!256 = !DILocalVariable(name: "next", arg: 1, scope: !215, file: !1, line: 159, type: !218)
!257 = !DIExpression()
!258 = !DILocation(line: 159, column: 42, scope: !215)
!259 = !DILocalVariable(name: "allocator", arg: 2, scope: !215, file: !1, line: 159, type: !53)
!260 = !DILocation(line: 159, column: 64, scope: !215)
!261 = !DILocalVariable(name: "block", arg: 3, scope: !215, file: !1, line: 160, type: !115)
!262 = !DILocation(line: 160, column: 15, scope: !215)
!263 = !DILocation(line: 162, column: 2, scope: !215)
!264 = !DILocation(line: 162, column: 2, scope: !265)
!265 = !DILexicalBlockFile(scope: !266, file: !1, discriminator: 1)
!266 = distinct !DILexicalBlock(scope: !267, file: !1, line: 162, column: 2)
!267 = distinct !DILexicalBlock(scope: !215, file: !1, line: 162, column: 2)
!268 = !DILocation(line: 162, column: 2, scope: !269)
!269 = !DILexicalBlockFile(scope: !266, file: !1, discriminator: 2)
!270 = !DILocation(line: 162, column: 2, scope: !271)
!271 = !DILexicalBlockFile(scope: !267, file: !1, discriminator: 3)
!272 = !DILocation(line: 164, column: 6, scope: !273)
!273 = distinct !DILexicalBlock(scope: !215, file: !1, line: 164, column: 6)
!274 = !DILocation(line: 164, column: 12, scope: !273)
!275 = !DILocation(line: 164, column: 6, scope: !215)
!276 = !DILocation(line: 165, column: 3, scope: !273)
!277 = !DILocation(line: 169, column: 6, scope: !278)
!278 = distinct !DILexicalBlock(scope: !215, file: !1, line: 169, column: 6)
!279 = !DILocation(line: 169, column: 13, scope: !278)
!280 = !DILocation(line: 169, column: 21, scope: !278)
!281 = !DILocation(line: 169, column: 6, scope: !215)
!282 = !DILocation(line: 170, column: 3, scope: !278)
!283 = !DILocation(line: 174, column: 21, scope: !284)
!284 = distinct !DILexicalBlock(scope: !215, file: !1, line: 174, column: 6)
!285 = !DILocation(line: 174, column: 28, scope: !284)
!286 = !DILocation(line: 174, column: 35, scope: !284)
!287 = !DILocation(line: 174, column: 6, scope: !215)
!288 = !DILocation(line: 175, column: 3, scope: !284)
!289 = !DILocation(line: 177, column: 31, scope: !290)
!290 = distinct !DILexicalBlock(scope: !215, file: !1, line: 177, column: 6)
!291 = !DILocation(line: 177, column: 38, scope: !290)
!292 = !DILocation(line: 177, column: 7, scope: !290)
!293 = !DILocation(line: 177, column: 6, scope: !215)
!294 = !DILocation(line: 178, column: 3, scope: !290)
!295 = !DILocation(line: 181, column: 6, scope: !296)
!296 = distinct !DILexicalBlock(scope: !215, file: !1, line: 181, column: 6)
!297 = !DILocation(line: 181, column: 12, scope: !296)
!298 = !DILocation(line: 181, column: 18, scope: !296)
!299 = !DILocation(line: 181, column: 6, scope: !215)
!300 = !DILocation(line: 182, column: 48, scope: !301)
!301 = distinct !DILexicalBlock(scope: !296, file: !1, line: 181, column: 27)
