; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_header_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }

; Function Attrs: nounwind uwtable
define i32 @lzma_block_header_decode(%struct.lzma_block* %block, %struct.lzma_allocator* %allocator, i8* %in) #0 !dbg !36 {
entry:
  %retval = alloca i32, align 4
  %block.addr = alloca %struct.lzma_block*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8
  %in.addr = alloca i8*, align 8
  %filter_count = alloca i64, align 8
  %in_size = alloca i64, align 8
  %i = alloca i64, align 8
  %in_pos = alloca i64, align 8
  %ret_ = alloca i32, align 4
  %ret_48 = alloca i32, align 4
  %ret = alloca i32, align 4
  store %struct.lzma_block* %block, %struct.lzma_block** %block.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_block** %block.addr, metadata !122, metadata !123), !dbg !124
  store %struct.lzma_allocator* %allocator, %struct.lzma_allocator** %allocator.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_allocator** %allocator.addr, metadata !125, metadata !123), !dbg !126

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !28, subprograms: !35)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_header_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 27, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!22 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!24 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!28 = !{!29, !30, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 51, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!35 = !{!36, !112, !116}
!36 = distinct !DISubprogram(name: "lzma_block_header_decode", scope: !1, file: !1, line: 36, type: !37, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, variables: !111)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !40, !94, !109}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !42, line: 245, baseType: !43)
!42 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!43 = !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 30, size: 1664, align: 64, elements: !44)
!44 = !{!45, !46, !47, !49, !54, !55, !63, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !82, !83, !84, !85, !87, !88, !89, !90, !91, !92, !93}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !43, file: !42, line: 47, baseType: !30, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !43, file: !42, line: 67, baseType: !30, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !43, file: !42, line: 88, baseType: !48, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !19, line: 55, baseType: !18)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !43, file: !42, line: 143, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !51, line: 63, baseType: !52)
!51 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 55, baseType: !53)
!53 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !43, file: !42, line: 167, baseType: !50, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !43, file: !42, line: 195, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !58, line: 65, baseType: !59)
!58 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!59 = !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 43, size: 128, align: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !59, file: !58, line: 54, baseType: !50, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !59, file: !58, line: 63, baseType: !29, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !43, file: !42, line: 212, baseType: !64, size: 512, align: 8, offset: 320)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, align: 8, elements: !67)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 48, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !43, file: !42, line: 221, baseType: !29, size: 64, align: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !43, file: !42, line: 222, baseType: !29, size: 64, align: 64, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !43, file: !42, line: 223, baseType: !29, size: 64, align: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !43, file: !42, line: 224, baseType: !30, size: 32, align: 32, offset: 1024)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !43, file: !42, line: 225, baseType: !30, size: 32, align: 32, offset: 1056)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !43, file: !42, line: 226, baseType: !50, size: 64, align: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !43, file: !42, line: 227, baseType: !50, size: 64, align: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !43, file: !42, line: 228, baseType: !50, size: 64, align: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !43, file: !42, line: 229, baseType: !50, size: 64, align: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !43, file: !42, line: 230, baseType: !50, size: 64, align: 64, offset: 1344)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !43, file: !42, line: 231, baseType: !50, size: 64, align: 64, offset: 1408)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !43, file: !42, line: 232, baseType: !81, size: 32, align: 32, offset: 1472)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !25)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !43, file: !42, line: 233, baseType: !81, size: 32, align: 32, offset: 1504)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !43, file: !42, line: 234, baseType: !81, size: 32, align: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !43, file: !42, line: 235, baseType: !81, size: 32, align: 32, offset: 1568)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !43, file: !42, line: 236, baseType: !86, size: 8, align: 8, offset: 1600)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !66)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !43, file: !42, line: 237, baseType: !86, size: 8, align: 8, offset: 1608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !43, file: !42, line: 238, baseType: !86, size: 8, align: 8, offset: 1616)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !43, file: !42, line: 239, baseType: !86, size: 8, align: 8, offset: 1624)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !43, file: !42, line: 240, baseType: !86, size: 8, align: 8, offset: 1632)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !43, file: !42, line: 241, baseType: !86, size: 8, align: 8, offset: 1640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !43, file: !42, line: 242, baseType: !86, size: 8, align: 8, offset: 1648)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !43, file: !42, line: 243, baseType: !86, size: 8, align: 8, offset: 1656)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !97)
!97 = !{!98, !104, !108}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !96, file: !4, line: 376, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!29, !29, !102, !102}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !53)
!103 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !96, file: !4, line: 390, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !29, !29}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !96, file: !4, line: 401, baseType: !29, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!111 = !{}
!112 = distinct !DISubprogram(name: "read32le", scope: !113, file: !113, line: 209, type: !114, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, variables: !111)
!113 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/common/tuklib_integer.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!114 = !DISubroutineType(types: !115)
!115 = !{!30, !109}
!116 = distinct !DISubprogram(name: "free_properties", scope: !1, file: !1, line: 18, type: !117, isLocal: true, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, variables: !111)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !40, !94}
!119 = !{i32 2, !"Dwarf Version", i32 4}
!120 = !{i32 2, !"Debug Info Version", i32 3}
!121 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!122 = !DILocalVariable(name: "block", arg: 1, scope: !36, file: !1, line: 36, type: !40)
!123 = !DIExpression()
!124 = !DILocation(line: 36, column: 38, scope: !36)
!125 = !DILocalVariable(name: "allocator", arg: 2, scope: !36, file: !1, line: 37, type: !94)
!126 = !DILocation(line: 37, column: 19, scope: !36)
!127 = !DILocalVariable(name: "in", arg: 3, scope: !36, file: !1, line: 37, type: !109)
!128 = !DILocation(line: 37, column: 45, scope: !36)
!129 = !DILocalVariable(name: "filter_count", scope: !36, file: !1, line: 39, type: !130)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!131 = !DILocation(line: 39, column: 15, scope: !36)
!132 = !DILocation(line: 39, column: 31, scope: !36)
!133 = !DILocation(line: 39, column: 37, scope: !36)
!134 = !DILocation(line: 39, column: 42, scope: !36)
!135 = !DILocation(line: 39, column: 30, scope: !36)
!136 = !DILocalVariable(name: "in_size", scope: !36, file: !1, line: 40, type: !102)
!137 = !DILocation(line: 40, column: 9, scope: !36)
!138 = !DILocalVariable(name: "i", scope: !36, file: !1, line: 41, type: !102)
!139 = !DILocation(line: 41, column: 9, scope: !36)
!140 = !DILocalVariable(name: "in_pos", scope: !36, file: !1, line: 44, type: !102)
!141 = !DILocation(line: 44, column: 9, scope: !36)
!142 = !DILocation(line: 53, column: 9, scope: !143)
!143 = distinct !DILexicalBlock(scope: !36, file: !1, line: 53, column: 2)
!144 = !DILocation(line: 53, column: 7, scope: !143)
!145 = !DILocation(line: 53, column: 14, scope: !146)
!146 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 1)
!147 = distinct !DILexicalBlock(scope: !143, file: !1, line: 53, column: 2)
!148 = !DILocation(line: 53, column: 16, scope: !146)
!149 = !DILocation(line: 53, column: 2, scope: !146)
!150 = !DILocation(line: 54, column: 18, scope: !151)
!151 = distinct !DILexicalBlock(scope: !147, file: !1, line: 53, column: 42)
!152 = !DILocation(line: 54, column: 3, scope: !151)
!153 = !DILocation(line: 54, column: 10, scope: !151)
!154 = !DILocation(line: 54, column: 21, scope: !151)
!155 = !DILocation(line: 54, column: 24, scope: !151)
!156 = !DILocation(line: 55, column: 18, scope: !151)
!157 = !DILocation(line: 55, column: 3, scope: !151)
!158 = !DILocation(line: 55, column: 10, scope: !151)
!159 = !DILocation(line: 55, column: 21, scope: !151)
!160 = !DILocation(line: 55, column: 29, scope: !151)
!161 = !DILocation(line: 56, column: 2, scope: !151)
!162 = !DILocation(line: 53, column: 37, scope: !163)
!163 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 2)
!164 = !DILocation(line: 53, column: 2, scope: !163)
!165 = !DILocation(line: 59, column: 2, scope: !36)
!166 = !DILocation(line: 59, column: 9, scope: !36)
!167 = !DILocation(line: 59, column: 17, scope: !36)
!168 = !DILocation(line: 63, column: 6, scope: !169)
