; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_header_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }

; Function Attrs: nounwind uwtable
define i32 @lzma_block_header_size(%struct.lzma_block* %block) #0 !dbg !35 {
entry:
  %retval = alloca i32, align 4
  %block.addr = alloca %struct.lzma_block*, align 8
  %i = alloca i64, align 8
  %size = alloca i32, align 4
  %add = alloca i32, align 4
  %add13 = alloca i32, align 4
  %add31 = alloca i32, align 4
  %ret_ = alloca i32, align 4
  store %struct.lzma_block* %block, %struct.lzma_block** %block.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_block** %block.addr, metadata !107, metadata !108), !dbg !109
  call void @llvm.dbg.declare(metadata i64* %i, metadata !110, metadata !108), !dbg !113
  call void @llvm.dbg.declare(metadata i32* %size, metadata !114, metadata !108), !dbg !115
  store i32 6, i32* %size, align 4, !dbg !115
  %0 = load %struct.lzma_block*, %struct.lzma_block** %block.addr, align 8, !dbg !116
  %version = getelementptr inbounds %struct.lzma_block, %struct.lzma_block* %0, i32 0, i32 0, !dbg !118
  %1 = load i32, i32* %version, align 8, !dbg !118

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !28, subprograms: !34)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_header_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 27, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!22 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!24 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!28 = !{!29, !30, !33}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 51, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!34 = !{!35, !94, !100}
!35 = distinct !DISubprogram(name: "lzma_block_header_size", scope: !1, file: !1, line: 18, type: !36, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, variables: !93)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !41, line: 245, baseType: !42)
!41 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!42 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 30, size: 1664, align: 64, elements: !43)
!43 = !{!44, !45, !46, !48, !53, !54, !62, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !81, !82, !83, !84, !86, !87, !88, !89, !90, !91, !92}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !42, file: !41, line: 47, baseType: !30, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !42, file: !41, line: 67, baseType: !30, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !42, file: !41, line: 88, baseType: !47, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !19, line: 55, baseType: !18)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !42, file: !41, line: 143, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !50, line: 63, baseType: !51)
!50 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 55, baseType: !52)
!52 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !42, file: !41, line: 167, baseType: !49, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !42, file: !41, line: 195, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !57, line: 65, baseType: !58)
!57 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!58 = !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 43, size: 128, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !58, file: !57, line: 54, baseType: !49, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !58, file: !57, line: 63, baseType: !29, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !42, file: !41, line: 212, baseType: !63, size: 512, align: 8, offset: 320)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, align: 8, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 48, baseType: !65)
!65 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!66 = !{!67}
!67 = !DISubrange(count: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !42, file: !41, line: 221, baseType: !29, size: 64, align: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !42, file: !41, line: 222, baseType: !29, size: 64, align: 64, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !42, file: !41, line: 223, baseType: !29, size: 64, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !42, file: !41, line: 224, baseType: !30, size: 32, align: 32, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !42, file: !41, line: 225, baseType: !30, size: 32, align: 32, offset: 1056)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !42, file: !41, line: 226, baseType: !49, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !42, file: !41, line: 227, baseType: !49, size: 64, align: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !42, file: !41, line: 228, baseType: !49, size: 64, align: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !42, file: !41, line: 229, baseType: !49, size: 64, align: 64, offset: 1280)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !42, file: !41, line: 230, baseType: !49, size: 64, align: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !42, file: !41, line: 231, baseType: !49, size: 64, align: 64, offset: 1408)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !42, file: !41, line: 232, baseType: !80, size: 32, align: 32, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !25)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !42, file: !41, line: 233, baseType: !80, size: 32, align: 32, offset: 1504)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !42, file: !41, line: 234, baseType: !80, size: 32, align: 32, offset: 1536)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !42, file: !41, line: 235, baseType: !80, size: 32, align: 32, offset: 1568)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !42, file: !41, line: 236, baseType: !85, size: 8, align: 8, offset: 1600)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !65)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !42, file: !41, line: 237, baseType: !85, size: 8, align: 8, offset: 1608)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !42, file: !41, line: 238, baseType: !85, size: 8, align: 8, offset: 1616)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !42, file: !41, line: 239, baseType: !85, size: 8, align: 8, offset: 1624)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !42, file: !41, line: 240, baseType: !85, size: 8, align: 8, offset: 1632)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !42, file: !41, line: 241, baseType: !85, size: 8, align: 8, offset: 1640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !42, file: !41, line: 242, baseType: !85, size: 8, align: 8, offset: 1648)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !42, file: !41, line: 243, baseType: !85, size: 8, align: 8, offset: 1656)
!93 = !{}
!94 = distinct !DISubprogram(name: "lzma_block_header_encode", scope: !1, file: !1, line: 77, type: !95, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !93)
!95 = !DISubroutineType(types: !96)
!96 = !{!38, !97, !99}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!100 = distinct !DISubprogram(name: "write32ne", scope: !101, file: !101, line: 255, type: !102, isLocal: true, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: false, variables: !93)
!101 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/common/tuklib_integer.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!102 = !DISubroutineType(types: !103)
!103 = !{null, !99, !30}
!104 = !{i32 2, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!107 = !DILocalVariable(name: "block", arg: 1, scope: !35, file: !1, line: 18, type: !39)
!108 = !DIExpression()
!109 = !DILocation(line: 18, column: 36, scope: !35)
!110 = !DILocalVariable(name: "i", scope: !35, file: !1, line: 20, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 62, baseType: !52)
!112 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!113 = !DILocation(line: 20, column: 9, scope: !35)
!114 = !DILocalVariable(name: "size", scope: !35, file: !1, line: 23, type: !30)
!115 = !DILocation(line: 23, column: 11, scope: !35)
!116 = !DILocation(line: 25, column: 6, scope: !117)
!117 = distinct !DILexicalBlock(scope: !35, file: !1, line: 25, column: 6)
!118 = !DILocation(line: 25, column: 13, scope: !117)
!119 = !DILocation(line: 25, column: 21, scope: !117)
!120 = !DILocation(line: 25, column: 6, scope: !35)
!121 = !DILocation(line: 26, column: 3, scope: !117)
!122 = !DILocation(line: 29, column: 6, scope: !123)
!123 = distinct !DILexicalBlock(scope: !35, file: !1, line: 29, column: 6)
!124 = !DILocation(line: 29, column: 13, scope: !123)
!125 = !DILocation(line: 29, column: 29, scope: !123)
!126 = !DILocation(line: 29, column: 6, scope: !35)
!127 = !DILocalVariable(name: "add", scope: !128, file: !1, line: 30, type: !129)
!128 = distinct !DILexicalBlock(scope: !123, file: !1, line: 29, column: 50)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!130 = !DILocation(line: 30, column: 18, scope: !128)
!131 = !DILocation(line: 30, column: 38, scope: !128)
!132 = !DILocation(line: 30, column: 45, scope: !128)
!133 = !DILocation(line: 30, column: 24, scope: !128)
!134 = !DILocation(line: 31, column: 7, scope: !135)
!135 = distinct !DILexicalBlock(scope: !128, file: !1, line: 31, column: 7)
!136 = !DILocation(line: 31, column: 11, scope: !135)
!137 = !DILocation(line: 31, column: 16, scope: !135)
!138 = !DILocation(line: 31, column: 19, scope: !139)
!139 = !DILexicalBlockFile(scope: !135, file: !1, discriminator: 1)
!140 = !DILocation(line: 31, column: 26, scope: !139)
!141 = !DILocation(line: 31, column: 42, scope: !139)
!142 = !DILocation(line: 31, column: 7, scope: !139)
!143 = !DILocation(line: 32, column: 4, scope: !135)
!144 = !DILocation(line: 34, column: 11, scope: !128)
!145 = !DILocation(line: 34, column: 8, scope: !128)
!146 = !DILocation(line: 35, column: 2, scope: !128)
!147 = !DILocation(line: 38, column: 6, scope: !148)
!148 = distinct !DILexicalBlock(scope: !35, file: !1, line: 38, column: 6)
!149 = !DILocation(line: 38, column: 13, scope: !148)
!150 = !DILocation(line: 38, column: 31, scope: !148)
!151 = !DILocation(line: 38, column: 6, scope: !35)
