; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_util.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }

@.str = private unnamed_addr constant [21 x i8] c"unpadded_size >= 5UL\00", align 1
@.str.1 = private unnamed_addr constant [82 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_util.c\00", align 1
@__PRETTY_FUNCTION__.lzma_block_unpadded_size = private unnamed_addr constant [54 x i8] c"lzma_vli lzma_block_unpadded_size(const lzma_block *)\00", align 1
@.str.2 = private unnamed_addr constant [38 x i8] c"vli <= ((18446744073709551615UL) / 2)\00", align 1
@.str.3 = private unnamed_addr constant [77 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.h\00", align 1
@__PRETTY_FUNCTION__.vli_ceil4 = private unnamed_addr constant [29 x i8] c"lzma_vli vli_ceil4(lzma_vli)\00", align 1

; Function Attrs: nounwind uwtable
define i32 @lzma_block_compressed_size(%struct.lzma_block* %block, i64 %unpadded_size) #0 !dbg !32 {
entry:
  %retval = alloca i32, align 4
  %block.addr = alloca %struct.lzma_block*, align 8
  %unpadded_size.addr = alloca i64, align 8
  %container_size = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !28, subprograms: !31)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_util.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 27, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!22 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!24 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !{!32, !93, !98, !99}
!32 = distinct !DISubprogram(name: "lzma_block_compressed_size", scope: !1, file: !1, line: 18, type: !33, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, variables: !92)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !36, !48}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !38, line: 245, baseType: !39)
!38 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 30, size: 1664, align: 64, elements: !40)
!40 = !{!41, !44, !45, !47, !52, !53, !61, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !80, !81, !82, !83, !85, !86, !87, !88, !89, !90, !91}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !39, file: !38, line: 47, baseType: !42, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 51, baseType: !30)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !39, file: !38, line: 67, baseType: !42, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !39, file: !38, line: 88, baseType: !46, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !19, line: 55, baseType: !18)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !39, file: !38, line: 143, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !49, line: 63, baseType: !50)
!49 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !43, line: 55, baseType: !51)
!51 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !39, file: !38, line: 167, baseType: !48, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !39, file: !38, line: 195, baseType: !54, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !56, line: 65, baseType: !57)
!56 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 43, size: 128, align: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !57, file: !56, line: 54, baseType: !48, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !57, file: !56, line: 63, baseType: !29, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !39, file: !38, line: 212, baseType: !62, size: 512, align: 8, offset: 320)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, align: 8, elements: !65)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 48, baseType: !64)
!64 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!65 = !{!66}
!66 = !DISubrange(count: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !39, file: !38, line: 221, baseType: !29, size: 64, align: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !39, file: !38, line: 222, baseType: !29, size: 64, align: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !39, file: !38, line: 223, baseType: !29, size: 64, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !39, file: !38, line: 224, baseType: !42, size: 32, align: 32, offset: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !39, file: !38, line: 225, baseType: !42, size: 32, align: 32, offset: 1056)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !39, file: !38, line: 226, baseType: !48, size: 64, align: 64, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !39, file: !38, line: 227, baseType: !48, size: 64, align: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !39, file: !38, line: 228, baseType: !48, size: 64, align: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !39, file: !38, line: 229, baseType: !48, size: 64, align: 64, offset: 1280)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !39, file: !38, line: 230, baseType: !48, size: 64, align: 64, offset: 1344)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !39, file: !38, line: 231, baseType: !48, size: 64, align: 64, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !39, file: !38, line: 232, baseType: !79, size: 32, align: 32, offset: 1472)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !25)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !39, file: !38, line: 233, baseType: !79, size: 32, align: 32, offset: 1504)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !39, file: !38, line: 234, baseType: !79, size: 32, align: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !39, file: !38, line: 235, baseType: !79, size: 32, align: 32, offset: 1568)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !39, file: !38, line: 236, baseType: !84, size: 8, align: 8, offset: 1600)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !39, file: !38, line: 237, baseType: !84, size: 8, align: 8, offset: 1608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !39, file: !38, line: 238, baseType: !84, size: 8, align: 8, offset: 1616)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !39, file: !38, line: 239, baseType: !84, size: 8, align: 8, offset: 1624)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !39, file: !38, line: 240, baseType: !84, size: 8, align: 8, offset: 1632)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !39, file: !38, line: 241, baseType: !84, size: 8, align: 8, offset: 1640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !39, file: !38, line: 242, baseType: !84, size: 8, align: 8, offset: 1648)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !39, file: !38, line: 243, baseType: !84, size: 8, align: 8, offset: 1656)
!92 = !{}
!93 = distinct !DISubprogram(name: "lzma_block_unpadded_size", scope: !1, file: !1, line: 49, type: !94, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, variables: !92)
!94 = !DISubroutineType(types: !95)
!95 = !{!48, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!98 = distinct !DISubprogram(name: "lzma_block_total_size", scope: !1, file: !1, line: 87, type: !94, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, variables: !92)
!99 = distinct !DISubprogram(name: "vli_ceil4", scope: !100, file: !100, line: 39, type: !101, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, variables: !92)
!100 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!101 = !DISubroutineType(types: !102)
!102 = !{!48, !48}
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!106 = !DILocalVariable(name: "block", arg: 1, scope: !32, file: !1, line: 18, type: !36)
!107 = !DIExpression()
!108 = !DILocation(line: 18, column: 40, scope: !32)
!109 = !DILocalVariable(name: "unpadded_size", arg: 2, scope: !32, file: !1, line: 18, type: !48)
!110 = !DILocation(line: 18, column: 56, scope: !32)
!111 = !DILocalVariable(name: "container_size", scope: !32, file: !1, line: 20, type: !42)
!112 = !DILocation(line: 20, column: 11, scope: !32)
!113 = !DILocalVariable(name: "compressed_size", scope: !32, file: !1, line: 21, type: !48)
!114 = !DILocation(line: 21, column: 11, scope: !32)
!115 = !DILocation(line: 24, column: 31, scope: !116)
!116 = distinct !DILexicalBlock(scope: !32, file: !1, line: 24, column: 6)
!117 = !DILocation(line: 24, column: 6, scope: !116)
!118 = !DILocation(line: 24, column: 38, scope: !116)
!119 = !DILocation(line: 24, column: 6, scope: !32)
!120 = !DILocation(line: 25, column: 3, scope: !116)
!121 = !DILocation(line: 27, column: 19, scope: !32)
!122 = !DILocation(line: 27, column: 26, scope: !32)
!123 = !DILocation(line: 28, column: 22, scope: !32)
!124 = !DILocation(line: 28, column: 29, scope: !32)
!125 = !DILocation(line: 28, column: 6, scope: !32)
!126 = !DILocation(line: 28, column: 4, scope: !32)
!127 = !DILocation(line: 27, column: 17, scope: !32)
!128 = !DILocation(line: 31, column: 6, scope: !129)
!129 = distinct !DILexicalBlock(scope: !32, file: !1, line: 31, column: 6)
!130 = !DILocation(line: 31, column: 23, scope: !129)
!131 = !DILocation(line: 31, column: 20, scope: !129)
!132 = !DILocation(line: 31, column: 6, scope: !32)
!133 = !DILocation(line: 32, column: 3, scope: !129)
!134 = !DILocation(line: 37, column: 20, scope: !32)
!135 = !DILocation(line: 37, column: 36, scope: !32)
!136 = !DILocation(line: 37, column: 34, scope: !32)
!137 = !DILocation(line: 37, column: 18, scope: !32)
!138 = !DILocation(line: 38, column: 6, scope: !139)
!139 = distinct !DILexicalBlock(scope: !32, file: !1, line: 38, column: 6)
!140 = !DILocation(line: 38, column: 13, scope: !139)
!141 = !DILocation(line: 38, column: 29, scope: !139)
!142 = !DILocation(line: 39, column: 4, scope: !139)
!143 = !DILocation(line: 39, column: 7, scope: !144)
!144 = !DILexicalBlockFile(scope: !139, file: !1, discriminator: 1)
!145 = !DILocation(line: 39, column: 14, scope: !144)
!146 = !DILocation(line: 39, column: 33, scope: !144)
!147 = !DILocation(line: 39, column: 30, scope: !144)
!148 = !DILocation(line: 38, column: 6, scope: !149)
!149 = !DILexicalBlockFile(scope: !32, file: !1, discriminator: 1)
!150 = !DILocation(line: 40, column: 3, scope: !139)
