; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_buffer_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [28 x i8] c"check_size != (4294967295U)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !46, subprograms: !52, globals: !140)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_buffer_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !25, !28, !34, !39}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 27, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!22 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!24 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!31 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!32 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!33 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 138, size: 32, align: 32, elements: !36)
!35 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!38 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 58, size: 32, align: 32, elements: !40)
!40 = !{!41, !42, !43, !44, !45}
!41 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!42 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!43 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!44 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!45 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 62, baseType: !51)
!50 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!51 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!52 = !{!53, !57, !133, !136, !137}
!53 = distinct !DISubprogram(name: "lzma_block_buffer_bound", scope: !1, file: !1, line: 57, type: !54, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{!49, !49}
!56 = !{}
!57 = distinct !DISubprogram(name: "lzma_block_buffer_encode", scope: !1, file: !1, line: 231, type: !58, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61, !116, !129, !49, !131, !132, !49}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !63, line: 245, baseType: !64)
!63 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!64 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 30, size: 1664, align: 64, elements: !65)
!65 = !{!66, !69, !70, !72, !76, !77, !85, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !104, !105, !106, !107, !109, !110, !111, !112, !113, !114, !115}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !64, file: !63, line: 47, baseType: !67, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !68, line: 51, baseType: !48)
!68 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !64, file: !63, line: 67, baseType: !67, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !64, file: !63, line: 88, baseType: !71, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !19, line: 55, baseType: !18)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !64, file: !63, line: 143, baseType: !73, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !74, line: 63, baseType: !75)
!74 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !68, line: 55, baseType: !51)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !64, file: !63, line: 167, baseType: !73, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !64, file: !63, line: 195, baseType: !78, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !80, line: 65, baseType: !81)
!80 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!81 = !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 43, size: 128, align: 64, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !80, line: 54, baseType: !73, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !80, line: 63, baseType: !47, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !64, file: !63, line: 212, baseType: !86, size: 512, align: 8, offset: 320)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 512, align: 8, elements: !89)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !68, line: 48, baseType: !88)
!88 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!89 = !{!90}
!90 = !DISubrange(count: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !64, file: !63, line: 221, baseType: !47, size: 64, align: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !64, file: !63, line: 222, baseType: !47, size: 64, align: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !64, file: !63, line: 223, baseType: !47, size: 64, align: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !64, file: !63, line: 224, baseType: !67, size: 32, align: 32, offset: 1024)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !64, file: !63, line: 225, baseType: !67, size: 32, align: 32, offset: 1056)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !64, file: !63, line: 226, baseType: !73, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !64, file: !63, line: 227, baseType: !73, size: 64, align: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !64, file: !63, line: 228, baseType: !73, size: 64, align: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !64, file: !63, line: 229, baseType: !73, size: 64, align: 64, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !64, file: !63, line: 230, baseType: !73, size: 64, align: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !64, file: !63, line: 231, baseType: !73, size: 64, align: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !64, file: !63, line: 232, baseType: !103, size: 32, align: 32, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !25)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !64, file: !63, line: 233, baseType: !103, size: 32, align: 32, offset: 1504)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !64, file: !63, line: 234, baseType: !103, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !64, file: !63, line: 235, baseType: !103, size: 32, align: 32, offset: 1568)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !64, file: !63, line: 236, baseType: !108, size: 8, align: 8, offset: 1600)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !88)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !64, file: !63, line: 237, baseType: !108, size: 8, align: 8, offset: 1608)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !64, file: !63, line: 238, baseType: !108, size: 8, align: 8, offset: 1616)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !64, file: !63, line: 239, baseType: !108, size: 8, align: 8, offset: 1624)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !64, file: !63, line: 240, baseType: !108, size: 8, align: 8, offset: 1632)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !64, file: !63, line: 241, baseType: !108, size: 8, align: 8, offset: 1640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !64, file: !63, line: 242, baseType: !108, size: 8, align: 8, offset: 1648)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !64, file: !63, line: 243, baseType: !108, size: 8, align: 8, offset: 1656)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !119)
!119 = !{!120, !124, !128}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !118, file: !4, line: 376, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!47, !47, !49, !49}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !118, file: !4, line: 390, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !47, !47}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !118, file: !4, line: 401, baseType: !47, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!133 = distinct !DISubprogram(name: "lzma2_bound", scope: !1, file: !1, line: 32, type: !134, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!134 = !DISubroutineType(types: !135)
!135 = !{!73, !73}
!136 = distinct !DISubprogram(name: "block_encode_normal", scope: !1, file: !1, line: 166, type: !58, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!137 = distinct !DISubprogram(name: "block_encode_uncompressed", scope: !1, file: !1, line: 84, type: !138, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!138 = !DISubroutineType(types: !139)
!139 = !{!60, !61, !129, !49, !131, !132, !49}
!140 = !{!141}
!141 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !142, line: 159, type: !143, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!142 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !142, line: 75, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !142, line: 119, size: 512, align: 64, elements: !146)
!146 = !{!147, !151, !152, !154, !163, !168, !174, !179}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !145, file: !142, line: 121, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !142, line: 73, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !142, line: 73, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !142, line: 125, baseType: !73, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !145, file: !142, line: 131, baseType: !153, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !68, line: 122, baseType: !51)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !145, file: !142, line: 134, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !142, line: 89, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!60, !148, !116, !159, !160, !49, !161, !160, !49, !162}
!159 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !129)
!160 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !132)
!161 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !131)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !28)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !145, file: !142, line: 139, baseType: !164, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !142, line: 97, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !148, !116}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !145, file: !142, line: 143, baseType: !169, size: 64, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!71, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !145, file: !142, line: 147, baseType: !175, size: 64, align: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!60, !148, !178, !178, !75}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !145, file: !142, line: 152, baseType: !180, size: 64, align: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!60, !148, !116, !183, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!188 = !DILocalVariable(name: "uncompressed_size", arg: 1, scope: !53, file: !1, line: 57, type: !49)
!189 = !DIExpression()
!190 = !DILocation(line: 57, column: 32, scope: !53)
!191 = !DILocalVariable(name: "lzma2_size", scope: !53, file: !1, line: 64, type: !73)
!192 = !DILocation(line: 64, column: 11, scope: !53)
!193 = !DILocation(line: 64, column: 36, scope: !53)
!194 = !DILocation(line: 64, column: 24, scope: !53)
!195 = !DILocation(line: 65, column: 6, scope: !196)
!196 = distinct !DILexicalBlock(scope: !53, file: !1, line: 65, column: 6)
!197 = !DILocation(line: 65, column: 17, scope: !196)
!198 = !DILocation(line: 65, column: 6, scope: !53)
!199 = !DILocation(line: 66, column: 3, scope: !196)
!200 = !DILocation(line: 69, column: 16, scope: !53)
!201 = !DILocation(line: 69, column: 27, scope: !53)
!202 = !DILocation(line: 69, column: 32, scope: !53)
!203 = !DILocation(line: 69, column: 13, scope: !53)
!204 = !DILocation(line: 79, column: 25, scope: !53)
!205 = !DILocation(line: 79, column: 23, scope: !53)
!206 = !DILocation(line: 79, column: 2, scope: !53)
!207 = !DILocation(line: 80, column: 1, scope: !53)
!208 = !DILocalVariable(name: "uncompressed_size", arg: 1, scope: !133, file: !1, line: 32, type: !73)
!209 = !DILocation(line: 32, column: 22, scope: !133)
!210 = !DILocalVariable(name: "overhead", scope: !133, file: !1, line: 34, type: !73)
!211 = !DILocation(line: 34, column: 11, scope: !133)
!212 = !DILocation(line: 37, column: 6, scope: !213)
!213 = distinct !DILexicalBlock(scope: !133, file: !1, line: 37, column: 6)
!214 = !DILocation(line: 37, column: 24, scope: !213)
!215 = !DILocation(line: 37, column: 6, scope: !133)
!216 = !DILocation(line: 38, column: 3, scope: !213)
!217 = !DILocation(line: 44, column: 15, scope: !133)
!218 = !DILocation(line: 44, column: 33, scope: !133)
!219 = !DILocation(line: 44, column: 51, scope: !133)
!220 = !DILocation(line: 45, column: 5, scope: !133)
!221 = !DILocation(line: 46, column: 4, scope: !133)
!222 = !DILocation(line: 46, column: 32, scope: !133)
!223 = !DILocation(line: 44, column: 11, scope: !133)
!224 = !DILocation(line: 49, column: 28, scope: !225)
!225 = distinct !DILexicalBlock(scope: !133, file: !1, line: 49, column: 6)
!226 = !DILocation(line: 49, column: 26, scope: !225)
!227 = !DILocation(line: 49, column: 39, scope: !225)
!228 = !DILocation(line: 49, column: 37, scope: !225)
!229 = !DILocation(line: 49, column: 6, scope: !133)
!230 = !DILocation(line: 50, column: 3, scope: !225)
!231 = !DILocation(line: 52, column: 9, scope: !133)
!232 = !DILocation(line: 52, column: 29, scope: !133)
!233 = !DILocation(line: 52, column: 27, scope: !133)
!234 = !DILocation(line: 52, column: 2, scope: !133)
!235 = !DILocation(line: 53, column: 1, scope: !133)
!236 = !DILocalVariable(name: "block", arg: 1, scope: !57, file: !1, line: 231, type: !61)
!237 = !DILocation(line: 231, column: 38, scope: !57)
!238 = !DILocalVariable(name: "allocator", arg: 2, scope: !57, file: !1, line: 231, type: !116)
!239 = !DILocation(line: 231, column: 61, scope: !57)
!240 = !DILocalVariable(name: "in", arg: 3, scope: !57, file: !1, line: 232, type: !129)
!241 = !DILocation(line: 232, column: 18, scope: !57)
!242 = !DILocalVariable(name: "in_size", arg: 4, scope: !57, file: !1, line: 232, type: !49)
!243 = !DILocation(line: 232, column: 29, scope: !57)
!244 = !DILocalVariable(name: "out", arg: 5, scope: !57, file: !1, line: 233, type: !131)
!245 = !DILocation(line: 233, column: 12, scope: !57)
!246 = !DILocalVariable(name: "out_pos", arg: 6, scope: !57, file: !1, line: 233, type: !132)
!247 = !DILocation(line: 233, column: 25, scope: !57)
!248 = !DILocalVariable(name: "out_size", arg: 7, scope: !57, file: !1, line: 233, type: !49)
!249 = !DILocation(line: 233, column: 41, scope: !57)
!250 = !DILocalVariable(name: "check_size", scope: !57, file: !1, line: 235, type: !49)
!251 = !DILocation(line: 235, column: 9, scope: !57)
!252 = !DILocalVariable(name: "ret", scope: !57, file: !1, line: 236, type: !60)
!253 = !DILocation(line: 236, column: 11, scope: !57)
!254 = !DILocalVariable(name: "i", scope: !57, file: !1, line: 237, type: !49)
!255 = !DILocation(line: 237, column: 9, scope: !57)
!256 = !DILocation(line: 240, column: 6, scope: !257)
!257 = distinct !DILexicalBlock(scope: !57, file: !1, line: 240, column: 6)
!258 = !DILocation(line: 240, column: 12, scope: !257)
!259 = !DILocation(line: 240, column: 20, scope: !257)
!260 = !DILocation(line: 240, column: 24, scope: !261)
!261 = !DILexicalBlockFile(scope: !257, file: !1, discriminator: 1)
!262 = !DILocation(line: 240, column: 27, scope: !261)
!263 = !DILocation(line: 240, column: 35, scope: !261)
!264 = !DILocation(line: 240, column: 38, scope: !265)
!265 = !DILexicalBlockFile(scope: !257, file: !1, discriminator: 2)
!266 = !DILocation(line: 240, column: 46, scope: !265)
!267 = !DILocation(line: 240, column: 52, scope: !265)
!268 = !DILocation(line: 240, column: 55, scope: !269)
!269 = !DILexicalBlockFile(scope: !257, file: !1, discriminator: 3)
!270 = !DILocation(line: 240, column: 59, scope: !269)
!271 = !DILocation(line: 241, column: 4, scope: !257)
!272 = !DILocation(line: 241, column: 7, scope: !261)
!273 = !DILocation(line: 241, column: 15, scope: !261)
!274 = !DILocation(line: 241, column: 23, scope: !261)
!275 = !DILocation(line: 241, column: 27, scope: !265)
!276 = !DILocation(line: 241, column: 26, scope: !265)
!277 = !DILocation(line: 241, column: 37, scope: !265)
!278 = !DILocation(line: 241, column: 35, scope: !265)
!279 = !DILocation(line: 240, column: 6, scope: !280)
!280 = !DILexicalBlockFile(scope: !57, file: !1, discriminator: 4)
!281 = !DILocation(line: 242, column: 3, scope: !257)
!282 = !DILocation(line: 246, column: 6, scope: !283)
!283 = distinct !DILexicalBlock(scope: !57, file: !1, line: 246, column: 6)
!284 = !DILocation(line: 246, column: 13, scope: !283)
!285 = !DILocation(line: 246, column: 21, scope: !283)
!286 = !DILocation(line: 246, column: 6, scope: !57)
!287 = !DILocation(line: 247, column: 3, scope: !283)
!288 = !DILocation(line: 249, column: 21, scope: !289)
!289 = distinct !DILexicalBlock(scope: !57, file: !1, line: 249, column: 6)
!290 = !DILocation(line: 249, column: 28, scope: !289)
!291 = !DILocation(line: 249, column: 35, scope: !289)
!292 = !DILocation(line: 250, column: 4, scope: !289)
!293 = !DILocation(line: 250, column: 7, scope: !294)
!294 = !DILexicalBlockFile(scope: !289, file: !1, discriminator: 1)
!295 = !DILocation(line: 250, column: 14, scope: !294)
!296 = !DILocation(line: 250, column: 22, scope: !294)
!297 = !DILocation(line: 249, column: 6, scope: !298)
!298 = !DILexicalBlockFile(scope: !57, file: !1, discriminator: 1)
!299 = !DILocation(line: 251, column: 3, scope: !289)
!300 = !DILocation(line: 253, column: 31, scope: !301)
!301 = distinct !DILexicalBlock(scope: !57, file: !1, line: 253, column: 6)
!302 = !DILocation(line: 253, column: 38, scope: !301)
!303 = !DILocation(line: 253, column: 7, scope: !301)
!304 = !DILocation(line: 253, column: 6, scope: !57)
!305 = !DILocation(line: 254, column: 3, scope: !301)
!306 = !DILocation(line: 259, column: 15, scope: !57)
!307 = !DILocation(line: 259, column: 27, scope: !57)
!308 = !DILocation(line: 259, column: 26, scope: !57)
!309 = !DILocation(line: 259, column: 24, scope: !57)
!310 = !DILocation(line: 259, column: 36, scope: !57)
!311 = !DILocation(line: 259, column: 11, scope: !57)
!312 = !DILocation(line: 262, column: 31, scope: !57)
!313 = !DILocation(line: 262, column: 38, scope: !57)
!314 = !DILocation(line: 262, column: 15, scope: !57)
!315 = !DILocation(line: 262, column: 13, scope: !57)
!316 = !DILocation(line: 263, column: 2, scope: !57)
!317 = !DILocation(line: 263, column: 2, scope: !298)
!318 = !DILocation(line: 263, column: 2, scope: !319)
!319 = !DILexicalBlockFile(scope: !57, file: !1, discriminator: 2)
!320 = !DILocation(line: 263, column: 2, scope: !321)
!321 = !DILexicalBlockFile(scope: !57, file: !1, discriminator: 3)
!322 = !DILocation(line: 266, column: 6, scope: !323)
!323 = distinct !DILexicalBlock(scope: !57, file: !1, line: 266, column: 6)
!324 = !DILocation(line: 266, column: 18, scope: !323)
!325 = !DILocation(line: 266, column: 17, scope: !323)
!326 = !DILocation(line: 266, column: 15, scope: !323)
!327 = !DILocation(line: 266, column: 29, scope: !323)
!328 = !DILocation(line: 266, column: 26, scope: !323)
!329 = !DILocation(line: 266, column: 6, scope: !57)
!330 = !DILocation(line: 267, column: 3, scope: !323)
!331 = !DILocation(line: 269, column: 14, scope: !57)
!332 = !DILocation(line: 269, column: 11, scope: !57)
!333 = !DILocation(line: 272, column: 28, scope: !57)
!334 = !DILocation(line: 272, column: 35, scope: !57)
!335 = !DILocation(line: 273, column: 4, scope: !57)
!336 = !DILocation(line: 273, column: 8, scope: !57)
!337 = !DILocation(line: 273, column: 17, scope: !57)
!338 = !DILocation(line: 273, column: 22, scope: !57)
!339 = !DILocation(line: 273, column: 31, scope: !57)
!340 = !DILocation(line: 272, column: 8, scope: !57)
!341 = !DILocation(line: 272, column: 6, scope: !57)
!342 = !DILocation(line: 274, column: 6, scope: !343)
!343 = distinct !DILexicalBlock(scope: !57, file: !1, line: 274, column: 6)
!344 = !DILocation(line: 274, column: 10, scope: !343)
!345 = !DILocation(line: 274, column: 6, scope: !57)
!346 = !DILocation(line: 277, column: 7, scope: !347)
!347 = distinct !DILexicalBlock(scope: !348, file: !1, line: 277, column: 7)
!348 = distinct !DILexicalBlock(scope: !343, file: !1, line: 274, column: 22)
!349 = !DILocation(line: 277, column: 11, scope: !347)
!350 = !DILocation(line: 277, column: 7, scope: !348)
!351 = !DILocation(line: 278, column: 11, scope: !347)
!352 = !DILocation(line: 278, column: 4, scope: !347)
!353 = !DILocation(line: 285, column: 3, scope: !348)
!354 = !DILocalVariable(name: "ret_", scope: !355, file: !1, line: 285, type: !356)
!355 = distinct !DILexicalBlock(scope: !348, file: !1, line: 285, column: 3)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!357 = !DILocation(line: 285, column: 3, scope: !355)
!358 = !DILocation(line: 285, column: 3, scope: !359)
!359 = !DILexicalBlockFile(scope: !355, file: !1, discriminator: 1)
!360 = !DILocation(line: 285, column: 3, scope: !361)
!361 = !DILexicalBlockFile(scope: !362, file: !1, discriminator: 2)
!362 = distinct !DILexicalBlock(scope: !355, file: !1, line: 285, column: 3)
!363 = !DILocation(line: 285, column: 3, scope: !364)
!364 = !DILexicalBlockFile(scope: !355, file: !1, discriminator: 3)
!365 = !DILocation(line: 287, column: 2, scope: !348)
!366 = !DILocation(line: 289, column: 2, scope: !57)
!367 = !DILocation(line: 289, column: 2, scope: !298)
!368 = !DILocation(line: 289, column: 2, scope: !319)
!369 = !DILocation(line: 289, column: 2, scope: !321)
!370 = !DILocation(line: 294, column: 20, scope: !371)
!371 = distinct !DILexicalBlock(scope: !57, file: !1, line: 294, column: 2)
!372 = !DILocation(line: 294, column: 27, scope: !371)
!373 = !DILocation(line: 294, column: 9, scope: !371)
!374 = !DILocation(line: 294, column: 7, scope: !371)
!375 = !DILocation(line: 294, column: 45, scope: !376)
!376 = !DILexicalBlockFile(scope: !377, file: !1, discriminator: 1)
!377 = distinct !DILexicalBlock(scope: !371, file: !1, line: 294, column: 2)
!378 = !DILocation(line: 294, column: 47, scope: !376)
!379 = !DILocation(line: 294, column: 2, scope: !376)
!380 = !DILocation(line: 295, column: 3, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !1, line: 294, column: 57)
!382 = !DILocation(line: 295, column: 3, scope: !383)
!383 = !DILexicalBlockFile(scope: !381, file: !1, discriminator: 1)
!384 = !DILocation(line: 295, column: 3, scope: !385)
!385 = !DILexicalBlockFile(scope: !381, file: !1, discriminator: 2)
!386 = !DILocation(line: 295, column: 3, scope: !387)
!387 = !DILexicalBlockFile(scope: !381, file: !1, discriminator: 3)
!388 = !DILocation(line: 296, column: 9, scope: !381)
!389 = !DILocation(line: 296, column: 17, scope: !381)
!390 = !DILocation(line: 296, column: 3, scope: !381)
!391 = !DILocation(line: 296, column: 21, scope: !381)
!392 = !DILocation(line: 297, column: 2, scope: !381)
!393 = !DILocation(line: 294, column: 52, scope: !394)
!394 = !DILexicalBlockFile(scope: !377, file: !1, discriminator: 2)
!395 = !DILocation(line: 294, column: 2, scope: !394)
!396 = !DILocation(line: 300, column: 6, scope: !397)
!397 = distinct !DILexicalBlock(scope: !57, file: !1, line: 300, column: 6)
!398 = !DILocation(line: 300, column: 17, scope: !397)
!399 = !DILocation(line: 300, column: 6, scope: !57)
!400 = !DILocalVariable(name: "check", scope: !401, file: !1, line: 304, type: !402)
!401 = distinct !DILexicalBlock(scope: !397, file: !1, line: 300, column: 22)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !403, line: 56, baseType: !404)
!403 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/check/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 34, size: 832, align: 64, elements: !405)
!405 = !{!406, !418}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !404, file: !403, line: 40, baseType: !407, size: 512, align: 64)
!407 = !DICompositeType(tag: DW_TAG_union_type, scope: !404, file: !403, line: 36, size: 512, align: 64, elements: !408)
!408 = !{!409, !410, !414}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !407, file: !403, line: 37, baseType: !86, size: 512, align: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !407, file: !403, line: 38, baseType: !411, size: 512, align: 32)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 512, align: 32, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !407, file: !403, line: 39, baseType: !415, size: 512, align: 64)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, align: 64, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !403, line: 54, baseType: !419, size: 320, align: 64, offset: 512)
!419 = !DICompositeType(tag: DW_TAG_union_type, scope: !404, file: !403, line: 43, size: 320, align: 64, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !419, file: !403, line: 44, baseType: !67, size: 32, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !419, file: !403, line: 45, baseType: !75, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !419, file: !403, line: 53, baseType: !424, size: 320, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !403, line: 47, size: 320, align: 64, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !424, file: !403, line: 49, baseType: !427, size: 256, align: 32)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, align: 32, elements: !416)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !424, file: !403, line: 52, baseType: !75, size: 64, align: 64, offset: 256)
!429 = !DILocation(line: 304, column: 20, scope: !401)
!430 = !DILocation(line: 305, column: 27, scope: !401)
!431 = !DILocation(line: 305, column: 34, scope: !401)
!432 = !DILocation(line: 305, column: 3, scope: !401)
!433 = !DILocation(line: 306, column: 29, scope: !401)
!434 = !DILocation(line: 306, column: 36, scope: !401)
!435 = !DILocation(line: 306, column: 43, scope: !401)
!436 = !DILocation(line: 306, column: 47, scope: !401)
!437 = !DILocation(line: 306, column: 3, scope: !401)
!438 = !DILocation(line: 307, column: 29, scope: !401)
!439 = !DILocation(line: 307, column: 36, scope: !401)
!440 = !DILocation(line: 307, column: 3, scope: !401)
!441 = !DILocation(line: 309, column: 10, scope: !401)
!442 = !DILocation(line: 309, column: 17, scope: !401)
!443 = !DILocation(line: 309, column: 3, scope: !401)
!444 = !DILocation(line: 309, column: 34, scope: !401)
!445 = !DILocation(line: 309, column: 41, scope: !401)
!446 = !DILocation(line: 309, column: 45, scope: !401)
!447 = !DILocation(line: 310, column: 10, scope: !401)
!448 = !DILocation(line: 310, column: 17, scope: !401)
!449 = !DILocation(line: 310, column: 16, scope: !401)
!450 = !DILocation(line: 310, column: 14, scope: !401)
!451 = !DILocation(line: 310, column: 32, scope: !401)
!452 = !DILocation(line: 310, column: 39, scope: !401)
!453 = !DILocation(line: 310, column: 3, scope: !401)
!454 = !DILocation(line: 310, column: 43, scope: !401)
!455 = !DILocation(line: 311, column: 15, scope: !401)
!456 = !DILocation(line: 311, column: 4, scope: !401)
!457 = !DILocation(line: 311, column: 12, scope: !401)
!458 = !DILocation(line: 312, column: 2, scope: !401)
!459 = !DILocation(line: 314, column: 2, scope: !57)
!460 = !DILocation(line: 315, column: 1, scope: !57)
!461 = !DILocalVariable(name: "block", arg: 1, scope: !136, file: !1, line: 166, type: !61)
!462 = !DILocation(line: 166, column: 33, scope: !136)
!463 = !DILocalVariable(name: "allocator", arg: 2, scope: !136, file: !1, line: 166, type: !116)
!464 = !DILocation(line: 166, column: 56, scope: !136)
!465 = !DILocalVariable(name: "in", arg: 3, scope: !136, file: !1, line: 167, type: !129)
!466 = !DILocation(line: 167, column: 18, scope: !136)
!467 = !DILocalVariable(name: "in_size", arg: 4, scope: !136, file: !1, line: 167, type: !49)
!468 = !DILocation(line: 167, column: 29, scope: !136)
!469 = !DILocalVariable(name: "out", arg: 5, scope: !136, file: !1, line: 168, type: !131)
!470 = !DILocation(line: 168, column: 12, scope: !136)
!471 = !DILocalVariable(name: "out_pos", arg: 6, scope: !136, file: !1, line: 168, type: !132)
!472 = !DILocation(line: 168, column: 25, scope: !136)
!473 = !DILocalVariable(name: "out_size", arg: 7, scope: !136, file: !1, line: 168, type: !49)
!474 = !DILocation(line: 168, column: 41, scope: !136)
!475 = !DILocalVariable(name: "out_start", scope: !136, file: !1, line: 170, type: !49)
!476 = !DILocation(line: 170, column: 9, scope: !136)
!477 = !DILocalVariable(name: "raw_encoder", scope: !136, file: !1, line: 171, type: !144)
!478 = !DILocation(line: 171, column: 18, scope: !136)
!479 = !DILocation(line: 171, column: 32, scope: !136)
!480 = !DILocalVariable(name: "ret", scope: !136, file: !1, line: 172, type: !60)
!481 = !DILocation(line: 172, column: 11, scope: !136)
!482 = !DILocation(line: 175, column: 39, scope: !136)
!483 = !DILocation(line: 175, column: 27, scope: !136)
!484 = !DILocation(line: 175, column: 2, scope: !136)
!485 = !DILocation(line: 175, column: 9, scope: !136)
!486 = !DILocation(line: 175, column: 25, scope: !136)
!487 = !DILocation(line: 176, column: 6, scope: !488)
!488 = distinct !DILexicalBlock(scope: !136, file: !1, line: 176, column: 6)
!489 = !DILocation(line: 176, column: 13, scope: !488)
!490 = !DILocation(line: 176, column: 29, scope: !488)
!491 = !DILocation(line: 176, column: 6, scope: !136)
!492 = !DILocation(line: 177, column: 3, scope: !488)
!493 = !DILocation(line: 179, column: 29, scope: !136)
!494 = !DILocation(line: 179, column: 2, scope: !136)
!495 = !DILocation(line: 179, column: 9, scope: !136)
!496 = !DILocation(line: 179, column: 27, scope: !136)
!497 = !DILocation(line: 180, column: 2, scope: !136)
!498 = !DILocalVariable(name: "ret_", scope: !499, file: !1, line: 180, type: !356)
!499 = distinct !DILexicalBlock(scope: !136, file: !1, line: 180, column: 2)
!500 = !DILocation(line: 180, column: 2, scope: !499)
!501 = !DILocation(line: 180, column: 2, scope: !502)
!502 = !DILexicalBlockFile(scope: !499, file: !1, discriminator: 1)
!503 = !DILocation(line: 180, column: 2, scope: !504)
!504 = !DILexicalBlockFile(scope: !505, file: !1, discriminator: 2)
!505 = distinct !DILexicalBlock(scope: !499, file: !1, line: 180, column: 2)
!506 = !DILocation(line: 180, column: 2, scope: !507)
!507 = !DILexicalBlockFile(scope: !499, file: !1, discriminator: 3)
!508 = !DILocation(line: 183, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !136, file: !1, line: 183, column: 6)
!510 = !DILocation(line: 183, column: 18, scope: !509)
!511 = !DILocation(line: 183, column: 17, scope: !509)
!512 = !DILocation(line: 183, column: 15, scope: !509)
!513 = !DILocation(line: 183, column: 29, scope: !509)
!514 = !DILocation(line: 183, column: 36, scope: !509)
!515 = !DILocation(line: 183, column: 26, scope: !509)
!516 = !DILocation(line: 183, column: 6, scope: !136)
!517 = !DILocation(line: 184, column: 3, scope: !509)
!518 = !DILocation(line: 186, column: 15, scope: !136)
!519 = !DILocation(line: 186, column: 14, scope: !136)
!520 = !DILocation(line: 186, column: 12, scope: !136)
!521 = !DILocation(line: 187, column: 14, scope: !136)
!522 = !DILocation(line: 187, column: 21, scope: !136)
!523 = !DILocation(line: 187, column: 3, scope: !136)
!524 = !DILocation(line: 187, column: 11, scope: !136)
!525 = !DILocation(line: 191, column: 6, scope: !526)
!526 = distinct !DILexicalBlock(scope: !136, file: !1, line: 191, column: 6)
!527 = !DILocation(line: 191, column: 18, scope: !526)
!528 = !DILocation(line: 191, column: 17, scope: !526)
!529 = !DILocation(line: 191, column: 15, scope: !526)
!530 = !DILocation(line: 191, column: 28, scope: !526)
!531 = !DILocation(line: 191, column: 35, scope: !526)
!532 = !DILocation(line: 191, column: 26, scope: !526)
!533 = !DILocation(line: 191, column: 6, scope: !136)
!534 = !DILocation(line: 192, column: 15, scope: !526)
!535 = !DILocation(line: 192, column: 14, scope: !526)
!536 = !DILocation(line: 192, column: 25, scope: !526)
!537 = !DILocation(line: 192, column: 32, scope: !526)
!538 = !DILocation(line: 192, column: 23, scope: !526)
!539 = !DILocation(line: 192, column: 12, scope: !526)
!540 = !DILocation(line: 192, column: 3, scope: !526)
!541 = !DILocation(line: 197, column: 18, scope: !136)
!542 = !DILocation(line: 197, column: 29, scope: !136)
!543 = !DILocation(line: 197, column: 36, scope: !136)
!544 = !DILocation(line: 196, column: 8, scope: !136)
!545 = !DILocation(line: 196, column: 6, scope: !136)
!546 = !DILocation(line: 199, column: 6, scope: !547)
!547 = distinct !DILexicalBlock(scope: !136, file: !1, line: 199, column: 6)
!548 = !DILocation(line: 199, column: 10, scope: !547)
!549 = !DILocation(line: 199, column: 6, scope: !136)
!550 = !DILocalVariable(name: "in_pos", scope: !551, file: !1, line: 200, type: !49)
!551 = distinct !DILexicalBlock(scope: !547, file: !1, line: 199, column: 22)
!552 = !DILocation(line: 200, column: 10, scope: !551)
!553 = !DILocation(line: 201, column: 21, scope: !551)
!554 = !DILocation(line: 201, column: 38, scope: !551)
!555 = !DILocation(line: 201, column: 45, scope: !551)
!556 = !DILocation(line: 202, column: 5, scope: !551)
!557 = !DILocation(line: 202, column: 18, scope: !551)
!558 = !DILocation(line: 202, column: 27, scope: !551)
!559 = !DILocation(line: 202, column: 32, scope: !551)
!560 = !DILocation(line: 202, column: 41, scope: !551)
!561 = !DILocation(line: 201, column: 9, scope: !551)
!562 = !DILocation(line: 201, column: 7, scope: !551)
!563 = !DILocation(line: 204, column: 2, scope: !551)
!564 = !DILocation(line: 207, column: 30, scope: !136)
!565 = !DILocation(line: 207, column: 2, scope: !136)
!566 = !DILocation(line: 209, column: 6, scope: !567)
!567 = distinct !DILexicalBlock(scope: !136, file: !1, line: 209, column: 6)
!568 = !DILocation(line: 209, column: 10, scope: !567)
!569 = !DILocation(line: 209, column: 6, scope: !136)
!570 = !DILocation(line: 212, column: 8, scope: !571)
!571 = distinct !DILexicalBlock(scope: !567, file: !1, line: 209, column: 30)
!572 = !DILocation(line: 212, column: 7, scope: !571)
!573 = !DILocation(line: 212, column: 19, scope: !571)
!574 = !DILocation(line: 212, column: 31, scope: !571)
!575 = !DILocation(line: 212, column: 38, scope: !571)
!576 = !DILocation(line: 212, column: 29, scope: !571)
!577 = !DILocation(line: 212, column: 16, scope: !571)
!578 = !DILocation(line: 211, column: 3, scope: !571)
!579 = !DILocation(line: 211, column: 10, scope: !571)
!580 = !DILocation(line: 212, column: 5, scope: !571)
!581 = !DILocation(line: 213, column: 34, scope: !571)
!582 = !DILocation(line: 213, column: 41, scope: !571)
!583 = !DILocation(line: 213, column: 47, scope: !571)
!584 = !DILocation(line: 213, column: 45, scope: !571)
!585 = !DILocation(line: 213, column: 9, scope: !571)
!586 = !DILocation(line: 213, column: 7, scope: !571)
!587 = !DILocation(line: 214, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !571, file: !1, line: 214, column: 7)
!589 = !DILocation(line: 214, column: 11, scope: !588)
!590 = !DILocation(line: 214, column: 7, scope: !571)
!591 = !DILocation(line: 215, column: 8, scope: !588)
!592 = !DILocation(line: 215, column: 4, scope: !588)
!593 = !DILocation(line: 217, column: 2, scope: !571)
!594 = !DILocation(line: 217, column: 13, scope: !595)
!595 = !DILexicalBlockFile(scope: !596, file: !1, discriminator: 1)
!596 = distinct !DILexicalBlock(scope: !567, file: !1, line: 217, column: 13)
!597 = !DILocation(line: 217, column: 17, scope: !595)
!598 = !DILocation(line: 219, column: 7, scope: !599)
!599 = distinct !DILexicalBlock(scope: !596, file: !1, line: 217, column: 29)
!600 = !DILocation(line: 220, column: 2, scope: !599)
!601 = !DILocation(line: 223, column: 6, scope: !602)
!602 = distinct !DILexicalBlock(scope: !136, file: !1, line: 223, column: 6)
!603 = !DILocation(line: 223, column: 10, scope: !602)
!604 = !DILocation(line: 223, column: 6, scope: !136)
!605 = !DILocation(line: 224, column: 14, scope: !602)
!606 = !DILocation(line: 224, column: 4, scope: !602)
!607 = !DILocation(line: 224, column: 12, scope: !602)
!608 = !DILocation(line: 224, column: 3, scope: !602)
!609 = !DILocation(line: 226, column: 9, scope: !136)
!610 = !DILocation(line: 226, column: 2, scope: !136)
!611 = !DILocation(line: 227, column: 1, scope: !136)
!612 = !DILocalVariable(name: "block", arg: 1, scope: !137, file: !1, line: 84, type: !61)
!613 = !DILocation(line: 84, column: 39, scope: !137)
!614 = !DILocalVariable(name: "in", arg: 2, scope: !137, file: !1, line: 84, type: !129)
!615 = !DILocation(line: 84, column: 61, scope: !137)
!616 = !DILocalVariable(name: "in_size", arg: 3, scope: !137, file: !1, line: 84, type: !49)
!617 = !DILocation(line: 84, column: 72, scope: !137)
!618 = !DILocalVariable(name: "out", arg: 4, scope: !137, file: !1, line: 85, type: !131)
!619 = !DILocation(line: 85, column: 12, scope: !137)
!620 = !DILocalVariable(name: "out_pos", arg: 5, scope: !137, file: !1, line: 85, type: !132)
!621 = !DILocation(line: 85, column: 25, scope: !137)
!622 = !DILocalVariable(name: "out_size", arg: 6, scope: !137, file: !1, line: 85, type: !49)
!623 = !DILocation(line: 85, column: 41, scope: !137)
!624 = !DILocalVariable(name: "in_pos", scope: !137, file: !1, line: 87, type: !49)
!625 = !DILocation(line: 87, column: 9, scope: !137)
!626 = !DILocalVariable(name: "control", scope: !137, file: !1, line: 88, type: !87)
!627 = !DILocation(line: 88, column: 10, scope: !137)
!628 = !DILocalVariable(name: "filters_orig", scope: !137, file: !1, line: 89, type: !78)
!629 = !DILocation(line: 89, column: 15, scope: !137)
!630 = !DILocalVariable(name: "lzma2", scope: !137, file: !1, line: 97, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !35, line: 399, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 185, size: 896, align: 64, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !642, !643, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !632, file: !35, line: 217, baseType: !67, size: 32, align: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !632, file: !35, line: 240, baseType: !129, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !632, file: !35, line: 254, baseType: !67, size: 32, align: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !632, file: !35, line: 281, baseType: !67, size: 32, align: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !632, file: !35, line: 293, baseType: !67, size: 32, align: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !632, file: !35, line: 316, baseType: !67, size: 32, align: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !632, file: !35, line: 322, baseType: !641, size: 32, align: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !35, line: 155, baseType: !34)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !632, file: !35, line: 342, baseType: !67, size: 32, align: 32, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !632, file: !35, line: 345, baseType: !644, size: 32, align: 32, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !35, line: 111, baseType: !39)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !632, file: !35, line: 375, baseType: !67, size: 32, align: 32, offset: 352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !632, file: !35, line: 384, baseType: !67, size: 32, align: 32, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !632, file: !35, line: 385, baseType: !67, size: 32, align: 32, offset: 416)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !632, file: !35, line: 386, baseType: !67, size: 32, align: 32, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !632, file: !35, line: 387, baseType: !67, size: 32, align: 32, offset: 480)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !632, file: !35, line: 388, baseType: !67, size: 32, align: 32, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !632, file: !35, line: 389, baseType: !67, size: 32, align: 32, offset: 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !632, file: !35, line: 390, baseType: !67, size: 32, align: 32, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !632, file: !35, line: 391, baseType: !67, size: 32, align: 32, offset: 608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !632, file: !35, line: 392, baseType: !103, size: 32, align: 32, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !632, file: !35, line: 393, baseType: !103, size: 32, align: 32, offset: 672)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !632, file: !35, line: 394, baseType: !103, size: 32, align: 32, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !632, file: !35, line: 395, baseType: !103, size: 32, align: 32, offset: 736)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !632, file: !35, line: 396, baseType: !47, size: 64, align: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !632, file: !35, line: 397, baseType: !47, size: 64, align: 64, offset: 832)
!660 = !DILocation(line: 97, column: 20, scope: !137)
!661 = !DILocalVariable(name: "filters", scope: !137, file: !1, line: 99, type: !662)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, align: 64, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 2)
!665 = !DILocation(line: 99, column: 14, scope: !137)
!666 = !DILocation(line: 100, column: 2, scope: !137)
!667 = !DILocation(line: 100, column: 13, scope: !137)
!668 = !DILocation(line: 100, column: 16, scope: !137)
!669 = !DILocation(line: 101, column: 23, scope: !137)
!670 = !DILocation(line: 101, column: 2, scope: !137)
!671 = !DILocation(line: 101, column: 13, scope: !137)
!672 = !DILocation(line: 101, column: 21, scope: !137)
!673 = !DILocation(line: 102, column: 2, scope: !137)
!674 = !DILocation(line: 102, column: 13, scope: !137)
!675 = !DILocation(line: 102, column: 16, scope: !137)
!676 = !DILocation(line: 106, column: 17, scope: !137)
!677 = !DILocation(line: 106, column: 24, scope: !137)
!678 = !DILocation(line: 106, column: 15, scope: !137)
!679 = !DILocation(line: 107, column: 19, scope: !137)
!680 = !DILocation(line: 107, column: 2, scope: !137)
!681 = !DILocation(line: 107, column: 9, scope: !137)
!682 = !DILocation(line: 107, column: 17, scope: !137)
!683 = !DILocation(line: 109, column: 29, scope: !684)
!684 = distinct !DILexicalBlock(scope: !137, file: !1, line: 109, column: 6)
!685 = !DILocation(line: 109, column: 6, scope: !684)
!686 = !DILocation(line: 109, column: 36, scope: !684)
!687 = !DILocation(line: 109, column: 6, scope: !137)
!688 = !DILocation(line: 110, column: 20, scope: !689)
!689 = distinct !DILexicalBlock(scope: !684, file: !1, line: 109, column: 48)
!690 = !DILocation(line: 110, column: 3, scope: !689)
!691 = !DILocation(line: 110, column: 10, scope: !689)
!692 = !DILocation(line: 110, column: 18, scope: !689)
!693 = !DILocation(line: 111, column: 3, scope: !689)
!694 = !DILocation(line: 119, column: 2, scope: !137)
!695 = !DILocation(line: 119, column: 2, scope: !696)
!696 = !DILexicalBlockFile(scope: !137, file: !1, discriminator: 1)
!697 = !DILocation(line: 119, column: 2, scope: !698)
!698 = !DILexicalBlockFile(scope: !137, file: !1, discriminator: 2)
!699 = !DILocation(line: 119, column: 2, scope: !700)
!700 = !DILexicalBlockFile(scope: !137, file: !1, discriminator: 3)
!701 = !DILocation(line: 120, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !137, file: !1, line: 120, column: 6)
!703 = !DILocation(line: 120, column: 18, scope: !702)
!704 = !DILocation(line: 120, column: 17, scope: !702)
!705 = !DILocation(line: 120, column: 15, scope: !702)
!706 = !DILocation(line: 121, column: 6, scope: !702)
!707 = !DILocation(line: 121, column: 13, scope: !702)
!708 = !DILocation(line: 121, column: 27, scope: !702)
!709 = !DILocation(line: 121, column: 34, scope: !702)
!710 = !DILocation(line: 121, column: 25, scope: !702)
!711 = !DILocation(line: 121, column: 4, scope: !702)
!712 = !DILocation(line: 120, column: 6, scope: !137)
!713 = !DILocation(line: 122, column: 20, scope: !714)
!714 = distinct !DILexicalBlock(scope: !702, file: !1, line: 121, column: 51)
!715 = !DILocation(line: 122, column: 3, scope: !714)
!716 = !DILocation(line: 122, column: 10, scope: !714)
!717 = !DILocation(line: 122, column: 18, scope: !714)
!718 = !DILocation(line: 123, column: 3, scope: !714)
!719 = !DILocation(line: 126, column: 31, scope: !720)
!720 = distinct !DILexicalBlock(scope: !137, file: !1, line: 126, column: 6)
!721 = !DILocation(line: 126, column: 38, scope: !720)
!722 = !DILocation(line: 126, column: 45, scope: !720)
!723 = !DILocation(line: 126, column: 44, scope: !720)
!724 = !DILocation(line: 126, column: 42, scope: !720)
!725 = !DILocation(line: 126, column: 6, scope: !720)
!726 = !DILocation(line: 126, column: 54, scope: !720)
