; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { i32, %struct.lzma_next_coder_s, %struct.lzma_block*, i64, i64, i64, i64, %struct.lzma_check_state }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !214, subprograms: !215, globals: !257)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/block_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !87, !144, !70, !195}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 19, size: 32, align: 32, elements: !191)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 18, size: 1728, align: 64, elements: !20)
!20 = !{!21, !22, !112, !159, !160, !161, !162, !163}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 23, baseType: !18, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !1, line: 26, baseType: !23, size: 512, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !24, line: 75, baseType: !25)
!24 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !24, line: 119, size: 512, align: 64, elements: !26)
!26 = !{!27, !30, !36, !38, !76, !81, !95, !100}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !25, file: !24, line: 121, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !24, line: 73, baseType: !19)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !25, file: !24, line: 125, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !32, line: 63, baseType: !33)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !34, line: 55, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!35 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !25, file: !24, line: 131, baseType: !37, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !34, line: 122, baseType: !35)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !25, file: !24, line: 134, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !24, line: 89, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !28, !44, !60, !65, !53, !67, !65, !53, !69}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !47)
!47 = !{!48, !55, !59}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !4, line: 376, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !52, !53, !53}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 62, baseType: !35)
!54 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !46, file: !4, line: 390, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !52, !52}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !46, file: !4, line: 401, baseType: !52, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !34, line: 48, baseType: !64)
!64 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!73 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!74 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!75 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !25, file: !24, line: 139, baseType: !77, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !24, line: 97, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !28, !44}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !25, file: !24, line: 143, baseType: !82, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !93}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !86, line: 55, baseType: !87)
!86 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 27, size: 32, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!90 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!91 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!92 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !25, file: !24, line: 147, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!43, !28, !99, !99, !33}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !25, file: !24, line: 152, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!43, !28, !44, !104, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !107, line: 65, baseType: !108)
!107 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!108 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 43, size: 128, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !107, line: 54, baseType: !31, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !108, file: !107, line: 63, baseType: !52, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !19, file: !1, line: 30, baseType: !113, size: 64, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !115, line: 245, baseType: !116)
!115 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!116 = !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 30, size: 1664, align: 64, elements: !117)
!117 = !{!118, !121, !122, !123, !124, !125, !127, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !147, !148, !149, !150, !152, !153, !154, !155, !156, !157, !158}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !116, file: !115, line: 47, baseType: !119, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 51, baseType: !120)
!120 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !116, file: !115, line: 67, baseType: !119, size: 32, align: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !116, file: !115, line: 88, baseType: !85, size: 32, align: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !116, file: !115, line: 143, baseType: !31, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !116, file: !115, line: 167, baseType: !31, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !116, file: !115, line: 195, baseType: !126, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !116, file: !115, line: 212, baseType: !128, size: 512, align: 8, offset: 320)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, align: 8, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !116, file: !115, line: 221, baseType: !52, size: 64, align: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !116, file: !115, line: 222, baseType: !52, size: 64, align: 64, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !116, file: !115, line: 223, baseType: !52, size: 64, align: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !116, file: !115, line: 224, baseType: !119, size: 32, align: 32, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !116, file: !115, line: 225, baseType: !119, size: 32, align: 32, offset: 1056)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !116, file: !115, line: 226, baseType: !31, size: 64, align: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !116, file: !115, line: 227, baseType: !31, size: 64, align: 64, offset: 1152)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !116, file: !115, line: 228, baseType: !31, size: 64, align: 64, offset: 1216)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !116, file: !115, line: 229, baseType: !31, size: 64, align: 64, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !116, file: !115, line: 230, baseType: !31, size: 64, align: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !116, file: !115, line: 231, baseType: !31, size: 64, align: 64, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !116, file: !115, line: 232, baseType: !143, size: 32, align: 32, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !144)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !145)
!145 = !{!146}
!146 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !116, file: !115, line: 233, baseType: !143, size: 32, align: 32, offset: 1504)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !116, file: !115, line: 234, baseType: !143, size: 32, align: 32, offset: 1536)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !116, file: !115, line: 235, baseType: !143, size: 32, align: 32, offset: 1568)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !116, file: !115, line: 236, baseType: !151, size: 8, align: 8, offset: 1600)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !116, file: !115, line: 237, baseType: !151, size: 8, align: 8, offset: 1608)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !116, file: !115, line: 238, baseType: !151, size: 8, align: 8, offset: 1616)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !116, file: !115, line: 239, baseType: !151, size: 8, align: 8, offset: 1624)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !116, file: !115, line: 240, baseType: !151, size: 8, align: 8, offset: 1632)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !116, file: !115, line: 241, baseType: !151, size: 8, align: 8, offset: 1640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !116, file: !115, line: 242, baseType: !151, size: 8, align: 8, offset: 1648)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !116, file: !115, line: 243, baseType: !151, size: 8, align: 8, offset: 1656)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !19, file: !1, line: 33, baseType: !31, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !19, file: !1, line: 36, baseType: !31, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_limit", scope: !19, file: !1, line: 41, baseType: !31, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "check_pos", scope: !19, file: !1, line: 44, baseType: !53, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !19, file: !1, line: 47, baseType: !164, size: 832, align: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !165, line: 56, baseType: !166)
!165 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/check/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!166 = !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 34, size: 832, align: 64, elements: !167)
!167 = !{!168, !180}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !166, file: !165, line: 40, baseType: !169, size: 512, align: 64)
!169 = !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !165, line: 36, size: 512, align: 64, elements: !170)
!170 = !{!171, !172, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !169, file: !165, line: 37, baseType: !128, size: 512, align: 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !169, file: !165, line: 38, baseType: !173, size: 512, align: 32)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, align: 32, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !169, file: !165, line: 39, baseType: !177, size: 512, align: 64)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, align: 64, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !165, line: 54, baseType: !181, size: 320, align: 64, offset: 512)
!181 = !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !165, line: 43, size: 320, align: 64, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !181, file: !165, line: 44, baseType: !119, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !181, file: !165, line: 45, baseType: !33, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !181, file: !165, line: 53, baseType: !186, size: 320, align: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !165, line: 47, size: 320, align: 64, elements: !187)
!187 = !{!188, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !186, file: !165, line: 49, baseType: !189, size: 256, align: 32)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 256, align: 32, elements: !178)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !186, file: !165, line: 52, baseType: !33, size: 64, align: 64, offset: 256)
!191 = !{!192, !193, !194}
!192 = !DIEnumerator(name: "SEQ_CODE", value: 0)
!193 = !DIEnumerator(name: "SEQ_PADDING", value: 1)
!194 = !DIEnumerator(name: "SEQ_CHECK", value: 2)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !196, file: !24, line: 182, size: 32, align: 32, elements: !207)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !24, line: 174, size: 704, align: 64, elements: !197)
!197 = !{!198, !199, !200, !201, !206}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !24, line: 176, baseType: !23, size: 512, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !196, file: !24, line: 189, baseType: !195, size: 32, align: 32, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !196, file: !24, line: 194, baseType: !53, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !196, file: !24, line: 197, baseType: !202, size: 32, align: 8, offset: 640)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 32, align: 8, elements: !204)
!203 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!204 = !{!205}
!205 = !DISubrange(count: 4)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !196, file: !24, line: 201, baseType: !203, size: 8, align: 8, offset: 672)
!207 = !{!208, !209, !210, !211, !212, !213}
!208 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!209 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!210 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!211 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!212 = !DIEnumerator(name: "ISEQ_END", value: 4)
!213 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!214 = !{!37, !52}
!215 = !{!216, !221, !248, !249, !253, !256}
!216 = distinct !DISubprogram(name: "lzma_block_decoder_init", scope: !1, file: !1, line: 182, type: !217, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, variables: !220)
!217 = !DISubroutineType(types: !218)
!218 = !{!43, !219, !44, !113}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!220 = !{}
!221 = distinct !DISubprogram(name: "lzma_block_decoder", scope: !1, file: !1, line: 234, type: !222, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, variables: !220)
!222 = !DISubroutineType(types: !223)
!223 = !{!43, !224, !113}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !226, file: !4, line: 454, baseType: !61, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !226, file: !4, line: 455, baseType: !53, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !226, file: !4, line: 456, baseType: !33, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !226, file: !4, line: 458, baseType: !68, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !226, file: !4, line: 459, baseType: !53, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !226, file: !4, line: 460, baseType: !33, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !226, file: !4, line: 468, baseType: !44, size: 64, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !226, file: !4, line: 471, baseType: !236, size: 64, align: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !196)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !226, file: !4, line: 479, baseType: !52, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !226, file: !4, line: 480, baseType: !52, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !226, file: !4, line: 481, baseType: !52, size: 64, align: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !226, file: !4, line: 482, baseType: !52, size: 64, align: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !226, file: !4, line: 483, baseType: !33, size: 64, align: 64, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !226, file: !4, line: 484, baseType: !33, size: 64, align: 64, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !226, file: !4, line: 485, baseType: !53, size: 64, align: 64, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !226, file: !4, line: 486, baseType: !53, size: 64, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !226, file: !4, line: 487, baseType: !143, size: 32, align: 32, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !226, file: !4, line: 488, baseType: !143, size: 32, align: 32, offset: 1056)
!248 = distinct !DISubprogram(name: "block_decode", scope: !1, file: !1, line: 74, type: !41, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !220)
!249 = distinct !DISubprogram(name: "update_size", scope: !1, file: !1, line: 52, type: !250, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, variables: !220)
!250 = !DISubroutineType(types: !251)
!251 = !{!203, !252, !31, !31}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!253 = distinct !DISubprogram(name: "is_size_valid", scope: !1, file: !1, line: 67, type: !254, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, variables: !220)
!254 = !DISubroutineType(types: !255)
!255 = !{!203, !31, !31}
!256 = distinct !DISubprogram(name: "block_decoder_end", scope: !1, file: !1, line: 173, type: !79, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, variables: !220)
!257 = !{!258}
!258 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !24, line: 159, type: !259, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!260 = !{i32 2, !"Dwarf Version", i32 4}
!261 = !{i32 2, !"Debug Info Version", i32 3}
!262 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!263 = !DILocalVariable(name: "next", arg: 1, scope: !216, file: !1, line: 182, type: !219)
!264 = !DIExpression()
!265 = !DILocation(line: 182, column: 42, scope: !216)
!266 = !DILocalVariable(name: "allocator", arg: 2, scope: !216, file: !1, line: 182, type: !44)
!267 = !DILocation(line: 182, column: 64, scope: !216)
!268 = !DILocalVariable(name: "block", arg: 3, scope: !216, file: !1, line: 183, type: !113)
!269 = !DILocation(line: 183, column: 15, scope: !216)
!270 = !DILocation(line: 185, column: 2, scope: !216)
!271 = !DILocation(line: 185, column: 2, scope: !272)
!272 = !DILexicalBlockFile(scope: !273, file: !1, discriminator: 1)
!273 = distinct !DILexicalBlock(scope: !274, file: !1, line: 185, column: 2)
!274 = distinct !DILexicalBlock(scope: !216, file: !1, line: 185, column: 2)
!275 = !DILocation(line: 185, column: 2, scope: !276)
!276 = !DILexicalBlockFile(scope: !273, file: !1, discriminator: 2)
!277 = !DILocation(line: 185, column: 2, scope: !278)
!278 = !DILexicalBlockFile(scope: !274, file: !1, discriminator: 3)
!279 = !DILocation(line: 190, column: 31, scope: !280)
!280 = distinct !DILexicalBlock(scope: !216, file: !1, line: 190, column: 6)
!281 = !DILocation(line: 190, column: 6, scope: !280)
!282 = !DILocation(line: 190, column: 38, scope: !280)
!283 = !DILocation(line: 191, column: 4, scope: !280)
!284 = !DILocation(line: 191, column: 8, scope: !285)
!285 = !DILexicalBlockFile(scope: !280, file: !1, discriminator: 1)
!286 = !DILocation(line: 191, column: 8, scope: !287)
!287 = !DILexicalBlockFile(scope: !280, file: !1, discriminator: 2)
!288 = !DILocation(line: 190, column: 6, scope: !289)
!289 = !DILexicalBlockFile(scope: !216, file: !1, discriminator: 1)
!290 = !DILocation(line: 192, column: 3, scope: !280)
!291 = !DILocation(line: 195, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !216, file: !1, line: 195, column: 6)
!293 = !DILocation(line: 195, column: 12, scope: !292)
!294 = !DILocation(line: 195, column: 18, scope: !292)
!295 = !DILocation(line: 195, column: 6, scope: !216)
!296 = !DILocation(line: 196, column: 48, scope: !297)
!297 = distinct !DILexicalBlock(scope: !292, file: !1, line: 195, column: 27)
!298 = !DILocation(line: 196, column: 17, scope: !297)
!299 = !DILocation(line: 196, column: 3, scope: !297)
!300 = !DILocation(line: 196, column: 9, scope: !297)
!301 = !DILocation(line: 196, column: 15, scope: !297)
