; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }

@.str = private unnamed_addr constant [6 x i8] c"5.0.8\00", align 1
@.str.1 = private unnamed_addr constant [27 x i8] c"next->update != ((void*)0)\00", align 1
@.str.2 = private unnamed_addr constant [78 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !130, subprograms: !132, globals: !219)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24, !31, !127}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !33, file: !32, line: 182, size: 32, align: 32, elements: !120)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !32, line: 174, size: 704, align: 64, elements: !34)
!34 = !{!35, !112, !113, !114, !119}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !32, line: 176, baseType: !36, size: 512, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !32, line: 75, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !32, line: 119, size: 512, align: 64, elements: !38)
!38 = !{!39, !43, !49, !51, !83, !88, !95, !100}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !37, file: !32, line: 121, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !32, line: 73, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !32, line: 73, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !37, file: !32, line: 125, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 55, baseType: !48)
!47 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !37, file: !32, line: 131, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !47, line: 122, baseType: !48)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !37, file: !32, line: 134, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !32, line: 89, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !40, !57, !73, !78, !66, !80, !78, !66, !82}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !60)
!60 = !{!61, !68, !72}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !59, file: !4, line: 376, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !65, !66, !66}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 62, baseType: !48)
!67 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !59, file: !4, line: 390, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !65, !65}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !59, file: !4, line: 401, baseType: !65, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 48, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !37, file: !32, line: 139, baseType: !84, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !32, line: 97, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !40, !57}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !37, file: !32, line: 143, baseType: !89, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !37, file: !32, line: 147, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!56, !40, !99, !99, !46}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !37, file: !32, line: 152, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!56, !40, !57, !104, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !107, line: 65, baseType: !108)
!107 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!108 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 43, size: 128, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !107, line: 54, baseType: !44, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !108, file: !107, line: 63, baseType: !65, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !33, file: !32, line: 189, baseType: !31, size: 32, align: 32, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !33, file: !32, line: 194, baseType: !66, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !33, file: !32, line: 197, baseType: !115, size: 32, align: 8, offset: 640)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, align: 8, elements: !117)
!116 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!117 = !{!118}
!118 = !DISubrange(count: 4)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !33, file: !32, line: 201, baseType: !116, size: 8, align: 8, offset: 672)
!120 = !{!121, !122, !123, !124, !125, !126}
!121 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!122 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!123 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!124 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!125 = !DIEnumerator(name: "ISEQ_END", value: 4)
!126 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !128)
!128 = !{!129}
!129 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!130 = !{!65, !50, !131}
!131 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!132 = !{!133, !138, !144, !147, !150, !153, !167, !170, !173, !201, !204, !207, !212, !215, !216}
!133 = distinct !DISubprogram(name: "lzma_version_number", scope: !1, file: !1, line: 21, type: !134, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!134 = !DISubroutineType(types: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 51, baseType: !131)
!137 = !{}
!138 = distinct !DISubprogram(name: "lzma_version_string", scope: !1, file: !1, line: 28, type: !139, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!139 = !DISubroutineType(types: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!144 = distinct !DISubprogram(name: "lzma_alloc", scope: !1, file: !1, line: 39, type: !145, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!145 = !DISubroutineType(types: !146)
!146 = !{!65, !66, !57}
!147 = distinct !DISubprogram(name: "lzma_free", scope: !1, file: !1, line: 57, type: !148, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !65, !57}
!150 = distinct !DISubprogram(name: "lzma_bufcpy", scope: !1, file: !1, line: 73, type: !151, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!151 = !DISubroutineType(types: !152)
!152 = !{!66, !73, !78, !66, !80, !78, !66}
!153 = distinct !DISubprogram(name: "lzma_next_filter_init", scope: !1, file: !1, line: 91, type: !154, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!154 = !DISubroutineType(types: !155)
!155 = !{!56, !156, !57, !157}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !32, line: 77, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !32, line: 104, size: 192, align: 64, elements: !161)
!161 = !{!162, !163, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !32, line: 107, baseType: !44, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !160, file: !32, line: 111, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !32, line: 81, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !32, line: 114, baseType: !65, size: 64, align: 64, offset: 128)
!167 = distinct !DISubprogram(name: "lzma_next_filter_update", scope: !1, file: !1, line: 102, type: !168, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!168 = !DISubroutineType(types: !169)
!169 = !{!56, !156, !57, !104}
!170 = distinct !DISubprogram(name: "lzma_next_end", scope: !1, file: !1, line: 120, type: !171, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !156, !57}
!173 = distinct !DISubprogram(name: "lzma_strm_init", scope: !1, file: !1, line: 145, type: !174, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!174 = !DISubroutineType(types: !175)
!175 = !{!56, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !190, !191, !192, !193, !194, !195, !196, !197, !198, !200}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !178, file: !4, line: 454, baseType: !74, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !178, file: !4, line: 455, baseType: !66, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !178, file: !4, line: 456, baseType: !46, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !178, file: !4, line: 458, baseType: !81, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !178, file: !4, line: 459, baseType: !66, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !178, file: !4, line: 460, baseType: !46, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !178, file: !4, line: 468, baseType: !57, size: 64, align: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !178, file: !4, line: 471, baseType: !188, size: 64, align: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !33)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !178, file: !4, line: 479, baseType: !65, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !178, file: !4, line: 480, baseType: !65, size: 64, align: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !178, file: !4, line: 481, baseType: !65, size: 64, align: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !178, file: !4, line: 482, baseType: !65, size: 64, align: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !178, file: !4, line: 483, baseType: !46, size: 64, align: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !178, file: !4, line: 484, baseType: !46, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !178, file: !4, line: 485, baseType: !66, size: 64, align: 64, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !178, file: !4, line: 486, baseType: !66, size: 64, align: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !178, file: !4, line: 487, baseType: !199, size: 32, align: 32, offset: 1024)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !127)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !178, file: !4, line: 488, baseType: !199, size: 32, align: 32, offset: 1056)
!201 = distinct !DISubprogram(name: "lzma_code", scope: !1, file: !1, line: 174, type: !202, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!202 = !DISubroutineType(types: !203)
!203 = !{!56, !176, !82}
!204 = distinct !DISubprogram(name: "lzma_end", scope: !1, file: !1, line: 316, type: !205, isLocal: false, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !176}
!207 = distinct !DISubprogram(name: "lzma_get_check", scope: !1, file: !1, line: 329, type: !208, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!208 = !DISubroutineType(types: !209)
!209 = !{!92, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!212 = distinct !DISubprogram(name: "lzma_memusage", scope: !1, file: !1, line: 341, type: !213, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!213 = !DISubroutineType(types: !214)
!214 = !{!46, !210}
!215 = distinct !DISubprogram(name: "lzma_memlimit_get", scope: !1, file: !1, line: 358, type: !213, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!216 = distinct !DISubprogram(name: "lzma_memlimit_set", scope: !1, file: !1, line: 375, type: !217, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!217 = !DISubroutineType(types: !218)
!218 = !{!56, !176, !46}
!219 = !{!220}
!220 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !32, line: 159, type: !221, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!222 = !{i32 2, !"Dwarf Version", i32 4}
!223 = !{i32 2, !"Debug Info Version", i32 3}
!224 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!225 = !DILocation(line: 23, column: 2, scope: !133)
!226 = !DILocation(line: 30, column: 2, scope: !138)
!227 = !DILocalVariable(name: "size", arg: 1, scope: !144, file: !1, line: 39, type: !66)
!228 = !DIExpression()
!229 = !DILocation(line: 39, column: 19, scope: !144)
!230 = !DILocalVariable(name: "allocator", arg: 2, scope: !144, file: !1, line: 39, type: !57)
!231 = !DILocation(line: 39, column: 41, scope: !144)
!232 = !DILocalVariable(name: "ptr", scope: !144, file: !1, line: 41, type: !65)
!233 = !DILocation(line: 41, column: 8, scope: !144)
!234 = !DILocation(line: 44, column: 6, scope: !235)
!235 = distinct !DILexicalBlock(scope: !144, file: !1, line: 44, column: 6)
!236 = !DILocation(line: 44, column: 11, scope: !235)
!237 = !DILocation(line: 44, column: 6, scope: !144)
!238 = !DILocation(line: 45, column: 8, scope: !235)
!239 = !DILocation(line: 45, column: 3, scope: !235)
!240 = !DILocation(line: 47, column: 6, scope: !241)
!241 = distinct !DILexicalBlock(scope: !144, file: !1, line: 47, column: 6)
!242 = !DILocation(line: 47, column: 16, scope: !241)
!243 = !DILocation(line: 47, column: 24, scope: !241)
!244 = !DILocation(line: 47, column: 27, scope: !245)
!245 = !DILexicalBlockFile(scope: !241, file: !1, discriminator: 1)
!246 = !DILocation(line: 47, column: 38, scope: !245)
!247 = !DILocation(line: 47, column: 44, scope: !245)
!248 = !DILocation(line: 47, column: 6, scope: !245)
!249 = !DILocation(line: 48, column: 9, scope: !241)
!250 = !DILocation(line: 48, column: 20, scope: !241)
!251 = !DILocation(line: 48, column: 26, scope: !241)
!252 = !DILocation(line: 48, column: 37, scope: !241)
!253 = !DILocation(line: 48, column: 48, scope: !241)
!254 = !DILocation(line: 48, column: 7, scope: !241)
