; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/filter_buffer_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }

@LZMA_NEXT_CODER_INIT = internal constant %struct.lzma_next_coder_s { %struct.lzma_coder_s* null, i64 -1, i64 0, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)* null, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)* null, i32 (%struct.lzma_coder_s*)* null, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)* null, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* null }, align 8
@.str = private unnamed_addr constant [43 x i8] c"*in_pos == in_size || *out_pos == out_size\00", align 1
@.str.1 = private unnamed_addr constant [93 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/filter_buffer_decoder.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !33, globals: !73)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/filter_buffer_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !{!34}
!34 = distinct !DISubprogram(name: "lzma_raw_buffer_decode", scope: !1, file: !1, line: 17, type: !35, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !51, !66, !70, !59, !71, !70, !59}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !41, line: 65, baseType: !42)
!41 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!42 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 43, size: 128, align: 64, elements: !43)
!43 = !{!44, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !41, line: 54, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !46, line: 63, baseType: !47)
!46 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !48, line: 55, baseType: !49)
!48 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!49 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !42, file: !41, line: 63, baseType: !32, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !54)
!54 = !{!55, !61, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !53, file: !4, line: 376, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!32, !32, !59, !59}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 62, baseType: !49)
!60 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !53, file: !4, line: 390, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !32, !32}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !53, file: !4, line: 401, baseType: !32, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !48, line: 48, baseType: !69)
!69 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!72 = !{}
!73 = !{!74}
!74 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !75, line: 159, type: !76, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!75 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !75, line: 75, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !75, line: 119, size: 512, align: 64, elements: !79)
!79 = !{!80, !84, !85, !87, !96, !101, !108, !113}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !78, file: !75, line: 121, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !75, line: 73, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !75, line: 73, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !78, file: !75, line: 125, baseType: !45, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !78, file: !75, line: 131, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !48, line: 122, baseType: !49)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !78, file: !75, line: 134, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !75, line: 89, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!37, !81, !51, !92, !93, !59, !94, !93, !59, !95}
!92 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!93 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!94 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !78, file: !75, line: 139, baseType: !97, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !75, line: 97, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !81, !51}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !78, file: !75, line: 143, baseType: !102, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !78, file: !75, line: 147, baseType: !109, size: 64, align: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!37, !81, !112, !112, !47}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !78, file: !75, line: 152, baseType: !114, size: 64, align: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!37, !81, !51, !38, !38}
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!120 = !DILocalVariable(name: "filters", arg: 1, scope: !34, file: !1, line: 17, type: !38)
!121 = !DIExpression()
!122 = !DILocation(line: 17, column: 43, scope: !34)
!123 = !DILocalVariable(name: "allocator", arg: 2, scope: !34, file: !1, line: 17, type: !51)
!124 = !DILocation(line: 17, column: 68, scope: !34)
!125 = !DILocalVariable(name: "in", arg: 3, scope: !34, file: !1, line: 18, type: !66)
!126 = !DILocation(line: 18, column: 18, scope: !34)
!127 = !DILocalVariable(name: "in_pos", arg: 4, scope: !34, file: !1, line: 18, type: !70)
!128 = !DILocation(line: 18, column: 30, scope: !34)
!129 = !DILocalVariable(name: "in_size", arg: 5, scope: !34, file: !1, line: 18, type: !59)
!130 = !DILocation(line: 18, column: 45, scope: !34)
!131 = !DILocalVariable(name: "out", arg: 6, scope: !34, file: !1, line: 19, type: !71)
!132 = !DILocation(line: 19, column: 12, scope: !34)
!133 = !DILocalVariable(name: "out_pos", arg: 7, scope: !34, file: !1, line: 19, type: !70)
!134 = !DILocation(line: 19, column: 25, scope: !34)
!135 = !DILocalVariable(name: "out_size", arg: 8, scope: !34, file: !1, line: 19, type: !59)
!136 = !DILocation(line: 19, column: 41, scope: !34)
!137 = !DILocalVariable(name: "next", scope: !34, file: !1, line: 21, type: !77)
!138 = !DILocation(line: 21, column: 18, scope: !34)
!139 = !DILocation(line: 21, column: 25, scope: !34)
!140 = !DILocalVariable(name: "in_start", scope: !34, file: !1, line: 22, type: !59)
!141 = !DILocation(line: 22, column: 9, scope: !34)
!142 = !DILocalVariable(name: "out_start", scope: !34, file: !1, line: 23, type: !59)
!143 = !DILocation(line: 23, column: 9, scope: !34)
!144 = !DILocalVariable(name: "ret", scope: !34, file: !1, line: 24, type: !37)
!145 = !DILocation(line: 24, column: 11, scope: !34)
!146 = !DILocation(line: 27, column: 6, scope: !147)
!147 = distinct !DILexicalBlock(scope: !34, file: !1, line: 27, column: 6)
!148 = !DILocation(line: 27, column: 9, scope: !147)
!149 = !DILocation(line: 27, column: 17, scope: !147)
!150 = !DILocation(line: 27, column: 20, scope: !151)
!151 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 1)
!152 = !DILocation(line: 27, column: 27, scope: !151)
!153 = !DILocation(line: 27, column: 35, scope: !151)
!154 = !DILocation(line: 27, column: 39, scope: !155)
!155 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 2)
!156 = !DILocation(line: 27, column: 38, scope: !155)
!157 = !DILocation(line: 27, column: 48, scope: !155)
!158 = !DILocation(line: 27, column: 46, scope: !155)
!159 = !DILocation(line: 27, column: 56, scope: !155)
!160 = !DILocation(line: 27, column: 59, scope: !161)
!161 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 3)
!162 = !DILocation(line: 27, column: 63, scope: !161)
!163 = !DILocation(line: 28, column: 4, scope: !147)
!164 = !DILocation(line: 28, column: 7, scope: !151)
!165 = !DILocation(line: 28, column: 15, scope: !151)
!166 = !DILocation(line: 28, column: 23, scope: !151)
!167 = !DILocation(line: 28, column: 27, scope: !155)
!168 = !DILocation(line: 28, column: 26, scope: !155)
!169 = !DILocation(line: 28, column: 37, scope: !155)
!170 = !DILocation(line: 28, column: 35, scope: !155)
!171 = !DILocation(line: 27, column: 6, scope: !172)
!172 = !DILexicalBlockFile(scope: !34, file: !1, discriminator: 4)
!173 = !DILocation(line: 29, column: 3, scope: !147)
!174 = !DILocation(line: 32, column: 2, scope: !34)
!175 = !DILocalVariable(name: "ret_", scope: !176, file: !1, line: 32, type: !177)
!176 = distinct !DILexicalBlock(scope: !34, file: !1, line: 32, column: 2)
