; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_index_s = type { %struct.index_tree, i64, i64, i64, i64, i64, i32 }
%struct.index_tree = type { %struct.index_tree_node_s*, %struct.index_tree_node_s*, %struct.index_tree_node_s*, i32 }
%struct.index_tree_node_s = type { i64, i64, %struct.index_tree_node_s*, %struct.index_tree_node_s*, %struct.index_tree_node_s* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.index_stream = type { %struct.index_tree_node_s, i32, i64, %struct.index_tree, i64, i64, %struct.lzma_stream_flags, i64 }
%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }
%struct.index_group = type { %struct.index_tree_node_s, i64, i64, i64, [0 x %struct.index_record] }
%struct.index_record = type { i64, i64 }
%struct.index_cat_info = type { i64, i64, i64, i32, %struct.index_tree* }
%struct.lzma_index_iter = type { %struct.anon, %struct.anon.0, [6 x %union.anon] }
%struct.anon = type { %struct.lzma_stream_flags*, i8*, i8*, i8*, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.anon.0 = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i8*, i8*, i8*, i8* }
%union.anon = type { i8* }

@.str = private unnamed_addr constant [27 x i8] c"g->node.left == ((void*)0)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !47, subprograms: !132)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !10, !14, !28, !35, !40}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 27, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!7 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!8 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!9 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 44, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!12 = !{!13}
!13 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 57, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "LZMA_OK", value: 0)
!17 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!18 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!19 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!20 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!21 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!22 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!23 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!24 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!25 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!26 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!27 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 979, size: 32, align: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "ITER_INDEX", value: 0)
!31 = !DIEnumerator(name: "ITER_STREAM", value: 1)
!32 = !DIEnumerator(name: "ITER_GROUP", value: 2)
!33 = !DIEnumerator(name: "ITER_RECORD", value: 3)
!34 = !DIEnumerator(name: "ITER_METHOD", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 989, size: 32, align: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "ITER_METHOD_NORMAL", value: 0)
!38 = !DIEnumerator(name: "ITER_METHOD_NEXT", value: 1)
!39 = !DIEnumerator(name: "ITER_METHOD_LEFTMOST", value: 2)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 226, size: 32, align: 32, elements: !42)
!41 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "LZMA_INDEX_ITER_ANY", value: 0)
!44 = !DIEnumerator(name: "LZMA_INDEX_ITER_STREAM", value: 1)
!45 = !DIEnumerator(name: "LZMA_INDEX_ITER_BLOCK", value: 2)
!46 = !DIEnumerator(name: "LZMA_INDEX_ITER_NONEMPTY_BLOCK", value: 3)
!47 = !{!48, !49, !52, !112, !130, !131, !73}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 62, baseType: !51)
!50 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!51 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_stream", file: !1, line: 142, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 107, size: 1344, align: 64, elements: !56)
!56 = !{!57, !71, !74, !75, !83, !84, !85, !111}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !55, file: !1, line: 109, baseType: !58, size: 320, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_tree_node", file: !1, line: 29, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "index_tree_node_s", file: !1, line: 30, size: 320, align: 64, elements: !60)
!60 = !{!61, !66, !67, !69, !70}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_base", scope: !59, file: !1, line: 34, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !63, line: 63, baseType: !64)
!63 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !65, line: 55, baseType: !51)
!65 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_base", scope: !59, file: !1, line: 37, baseType: !62, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !59, file: !1, line: 39, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !59, file: !1, line: 40, baseType: !68, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !59, file: !1, line: 41, baseType: !68, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !55, file: !1, line: 112, baseType: !72, size: 32, align: 32, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !65, line: 51, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "block_number_base", scope: !55, file: !1, line: 115, baseType: !62, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !55, file: !1, line: 122, baseType: !76, size: 256, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_tree", file: !1, line: 62, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 46, size: 256, align: 64, elements: !78)
!78 = !{!79, !80, !81, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !77, file: !1, line: 48, baseType: !68, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "leftmost", scope: !77, file: !1, line: 53, baseType: !68, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rightmost", scope: !77, file: !1, line: 57, baseType: !68, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !77, file: !1, line: 60, baseType: !72, size: 32, align: 32, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "record_count", scope: !55, file: !1, line: 125, baseType: !62, size: 64, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !55, file: !1, line: 130, baseType: !62, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stream_flags", scope: !55, file: !1, line: 136, baseType: !86, size: 448, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !87, line: 105, baseType: !88)
!87 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/stream_flags.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!88 = !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 33, size: 448, align: 64, elements: !89)
!89 = !{!90, !91, !92, !94, !96, !97, !98, !99, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !88, file: !87, line: 51, baseType: !72, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !88, file: !87, line: 69, baseType: !62, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !88, file: !87, line: 79, baseType: !93, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !4, line: 55, baseType: !3)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !88, file: !87, line: 90, baseType: !95, size: 32, align: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !11, line: 46, baseType: !10)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !88, file: !87, line: 91, baseType: !95, size: 32, align: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !88, file: !87, line: 92, baseType: !95, size: 32, align: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !88, file: !87, line: 93, baseType: !95, size: 32, align: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !88, file: !87, line: 94, baseType: !100, size: 8, align: 8, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !11, line: 29, baseType: !101)
!101 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !88, file: !87, line: 95, baseType: !100, size: 8, align: 8, offset: 296)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !88, file: !87, line: 96, baseType: !100, size: 8, align: 8, offset: 304)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !88, file: !87, line: 97, baseType: !100, size: 8, align: 8, offset: 312)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !88, file: !87, line: 98, baseType: !100, size: 8, align: 8, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !88, file: !87, line: 99, baseType: !100, size: 8, align: 8, offset: 328)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !88, file: !87, line: 100, baseType: !100, size: 8, align: 8, offset: 336)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !88, file: !87, line: 101, baseType: !100, size: 8, align: 8, offset: 344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !88, file: !87, line: 102, baseType: !72, size: 32, align: 32, offset: 352)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !88, file: !87, line: 103, baseType: !72, size: 32, align: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "stream_padding", scope: !55, file: !1, line: 140, baseType: !62, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_group", file: !1, line: 104, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 71, size: 512, align: 64, elements: !116)
!116 = !{!117, !118, !119, !120, !121}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !115, file: !1, line: 73, baseType: !58, size: 320, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "number_base", scope: !115, file: !1, line: 76, baseType: !62, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !115, file: !1, line: 79, baseType: !49, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !115, file: !1, line: 82, baseType: !49, size: 64, align: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !115, file: !1, line: 102, baseType: !122, offset: 512)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, align: 64, elements: !128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_record", file: !1, line: 68, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 65, size: 128, align: 64, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_sum", scope: !124, file: !1, line: 66, baseType: !62, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_sum", scope: !124, file: !1, line: 67, baseType: !62, size: 64, align: 64, offset: 64)
!128 = !{!129}
!129 = !DISubrange(count: -1)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!132 = !{!133, !161, !164, !167, !170, !175, !178, !179, !180, !181, !182, !183, !184, !187, !188, !194, !197, !200, !204, !207, !263, !266, !270, !273, !274, !278, !281, !284, !288, !289, !295, !298, !299, !303, !306, !307, !310, !323, !326, !331, !332}
!133 = distinct !DISubprogram(name: "lzma_index_init", scope: !1, file: !1, line: 401, type: !134, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !147}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !41, line: 37, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !1, line: 145, size: 640, align: 64, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !138, file: !1, line: 149, baseType: !76, size: 256, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !138, file: !1, line: 152, baseType: !62, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !138, file: !1, line: 155, baseType: !62, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "record_count", scope: !138, file: !1, line: 158, baseType: !62, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !138, file: !1, line: 166, baseType: !62, size: 64, align: 64, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !138, file: !1, line: 171, baseType: !49, size: 64, align: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !138, file: !1, line: 177, baseType: !72, size: 32, align: 32, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !11, line: 403, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 341, size: 192, align: 64, elements: !150)
!150 = !{!151, !155, !159}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !149, file: !11, line: 376, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!48, !48, !49, !49}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !149, file: !11, line: 390, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !48, !48}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !149, file: !11, line: 401, baseType: !48, size: 64, align: 64, offset: 128)
!160 = !{}
!161 = distinct !DISubprogram(name: "lzma_index_end", scope: !1, file: !1, line: 422, type: !162, isLocal: false, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !136, !147}
!164 = distinct !DISubprogram(name: "lzma_index_prealloc", scope: !1, file: !1, line: 436, type: !165, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !136, !62}
!167 = distinct !DISubprogram(name: "lzma_index_memusage", scope: !1, file: !1, line: 447, type: !168, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!168 = !DISubroutineType(types: !169)
!169 = !{!64, !62, !62}
!170 = distinct !DISubprogram(name: "lzma_index_memused", scope: !1, file: !1, line: 496, type: !171, isLocal: false, isDefinition: true, scopeLine: 497, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!171 = !DISubroutineType(types: !172)
!172 = !{!64, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!175 = distinct !DISubprogram(name: "lzma_index_block_count", scope: !1, file: !1, line: 503, type: !176, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!176 = !DISubroutineType(types: !177)
!177 = !{!62, !173}
!178 = distinct !DISubprogram(name: "lzma_index_stream_count", scope: !1, file: !1, line: 510, type: !176, isLocal: false, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!179 = distinct !DISubprogram(name: "lzma_index_size", scope: !1, file: !1, line: 517, type: !176, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!180 = distinct !DISubprogram(name: "lzma_index_total_size", scope: !1, file: !1, line: 524, type: !176, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!181 = distinct !DISubprogram(name: "lzma_index_stream_size", scope: !1, file: !1, line: 531, type: !176, isLocal: false, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!182 = distinct !DISubprogram(name: "lzma_index_file_size", scope: !1, file: !1, line: 565, type: !176, isLocal: false, isDefinition: true, scopeLine: 566, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!183 = distinct !DISubprogram(name: "lzma_index_uncompressed_size", scope: !1, file: !1, line: 577, type: !176, isLocal: false, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!184 = distinct !DISubprogram(name: "lzma_index_checks", scope: !1, file: !1, line: 584, type: !185, isLocal: false, isDefinition: true, scopeLine: 585, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!185 = !DISubroutineType(types: !186)
!186 = !{!72, !173}
!187 = distinct !DISubprogram(name: "lzma_index_padding_size", scope: !1, file: !1, line: 598, type: !185, isLocal: false, isDefinition: true, scopeLine: 599, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!188 = distinct !DISubprogram(name: "lzma_index_stream_flags", scope: !1, file: !1, line: 606, type: !189, isLocal: false, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !136, !192}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !11, line: 237, baseType: !14)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!194 = distinct !DISubprogram(name: "lzma_index_stream_padding", scope: !1, file: !1, line: 625, type: !195, isLocal: false, isDefinition: true, scopeLine: 626, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!195 = !DISubroutineType(types: !196)
!196 = !{!191, !136, !62}
!197 = distinct !DISubprogram(name: "lzma_index_append", scope: !1, file: !1, line: 650, type: !198, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!198 = !DISubroutineType(types: !199)
!199 = !{!191, !136, !147, !62, !62}
!200 = distinct !DISubprogram(name: "lzma_index_cat", scope: !1, file: !1, line: 783, type: !201, isLocal: false, isDefinition: true, scopeLine: 785, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!201 = !DISubroutineType(types: !202)
!202 = !{!191, !203, !203, !147}
!203 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !136)
!204 = distinct !DISubprogram(name: "lzma_index_dup", scope: !1, file: !1, line: 944, type: !205, isLocal: false, isDefinition: true, scopeLine: 945, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!205 = !DISubroutineType(types: !206)
!206 = !{!136, !173, !147}
!207 = distinct !DISubprogram(name: "lzma_index_iter_init", scope: !1, file: !1, line: 1100, type: !208, isLocal: false, isDefinition: true, scopeLine: 1101, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210, !173}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_iter", file: !41, line: 220, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 43, size: 2432, align: 64, elements: !213)
!213 = !{!214, !234, !254}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !212, file: !41, line: 114, baseType: !215, size: 960, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !41, line: 44, size: 960, align: 64, elements: !216)
!216 = !{!217, !218, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !215, file: !41, line: 51, baseType: !192, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !215, file: !41, line: 53, baseType: !219, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !215, file: !41, line: 54, baseType: !219, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !215, file: !41, line: 55, baseType: !219, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !215, file: !41, line: 62, baseType: !62, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !215, file: !41, line: 70, baseType: !62, size: 64, align: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_offset", scope: !215, file: !41, line: 78, baseType: !62, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_offset", scope: !215, file: !41, line: 86, baseType: !62, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !215, file: !41, line: 94, baseType: !62, size: 64, align: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !215, file: !41, line: 99, baseType: !62, size: 64, align: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !215, file: !41, line: 108, baseType: !62, size: 64, align: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli1", scope: !215, file: !41, line: 110, baseType: !62, size: 64, align: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli2", scope: !215, file: !41, line: 111, baseType: !62, size: 64, align: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli3", scope: !215, file: !41, line: 112, baseType: !62, size: 64, align: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli4", scope: !215, file: !41, line: 113, baseType: !62, size: 64, align: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !212, file: !41, line: 208, baseType: !235, size: 1088, align: 64, offset: 960)
!235 = !DICompositeType(tag: DW_TAG_structure_type, scope: !212, file: !41, line: 116, size: 1088, align: 64, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "number_in_file", scope: !235, file: !41, line: 122, baseType: !62, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_file_offset", scope: !235, file: !41, line: 132, baseType: !62, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_file_offset", scope: !235, file: !41, line: 147, baseType: !62, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "number_in_stream", scope: !235, file: !41, line: 154, baseType: !62, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_stream_offset", scope: !235, file: !41, line: 162, baseType: !62, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_stream_offset", scope: !235, file: !41, line: 170, baseType: !62, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !235, file: !41, line: 179, baseType: !62, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !235, file: !41, line: 188, baseType: !62, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !235, file: !41, line: 197, baseType: !62, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli1", scope: !235, file: !41, line: 199, baseType: !62, size: 64, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli2", scope: !235, file: !41, line: 200, baseType: !62, size: 64, align: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli3", scope: !235, file: !41, line: 201, baseType: !62, size: 64, align: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli4", scope: !235, file: !41, line: 202, baseType: !62, size: 64, align: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !235, file: !41, line: 204, baseType: !219, size: 64, align: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !235, file: !41, line: 205, baseType: !219, size: 64, align: 64, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !235, file: !41, line: 206, baseType: !219, size: 64, align: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !235, file: !41, line: 207, baseType: !219, size: 64, align: 64, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !212, file: !41, line: 219, baseType: !255, size: 384, align: 64, offset: 2048)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 384, align: 64, elements: !261)
!256 = !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !41, line: 215, size: 64, align: 64, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !256, file: !41, line: 216, baseType: !219, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !256, file: !41, line: 217, baseType: !49, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !256, file: !41, line: 218, baseType: !62, size: 64, align: 64)
!261 = !{!262}
!262 = !DISubrange(count: 6)
!263 = distinct !DISubprogram(name: "lzma_index_iter_rewind", scope: !1, file: !1, line: 1109, type: !264, isLocal: false, isDefinition: true, scopeLine: 1110, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !210}
!266 = distinct !DISubprogram(name: "lzma_index_iter_next", scope: !1, file: !1, line: 1120, type: !267, isLocal: false, isDefinition: true, scopeLine: 1121, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!267 = !DISubroutineType(types: !268)
!268 = !{!100, !210, !269}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_iter_mode", file: !41, line: 268, baseType: !40)
!270 = distinct !DISubprogram(name: "lzma_index_iter_locate", scope: !1, file: !1, line: 1232, type: !271, isLocal: false, isDefinition: true, scopeLine: 1233, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!271 = !DISubroutineType(types: !272)
!272 = !{!100, !210, !62}
!273 = distinct !DISubprogram(name: "index_init_plain", scope: !1, file: !1, line: 383, type: !134, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!274 = distinct !DISubprogram(name: "index_tree_init", scope: !1, file: !1, line: 182, type: !275, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!278 = distinct !DISubprogram(name: "index_stream_init", scope: !1, file: !1, line: 344, type: !279, isLocal: true, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!279 = !DISubroutineType(types: !280)
!280 = !{!130, !62, !62, !62, !62, !147}
!281 = distinct !DISubprogram(name: "index_tree_append", scope: !1, file: !1, line: 231, type: !282, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !277, !68}
!284 = distinct !DISubprogram(name: "bsr32", scope: !285, file: !285, line: 372, type: !286, isLocal: true, isDefinition: true, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!285 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/common/tuklib_integer.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!286 = !DISubroutineType(types: !287)
!287 = !{!72, !72}
!288 = distinct !DISubprogram(name: "ctz32", scope: !285, file: !285, line: 469, type: !286, isLocal: true, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!289 = distinct !DISubprogram(name: "index_tree_end", scope: !1, file: !1, line: 218, type: !290, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !277, !147, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !48, !147}
!295 = distinct !DISubprogram(name: "index_tree_node_end", scope: !1, file: !1, line: 194, type: !296, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !68, !147, !292}
!298 = distinct !DISubprogram(name: "index_stream_end", scope: !1, file: !1, line: 374, type: !293, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!299 = distinct !DISubprogram(name: "index_size", scope: !300, file: !300, line: 57, type: !301, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!300 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!301 = !DISubroutineType(types: !302)
!302 = !{!62, !62, !62}
!303 = distinct !DISubprogram(name: "index_file_size", scope: !1, file: !1, line: 541, type: !304, isLocal: true, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!304 = !DISubroutineType(types: !305)
!305 = !{!62, !62, !62, !62, !62, !62}
!306 = distinct !DISubprogram(name: "index_size_unpadded", scope: !300, file: !300, line: 48, type: !301, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!307 = distinct !DISubprogram(name: "vli_ceil4", scope: !300, file: !300, line: 39, type: !308, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!308 = !DISubroutineType(types: !309)
!309 = !{!62, !62}
!310 = distinct !DISubprogram(name: "index_cat_helper", scope: !1, file: !1, line: 761, type: !311, isLocal: true, isDefinition: true, scopeLine: 762, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313, !130}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "index_cat_info", file: !1, line: 754, baseType: !316)
!316 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 736, size: 320, align: 64, elements: !317)
!317 = !{!318, !319, !320, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !316, file: !1, line: 738, baseType: !62, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !316, file: !1, line: 741, baseType: !62, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "block_number_add", scope: !316, file: !1, line: 744, baseType: !62, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "stream_number_add", scope: !316, file: !1, line: 749, baseType: !72, size: 32, align: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !316, file: !1, line: 752, baseType: !277, size: 64, align: 64, offset: 256)
!323 = distinct !DISubprogram(name: "index_dup_stream", scope: !1, file: !1, line: 880, type: !324, isLocal: true, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!324 = !DISubroutineType(types: !325)
!325 = !{!130, !52, !147}
!326 = distinct !DISubprogram(name: "index_tree_next", scope: !1, file: !1, line: 298, type: !327, isLocal: true, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!327 = !DISubroutineType(types: !328)
!328 = !{!48, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!331 = distinct !DISubprogram(name: "iter_set_info", scope: !1, file: !1, line: 997, type: !264, isLocal: true, isDefinition: true, scopeLine: 998, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!332 = distinct !DISubprogram(name: "index_tree_locate", scope: !1, file: !1, line: 319, type: !333, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, variables: !160)
!333 = !DISubroutineType(types: !334)
!334 = !{!48, !335, !62}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!337 = !{i32 2, !"Dwarf Version", i32 4}
!338 = !{i32 2, !"Debug Info Version", i32 3}
!339 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!340 = !DILocalVariable(name: "allocator", arg: 1, scope: !133, file: !1, line: 401, type: !147)
!341 = !DIExpression()
!342 = !DILocation(line: 401, column: 33, scope: !133)
!343 = !DILocalVariable(name: "s", scope: !133, file: !1, line: 403, type: !130)
!344 = !DILocation(line: 403, column: 16, scope: !133)
!345 = !DILocalVariable(name: "i", scope: !133, file: !1, line: 405, type: !136)
!346 = !DILocation(line: 405, column: 14, scope: !133)
!347 = !DILocation(line: 405, column: 35, scope: !133)
!348 = !DILocation(line: 405, column: 18, scope: !133)
!349 = !DILocation(line: 406, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !133, file: !1, line: 406, column: 6)
!351 = !DILocation(line: 406, column: 8, scope: !350)
!352 = !DILocation(line: 406, column: 6, scope: !133)
!353 = !DILocation(line: 407, column: 3, scope: !350)
!354 = !DILocation(line: 409, column: 36, scope: !133)
!355 = !DILocation(line: 409, column: 6, scope: !133)
!356 = !DILocation(line: 409, column: 4, scope: !133)
!357 = !DILocation(line: 410, column: 6, scope: !358)
!358 = distinct !DILexicalBlock(scope: !133, file: !1, line: 410, column: 6)
!359 = !DILocation(line: 410, column: 8, scope: !358)
!360 = !DILocation(line: 410, column: 6, scope: !133)
!361 = !DILocation(line: 411, column: 13, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !1, line: 410, column: 17)
!363 = !DILocation(line: 411, column: 16, scope: !362)
!364 = !DILocation(line: 411, column: 3, scope: !362)
!365 = !DILocation(line: 412, column: 3, scope: !362)
!366 = !DILocation(line: 415, column: 21, scope: !133)
!367 = !DILocation(line: 415, column: 24, scope: !133)
!368 = !DILocation(line: 415, column: 34, scope: !133)
!369 = !DILocation(line: 415, column: 37, scope: !133)
!370 = !DILocation(line: 415, column: 2, scope: !133)
!371 = !DILocation(line: 417, column: 9, scope: !133)
!372 = !DILocation(line: 417, column: 2, scope: !133)
!373 = !DILocation(line: 418, column: 1, scope: !133)
!374 = !DILocalVariable(name: "allocator", arg: 1, scope: !273, file: !1, line: 383, type: !147)
!375 = !DILocation(line: 383, column: 34, scope: !273)
!376 = !DILocalVariable(name: "i", scope: !273, file: !1, line: 385, type: !136)
!377 = !DILocation(line: 385, column: 14, scope: !273)
!378 = !DILocation(line: 385, column: 49, scope: !273)
!379 = !DILocation(line: 385, column: 18, scope: !273)
