; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }
%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { i32, i64, %struct.lzma_index_s*, %struct.lzma_index_s**, i64, i64, i64, i64, i32 }
%struct.lzma_index_s = type opaque
%struct.lzma_filter = type { i64, i8* }

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [85 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_decoder.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !157, subprograms: !158)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !53, !59, !66, !154}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 18, size: 32, align: 32, elements: !44)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 17, size: 576, align: 64, elements: !20)
!20 = !{!21, !22, !26, !31, !33, !36, !37, !38, !41}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 27, baseType: !18, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !19, file: !1, line: 30, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!25 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !19, file: !1, line: 33, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !29, line: 37, baseType: !30)
!29 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !29, line: 37, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "index_ptr", scope: !19, file: !1, line: 37, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !19, file: !1, line: 40, baseType: !34, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !35, line: 63, baseType: !23)
!35 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !19, file: !1, line: 43, baseType: !34, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !19, file: !1, line: 46, baseType: !34, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !1, line: 49, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !40, line: 62, baseType: !25)
!40 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !19, file: !1, line: 52, baseType: !42, size: 32, align: 32, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 51, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52}
!45 = !DIEnumerator(name: "SEQ_INDICATOR", value: 0)
!46 = !DIEnumerator(name: "SEQ_COUNT", value: 1)
!47 = !DIEnumerator(name: "SEQ_MEMUSAGE", value: 2)
!48 = !DIEnumerator(name: "SEQ_UNPADDED", value: 3)
!49 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 4)
!50 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 5)
!51 = !DIEnumerator(name: "SEQ_PADDING", value: 6)
!52 = !DIEnumerator(name: "SEQ_CRC32", value: 7)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!56 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!57 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!58 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 27, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!63 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!64 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!65 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !68, file: !67, line: 182, size: 32, align: 32, elements: !147)
!67 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !67, line: 174, size: 704, align: 64, elements: !69)
!69 = !{!70, !139, !140, !141, !146}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 176, baseType: !71, size: 512, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !67, line: 75, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !67, line: 119, size: 512, align: 64, elements: !73)
!73 = !{!74, !77, !78, !80, !110, !115, !122, !127}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !72, file: !67, line: 121, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !67, line: 73, baseType: !19)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !67, line: 125, baseType: !34, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !72, file: !67, line: 131, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !24, line: 122, baseType: !25)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !72, file: !67, line: 134, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !67, line: 89, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !75, !86, !100, !105, !39, !107, !105, !39, !109}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !89)
!89 = !{!90, !95, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !88, file: !4, line: 376, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !94, !39, !39}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !88, file: !4, line: 390, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !94, !94}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !88, file: !4, line: 401, baseType: !94, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 48, baseType: !104)
!104 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !53)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !72, file: !67, line: 139, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !67, line: 97, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !75, !86}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !72, file: !67, line: 143, baseType: !116, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !60, line: 55, baseType: !59)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !72, file: !67, line: 147, baseType: !123, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!85, !75, !126, !126, !23}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !72, file: !67, line: 152, baseType: !128, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!85, !75, !86, !131, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !134, line: 65, baseType: !135)
!134 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 43, size: 128, align: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !134, line: 54, baseType: !34, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !135, file: !134, line: 63, baseType: !94, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !68, file: !67, line: 189, baseType: !66, size: 32, align: 32, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !68, file: !67, line: 194, baseType: !39, size: 64, align: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !68, file: !67, line: 197, baseType: !142, size: 32, align: 8, offset: 640)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 32, align: 8, elements: !144)
!143 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!144 = !{!145}
!145 = !DISubrange(count: 4)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !68, file: !67, line: 201, baseType: !143, size: 8, align: 8, offset: 672)
!147 = !{!148, !149, !150, !151, !152, !153}
!148 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!149 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!150 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!151 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!152 = !DIEnumerator(name: "ISEQ_END", value: 4)
!153 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !155)
!155 = !{!156}
!156 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!157 = !{!94, !79}
!158 = !{!159, !188, !191, !195, !196, !197, !200}
!159 = distinct !DISubprogram(name: "lzma_index_decoder", scope: !1, file: !1, line: 290, type: !160, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!160 = !DISubroutineType(types: !161)
!161 = !{!85, !162, !32, !23}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !164, file: !4, line: 454, baseType: !101, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !164, file: !4, line: 455, baseType: !39, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !164, file: !4, line: 456, baseType: !23, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !164, file: !4, line: 458, baseType: !108, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !164, file: !4, line: 459, baseType: !39, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !164, file: !4, line: 460, baseType: !23, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !164, file: !4, line: 468, baseType: !86, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !164, file: !4, line: 471, baseType: !174, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !68)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !164, file: !4, line: 479, baseType: !94, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !164, file: !4, line: 480, baseType: !94, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !164, file: !4, line: 481, baseType: !94, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !164, file: !4, line: 482, baseType: !94, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !164, file: !4, line: 483, baseType: !23, size: 64, align: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !164, file: !4, line: 484, baseType: !23, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !164, file: !4, line: 485, baseType: !39, size: 64, align: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !164, file: !4, line: 486, baseType: !39, size: 64, align: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !164, file: !4, line: 487, baseType: !185, size: 32, align: 32, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !154)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !164, file: !4, line: 488, baseType: !185, size: 32, align: 32, offset: 1056)
!187 = !{}
!188 = distinct !DISubprogram(name: "lzma_index_buffer_decode", scope: !1, file: !1, line: 302, type: !189, isLocal: false, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!189 = !DISubroutineType(types: !190)
!190 = !{!85, !32, !126, !86, !101, !106, !39}
!191 = distinct !DISubprogram(name: "index_decoder_init", scope: !1, file: !1, line: 264, type: !192, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!192 = !DISubroutineType(types: !193)
!193 = !{!85, !194, !86, !32, !23}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!195 = distinct !DISubprogram(name: "index_decoder_end", scope: !1, file: !1, line: 210, type: !113, isLocal: true, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!196 = distinct !DISubprogram(name: "index_decoder_memconfig", scope: !1, file: !1, line: 219, type: !124, isLocal: true, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!197 = distinct !DISubprogram(name: "index_decoder_reset", scope: !1, file: !1, line: 237, type: !198, isLocal: true, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!198 = !DISubroutineType(types: !199)
!199 = !{!85, !75, !86, !32, !23}
!200 = distinct !DISubprogram(name: "index_decode", scope: !1, file: !1, line: 57, type: !83, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, variables: !187)
!201 = !{i32 2, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!204 = !DILocalVariable(name: "strm", arg: 1, scope: !159, file: !1, line: 290, type: !162)
!205 = !DIExpression()
!206 = !DILocation(line: 290, column: 33, scope: !159)
!207 = !DILocalVariable(name: "i", arg: 2, scope: !159, file: !1, line: 290, type: !32)
!208 = !DILocation(line: 290, column: 52, scope: !159)
!209 = !DILocalVariable(name: "memlimit", arg: 3, scope: !159, file: !1, line: 290, type: !23)
!210 = !DILocation(line: 290, column: 64, scope: !159)
!211 = !DILocation(line: 292, column: 2, scope: !159)
!212 = !DILocalVariable(name: "ret_", scope: !213, file: !1, line: 292, type: !85)
!213 = distinct !DILexicalBlock(scope: !159, file: !1, line: 292, column: 2)
!214 = !DILocation(line: 292, column: 2, scope: !213)
!215 = !DILocation(line: 292, column: 2, scope: !216)
!216 = !DILexicalBlockFile(scope: !213, file: !1, discriminator: 1)
!217 = !DILocalVariable(name: "ret_", scope: !218, file: !1, line: 292, type: !219)
!218 = distinct !DILexicalBlock(scope: !213, file: !1, line: 292, column: 2)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!220 = !DILocation(line: 292, column: 2, scope: !218)
!221 = !DILocation(line: 292, column: 2, scope: !222)
!222 = !DILexicalBlockFile(scope: !218, file: !1, discriminator: 2)
!223 = !DILocation(line: 292, column: 2, scope: !224)
!224 = !DILexicalBlockFile(scope: !225, file: !1, discriminator: 3)
!225 = distinct !DILexicalBlock(scope: !218, file: !1, line: 292, column: 2)
!226 = !DILocation(line: 292, column: 2, scope: !227)
!227 = !DILexicalBlockFile(scope: !218, file: !1, discriminator: 4)
!228 = !DILocation(line: 292, column: 2, scope: !229)
!229 = !DILexicalBlockFile(scope: !213, file: !1, discriminator: 5)
!230 = !DILocation(line: 292, column: 2, scope: !231)
!231 = !DILexicalBlockFile(scope: !232, file: !1, discriminator: 6)
!232 = distinct !DILexicalBlock(scope: !233, file: !1, line: 292, column: 2)
!233 = distinct !DILexicalBlock(scope: !213, file: !1, line: 292, column: 2)
!234 = !DILocation(line: 292, column: 2, scope: !235)
!235 = !DILexicalBlockFile(scope: !213, file: !1, discriminator: 7)
