; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { i32, %struct.lzma_index_s*, %struct.lzma_index_iter, i64, i32 }
%struct.lzma_index_iter = type { %struct.anon, %struct.anon.0, [6 x %union.anon] }
%struct.anon = type { %struct.lzma_stream_flags*, i8*, i8*, i8*, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }
%struct.anon.0 = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i8*, i8*, i8*, i8* }
%union.anon = type { i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_index_s = type opaque
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !235, subprograms: !236)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !54, !62, !137, !143, !229}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 19, size: 32, align: 32, elements: !129)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 18, size: 2688, align: 64, elements: !20)
!20 = !{!21, !22, !28, !127, !128}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 27, baseType: !18, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !19, file: !1, line: 30, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !26, line: 37, baseType: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !26, line: 37, flags: DIFlagFwdDecl)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !19, file: !1, line: 33, baseType: !29, size: 2432, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_iter", file: !26, line: 220, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 43, size: 2432, align: 64, elements: !31)
!31 = !{!32, !96, !116}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !30, file: !26, line: 114, baseType: !33, size: 960, align: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, scope: !30, file: !26, line: 44, size: 960, align: 64, elements: !34)
!34 = !{!35, !80, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !26, line: 51, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !39, line: 105, baseType: !40)
!39 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/stream_flags.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 33, size: 448, align: 64, elements: !41)
!41 = !{!42, !46, !51, !60, !65, !66, !67, !68, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !40, file: !39, line: 51, baseType: !43, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !44, line: 51, baseType: !45)
!44 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!45 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !40, file: !39, line: 69, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !48, line: 63, baseType: !49)
!48 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !44, line: 55, baseType: !50)
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !40, file: !39, line: 79, baseType: !52, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !53, line: 55, baseType: !54)
!53 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 27, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!57 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!58 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!59 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !40, file: !39, line: 90, baseType: !61, size: 32, align: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !63)
!63 = !{!64}
!64 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !40, file: !39, line: 91, baseType: !61, size: 32, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !40, file: !39, line: 92, baseType: !61, size: 32, align: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !40, file: !39, line: 93, baseType: !61, size: 32, align: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !40, file: !39, line: 94, baseType: !69, size: 8, align: 8, offset: 288)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !70)
!70 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !40, file: !39, line: 95, baseType: !69, size: 8, align: 8, offset: 296)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !40, file: !39, line: 96, baseType: !69, size: 8, align: 8, offset: 304)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !40, file: !39, line: 97, baseType: !69, size: 8, align: 8, offset: 312)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !40, file: !39, line: 98, baseType: !69, size: 8, align: 8, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !40, file: !39, line: 99, baseType: !69, size: 8, align: 8, offset: 328)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !40, file: !39, line: 100, baseType: !69, size: 8, align: 8, offset: 336)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !40, file: !39, line: 101, baseType: !69, size: 8, align: 8, offset: 344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !40, file: !39, line: 102, baseType: !43, size: 32, align: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !40, file: !39, line: 103, baseType: !43, size: 32, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !33, file: !26, line: 53, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !33, file: !26, line: 54, baseType: !81, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !33, file: !26, line: 55, baseType: !81, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !33, file: !26, line: 62, baseType: !47, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !33, file: !26, line: 70, baseType: !47, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_offset", scope: !33, file: !26, line: 78, baseType: !47, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_offset", scope: !33, file: !26, line: 86, baseType: !47, size: 64, align: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !33, file: !26, line: 94, baseType: !47, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !33, file: !26, line: 99, baseType: !47, size: 64, align: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !33, file: !26, line: 108, baseType: !47, size: 64, align: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli1", scope: !33, file: !26, line: 110, baseType: !47, size: 64, align: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli2", scope: !33, file: !26, line: 111, baseType: !47, size: 64, align: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli3", scope: !33, file: !26, line: 112, baseType: !47, size: 64, align: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli4", scope: !33, file: !26, line: 113, baseType: !47, size: 64, align: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !30, file: !26, line: 208, baseType: !97, size: 1088, align: 64, offset: 960)
!97 = !DICompositeType(tag: DW_TAG_structure_type, scope: !30, file: !26, line: 116, size: 1088, align: 64, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "number_in_file", scope: !97, file: !26, line: 122, baseType: !47, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_file_offset", scope: !97, file: !26, line: 132, baseType: !47, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_file_offset", scope: !97, file: !26, line: 147, baseType: !47, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "number_in_stream", scope: !97, file: !26, line: 154, baseType: !47, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_stream_offset", scope: !97, file: !26, line: 162, baseType: !47, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_stream_offset", scope: !97, file: !26, line: 170, baseType: !47, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !97, file: !26, line: 179, baseType: !47, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !97, file: !26, line: 188, baseType: !47, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !97, file: !26, line: 197, baseType: !47, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli1", scope: !97, file: !26, line: 199, baseType: !47, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli2", scope: !97, file: !26, line: 200, baseType: !47, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli3", scope: !97, file: !26, line: 201, baseType: !47, size: 64, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_vli4", scope: !97, file: !26, line: 202, baseType: !47, size: 64, align: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !97, file: !26, line: 204, baseType: !81, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !97, file: !26, line: 205, baseType: !81, size: 64, align: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !97, file: !26, line: 206, baseType: !81, size: 64, align: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !97, file: !26, line: 207, baseType: !81, size: 64, align: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !30, file: !26, line: 219, baseType: !117, size: 384, align: 64, offset: 2048)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 384, align: 64, elements: !125)
!118 = !DICompositeType(tag: DW_TAG_union_type, scope: !30, file: !26, line: 215, size: 64, align: 64, elements: !119)
!119 = !{!120, !121, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !118, file: !26, line: 216, baseType: !81, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !118, file: !26, line: 217, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 62, baseType: !50)
!123 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !118, file: !26, line: 218, baseType: !47, size: 64, align: 64)
!125 = !{!126}
!126 = !DISubrange(count: 6)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !1, line: 36, baseType: !122, size: 64, align: 64, offset: 2560)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !19, file: !1, line: 39, baseType: !43, size: 32, align: 32, offset: 2624)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "SEQ_INDICATOR", value: 0)
!131 = !DIEnumerator(name: "SEQ_COUNT", value: 1)
!132 = !DIEnumerator(name: "SEQ_UNPADDED", value: 2)
!133 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 3)
!134 = !DIEnumerator(name: "SEQ_NEXT", value: 4)
!135 = !DIEnumerator(name: "SEQ_PADDING", value: 5)
!136 = !DIEnumerator(name: "SEQ_CRC32", value: 6)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142}
!139 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!140 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!141 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!142 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !145, file: !144, line: 182, size: 32, align: 32, elements: !222)
!144 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !144, line: 174, size: 704, align: 64, elements: !146)
!146 = !{!147, !214, !215, !216, !221}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !144, line: 176, baseType: !148, size: 512, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !144, line: 75, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !144, line: 119, size: 512, align: 64, elements: !150)
!150 = !{!151, !154, !155, !157, !186, !191, !197, !202}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !149, file: !144, line: 121, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !144, line: 73, baseType: !19)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !144, line: 125, baseType: !47, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !149, file: !144, line: 131, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !44, line: 122, baseType: !50)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !149, file: !144, line: 134, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !144, line: 89, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !152, !163, !177, !181, !122, !183, !181, !122, !185}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !166)
!166 = !{!167, !172, !176}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !165, file: !4, line: 376, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !171, !122, !122}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !165, file: !4, line: 390, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !171, !171}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !165, file: !4, line: 401, baseType: !171, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !44, line: 48, baseType: !70)
!181 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !137)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !149, file: !144, line: 139, baseType: !187, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !144, line: 97, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !152, !163}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !149, file: !144, line: 143, baseType: !192, size: 64, align: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!52, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !149, file: !144, line: 147, baseType: !198, size: 64, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!162, !152, !201, !201, !49}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !149, file: !144, line: 152, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!162, !152, !163, !206, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !209, line: 65, baseType: !210)
!209 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 43, size: 128, align: 64, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !209, line: 54, baseType: !47, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !210, file: !209, line: 63, baseType: !171, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !145, file: !144, line: 189, baseType: !143, size: 32, align: 32, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !145, file: !144, line: 194, baseType: !122, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !145, file: !144, line: 197, baseType: !217, size: 32, align: 8, offset: 640)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 32, align: 8, elements: !219)
!218 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!219 = !{!220}
!220 = !DISubrange(count: 4)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !145, file: !144, line: 201, baseType: !218, size: 8, align: 8, offset: 672)
!222 = !{!223, !224, !225, !226, !227, !228}
!223 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!224 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!225 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!226 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!227 = !DIEnumerator(name: "ISEQ_END", value: 4)
!228 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 226, size: 32, align: 32, elements: !230)
!230 = !{!231, !232, !233, !234}
!231 = !DIEnumerator(name: "LZMA_INDEX_ITER_ANY", value: 0)
!232 = !DIEnumerator(name: "LZMA_INDEX_ITER_STREAM", value: 1)
!233 = !DIEnumerator(name: "LZMA_INDEX_ITER_BLOCK", value: 2)
!234 = !DIEnumerator(name: "LZMA_INDEX_ITER_NONEMPTY_BLOCK", value: 3)
!235 = !{!156, !171}
!236 = !{!237, !242, !269, !272, !273, !274}
!237 = distinct !DISubprogram(name: "lzma_index_encoder_init", scope: !1, file: !1, line: 184, type: !238, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, variables: !241)
!238 = !DISubroutineType(types: !239)
!239 = !{!162, !240, !163, !23}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!241 = !{}
!242 = distinct !DISubprogram(name: "lzma_index_encoder", scope: !1, file: !1, line: 208, type: !243, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, variables: !241)
!243 = !DISubroutineType(types: !244)
!244 = !{!162, !245, !23}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !247, file: !4, line: 454, baseType: !178, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !247, file: !4, line: 455, baseType: !122, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !247, file: !4, line: 456, baseType: !49, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !247, file: !4, line: 458, baseType: !184, size: 64, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !247, file: !4, line: 459, baseType: !122, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !247, file: !4, line: 460, baseType: !49, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !247, file: !4, line: 468, baseType: !163, size: 64, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !247, file: !4, line: 471, baseType: !257, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !145)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !247, file: !4, line: 479, baseType: !171, size: 64, align: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !247, file: !4, line: 480, baseType: !171, size: 64, align: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !247, file: !4, line: 481, baseType: !171, size: 64, align: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !247, file: !4, line: 482, baseType: !171, size: 64, align: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !247, file: !4, line: 483, baseType: !49, size: 64, align: 64, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !247, file: !4, line: 484, baseType: !49, size: 64, align: 64, offset: 832)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !247, file: !4, line: 485, baseType: !122, size: 64, align: 64, offset: 896)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !247, file: !4, line: 486, baseType: !122, size: 64, align: 64, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !247, file: !4, line: 487, baseType: !61, size: 32, align: 32, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !247, file: !4, line: 488, baseType: !61, size: 32, align: 32, offset: 1056)
!269 = distinct !DISubprogram(name: "lzma_index_buffer_encode", scope: !1, file: !1, line: 220, type: !270, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, variables: !241)
!270 = !DISubroutineType(types: !271)
!271 = !{!162, !23, !184, !182, !122}
!272 = distinct !DISubprogram(name: "index_encode", scope: !1, file: !1, line: 44, type: !160, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, variables: !241)
!273 = distinct !DISubprogram(name: "index_encoder_end", scope: !1, file: !1, line: 162, type: !189, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, variables: !241)
!274 = distinct !DISubprogram(name: "index_encoder_reset", scope: !1, file: !1, line: 170, type: !275, isLocal: true, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, variables: !241)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !152, !23}
!277 = !{i32 2, !"Dwarf Version", i32 4}
!278 = !{i32 2, !"Debug Info Version", i32 3}
!279 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!280 = !DILocalVariable(name: "next", arg: 1, scope: !237, file: !1, line: 184, type: !240)
!281 = !DIExpression()
!282 = !DILocation(line: 184, column: 42, scope: !237)
!283 = !DILocalVariable(name: "allocator", arg: 2, scope: !237, file: !1, line: 184, type: !163)
!284 = !DILocation(line: 184, column: 64, scope: !237)
!285 = !DILocalVariable(name: "i", arg: 3, scope: !237, file: !1, line: 185, type: !23)
!286 = !DILocation(line: 185, column: 21, scope: !237)
!287 = !DILocation(line: 187, column: 2, scope: !237)
!288 = !DILocation(line: 187, column: 2, scope: !289)
!289 = !DILexicalBlockFile(scope: !290, file: !1, discriminator: 1)
!290 = distinct !DILexicalBlock(scope: !291, file: !1, line: 187, column: 2)
!291 = distinct !DILexicalBlock(scope: !237, file: !1, line: 187, column: 2)
!292 = !DILocation(line: 187, column: 2, scope: !293)
!293 = !DILexicalBlockFile(scope: !290, file: !1, discriminator: 2)
!294 = !DILocation(line: 187, column: 2, scope: !295)
!295 = !DILexicalBlockFile(scope: !291, file: !1, discriminator: 3)
!296 = !DILocation(line: 189, column: 6, scope: !297)
!297 = distinct !DILexicalBlock(scope: !237, file: !1, line: 189, column: 6)
!298 = !DILocation(line: 189, column: 8, scope: !297)
!299 = !DILocation(line: 189, column: 6, scope: !237)
!300 = !DILocation(line: 190, column: 3, scope: !297)
!301 = !DILocation(line: 192, column: 6, scope: !302)
!302 = distinct !DILexicalBlock(scope: !237, file: !1, line: 192, column: 6)
!303 = !DILocation(line: 192, column: 12, scope: !302)
!304 = !DILocation(line: 192, column: 18, scope: !302)
!305 = !DILocation(line: 192, column: 6, scope: !237)
!306 = !DILocation(line: 193, column: 48, scope: !307)
!307 = distinct !DILexicalBlock(scope: !302, file: !1, line: 192, column: 27)
!308 = !DILocation(line: 193, column: 17, scope: !307)
!309 = !DILocation(line: 193, column: 3, scope: !307)
!310 = !DILocation(line: 193, column: 9, scope: !307)
!311 = !DILocation(line: 193, column: 15, scope: !307)
!312 = !DILocation(line: 194, column: 7, scope: !313)
!313 = distinct !DILexicalBlock(scope: !307, file: !1, line: 194, column: 7)
!314 = !DILocation(line: 194, column: 13, scope: !313)
!315 = !DILocation(line: 194, column: 19, scope: !313)
!316 = !DILocation(line: 194, column: 7, scope: !307)
!317 = !DILocation(line: 195, column: 4, scope: !313)
!318 = !DILocation(line: 197, column: 3, scope: !307)
!319 = !DILocation(line: 197, column: 9, scope: !307)
!320 = !DILocation(line: 197, column: 14, scope: !307)
!321 = !DILocation(line: 198, column: 3, scope: !307)
!322 = !DILocation(line: 198, column: 9, scope: !307)
!323 = !DILocation(line: 198, column: 13, scope: !307)
!324 = !DILocation(line: 199, column: 2, scope: !307)
