; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_hash.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_index_hash_s = type { i32, %struct.lzma_index_hash_info, %struct.lzma_index_hash_info, i64, i64, i64, i64, i32 }
%struct.lzma_index_hash_info = type { i64, i64, i64, i64, %struct.lzma_check_state }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [82 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_hash.c\00", align 1
@__PRETTY_FUNCTION__.lzma_index_hash_decode = private unnamed_addr constant [86 x i8] c"lzma_ret lzma_index_hash_decode(lzma_index_hash *, const uint8_t *, size_t *, size_t)\00", align 1
@.str.2 = private unnamed_addr constant [38 x i8] c"vli <= ((18446744073709551615UL) / 2)\00", align 1
@.str.3 = private unnamed_addr constant [77 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.h\00", align 1
@__PRETTY_FUNCTION__.vli_ceil4 = private unnamed_addr constant [29 x i8] c"lzma_vli vli_ceil4(lzma_vli)\00", align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !93, subprograms: !97)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index_hash.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !71, !78}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !1, line: 38, size: 32, align: 32, elements: !63)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_hash_s", file: !1, line: 37, size: 2560, align: 64, elements: !5)
!5 = !{!6, !7, !55, !56, !57, !58, !59, !62}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !4, file: !1, line: 46, baseType: !3, size: 32, align: 32)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !4, file: !1, line: 49, baseType: !8, size: 1088, align: 64, offset: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash_info", file: !1, line: 34, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 18, size: 1088, align: 64, elements: !10)
!10 = !{!11, !17, !18, !19, !20}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_size", scope: !9, file: !1, line: 20, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !13, line: 63, baseType: !14)
!13 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 55, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!16 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !9, file: !1, line: 23, baseType: !12, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !9, file: !1, line: 26, baseType: !12, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !9, file: !1, line: 29, baseType: !12, size: 64, align: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !9, file: !1, line: 32, baseType: !21, size: 832, align: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !22, line: 56, baseType: !23)
!22 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/check/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 34, size: 832, align: 64, elements: !24)
!24 = !{!25, !44}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !23, file: !22, line: 40, baseType: !26, size: 512, align: 64)
!26 = !DICompositeType(tag: DW_TAG_union_type, scope: !23, file: !22, line: 36, size: 512, align: 64, elements: !27)
!27 = !{!28, !34, !40}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !26, file: !22, line: 37, baseType: !29, size: 512, align: 8)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, align: 8, elements: !32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 48, baseType: !31)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33}
!33 = !DISubrange(count: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !26, file: !22, line: 38, baseType: !35, size: 512, align: 32)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, align: 32, elements: !38)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 51, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !{!39}
!39 = !DISubrange(count: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !26, file: !22, line: 39, baseType: !41, size: 512, align: 64)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 64, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !23, file: !22, line: 54, baseType: !45, size: 320, align: 64, offset: 512)
!45 = !DICompositeType(tag: DW_TAG_union_type, scope: !23, file: !22, line: 43, size: 320, align: 64, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !45, file: !22, line: 44, baseType: !36, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !45, file: !22, line: 45, baseType: !14, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !45, file: !22, line: 53, baseType: !50, size: 320, align: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, scope: !45, file: !22, line: 47, size: 320, align: 64, elements: !51)
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !50, file: !22, line: 49, baseType: !53, size: 256, align: 32)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 256, align: 32, elements: !42)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !22, line: 52, baseType: !14, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !4, file: !1, line: 52, baseType: !8, size: 1088, align: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !4, file: !1, line: 55, baseType: !12, size: 64, align: 64, offset: 2240)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !4, file: !1, line: 58, baseType: !12, size: 64, align: 64, offset: 2304)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !4, file: !1, line: 61, baseType: !12, size: 64, align: 64, offset: 2368)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !4, file: !1, line: 65, baseType: !60, size: 64, align: 64, offset: 2432)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 62, baseType: !16)
!61 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !4, file: !1, line: 68, baseType: !36, size: 32, align: 32, offset: 2496)
!63 = !{!64, !65, !66, !67, !68, !69, !70}
!64 = !DIEnumerator(name: "SEQ_BLOCK", value: 0)
!65 = !DIEnumerator(name: "SEQ_COUNT", value: 1)
!66 = !DIEnumerator(name: "SEQ_UNPADDED", value: 2)
!67 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 3)
!68 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 4)
!69 = !DIEnumerator(name: "SEQ_PADDING", value: 5)
!70 = !DIEnumerator(name: "SEQ_CRC32", value: 6)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 27, size: 32, align: 32, elements: !73)
!72 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!75 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!76 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!77 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 57, size: 32, align: 32, elements: !80)
!79 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!81 = !DIEnumerator(name: "LZMA_OK", value: 0)
!82 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!83 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!84 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!85 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!86 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!87 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!88 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!89 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!90 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!91 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!92 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!97 = !{!98, !118, !121, !126, !130, !134, !138, !141, !145, !148}
!98 = distinct !DISubprogram(name: "lzma_index_hash_init", scope: !1, file: !1, line: 73, type: !99, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !101, !104}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash", file: !103, line: 25, baseType: !4)
!103 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/index_hash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !79, line: 403, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 341, size: 192, align: 64, elements: !107)
!107 = !{!108, !112, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !106, file: !79, line: 376, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!94, !94, !60, !60}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !106, file: !79, line: 390, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !94, !94}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !106, file: !79, line: 401, baseType: !94, size: 64, align: 64, offset: 128)
!117 = !{}
!118 = distinct !DISubprogram(name: "lzma_index_hash_end", scope: !1, file: !1, line: 104, type: !119, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !101, !104}
!121 = distinct !DISubprogram(name: "lzma_index_hash_size", scope: !1, file: !1, line: 112, type: !122, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!122 = !DISubroutineType(types: !123)
!123 = !{!12, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!126 = distinct !DISubprogram(name: "lzma_index_hash_append", scope: !1, file: !1, line: 143, type: !127, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !101, !12, !12}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !79, line: 237, baseType: !78)
!130 = distinct !DISubprogram(name: "lzma_index_hash_decode", scope: !1, file: !1, line: 174, type: !131, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!131 = !DISubroutineType(types: !132)
!132 = !{!129, !101, !95, !133, !60}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!134 = distinct !DISubprogram(name: "index_size", scope: !135, file: !135, line: 57, type: !136, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!135 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!136 = !DISubroutineType(types: !137)
!137 = !{!12, !12, !12}
!138 = distinct !DISubprogram(name: "vli_ceil4", scope: !135, file: !135, line: 39, type: !139, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!139 = !DISubroutineType(types: !140)
!140 = !{!12, !12}
!141 = distinct !DISubprogram(name: "hash_append", scope: !1, file: !1, line: 124, type: !142, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!142 = !DISubroutineType(types: !143)
!143 = !{!129, !144, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!145 = distinct !DISubprogram(name: "index_stream_size", scope: !135, file: !135, line: 65, type: !146, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!146 = !DISubroutineType(types: !147)
!147 = !{!12, !12, !12, !12}
!148 = distinct !DISubprogram(name: "index_size_unpadded", scope: !135, file: !135, line: 48, type: !136, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, variables: !117)
!149 = !{i32 2, !"Dwarf Version", i32 4}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!152 = !DILocalVariable(name: "index_hash", arg: 1, scope: !98, file: !1, line: 73, type: !101)
!153 = !DIExpression()
!154 = !DILocation(line: 73, column: 39, scope: !98)
!155 = !DILocalVariable(name: "allocator", arg: 2, scope: !98, file: !1, line: 73, type: !104)
!156 = !DILocation(line: 73, column: 67, scope: !98)
!157 = !DILocation(line: 75, column: 6, scope: !158)
!158 = distinct !DILexicalBlock(scope: !98, file: !1, line: 75, column: 6)
!159 = !DILocation(line: 75, column: 17, scope: !158)
!160 = !DILocation(line: 75, column: 6, scope: !98)
!161 = !DILocation(line: 76, column: 52, scope: !162)
!162 = distinct !DILexicalBlock(scope: !158, file: !1, line: 75, column: 26)
