; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { i32, %struct.lzma_next_coder_s, %struct.lzma_block, %struct.lzma_stream_flags, %struct.lzma_index_hash_s*, i64, i64, i8, i8, i8, i8, i8, i64, [1024 x i8] }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }
%struct.lzma_index_hash_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !223, subprograms: !224, globals: !264)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !87, !143, !70, !205}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 18, size: 32, align: 32, elements: !198)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 17, size: 11200, align: 64, elements: !20)
!20 = !{!21, !22, !112, !158, !180, !185, !186, !187, !189, !190, !191, !192, !193, !194}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 25, baseType: !18, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "block_decoder", scope: !19, file: !1, line: 30, baseType: !23, size: 512, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !24, line: 75, baseType: !25)
!24 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !24, line: 119, size: 512, align: 64, elements: !26)
!26 = !{!27, !30, !36, !38, !76, !81, !95, !100}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !25, file: !24, line: 121, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !24, line: 73, baseType: !19)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !25, file: !24, line: 125, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !32, line: 63, baseType: !33)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !34, line: 55, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!35 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !25, file: !24, line: 131, baseType: !37, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !34, line: 122, baseType: !35)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !25, file: !24, line: 134, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !24, line: 89, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !28, !44, !60, !65, !53, !67, !65, !53, !69}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !47)
!47 = !{!48, !55, !59}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !4, line: 376, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !52, !53, !53}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 62, baseType: !35)
!54 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !46, file: !4, line: 390, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !52, !52}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !46, file: !4, line: 401, baseType: !52, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !34, line: 48, baseType: !64)
!64 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!73 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!74 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!75 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !25, file: !24, line: 139, baseType: !77, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !24, line: 97, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !28, !44}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !25, file: !24, line: 143, baseType: !82, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !93}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !86, line: 55, baseType: !87)
!86 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 27, size: 32, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!90 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!91 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!92 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !25, file: !24, line: 147, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!43, !28, !99, !99, !33}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !25, file: !24, line: 152, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!43, !28, !44, !104, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !107, line: 65, baseType: !108)
!107 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!108 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 43, size: 128, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !107, line: 54, baseType: !31, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !108, file: !107, line: 63, baseType: !52, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "block_options", scope: !19, file: !1, line: 34, baseType: !113, size: 1664, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !114, line: 245, baseType: !115)
!114 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 30, size: 1664, align: 64, elements: !116)
!116 = !{!117, !120, !121, !122, !123, !124, !126, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !146, !147, !148, !149, !151, !152, !153, !154, !155, !156, !157}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !115, file: !114, line: 47, baseType: !118, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 51, baseType: !119)
!119 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !115, file: !114, line: 67, baseType: !118, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !115, file: !114, line: 88, baseType: !85, size: 32, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !115, file: !114, line: 143, baseType: !31, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !115, file: !114, line: 167, baseType: !31, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !115, file: !114, line: 195, baseType: !125, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !115, file: !114, line: 212, baseType: !127, size: 512, align: 8, offset: 320)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !115, file: !114, line: 221, baseType: !52, size: 64, align: 64, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !115, file: !114, line: 222, baseType: !52, size: 64, align: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !115, file: !114, line: 223, baseType: !52, size: 64, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !115, file: !114, line: 224, baseType: !118, size: 32, align: 32, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !115, file: !114, line: 225, baseType: !118, size: 32, align: 32, offset: 1056)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !115, file: !114, line: 226, baseType: !31, size: 64, align: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !115, file: !114, line: 227, baseType: !31, size: 64, align: 64, offset: 1152)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !115, file: !114, line: 228, baseType: !31, size: 64, align: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !115, file: !114, line: 229, baseType: !31, size: 64, align: 64, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !115, file: !114, line: 230, baseType: !31, size: 64, align: 64, offset: 1344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !115, file: !114, line: 231, baseType: !31, size: 64, align: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !115, file: !114, line: 232, baseType: !142, size: 32, align: 32, offset: 1472)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !144)
!144 = !{!145}
!145 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !115, file: !114, line: 233, baseType: !142, size: 32, align: 32, offset: 1504)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !115, file: !114, line: 234, baseType: !142, size: 32, align: 32, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !115, file: !114, line: 235, baseType: !142, size: 32, align: 32, offset: 1568)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !115, file: !114, line: 236, baseType: !150, size: 8, align: 8, offset: 1600)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !115, file: !114, line: 237, baseType: !150, size: 8, align: 8, offset: 1608)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !115, file: !114, line: 238, baseType: !150, size: 8, align: 8, offset: 1616)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !115, file: !114, line: 239, baseType: !150, size: 8, align: 8, offset: 1624)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !115, file: !114, line: 240, baseType: !150, size: 8, align: 8, offset: 1632)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !115, file: !114, line: 241, baseType: !150, size: 8, align: 8, offset: 1640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !115, file: !114, line: 242, baseType: !150, size: 8, align: 8, offset: 1648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !115, file: !114, line: 243, baseType: !150, size: 8, align: 8, offset: 1656)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "stream_flags", scope: !19, file: !1, line: 37, baseType: !159, size: 448, align: 64, offset: 2240)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !160, line: 105, baseType: !161)
!160 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/stream_flags.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!161 = !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 33, size: 448, align: 64, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !161, file: !160, line: 51, baseType: !118, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !161, file: !160, line: 69, baseType: !31, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !161, file: !160, line: 79, baseType: !85, size: 32, align: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !161, file: !160, line: 90, baseType: !142, size: 32, align: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !161, file: !160, line: 91, baseType: !142, size: 32, align: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !161, file: !160, line: 92, baseType: !142, size: 32, align: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !161, file: !160, line: 93, baseType: !142, size: 32, align: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !161, file: !160, line: 94, baseType: !150, size: 8, align: 8, offset: 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !161, file: !160, line: 95, baseType: !150, size: 8, align: 8, offset: 296)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !161, file: !160, line: 96, baseType: !150, size: 8, align: 8, offset: 304)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !161, file: !160, line: 97, baseType: !150, size: 8, align: 8, offset: 312)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !161, file: !160, line: 98, baseType: !150, size: 8, align: 8, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !161, file: !160, line: 99, baseType: !150, size: 8, align: 8, offset: 328)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !161, file: !160, line: 100, baseType: !150, size: 8, align: 8, offset: 336)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !161, file: !160, line: 101, baseType: !150, size: 8, align: 8, offset: 344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !161, file: !160, line: 102, baseType: !118, size: 32, align: 32, offset: 352)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !161, file: !160, line: 103, baseType: !118, size: 32, align: 32, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "index_hash", scope: !19, file: !1, line: 41, baseType: !181, size: 64, align: 64, offset: 2688)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash", file: !183, line: 25, baseType: !184)
!183 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/index_hash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_hash_s", file: !183, line: 25, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !19, file: !1, line: 44, baseType: !33, size: 64, align: 64, offset: 2752)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !19, file: !1, line: 47, baseType: !33, size: 64, align: 64, offset: 2816)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tell_no_check", scope: !19, file: !1, line: 51, baseType: !188, size: 8, align: 8, offset: 2880)
!188 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tell_unsupported_check", scope: !19, file: !1, line: 55, baseType: !188, size: 8, align: 8, offset: 2888)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tell_any_check", scope: !19, file: !1, line: 58, baseType: !188, size: 8, align: 8, offset: 2896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "concatenated", scope: !19, file: !1, line: 65, baseType: !188, size: 8, align: 8, offset: 2904)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "first_stream", scope: !19, file: !1, line: 71, baseType: !188, size: 8, align: 8, offset: 2912)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !1, line: 74, baseType: !53, size: 64, align: 64, offset: 2944)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !19, file: !1, line: 78, baseType: !195, size: 8192, align: 8, offset: 3008)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8192, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1024)
!198 = !{!199, !200, !201, !202, !203, !204}
!199 = !DIEnumerator(name: "SEQ_STREAM_HEADER", value: 0)
!200 = !DIEnumerator(name: "SEQ_BLOCK_HEADER", value: 1)
!201 = !DIEnumerator(name: "SEQ_BLOCK", value: 2)
!202 = !DIEnumerator(name: "SEQ_INDEX", value: 3)
!203 = !DIEnumerator(name: "SEQ_STREAM_FOOTER", value: 4)
!204 = !DIEnumerator(name: "SEQ_STREAM_PADDING", value: 5)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !206, file: !24, line: 182, size: 32, align: 32, elements: !216)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !24, line: 174, size: 704, align: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !215}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !24, line: 176, baseType: !23, size: 512, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !206, file: !24, line: 189, baseType: !205, size: 32, align: 32, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !206, file: !24, line: 194, baseType: !53, size: 64, align: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !206, file: !24, line: 197, baseType: !212, size: 32, align: 8, offset: 640)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 32, align: 8, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 4)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !206, file: !24, line: 201, baseType: !188, size: 8, align: 8, offset: 672)
!216 = !{!217, !218, !219, !220, !221, !222}
!217 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!218 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!219 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!220 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!221 = !DIEnumerator(name: "ISEQ_END", value: 4)
!222 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!223 = !{!37, !52, !118}
!224 = !{!225, !230, !257, !258, !259, !260, !261}
!225 = distinct !DISubprogram(name: "lzma_stream_decoder_init", scope: !1, file: !1, line: 412, type: !226, isLocal: false, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!226 = !DISubroutineType(types: !227)
!227 = !{!43, !228, !44, !33, !118}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!229 = !{}
!230 = distinct !DISubprogram(name: "lzma_stream_decoder", scope: !1, file: !1, line: 451, type: !231, isLocal: false, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!231 = !DISubroutineType(types: !232)
!232 = !{!43, !233, !33, !118}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !235, file: !4, line: 454, baseType: !61, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !235, file: !4, line: 455, baseType: !53, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !235, file: !4, line: 456, baseType: !33, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !235, file: !4, line: 458, baseType: !68, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !235, file: !4, line: 459, baseType: !53, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !235, file: !4, line: 460, baseType: !33, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !235, file: !4, line: 468, baseType: !44, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !235, file: !4, line: 471, baseType: !245, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !206)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !235, file: !4, line: 479, baseType: !52, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !235, file: !4, line: 480, baseType: !52, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !235, file: !4, line: 481, baseType: !52, size: 64, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !235, file: !4, line: 482, baseType: !52, size: 64, align: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !235, file: !4, line: 483, baseType: !33, size: 64, align: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !235, file: !4, line: 484, baseType: !33, size: 64, align: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !235, file: !4, line: 485, baseType: !53, size: 64, align: 64, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !235, file: !4, line: 486, baseType: !53, size: 64, align: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !235, file: !4, line: 487, baseType: !142, size: 32, align: 32, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !235, file: !4, line: 488, baseType: !142, size: 32, align: 32, offset: 1056)
!257 = distinct !DISubprogram(name: "stream_decode", scope: !1, file: !1, line: 99, type: !41, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!258 = distinct !DISubprogram(name: "stream_decoder_end", scope: !1, file: !1, line: 377, type: !79, isLocal: true, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!259 = distinct !DISubprogram(name: "stream_decoder_get_check", scope: !1, file: !1, line: 387, type: !83, isLocal: true, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!260 = distinct !DISubprogram(name: "stream_decoder_memconfig", scope: !1, file: !1, line: 394, type: !97, isLocal: true, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!261 = distinct !DISubprogram(name: "stream_decoder_reset", scope: !1, file: !1, line: 83, type: !262, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, variables: !229)
!262 = !DISubroutineType(types: !263)
!263 = !{!43, !28, !44}
!264 = !{!265}
!265 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !24, line: 159, type: !266, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!267 = !{i32 2, !"Dwarf Version", i32 4}
!268 = !{i32 2, !"Debug Info Version", i32 3}
!269 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!270 = !DILocalVariable(name: "next", arg: 1, scope: !225, file: !1, line: 412, type: !228)
!271 = !DIExpression()
!272 = !DILocation(line: 412, column: 43, scope: !225)
!273 = !DILocalVariable(name: "allocator", arg: 2, scope: !225, file: !1, line: 412, type: !44)
!274 = !DILocation(line: 412, column: 65, scope: !225)
!275 = !DILocalVariable(name: "memlimit", arg: 3, scope: !225, file: !1, line: 413, type: !33)
!276 = !DILocation(line: 413, column: 12, scope: !225)
!277 = !DILocalVariable(name: "flags", arg: 4, scope: !225, file: !1, line: 413, type: !118)
!278 = !DILocation(line: 413, column: 31, scope: !225)
!279 = !DILocation(line: 415, column: 2, scope: !225)
!280 = !DILocation(line: 415, column: 2, scope: !281)
!281 = !DILexicalBlockFile(scope: !282, file: !1, discriminator: 1)
!282 = distinct !DILexicalBlock(scope: !283, file: !1, line: 415, column: 2)
!283 = distinct !DILexicalBlock(scope: !225, file: !1, line: 415, column: 2)
!284 = !DILocation(line: 415, column: 2, scope: !285)
!285 = !DILexicalBlockFile(scope: !282, file: !1, discriminator: 2)
!286 = !DILocation(line: 415, column: 2, scope: !287)
!287 = !DILexicalBlockFile(scope: !283, file: !1, discriminator: 3)
!288 = !DILocation(line: 417, column: 6, scope: !289)
!289 = distinct !DILexicalBlock(scope: !225, file: !1, line: 417, column: 6)
!290 = !DILocation(line: 417, column: 15, scope: !289)
!291 = !DILocation(line: 417, column: 6, scope: !225)
!292 = !DILocation(line: 418, column: 3, scope: !289)
!293 = !DILocation(line: 420, column: 6, scope: !294)
!294 = distinct !DILexicalBlock(scope: !225, file: !1, line: 420, column: 6)
!295 = !DILocation(line: 420, column: 12, scope: !294)
!296 = !DILocation(line: 420, column: 6, scope: !225)
!297 = !DILocation(line: 421, column: 3, scope: !294)
!298 = !DILocation(line: 423, column: 6, scope: !299)
!299 = distinct !DILexicalBlock(scope: !225, file: !1, line: 423, column: 6)
!300 = !DILocation(line: 423, column: 12, scope: !299)
!301 = !DILocation(line: 423, column: 18, scope: !299)
!302 = !DILocation(line: 423, column: 6, scope: !225)
!303 = !DILocation(line: 424, column: 48, scope: !304)
!304 = distinct !DILexicalBlock(scope: !299, file: !1, line: 423, column: 27)
!305 = !DILocation(line: 424, column: 17, scope: !304)
!306 = !DILocation(line: 424, column: 3, scope: !304)
