; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { i32, i8, %struct.lzma_next_coder_s, %struct.lzma_block, [5 x %struct.lzma_filter], %struct.lzma_next_coder_s, %struct.lzma_index_s*, i64, i64, [1024 x i8] }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_index_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !201, subprograms: !202, globals: !241)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !89, !145, !72, !183}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 19, size: 32, align: 32, elements: !176)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 18, size: 11776, align: 64, elements: !20)
!20 = !{!21, !22, !24, !114, !160, !164, !165, !170, !171, !172}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 26, baseType: !18, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "block_encoder_is_initialized", scope: !19, file: !1, line: 31, baseType: !23, size: 8, align: 8, offset: 32)
!23 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "block_encoder", scope: !19, file: !1, line: 34, baseType: !25, size: 512, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !26, line: 75, baseType: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !26, line: 119, size: 512, align: 64, elements: !28)
!28 = !{!29, !32, !38, !40, !78, !83, !97, !102}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !27, file: !26, line: 121, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !26, line: 73, baseType: !19)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !27, file: !26, line: 125, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !34, line: 63, baseType: !35)
!34 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !36, line: 55, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!37 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !27, file: !26, line: 131, baseType: !39, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !36, line: 122, baseType: !37)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !27, file: !26, line: 134, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !26, line: 89, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !30, !46, !62, !67, !55, !69, !67, !55, !71}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !49)
!49 = !{!50, !57, !61}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !48, file: !4, line: 376, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !54, !55, !55}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 62, baseType: !37)
!56 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !48, file: !4, line: 390, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !54, !54}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !48, file: !4, line: 401, baseType: !54, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !36, line: 48, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!75 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!76 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!77 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !27, file: !26, line: 139, baseType: !79, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !26, line: 97, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !30, !46}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !27, file: !26, line: 143, baseType: !84, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !95}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !88, line: 55, baseType: !89)
!88 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 27, size: 32, align: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!92 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!93 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!94 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !27, file: !26, line: 147, baseType: !98, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!45, !30, !101, !101, !35}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !27, file: !26, line: 152, baseType: !103, size: 64, align: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!45, !30, !46, !106, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !109, line: 65, baseType: !110)
!109 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 43, size: 128, align: 64, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !109, line: 54, baseType: !33, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !110, file: !109, line: 63, baseType: !54, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "block_options", scope: !19, file: !1, line: 37, baseType: !115, size: 1664, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !116, line: 245, baseType: !117)
!116 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!117 = !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 30, size: 1664, align: 64, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !128, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !148, !149, !150, !151, !153, !154, !155, !156, !157, !158, !159}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !117, file: !116, line: 47, baseType: !120, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !36, line: 51, baseType: !121)
!121 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !117, file: !116, line: 67, baseType: !120, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !117, file: !116, line: 88, baseType: !87, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !117, file: !116, line: 143, baseType: !33, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !117, file: !116, line: 167, baseType: !33, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !117, file: !116, line: 195, baseType: !127, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !117, file: !116, line: 212, baseType: !129, size: 512, align: 8, offset: 320)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !117, file: !116, line: 221, baseType: !54, size: 64, align: 64, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !117, file: !116, line: 222, baseType: !54, size: 64, align: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !117, file: !116, line: 223, baseType: !54, size: 64, align: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !117, file: !116, line: 224, baseType: !120, size: 32, align: 32, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !117, file: !116, line: 225, baseType: !120, size: 32, align: 32, offset: 1056)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !117, file: !116, line: 226, baseType: !33, size: 64, align: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !117, file: !116, line: 227, baseType: !33, size: 64, align: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !117, file: !116, line: 228, baseType: !33, size: 64, align: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !117, file: !116, line: 229, baseType: !33, size: 64, align: 64, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !117, file: !116, line: 230, baseType: !33, size: 64, align: 64, offset: 1344)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !117, file: !116, line: 231, baseType: !33, size: 64, align: 64, offset: 1408)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !117, file: !116, line: 232, baseType: !144, size: 32, align: 32, offset: 1472)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !146)
!146 = !{!147}
!147 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !117, file: !116, line: 233, baseType: !144, size: 32, align: 32, offset: 1504)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !117, file: !116, line: 234, baseType: !144, size: 32, align: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !117, file: !116, line: 235, baseType: !144, size: 32, align: 32, offset: 1568)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !117, file: !116, line: 236, baseType: !152, size: 8, align: 8, offset: 1600)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !66)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !117, file: !116, line: 237, baseType: !152, size: 8, align: 8, offset: 1608)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !117, file: !116, line: 238, baseType: !152, size: 8, align: 8, offset: 1616)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !117, file: !116, line: 239, baseType: !152, size: 8, align: 8, offset: 1624)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !117, file: !116, line: 240, baseType: !152, size: 8, align: 8, offset: 1632)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !117, file: !116, line: 241, baseType: !152, size: 8, align: 8, offset: 1640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !117, file: !116, line: 242, baseType: !152, size: 8, align: 8, offset: 1648)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !117, file: !116, line: 243, baseType: !152, size: 8, align: 8, offset: 1656)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !19, file: !1, line: 40, baseType: !161, size: 640, align: 64, offset: 2240)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 640, align: 64, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 5)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "index_encoder", scope: !19, file: !1, line: 45, baseType: !25, size: 512, align: 64, offset: 2880)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !19, file: !1, line: 48, baseType: !166, size: 64, align: 64, offset: 3392)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !168, line: 37, baseType: !169)
!168 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/index.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !168, line: 37, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pos", scope: !19, file: !1, line: 51, baseType: !55, size: 64, align: 64, offset: 3456)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !19, file: !1, line: 54, baseType: !55, size: 64, align: 64, offset: 3520)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !19, file: !1, line: 58, baseType: !173, size: 8192, align: 8, offset: 3584)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, align: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 1024)
!176 = !{!177, !178, !179, !180, !181, !182}
!177 = !DIEnumerator(name: "SEQ_STREAM_HEADER", value: 0)
!178 = !DIEnumerator(name: "SEQ_BLOCK_INIT", value: 1)
!179 = !DIEnumerator(name: "SEQ_BLOCK_HEADER", value: 2)
!180 = !DIEnumerator(name: "SEQ_BLOCK_ENCODE", value: 3)
!181 = !DIEnumerator(name: "SEQ_INDEX_ENCODE", value: 4)
!182 = !DIEnumerator(name: "SEQ_STREAM_FOOTER", value: 5)
!183 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !184, file: !26, line: 182, size: 32, align: 32, elements: !194)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !26, line: 174, size: 704, align: 64, elements: !185)
!185 = !{!186, !187, !188, !189, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !26, line: 176, baseType: !25, size: 512, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !184, file: !26, line: 189, baseType: !183, size: 32, align: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !184, file: !26, line: 194, baseType: !55, size: 64, align: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !184, file: !26, line: 197, baseType: !190, size: 32, align: 8, offset: 640)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, align: 8, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 4)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !184, file: !26, line: 201, baseType: !23, size: 8, align: 8, offset: 672)
!194 = !{!195, !196, !197, !198, !199, !200}
!195 = !DIEnumerator(name: "ISEQ_RUN", value: 0)
!196 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1)
!197 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2)
!198 = !DIEnumerator(name: "ISEQ_FINISH", value: 3)
!199 = !DIEnumerator(name: "ISEQ_END", value: 4)
!200 = !DIEnumerator(name: "ISEQ_ERROR", value: 5)
!201 = !{!39, !54, !127}
!202 = !{!203, !208, !235, !236, !239, !240}
!203 = distinct !DISubprogram(name: "lzma_stream_encoder_init", scope: !1, file: !1, line: 275, type: !204, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false, variables: !207)
!204 = !DISubroutineType(types: !205)
!205 = !{!45, !206, !46, !106, !87}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!207 = !{}
!208 = distinct !DISubprogram(name: "lzma_stream_encoder", scope: !1, file: !1, line: 327, type: !209, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, variables: !207)
!209 = !DISubroutineType(types: !210)
!210 = !{!45, !211, !106, !87}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !213, file: !4, line: 454, baseType: !63, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !213, file: !4, line: 455, baseType: !55, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !213, file: !4, line: 456, baseType: !35, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !213, file: !4, line: 458, baseType: !70, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !213, file: !4, line: 459, baseType: !55, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !213, file: !4, line: 460, baseType: !35, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !213, file: !4, line: 468, baseType: !46, size: 64, align: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !213, file: !4, line: 471, baseType: !223, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !184)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !213, file: !4, line: 479, baseType: !54, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !213, file: !4, line: 480, baseType: !54, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !213, file: !4, line: 481, baseType: !54, size: 64, align: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !213, file: !4, line: 482, baseType: !54, size: 64, align: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !213, file: !4, line: 483, baseType: !35, size: 64, align: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !213, file: !4, line: 484, baseType: !35, size: 64, align: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !213, file: !4, line: 485, baseType: !55, size: 64, align: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !213, file: !4, line: 486, baseType: !55, size: 64, align: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !213, file: !4, line: 487, baseType: !144, size: 32, align: 32, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !213, file: !4, line: 488, baseType: !144, size: 32, align: 32, offset: 1056)
!235 = distinct !DISubprogram(name: "stream_encode", scope: !1, file: !1, line: 82, type: !43, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, variables: !207)
!236 = distinct !DISubprogram(name: "block_encoder_init", scope: !1, file: !1, line: 63, type: !237, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, variables: !207)
!237 = !DISubroutineType(types: !238)
!238 = !{!45, !30, !46}
!239 = distinct !DISubprogram(name: "stream_encoder_end", scope: !1, file: !1, line: 215, type: !81, isLocal: true, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: false, variables: !207)
!240 = distinct !DISubprogram(name: "stream_encoder_update", scope: !1, file: !1, line: 232, type: !104, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, variables: !207)
!241 = !{!242, !245}
!242 = !DIGlobalVariable(name: "convert", scope: !235, file: !1, line: 152, type: !243, isLocal: true, isDefinition: true, variable: [4 x i32]* @stream_encode.convert)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, align: 32, elements: !191)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!245 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !26, line: 159, type: !246, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!247 = !{i32 2, !"Dwarf Version", i32 4}
!248 = !{i32 2, !"Debug Info Version", i32 3}
!249 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!250 = !DILocalVariable(name: "next", arg: 1, scope: !203, file: !1, line: 275, type: !206)
!251 = !DIExpression()
!252 = !DILocation(line: 275, column: 43, scope: !203)
!253 = !DILocalVariable(name: "allocator", arg: 2, scope: !203, file: !1, line: 275, type: !46)
!254 = !DILocation(line: 275, column: 65, scope: !203)
!255 = !DILocalVariable(name: "filters", arg: 3, scope: !203, file: !1, line: 276, type: !106)
!256 = !DILocation(line: 276, column: 22, scope: !203)
!257 = !DILocalVariable(name: "check", arg: 4, scope: !203, file: !1, line: 276, type: !87)
!258 = !DILocation(line: 276, column: 42, scope: !203)
!259 = !DILocalVariable(name: "stream_flags", scope: !203, file: !1, line: 278, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !261, line: 105, baseType: !262)
!261 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/stream_flags.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!262 = !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 33, size: 448, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !262, file: !261, line: 51, baseType: !120, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !262, file: !261, line: 69, baseType: !33, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !262, file: !261, line: 79, baseType: !87, size: 32, align: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !262, file: !261, line: 90, baseType: !144, size: 32, align: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !262, file: !261, line: 91, baseType: !144, size: 32, align: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !262, file: !261, line: 92, baseType: !144, size: 32, align: 32, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !262, file: !261, line: 93, baseType: !144, size: 32, align: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !262, file: !261, line: 94, baseType: !152, size: 8, align: 8, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !262, file: !261, line: 95, baseType: !152, size: 8, align: 8, offset: 296)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !262, file: !261, line: 96, baseType: !152, size: 8, align: 8, offset: 304)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !262, file: !261, line: 97, baseType: !152, size: 8, align: 8, offset: 312)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !262, file: !261, line: 98, baseType: !152, size: 8, align: 8, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !262, file: !261, line: 99, baseType: !152, size: 8, align: 8, offset: 328)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !262, file: !261, line: 100, baseType: !152, size: 8, align: 8, offset: 336)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !262, file: !261, line: 101, baseType: !152, size: 8, align: 8, offset: 344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !262, file: !261, line: 102, baseType: !120, size: 32, align: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !262, file: !261, line: 103, baseType: !120, size: 32, align: 32, offset: 384)
!281 = !DILocation(line: 278, column: 20, scope: !203)
!282 = !DILocation(line: 278, column: 35, scope: !203)
!283 = !DILocation(line: 278, column: 43, scope: !203)
!284 = !DILocation(line: 280, column: 2, scope: !203)
!285 = !DILocation(line: 280, column: 2, scope: !286)
!286 = !DILexicalBlockFile(scope: !287, file: !1, discriminator: 1)
!287 = distinct !DILexicalBlock(scope: !288, file: !1, line: 280, column: 2)
!288 = distinct !DILexicalBlock(scope: !203, file: !1, line: 280, column: 2)
!289 = !DILocation(line: 280, column: 2, scope: !290)
!290 = !DILexicalBlockFile(scope: !287, file: !1, discriminator: 2)
!291 = !DILocation(line: 280, column: 2, scope: !292)
!292 = !DILexicalBlockFile(scope: !288, file: !1, discriminator: 3)
!293 = !DILocation(line: 282, column: 6, scope: !294)
!294 = distinct !DILexicalBlock(scope: !203, file: !1, line: 282, column: 6)
!295 = !DILocation(line: 282, column: 14, scope: !294)
!296 = !DILocation(line: 282, column: 6, scope: !203)
!297 = !DILocation(line: 283, column: 3, scope: !294)
!298 = !DILocation(line: 285, column: 6, scope: !299)
!299 = distinct !DILexicalBlock(scope: !203, file: !1, line: 285, column: 6)
!300 = !DILocation(line: 285, column: 12, scope: !299)
!301 = !DILocation(line: 285, column: 18, scope: !299)
!302 = !DILocation(line: 285, column: 6, scope: !203)
!303 = !DILocation(line: 286, column: 48, scope: !304)
!304 = distinct !DILexicalBlock(scope: !299, file: !1, line: 285, column: 27)
!305 = !DILocation(line: 286, column: 17, scope: !304)
!306 = !DILocation(line: 286, column: 3, scope: !304)
!307 = !DILocation(line: 286, column: 9, scope: !304)
!308 = !DILocation(line: 286, column: 15, scope: !304)
!309 = !DILocation(line: 287, column: 7, scope: !310)
!310 = distinct !DILexicalBlock(scope: !304, file: !1, line: 287, column: 7)
!311 = !DILocation(line: 287, column: 13, scope: !310)
!312 = !DILocation(line: 287, column: 19, scope: !310)
!313 = !DILocation(line: 287, column: 7, scope: !304)
!314 = !DILocation(line: 288, column: 4, scope: !310)
!315 = !DILocation(line: 290, column: 3, scope: !304)
!316 = !DILocation(line: 290, column: 9, scope: !304)
!317 = !DILocation(line: 290, column: 14, scope: !304)
!318 = !DILocation(line: 291, column: 3, scope: !304)
!319 = !DILocation(line: 291, column: 9, scope: !304)
!320 = !DILocation(line: 291, column: 13, scope: !304)
!321 = !DILocation(line: 292, column: 3, scope: !304)
!322 = !DILocation(line: 292, column: 9, scope: !304)
!323 = !DILocation(line: 292, column: 16, scope: !304)
!324 = !DILocation(line: 294, column: 3, scope: !304)
!325 = !DILocation(line: 294, column: 9, scope: !304)
!326 = !DILocation(line: 294, column: 16, scope: !304)
!327 = !DILocation(line: 294, column: 27, scope: !304)
!328 = !DILocation(line: 294, column: 30, scope: !304)
!329 = !DILocation(line: 295, column: 3, scope: !304)
!330 = !DILocation(line: 295, column: 9, scope: !304)
!331 = !DILocation(line: 295, column: 16, scope: !304)
!332 = !DILocation(line: 295, column: 32, scope: !304)
!333 = !DILocation(line: 296, column: 3, scope: !304)
!334 = !DILocation(line: 296, column: 9, scope: !304)
!335 = !DILocation(line: 296, column: 16, scope: !304)
!336 = !DILocation(line: 296, column: 32, scope: !304)
!337 = !DILocation(line: 297, column: 3, scope: !304)
!338 = !DILocation(line: 297, column: 9, scope: !304)
!339 = !DILocation(line: 297, column: 16, scope: !304)
!340 = !DILocation(line: 297, column: 22, scope: !304)
!341 = !DILocation(line: 298, column: 2, scope: !304)
!342 = !DILocation(line: 301, column: 2, scope: !203)
!343 = !DILocation(line: 301, column: 8, scope: !203)
!344 = !DILocation(line: 301, column: 15, scope: !203)
!345 = !DILocation(line: 301, column: 24, scope: !203)
!346 = !DILocation(line: 302, column: 2, scope: !203)
!347 = !DILocation(line: 302, column: 8, scope: !203)
