; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_buffer_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }

@LZMA_NEXT_CODER_INIT = internal constant %struct.lzma_next_coder_s { %struct.lzma_coder_s* null, i64 -1, i64 0, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)* null, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)* null, i32 (%struct.lzma_coder_s*)* null, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)* null, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* null }, align 8
@.str = private unnamed_addr constant [43 x i8] c"*in_pos == in_size || *out_pos == out_size\00", align 1
@.str.1 = private unnamed_addr constant [93 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_buffer_decoder.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !33, globals: !66)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_buffer_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !{!34}
!34 = distinct !DISubprogram(name: "lzma_stream_buffer_decode", scope: !1, file: !1, line: 17, type: !35, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, variables: !65)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !42, !44, !59, !63, !52, !64, !63, !52}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 55, baseType: !41)
!40 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!41 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !40, line: 51, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !47)
!47 = !{!48, !54, !58}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !46, file: !4, line: 376, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!32, !32, !52, !52}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 62, baseType: !41)
!53 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !46, file: !4, line: 390, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !32, !32}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !46, file: !4, line: 401, baseType: !32, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !40, line: 48, baseType: !62)
!62 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!65 = !{}
!66 = !{!67}
!67 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !68, line: 159, type: !69, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!68 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !68, line: 75, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !68, line: 119, size: 512, align: 64, elements: !72)
!72 = !{!73, !77, !80, !82, !91, !96, !103, !107}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !71, file: !68, line: 121, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !68, line: 73, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !68, line: 73, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !71, file: !68, line: 125, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !79, line: 63, baseType: !39)
!79 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !71, file: !68, line: 131, baseType: !81, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !40, line: 122, baseType: !41)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !71, file: !68, line: 134, baseType: !83, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !68, line: 89, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!37, !74, !44, !87, !88, !52, !89, !88, !52, !90}
!87 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!88 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !71, file: !68, line: 139, baseType: !92, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !68, line: 97, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !74, !44}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !71, file: !68, line: 143, baseType: !97, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !71, file: !68, line: 147, baseType: !104, size: 64, align: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!37, !74, !38, !38, !39}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !71, file: !68, line: 152, baseType: !108, size: 64, align: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!37, !74, !44, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !114, line: 65, baseType: !115)
!114 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 43, size: 128, align: 64, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !115, file: !114, line: 54, baseType: !78, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !115, file: !114, line: 63, baseType: !32, size: 64, align: 64, offset: 64)
!119 = !{i32 2, !"Dwarf Version", i32 4}
!120 = !{i32 2, !"Debug Info Version", i32 3}
!121 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!122 = !DILocalVariable(name: "memlimit", arg: 1, scope: !34, file: !1, line: 17, type: !38)
!123 = !DIExpression()
!124 = !DILocation(line: 17, column: 37, scope: !34)
!125 = !DILocalVariable(name: "flags", arg: 2, scope: !34, file: !1, line: 17, type: !42)
!126 = !DILocation(line: 17, column: 56, scope: !34)
!127 = !DILocalVariable(name: "allocator", arg: 3, scope: !34, file: !1, line: 18, type: !44)
!128 = !DILocation(line: 18, column: 19, scope: !34)
!129 = !DILocalVariable(name: "in", arg: 4, scope: !34, file: !1, line: 19, type: !59)
!130 = !DILocation(line: 19, column: 18, scope: !34)
!131 = !DILocalVariable(name: "in_pos", arg: 5, scope: !34, file: !1, line: 19, type: !63)
!132 = !DILocation(line: 19, column: 30, scope: !34)
!133 = !DILocalVariable(name: "in_size", arg: 6, scope: !34, file: !1, line: 19, type: !52)
!134 = !DILocation(line: 19, column: 45, scope: !34)
!135 = !DILocalVariable(name: "out", arg: 7, scope: !34, file: !1, line: 20, type: !64)
!136 = !DILocation(line: 20, column: 12, scope: !34)
!137 = !DILocalVariable(name: "out_pos", arg: 8, scope: !34, file: !1, line: 20, type: !63)
!138 = !DILocation(line: 20, column: 25, scope: !34)
!139 = !DILocalVariable(name: "out_size", arg: 9, scope: !34, file: !1, line: 20, type: !52)
!140 = !DILocation(line: 20, column: 41, scope: !34)
!141 = !DILocalVariable(name: "stream_decoder", scope: !34, file: !1, line: 22, type: !70)
!142 = !DILocation(line: 22, column: 18, scope: !34)
!143 = !DILocation(line: 22, column: 35, scope: !34)
!144 = !DILocalVariable(name: "ret", scope: !34, file: !1, line: 23, type: !37)
!145 = !DILocation(line: 23, column: 11, scope: !34)
!146 = !DILocation(line: 26, column: 6, scope: !147)
!147 = distinct !DILexicalBlock(scope: !34, file: !1, line: 26, column: 6)
!148 = !DILocation(line: 26, column: 13, scope: !147)
!149 = !DILocation(line: 26, column: 21, scope: !147)
!150 = !DILocation(line: 26, column: 25, scope: !151)
!151 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 1)
!152 = !DILocation(line: 26, column: 28, scope: !151)
!153 = !DILocation(line: 26, column: 36, scope: !151)
!154 = !DILocation(line: 26, column: 40, scope: !155)
!155 = !DILexicalBlockFile(scope: !147, file: !1, discriminator: 2)
!156 = !DILocation(line: 26, column: 39, scope: !155)
!157 = !DILocation(line: 26, column: 50, scope: !155)
!158 = !DILocation(line: 26, column: 47, scope: !155)
!159 = !DILocation(line: 27, column: 4, scope: !147)
!160 = !DILocation(line: 27, column: 8, scope: !151)
!161 = !DILocation(line: 27, column: 7, scope: !151)
!162 = !DILocation(line: 27, column: 17, scope: !151)
!163 = !DILocation(line: 27, column: 15, scope: !151)
!164 = !DILocation(line: 27, column: 25, scope: !151)
!165 = !DILocation(line: 27, column: 28, scope: !155)
!166 = !DILocation(line: 27, column: 36, scope: !155)
!167 = !DILocation(line: 28, column: 4, scope: !147)
!168 = !DILocation(line: 28, column: 8, scope: !151)
!169 = !DILocation(line: 28, column: 12, scope: !151)
!170 = !DILocation(line: 28, column: 20, scope: !151)
!171 = !DILocation(line: 28, column: 24, scope: !155)
!172 = !DILocation(line: 28, column: 23, scope: !155)
!173 = !DILocation(line: 28, column: 35, scope: !155)
!174 = !DILocation(line: 28, column: 32, scope: !155)
!175 = !DILocation(line: 29, column: 4, scope: !147)
!176 = !DILocation(line: 29, column: 8, scope: !151)
!177 = !DILocation(line: 29, column: 7, scope: !151)
!178 = !DILocation(line: 29, column: 18, scope: !151)
!179 = !DILocation(line: 29, column: 16, scope: !151)
!180 = !DILocation(line: 26, column: 6, scope: !181)
!181 = !DILexicalBlockFile(scope: !34, file: !1, discriminator: 3)
!182 = !DILocation(line: 30, column: 3, scope: !147)
