; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_buffer_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_index_s = type opaque

; Function Attrs: nounwind uwtable
define i64 @lzma_stream_buffer_bound(i64 %uncompressed_size) #0 !dbg !32 {
entry:
  %retval = alloca i64, align 8
  %uncompressed_size.addr = alloca i64, align 8
  %block_bound = alloca i64, align 8
  store i64 %uncompressed_size, i64* %uncompressed_size.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %uncompressed_size.addr, metadata !77, metadata !78), !dbg !79
  call void @llvm.dbg.declare(metadata i64* %block_bound, metadata !80, metadata !78), !dbg !82
  %0 = load i64, i64* %uncompressed_size.addr, align 8, !dbg !83
  %call = call i64 @lzma_block_buffer_bound(i64 %0) #6, !dbg !84
  store i64 %call, i64* %block_bound, align 8, !dbg !82
  %1 = load i64, i64* %block_bound, align 8, !dbg !85
  %cmp = icmp eq i64 %1, 0, !dbg !87

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !28, subprograms: !31)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/stream_buffer_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 27, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!22 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!24 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !{!32, !39}
!32 = distinct !DISubprogram(name: "lzma_stream_buffer_bound", scope: !1, file: !1, line: 26, type: !33, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, variables: !38)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 62, baseType: !37)
!36 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!37 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!38 = !{}
!39 = distinct !DISubprogram(name: "lzma_stream_buffer_encode", scope: !1, file: !1, line: 44, type: !40, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, variables: !38)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !54, !55, !68, !35, !72, !73, !35}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !45, line: 65, baseType: !46)
!45 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 43, size: 128, align: 64, elements: !47)
!47 = !{!48, !53}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !46, file: !45, line: 54, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !50, line: 63, baseType: !51)
!50 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !52, line: 55, baseType: !37)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !46, file: !45, line: 63, baseType: !29, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !19, line: 55, baseType: !18)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !58)
!58 = !{!59, !63, !67}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !57, file: !4, line: 376, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!29, !29, !35, !35}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !57, file: !4, line: 390, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !29, !29}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !57, file: !4, line: 401, baseType: !29, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !52, line: 48, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!74 = !{i32 2, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!77 = !DILocalVariable(name: "uncompressed_size", arg: 1, scope: !32, file: !1, line: 26, type: !35)
!78 = !DIExpression()
!79 = !DILocation(line: 26, column: 33, scope: !32)
!80 = !DILocalVariable(name: "block_bound", scope: !32, file: !1, line: 29, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!82 = !DILocation(line: 29, column: 15, scope: !32)
!83 = !DILocation(line: 29, column: 53, scope: !32)
!84 = !DILocation(line: 29, column: 29, scope: !32)
!85 = !DILocation(line: 30, column: 6, scope: !86)
!86 = distinct !DILexicalBlock(scope: !32, file: !1, line: 30, column: 6)
!87 = !DILocation(line: 30, column: 18, scope: !86)
!88 = !DILocation(line: 30, column: 6, scope: !32)
!89 = !DILocation(line: 31, column: 3, scope: !86)
!90 = !DILocation(line: 36, column: 39, scope: !91)
!91 = distinct !DILexicalBlock(scope: !32, file: !1, line: 36, column: 6)
!92 = !DILocation(line: 36, column: 37, scope: !91)
!93 = !DILocation(line: 36, column: 51, scope: !91)
!94 = !DILocation(line: 36, column: 6, scope: !32)
!95 = !DILocation(line: 37, column: 3, scope: !91)
!96 = !DILocation(line: 39, column: 9, scope: !32)
!97 = !DILocation(line: 39, column: 21, scope: !32)
!98 = !DILocation(line: 39, column: 2, scope: !32)
!99 = !DILocation(line: 40, column: 1, scope: !32)
!100 = !DILocalVariable(name: "filters", arg: 1, scope: !39, file: !1, line: 44, type: !43)
!101 = !DILocation(line: 44, column: 40, scope: !39)
!102 = !DILocalVariable(name: "check", arg: 2, scope: !39, file: !1, line: 44, type: !54)
!103 = !DILocation(line: 44, column: 60, scope: !39)
!104 = !DILocalVariable(name: "allocator", arg: 3, scope: !39, file: !1, line: 45, type: !55)
!105 = !DILocation(line: 45, column: 19, scope: !39)
!106 = !DILocalVariable(name: "in", arg: 4, scope: !39, file: !1, line: 45, type: !68)
!107 = !DILocation(line: 45, column: 45, scope: !39)
!108 = !DILocalVariable(name: "in_size", arg: 5, scope: !39, file: !1, line: 45, type: !35)
!109 = !DILocation(line: 45, column: 56, scope: !39)
!110 = !DILocalVariable(name: "out", arg: 6, scope: !39, file: !1, line: 46, type: !72)
!111 = !DILocation(line: 46, column: 12, scope: !39)
!112 = !DILocalVariable(name: "out_pos_ptr", arg: 7, scope: !39, file: !1, line: 46, type: !73)
!113 = !DILocation(line: 46, column: 25, scope: !39)
!114 = !DILocalVariable(name: "out_size", arg: 8, scope: !39, file: !1, line: 46, type: !35)
!115 = !DILocation(line: 46, column: 45, scope: !39)
!116 = !DILocalVariable(name: "stream_flags", scope: !39, file: !1, line: 48, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !118, line: 105, baseType: !119)
!118 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/stream_flags.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 33, size: 448, align: 64, elements: !120)
!120 = !{!121, !123, !124, !125, !127, !128, !129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !119, file: !118, line: 51, baseType: !122, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !52, line: 51, baseType: !30)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !119, file: !118, line: 69, baseType: !49, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !119, file: !118, line: 79, baseType: !54, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !119, file: !118, line: 90, baseType: !126, size: 32, align: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !25)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !119, file: !118, line: 91, baseType: !126, size: 32, align: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !119, file: !118, line: 92, baseType: !126, size: 32, align: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !119, file: !118, line: 93, baseType: !126, size: 32, align: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !119, file: !118, line: 94, baseType: !131, size: 8, align: 8, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !71)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !119, file: !118, line: 95, baseType: !131, size: 8, align: 8, offset: 296)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !119, file: !118, line: 96, baseType: !131, size: 8, align: 8, offset: 304)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !119, file: !118, line: 97, baseType: !131, size: 8, align: 8, offset: 312)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !119, file: !118, line: 98, baseType: !131, size: 8, align: 8, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !119, file: !118, line: 99, baseType: !131, size: 8, align: 8, offset: 328)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !119, file: !118, line: 100, baseType: !131, size: 8, align: 8, offset: 336)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !119, file: !118, line: 101, baseType: !131, size: 8, align: 8, offset: 344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !119, file: !118, line: 102, baseType: !122, size: 32, align: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !119, file: !118, line: 103, baseType: !122, size: 32, align: 32, offset: 384)
!141 = !DILocation(line: 48, column: 20, scope: !39)
!142 = !DILocalVariable(name: "block", scope: !39, file: !1, line: 49, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !144, line: 245, baseType: !145)
!144 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/block.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!145 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 30, size: 1664, align: 64, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !145, file: !144, line: 47, baseType: !122, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !145, file: !144, line: 67, baseType: !122, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !145, file: !144, line: 88, baseType: !54, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !145, file: !144, line: 143, baseType: !49, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !145, file: !144, line: 167, baseType: !49, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !145, file: !144, line: 195, baseType: !43, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !145, file: !144, line: 212, baseType: !154, size: 512, align: 8, offset: 320)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !145, file: !144, line: 221, baseType: !29, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !145, file: !144, line: 222, baseType: !29, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !145, file: !144, line: 223, baseType: !29, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !145, file: !144, line: 224, baseType: !122, size: 32, align: 32, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !145, file: !144, line: 225, baseType: !122, size: 32, align: 32, offset: 1056)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !145, file: !144, line: 226, baseType: !49, size: 64, align: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !145, file: !144, line: 227, baseType: !49, size: 64, align: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !145, file: !144, line: 228, baseType: !49, size: 64, align: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !145, file: !144, line: 229, baseType: !49, size: 64, align: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !145, file: !144, line: 230, baseType: !49, size: 64, align: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !145, file: !144, line: 231, baseType: !49, size: 64, align: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !145, file: !144, line: 232, baseType: !126, size: 32, align: 32, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !145, file: !144, line: 233, baseType: !126, size: 32, align: 32, offset: 1504)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !145, file: !144, line: 234, baseType: !126, size: 32, align: 32, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !145, file: !144, line: 235, baseType: !126, size: 32, align: 32, offset: 1568)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !145, file: !144, line: 236, baseType: !131, size: 8, align: 8, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !145, file: !144, line: 237, baseType: !131, size: 8, align: 8, offset: 1608)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !145, file: !144, line: 238, baseType: !131, size: 8, align: 8, offset: 1616)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !145, file: !144, line: 239, baseType: !131, size: 8, align: 8, offset: 1624)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !145, file: !144, line: 240, baseType: !131, size: 8, align: 8, offset: 1632)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !145, file: !144, line: 241, baseType: !131, size: 8, align: 8, offset: 1640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !145, file: !144, line: 242, baseType: !131, size: 8, align: 8, offset: 1648)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !145, file: !144, line: 243, baseType: !131, size: 8, align: 8, offset: 1656)
!180 = !DILocation(line: 49, column: 13, scope: !39)
!181 = !DILocalVariable(name: "out_pos", scope: !39, file: !1, line: 50, type: !35)
!182 = !DILocation(line: 50, column: 9, scope: !39)
!183 = !DILocation(line: 53, column: 6, scope: !184)
!184 = distinct !DILexicalBlock(scope: !39, file: !1, line: 53, column: 6)
!185 = !DILocation(line: 53, column: 14, scope: !184)
!186 = !DILocation(line: 53, column: 22, scope: !184)
!187 = !DILocation(line: 53, column: 40, scope: !188)
!188 = !DILexicalBlockFile(scope: !184, file: !1, discriminator: 1)
!189 = !DILocation(line: 53, column: 47, scope: !188)
!190 = !DILocation(line: 54, column: 4, scope: !184)
!191 = !DILocation(line: 54, column: 8, scope: !188)
!192 = !DILocation(line: 54, column: 11, scope: !188)
!193 = !DILocation(line: 54, column: 19, scope: !188)
!194 = !DILocation(line: 54, column: 22, scope: !195)
!195 = !DILexicalBlockFile(scope: !184, file: !1, discriminator: 2)
!196 = !DILocation(line: 54, column: 30, scope: !195)
!197 = !DILocation(line: 54, column: 36, scope: !195)
!198 = !DILocation(line: 54, column: 39, scope: !199)
!199 = !DILexicalBlockFile(scope: !184, file: !1, discriminator: 3)
!200 = !DILocation(line: 54, column: 43, scope: !199)
!201 = !DILocation(line: 55, column: 4, scope: !184)
!202 = !DILocation(line: 55, column: 7, scope: !188)
!203 = !DILocation(line: 55, column: 19, scope: !188)
!204 = !DILocation(line: 55, column: 27, scope: !188)
!205 = !DILocation(line: 55, column: 31, scope: !195)
!206 = !DILocation(line: 55, column: 30, scope: !195)
!207 = !DILocation(line: 55, column: 45, scope: !195)
!208 = !DILocation(line: 55, column: 43, scope: !195)
!209 = !DILocation(line: 53, column: 6, scope: !210)
!210 = !DILexicalBlockFile(scope: !39, file: !1, discriminator: 2)
!211 = !DILocation(line: 56, column: 3, scope: !184)
!212 = !DILocation(line: 58, column: 31, scope: !213)
!213 = distinct !DILexicalBlock(scope: !39, file: !1, line: 58, column: 6)
!214 = !DILocation(line: 58, column: 7, scope: !213)
!215 = !DILocation(line: 58, column: 6, scope: !39)
!216 = !DILocation(line: 59, column: 3, scope: !213)
!217 = !DILocation(line: 68, column: 13, scope: !39)
!218 = !DILocation(line: 68, column: 12, scope: !39)
!219 = !DILocation(line: 68, column: 10, scope: !39)
!220 = !DILocation(line: 72, column: 6, scope: !221)
!221 = distinct !DILexicalBlock(scope: !39, file: !1, line: 72, column: 6)
!222 = !DILocation(line: 72, column: 17, scope: !221)
!223 = !DILocation(line: 72, column: 15, scope: !221)
!224 = !DILocation(line: 72, column: 25, scope: !221)
!225 = !DILocation(line: 72, column: 6, scope: !39)
!226 = !DILocation(line: 73, column: 3, scope: !221)
!227 = !DILocation(line: 77, column: 11, scope: !39)
!228 = !DILocation(line: 80, column: 23, scope: !39)
!229 = !DILocation(line: 80, column: 15, scope: !39)
!230 = !DILocation(line: 80, column: 21, scope: !39)
!231 = !DILocation(line: 82, column: 47, scope: !232)
!232 = distinct !DILexicalBlock(scope: !39, file: !1, line: 82, column: 6)
!233 = !DILocation(line: 82, column: 53, scope: !232)
!234 = !DILocation(line: 82, column: 51, scope: !232)
!235 = !DILocation(line: 82, column: 6, scope: !232)
!236 = !DILocation(line: 83, column: 4, scope: !232)
!237 = !DILocation(line: 82, column: 6, scope: !39)
!238 = !DILocation(line: 84, column: 3, scope: !232)
!239 = !DILocation(line: 86, column: 10, scope: !39)
!240 = !DILocation(line: 89, column: 16, scope: !39)
!241 = !DILocation(line: 89, column: 8, scope: !39)
!242 = !DILocation(line: 89, column: 14, scope: !39)
!243 = !DILocation(line: 90, column: 18, scope: !39)
!244 = !DILocation(line: 90, column: 8, scope: !39)
!245 = !DILocation(line: 90, column: 16, scope: !39)
!246 = !DILocation(line: 92, column: 6, scope: !247)
!247 = distinct !DILexicalBlock(scope: !39, file: !1, line: 92, column: 6)
!248 = !DILocation(line: 92, column: 14, scope: !247)
