; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_sparse.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_entry = type { %struct.archive*, i8*, i32, %struct.aest, i32, %struct.archive_mstring, i64, i64, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, i8, i8*, i64, %struct.archive_acl, %struct.ae_xattr*, %struct.ae_xattr*, %struct.ae_sparse*, %struct.ae_sparse*, %struct.ae_sparse*, [12 x i8] }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_sparse.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "ae_sparse", file: !7, line: 46, size: 192, align: 64, elements: !8)
!7 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!8 = !{!9, !10, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !6, file: !7, line: 47, baseType: !5, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !6, file: !7, line: 49, baseType: !11, size: 64, align: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !12, line: 40, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !6, file: !7, line: 50, baseType: !11, size: 64, align: 64, offset: 128)
!15 = !{!16, !214, !217, !220, !221}
!16 = distinct !DISubprogram(name: "archive_entry_sparse_clear", scope: !1, file: !1, line: 40, type: !17, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !7, line: 73, size: 8640, align: 64, elements: !21)
!21 = !{!22, !118, !119, !120, !149, !150, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !198, !206, !207, !208, !209, !210}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !20, file: !7, line: 74, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !25, line: 89, size: 1280, align: 64, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!26 = !{!27, !29, !30, !91, !92, !93, !94, !95, !96, !97, !98, !106, !107, !108, !109, !112, !113, !114, !115, !116, !117}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !24, file: !25, line: 96, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !24, file: !25, line: 97, baseType: !28, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !24, file: !25, line: 103, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !25, line: 63, size: 832, align: 64, elements: !33)
!33 = !{!34, !39, !40, !44, !45, !58, !62, !67, !68, !75, !76, !80, !84}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !32, file: !25, line: 64, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !23}
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !32, file: !25, line: 65, baseType: !35, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !32, file: !25, line: 66, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!38, !23, !19}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !32, file: !25, line: 68, baseType: !35, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !32, file: !25, line: 69, baseType: !46, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !23, !53, !55}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !50, line: 102, baseType: !51)
!50 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !52, line: 172, baseType: !13)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 62, baseType: !57)
!56 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!57 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !32, file: !25, line: 71, baseType: !59, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!49, !23, !53, !55, !11}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !32, file: !25, line: 74, baseType: !63, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!38, !23, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !32, file: !25, line: 76, baseType: !41, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !32, file: !25, line: 78, baseType: !69, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!38, !23, !72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !32, file: !25, line: 81, baseType: !35, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !32, file: !25, line: 82, baseType: !77, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!11, !23, !38}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !32, file: !25, line: 83, baseType: !81, size: 64, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!38, !23, !38}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !32, file: !25, line: 84, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !23, !38}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !24, file: !25, line: 105, baseType: !38, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !24, file: !25, line: 106, baseType: !88, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !24, file: !25, line: 108, baseType: !38, size: 32, align: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !24, file: !25, line: 109, baseType: !88, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !24, file: !25, line: 112, baseType: !38, size: 32, align: 32, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !24, file: !25, line: 114, baseType: !38, size: 32, align: 32, offset: 416)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !24, file: !25, line: 115, baseType: !88, size: 64, align: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !24, file: !25, line: 116, baseType: !99, size: 192, align: 64, offset: 512)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !100, line: 58, size: 192, align: 64, elements: !101)
!100 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!101 = !{!102, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !99, file: !100, line: 59, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !99, file: !100, line: 60, baseType: !55, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !99, file: !100, line: 61, baseType: !55, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !24, file: !25, line: 118, baseType: !103, size: 64, align: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !24, file: !25, line: 119, baseType: !28, size: 32, align: 32, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !24, file: !25, line: 120, baseType: !28, size: 32, align: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !24, file: !25, line: 121, baseType: !110, size: 64, align: 64, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !100, line: 70, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !24, file: !25, line: 127, baseType: !88, size: 64, align: 64, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !24, file: !25, line: 128, baseType: !11, size: 64, align: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !24, file: !25, line: 129, baseType: !11, size: 64, align: 64, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !24, file: !25, line: 130, baseType: !55, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !24, file: !25, line: 137, baseType: !90, size: 8, align: 8, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !24, file: !25, line: 138, baseType: !55, size: 64, align: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !20, file: !7, line: 96, baseType: !4, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stat_valid", scope: !20, file: !7, line: 97, baseType: !38, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ae_stat", scope: !20, file: !7, line: 129, baseType: !121, size: 1344, align: 64, offset: 192)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "aest", file: !7, line: 99, size: 1344, align: 64, elements: !122)
!122 = !{!123, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !137, !138, !139, !143, !144, !145, !146, !147, !148}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aest_atime", scope: !121, file: !7, line: 100, baseType: !11, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "aest_atime_nsec", scope: !121, file: !7, line: 101, baseType: !125, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 51, baseType: !28)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ctime", scope: !121, file: !7, line: 102, baseType: !11, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ctime_nsec", scope: !121, file: !7, line: 103, baseType: !125, size: 32, align: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "aest_mtime", scope: !121, file: !7, line: 104, baseType: !11, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aest_mtime_nsec", scope: !121, file: !7, line: 105, baseType: !125, size: 32, align: 32, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "aest_birthtime", scope: !121, file: !7, line: 106, baseType: !11, size: 64, align: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "aest_birthtime_nsec", scope: !121, file: !7, line: 107, baseType: !125, size: 32, align: 32, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "aest_gid", scope: !121, file: !7, line: 108, baseType: !11, size: 64, align: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ino", scope: !121, file: !7, line: 109, baseType: !11, size: 64, align: 64, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "aest_nlink", scope: !121, file: !7, line: 110, baseType: !125, size: 32, align: 32, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "aest_size", scope: !121, file: !7, line: 111, baseType: !136, size: 64, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 55, baseType: !57)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "aest_uid", scope: !121, file: !7, line: 112, baseType: !11, size: 64, align: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "aest_dev_is_broken_down", scope: !121, file: !7, line: 121, baseType: !38, size: 32, align: 32, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "aest_dev", scope: !121, file: !7, line: 122, baseType: !140, size: 64, align: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !141, line: 44, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !52, line: 124, baseType: !57)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "aest_devmajor", scope: !121, file: !7, line: 123, baseType: !140, size: 64, align: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "aest_devminor", scope: !121, file: !7, line: 124, baseType: !140, size: 64, align: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdev_is_broken_down", scope: !121, file: !7, line: 125, baseType: !38, size: 32, align: 32, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdev", scope: !121, file: !7, line: 126, baseType: !140, size: 64, align: 64, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdevmajor", scope: !121, file: !7, line: 127, baseType: !140, size: 64, align: 64, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdevminor", scope: !121, file: !7, line: 128, baseType: !140, size: 64, align: 64, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ae_set", scope: !20, file: !7, line: 131, baseType: !38, size: 32, align: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_text", scope: !20, file: !7, line: 145, baseType: !151, size: 832, align: 64, offset: 1600)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_mstring", file: !100, line: 209, size: 832, align: 64, elements: !152)
!152 = !{!153, !154, !155, !163, !164}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs", scope: !151, file: !100, line: 210, baseType: !99, size: 192, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aes_utf8", scope: !151, file: !100, line: 211, baseType: !99, size: 192, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "aes_wcs", scope: !151, file: !100, line: 212, baseType: !156, size: 192, align: 64, offset: 384)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_wstring", file: !100, line: 64, size: 192, align: 64, elements: !157)
!157 = !{!158, !161, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !156, file: !100, line: 65, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !56, line: 90, baseType: !38)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !156, file: !100, line: 66, baseType: !55, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !156, file: !100, line: 67, baseType: !55, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs_in_locale", scope: !151, file: !100, line: 213, baseType: !99, size: 192, align: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "aes_set", scope: !151, file: !100, line: 218, baseType: !38, size: 32, align: 32, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_set", scope: !20, file: !7, line: 146, baseType: !57, size: 64, align: 64, offset: 2432)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_clear", scope: !20, file: !7, line: 147, baseType: !57, size: 64, align: 64, offset: 2496)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ae_gname", scope: !20, file: !7, line: 148, baseType: !151, size: 832, align: 64, offset: 2560)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ae_hardlink", scope: !20, file: !7, line: 149, baseType: !151, size: 832, align: 64, offset: 3392)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ae_pathname", scope: !20, file: !7, line: 150, baseType: !151, size: 832, align: 64, offset: 4224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ae_symlink", scope: !20, file: !7, line: 151, baseType: !151, size: 832, align: 64, offset: 5056)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ae_uname", scope: !20, file: !7, line: 152, baseType: !151, size: 832, align: 64, offset: 5888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ae_sourcepath", scope: !20, file: !7, line: 155, baseType: !151, size: 832, align: 64, offset: 6720)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "encryption", scope: !20, file: !7, line: 160, baseType: !90, size: 8, align: 8, offset: 7552)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata", scope: !20, file: !7, line: 162, baseType: !4, size: 64, align: 64, offset: 7616)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata_size", scope: !20, file: !7, line: 163, baseType: !55, size: 64, align: 64, offset: 7680)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !20, file: !7, line: 166, baseType: !177, size: 448, align: 64, offset: 7744)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl", file: !178, line: 46, size: 448, align: 64, elements: !179)
!178 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_acl_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!179 = !{!180, !183, !193, !194, !195, !196, !197}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !177, file: !178, line: 47, baseType: !181, size: 32, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !141, line: 63, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !52, line: 129, baseType: !28)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "acl_head", scope: !177, file: !178, line: 48, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl_entry", file: !178, line: 37, size: 1024, align: 64, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !178, line: 38, baseType: !184, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !178, line: 39, baseType: !38, size: 32, align: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !185, file: !178, line: 40, baseType: !38, size: 32, align: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "permset", scope: !185, file: !178, line: 41, baseType: !38, size: 32, align: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !185, file: !178, line: 42, baseType: !38, size: 32, align: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !178, line: 43, baseType: !151, size: 832, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "acl_p", scope: !177, file: !178, line: 49, baseType: !184, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "acl_state", scope: !177, file: !178, line: 50, baseType: !38, size: 32, align: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text_w", scope: !177, file: !178, line: 51, baseType: !159, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text", scope: !177, file: !178, line: 52, baseType: !103, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "acl_types", scope: !177, file: !178, line: 53, baseType: !38, size: 32, align: 32, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_head", scope: !20, file: !7, line: 169, baseType: !199, size: 64, align: 64, offset: 8192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "ae_xattr", file: !7, line: 38, size: 256, align: 64, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !7, line: 39, baseType: !199, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !7, line: 41, baseType: !103, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !7, line: 42, baseType: !4, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !7, line: 43, baseType: !55, size: 64, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_p", scope: !20, file: !7, line: 170, baseType: !199, size: 64, align: 64, offset: 8256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_head", scope: !20, file: !7, line: 173, baseType: !5, size: 64, align: 64, offset: 8320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_tail", scope: !20, file: !7, line: 174, baseType: !5, size: 64, align: 64, offset: 8384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_p", scope: !20, file: !7, line: 175, baseType: !5, size: 64, align: 64, offset: 8448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "strmode", scope: !20, file: !7, line: 178, baseType: !211, size: 96, align: 8, offset: 8512)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 96, align: 8, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 12)
!214 = distinct !DISubprogram(name: "archive_entry_sparse_add_entry", scope: !1, file: !1, line: 53, type: !215, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !19, !11, !11}
!217 = distinct !DISubprogram(name: "archive_entry_sparse_count", scope: !1, file: !1, line: 103, type: !218, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!218 = !DISubroutineType(types: !219)
!219 = !{!38, !19}
!220 = distinct !DISubprogram(name: "archive_entry_sparse_reset", scope: !1, file: !1, line: 129, type: !218, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!221 = distinct !DISubprogram(name: "archive_entry_sparse_next", scope: !1, file: !1, line: 137, type: !222, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!222 = !DISubroutineType(types: !223)
!223 = !{!38, !19, !74, !74}
!224 = !{i32 2, !"Dwarf Version", i32 4}
!225 = !{i32 2, !"Debug Info Version", i32 3}
!226 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!227 = !DILocalVariable(name: "entry", arg: 1, scope: !16, file: !1, line: 40, type: !19)
!228 = !DIExpression()
!229 = !DILocation(line: 40, column: 50, scope: !16)
!230 = !DILocalVariable(name: "sp", scope: !16, file: !1, line: 42, type: !5)
!231 = !DILocation(line: 42, column: 20, scope: !16)
!232 = !DILocation(line: 44, column: 2, scope: !16)
!233 = !DILocation(line: 44, column: 9, scope: !234)
!234 = !DILexicalBlockFile(scope: !16, file: !1, discriminator: 1)
!235 = !DILocation(line: 44, column: 16, scope: !234)
!236 = !DILocation(line: 44, column: 28, scope: !234)
!237 = !DILocation(line: 44, column: 2, scope: !234)
!238 = !DILocation(line: 45, column: 8, scope: !239)
!239 = distinct !DILexicalBlock(scope: !16, file: !1, line: 44, column: 37)
!240 = !DILocation(line: 45, column: 15, scope: !239)
!241 = !DILocation(line: 45, column: 28, scope: !239)
!242 = !DILocation(line: 45, column: 6, scope: !239)
!243 = !DILocation(line: 46, column: 8, scope: !239)
!244 = !DILocation(line: 46, column: 15, scope: !239)
!245 = !DILocation(line: 46, column: 3, scope: !239)
!246 = !DILocation(line: 47, column: 24, scope: !239)
!247 = !DILocation(line: 47, column: 3, scope: !239)
!248 = !DILocation(line: 47, column: 10, scope: !239)
!249 = !DILocation(line: 47, column: 22, scope: !239)
!250 = !DILocation(line: 44, column: 2, scope: !251)
!251 = !DILexicalBlockFile(scope: !16, file: !1, discriminator: 2)
!252 = !DILocation(line: 49, column: 2, scope: !16)
!253 = !DILocation(line: 49, column: 9, scope: !16)
!254 = !DILocation(line: 49, column: 21, scope: !16)
!255 = !DILocation(line: 50, column: 1, scope: !16)
!256 = !DILocalVariable(name: "entry", arg: 1, scope: !214, file: !1, line: 53, type: !19)
!257 = !DILocation(line: 53, column: 54, scope: !214)
!258 = !DILocalVariable(name: "offset", arg: 2, scope: !214, file: !1, line: 54, type: !11)
!259 = !DILocation(line: 54, column: 10, scope: !214)
!260 = !DILocalVariable(name: "length", arg: 3, scope: !214, file: !1, line: 54, type: !11)
!261 = !DILocation(line: 54, column: 26, scope: !214)
!262 = !DILocalVariable(name: "sp", scope: !214, file: !1, line: 56, type: !5)
!263 = !DILocation(line: 56, column: 20, scope: !214)
!264 = !DILocation(line: 58, column: 6, scope: !265)
!265 = distinct !DILexicalBlock(scope: !214, file: !1, line: 58, column: 6)
!266 = !DILocation(line: 58, column: 13, scope: !265)
!267 = !DILocation(line: 58, column: 17, scope: !265)
!268 = !DILocation(line: 58, column: 20, scope: !269)
