; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_add_filter_program.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_write_filter = type { i64, %struct.archive*, %struct.archive_write_filter*, i32 (%struct.archive_write_filter*, i8*, i8*)*, i32 (%struct.archive_write_filter*)*, i32 (%struct.archive_write_filter*, i8*, i64)*, i32 (%struct.archive_write_filter*)*, i32 (%struct.archive_write_filter*)*, i8*, i8*, i32, i32, i32 }
%struct.private_data = type { %struct.archive_write_program_data*, %struct.archive_string, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !37, globals: !178)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_add_filter_program.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "private_data", file: !1, line: 74, size: 320, align: 64, elements: !7)
!7 = !{!8, !29, !36}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !6, file: !1, line: 75, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write_program_data", file: !1, line: 61, size: 384, align: 64, elements: !11)
!11 = !{!12, !18, !19, !20, !23, !27, !28}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !10, file: !1, line: 65, baseType: !13, size: 32, align: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !14, line: 61, baseType: !15)
!14 = !DIFile(filename: "/usr/include/signal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !16, line: 133, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "child_stdin", scope: !10, file: !1, line: 67, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "child_stdout", scope: !10, file: !1, line: 67, baseType: !17, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "child_buf", scope: !10, file: !1, line: 69, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "child_buf_len", scope: !10, file: !1, line: 70, baseType: !24, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 62, baseType: !26)
!25 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!26 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "child_buf_avail", scope: !10, file: !1, line: 70, baseType: !24, size: 64, align: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "program_name", scope: !10, file: !1, line: 71, baseType: !21, size: 64, align: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !6, file: !1, line: 76, baseType: !30, size: 192, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !31, line: 58, size: 192, align: 64, elements: !32)
!31 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !30, file: !31, line: 59, baseType: !21, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !30, file: !31, line: 60, baseType: !24, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !30, file: !31, line: 61, baseType: !24, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !6, file: !1, line: 77, baseType: !21, size: 64, align: 64, offset: 256)
!37 = !{!38, !129, !130, !133, !136, !165, !168, !171, !172, !173, !174, !175}
!38 = distinct !DISubprogram(name: "archive_write_set_compression_program", scope: !1, file: !1, line: 54, type: !39, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!17, !41, !107}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !43, line: 89, size: 1280, align: 64, elements: !44)
!43 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!44 = !{!45, !47, !48, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !124, !125, !126, !127, !128}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !42, file: !43, line: 96, baseType: !46, size: 32, align: 32)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !42, file: !43, line: 97, baseType: !46, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !42, file: !43, line: 103, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !43, line: 63, size: 832, align: 64, elements: !51)
!51 = !{!52, !56, !57, !64, !65, !75, !81, !86, !87, !94, !95, !99, !103}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !50, file: !43, line: 64, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!17, !41}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !50, file: !43, line: 65, baseType: !53, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !50, file: !43, line: 66, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!17, !41, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !63, line: 180, flags: DIFlagFwdDecl)
!63 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !50, file: !43, line: 68, baseType: !53, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !50, file: !43, line: 69, baseType: !66, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !41, !73, !24}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !70, line: 109, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 172, baseType: !72)
!72 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !50, file: !43, line: 71, baseType: !76, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!69, !41, !73, !24, !79}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !80, line: 40, baseType: !72)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !50, file: !43, line: 74, baseType: !82, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!17, !41, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !50, file: !43, line: 76, baseType: !58, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !50, file: !43, line: 78, baseType: !88, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!17, !41, !91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !50, file: !43, line: 81, baseType: !53, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !50, file: !43, line: 82, baseType: !96, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!79, !41, !17}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !50, file: !43, line: 83, baseType: !100, size: 64, align: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!17, !41, !17}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !50, file: !43, line: 84, baseType: !104, size: 64, align: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !41, !17}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !42, file: !43, line: 105, baseType: !17, size: 32, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !42, file: !43, line: 106, baseType: !107, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !42, file: !43, line: 108, baseType: !17, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !42, file: !43, line: 109, baseType: !107, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !42, file: !43, line: 112, baseType: !17, size: 32, align: 32, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !42, file: !43, line: 114, baseType: !17, size: 32, align: 32, offset: 416)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !42, file: !43, line: 115, baseType: !107, size: 64, align: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !42, file: !43, line: 116, baseType: !30, size: 192, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !42, file: !43, line: 118, baseType: !21, size: 64, align: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !42, file: !43, line: 119, baseType: !46, size: 32, align: 32, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !42, file: !43, line: 120, baseType: !46, size: 32, align: 32, offset: 800)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !42, file: !43, line: 121, baseType: !121, size: 64, align: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !31, line: 70, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !42, file: !43, line: 127, baseType: !107, size: 64, align: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !42, file: !43, line: 128, baseType: !79, size: 64, align: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !42, file: !43, line: 129, baseType: !79, size: 64, align: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !42, file: !43, line: 130, baseType: !24, size: 64, align: 64, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !42, file: !43, line: 137, baseType: !22, size: 8, align: 8, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !42, file: !43, line: 138, baseType: !24, size: 64, align: 64, offset: 1216)
!129 = distinct !DISubprogram(name: "archive_write_add_filter_program", scope: !1, file: !1, line: 91, type: !39, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!130 = distinct !DISubprogram(name: "__archive_write_program_allocate", scope: !1, file: !1, line: 178, type: !131, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!131 = !DISubroutineType(types: !132)
!132 = !{!9, !107}
!133 = distinct !DISubprogram(name: "__archive_write_program_free", scope: !1, file: !1, line: 195, type: !134, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!134 = !DISubroutineType(types: !135)
!135 = !{!17, !9}
!136 = distinct !DISubprogram(name: "__archive_write_program_open", scope: !1, file: !1, line: 211, type: !137, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!137 = !DISubroutineType(types: !138)
!138 = !{!17, !139, !9, !107}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write_filter", file: !141, line: 43, size: 768, align: 64, elements: !142)
!141 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!142 = !{!143, !144, !145, !146, !150, !154, !158, !159, !160, !161, !162, !163, !164}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !140, file: !141, line: 44, baseType: !79, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !140, file: !141, line: 45, baseType: !41, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next_filter", scope: !140, file: !141, line: 46, baseType: !139, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !140, file: !141, line: 47, baseType: !147, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!17, !139, !107, !107}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !140, file: !141, line: 49, baseType: !151, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!17, !139}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !140, file: !141, line: 50, baseType: !155, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!17, !139, !73, !24}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !140, file: !141, line: 51, baseType: !151, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !140, file: !141, line: 52, baseType: !151, size: 64, align: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 53, baseType: !4, size: 64, align: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 54, baseType: !107, size: 64, align: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !140, file: !141, line: 55, baseType: !17, size: 32, align: 32, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !140, file: !141, line: 56, baseType: !17, size: 32, align: 32, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !140, file: !141, line: 57, baseType: !17, size: 32, align: 32, offset: 704)
!165 = distinct !DISubprogram(name: "__archive_write_program_write", scope: !1, file: !1, line: 326, type: !166, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!166 = !DISubroutineType(types: !167)
!167 = !{!17, !139, !9, !73, !24}
!168 = distinct !DISubprogram(name: "__archive_write_program_close", scope: !1, file: !1, line: 353, type: !169, isLocal: false, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!169 = !DISubroutineType(types: !170)
!170 = !{!17, !139, !9}
!171 = distinct !DISubprogram(name: "archive_compressor_program_open", scope: !1, file: !1, line: 135, type: !152, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!172 = distinct !DISubprogram(name: "archive_compressor_program_write", scope: !1, file: !1, line: 143, type: !156, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!173 = distinct !DISubprogram(name: "archive_compressor_program_close", scope: !1, file: !1, line: 152, type: !152, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!174 = distinct !DISubprogram(name: "archive_compressor_program_free", scope: !1, file: !1, line: 160, type: !152, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!175 = distinct !DISubprogram(name: "child_write", scope: !1, file: !1, line: 258, type: !176, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!176 = !DISubroutineType(types: !177)
!177 = !{!69, !139, !9, !107, !24}
!178 = !{!179}
!179 = !DIGlobalVariable(name: "prefix", scope: !129, file: !1, line: 95, type: !107, isLocal: true, isDefinition: true, variable: i8** @archive_write_add_filter_program.prefix)
!180 = !{i32 2, !"Dwarf Version", i32 4}
!181 = !{i32 2, !"Debug Info Version", i32 3}
!182 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!183 = !DILocalVariable(name: "a", arg: 1, scope: !38, file: !1, line: 54, type: !41)
!184 = !DIExpression()
!185 = !DILocation(line: 54, column: 55, scope: !38)
!186 = !DILocalVariable(name: "cmd", arg: 2, scope: !38, file: !1, line: 54, type: !107)
!187 = !DILocation(line: 54, column: 70, scope: !38)
!188 = !DILocation(line: 56, column: 31, scope: !38)
!189 = !DILocation(line: 56, column: 2, scope: !38)
!190 = !DILocation(line: 57, column: 43, scope: !38)
!191 = !DILocation(line: 57, column: 46, scope: !38)
!192 = !DILocation(line: 57, column: 10, scope: !38)
!193 = !DILocation(line: 57, column: 2, scope: !38)
!194 = !DILocalVariable(name: "_a", arg: 1, scope: !129, file: !1, line: 91, type: !41)
!195 = !DILocation(line: 91, column: 50, scope: !129)
!196 = !DILocalVariable(name: "cmd", arg: 2, scope: !129, file: !1, line: 91, type: !107)
!197 = !DILocation(line: 91, column: 66, scope: !129)
!198 = !DILocalVariable(name: "f", scope: !129, file: !1, line: 93, type: !139)
!199 = !DILocation(line: 93, column: 31, scope: !129)
!200 = !DILocation(line: 93, column: 67, scope: !129)
!201 = !DILocation(line: 93, column: 35, scope: !129)
!202 = !DILocalVariable(name: "data", scope: !129, file: !1, line: 94, type: !5)
!203 = !DILocation(line: 94, column: 23, scope: !129)
!204 = !DILocation(line: 97, column: 2, scope: !129)
!205 = !DILocalVariable(name: "magic_test", scope: !206, file: !1, line: 97, type: !17)
!206 = distinct !DILexicalBlock(scope: !129, file: !1, line: 97, column: 2)
!207 = !DILocation(line: 97, column: 2, scope: !206)
!208 = !DILocation(line: 97, column: 2, scope: !209)
!209 = !DILexicalBlockFile(scope: !206, file: !1, discriminator: 1)
!210 = !DILocation(line: 97, column: 2, scope: !211)
