; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_link_resolver.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_entry_linkresolver = type { %struct.links_entry**, %struct.links_entry*, i64, i64, i32 }
%struct.links_entry = type { %struct.links_entry*, %struct.links_entry*, %struct.archive_entry*, %struct.archive_entry*, i64, i32 }
%struct.archive_entry = type opaque

; Function Attrs: nounwind uwtable
define %struct.archive_entry_linkresolver* @archive_entry_linkresolver_new() #0 !dbg !14 {
entry:
  %retval = alloca %struct.archive_entry_linkresolver*, align 8
  %res = alloca %struct.archive_entry_linkresolver*, align 8
  call void @llvm.dbg.declare(metadata %struct.archive_entry_linkresolver** %res, metadata !64, metadata !65), !dbg !66
  %call = call noalias i8* @calloc(i64 1, i64 40) #4, !dbg !67
  %0 = bitcast i8* %call to %struct.archive_entry_linkresolver*, !dbg !67
  store %struct.archive_entry_linkresolver* %0, %struct.archive_entry_linkresolver** %res, align 8, !dbg !68
  %1 = load %struct.archive_entry_linkresolver*, %struct.archive_entry_linkresolver** %res, align 8, !dbg !69
  %cmp = icmp eq %struct.archive_entry_linkresolver* %1, null, !dbg !71
  br i1 %cmp, label %if.then, label %if.end, !dbg !72

if.then:                                          ; preds = %entry

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !13)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_link_resolver.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 63, baseType: !7)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !8, line: 129, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 62, baseType: !12)
!11 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!12 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!13 = !{!14, !39, !42, !45, !49, !53, !56, !59, !60}
!14 = distinct !DISubprogram(name: "archive_entry_linkresolver_new", scope: !1, file: !1, line: 100, type: !15, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry_linkresolver", file: !1, line: 79, size: 320, align: 64, elements: !19)
!19 = !{!20, !34, !35, !36, !37}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !18, file: !1, line: 80, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "links_entry", file: !1, line: 70, size: 384, align: 64, elements: !24)
!24 = !{!25, !26, !27, !31, !32, !33}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !1, line: 71, baseType: !22, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !23, file: !1, line: 72, baseType: !22, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !23, file: !1, line: 73, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !30, line: 180, flags: DIFlagFwdDecl)
!30 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !23, file: !1, line: 74, baseType: !28, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !23, file: !1, line: 75, baseType: !10, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !23, file: !1, line: 76, baseType: !9, size: 32, align: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !18, file: !1, line: 81, baseType: !22, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "number_entries", scope: !18, file: !1, line: 82, baseType: !12, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "number_buckets", scope: !18, file: !1, line: 83, baseType: !10, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !18, file: !1, line: 84, baseType: !38, size: 32, align: 32, offset: 256)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = distinct !DISubprogram(name: "archive_entry_linkresolver_set_strategy", scope: !1, file: !1, line: 122, type: !40, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !17, !38}
!42 = distinct !DISubprogram(name: "archive_entry_linkresolver_free", scope: !1, file: !1, line: 160, type: !43, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !17}
!45 = distinct !DISubprogram(name: "archive_entry_linkify", scope: !1, file: !1, line: 174, type: !46, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !17, !48, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!49 = distinct !DISubprogram(name: "archive_entry_partial_links", scope: !1, file: !1, line: 421, type: !50, isLocal: false, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!28, !17, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!53 = distinct !DISubprogram(name: "find_entry", scope: !1, file: !1, line: 261, type: !54, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!54 = !DISubroutineType(types: !55)
!55 = !{!22, !17, !28}
!56 = distinct !DISubprogram(name: "next_entry", scope: !1, file: !1, line: 313, type: !57, isLocal: true, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!57 = !DISubroutineType(types: !58)
!58 = !{!22, !17, !38}
!59 = distinct !DISubprogram(name: "insert_entry", scope: !1, file: !1, line: 352, type: !54, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!60 = distinct !DISubprogram(name: "grow_hash", scope: !1, file: !1, line: 384, type: !43, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!64 = !DILocalVariable(name: "res", scope: !14, file: !1, line: 102, type: !17)
!65 = !DIExpression()
!66 = !DILocation(line: 102, column: 37, scope: !14)
!67 = !DILocation(line: 109, column: 8, scope: !14)
!68 = !DILocation(line: 109, column: 6, scope: !14)
!69 = !DILocation(line: 110, column: 6, scope: !70)
!70 = distinct !DILexicalBlock(scope: !14, file: !1, line: 110, column: 6)
!71 = !DILocation(line: 110, column: 10, scope: !70)
!72 = !DILocation(line: 110, column: 6, scope: !14)
!73 = !DILocation(line: 111, column: 3, scope: !70)
!74 = !DILocation(line: 112, column: 2, scope: !14)
!75 = !DILocation(line: 112, column: 7, scope: !14)
!76 = !DILocation(line: 112, column: 22, scope: !14)
!77 = !DILocation(line: 113, column: 24, scope: !14)
!78 = !DILocation(line: 113, column: 29, scope: !14)
!79 = !DILocation(line: 113, column: 17, scope: !14)
!80 = !DILocation(line: 113, column: 2, scope: !14)
!81 = !DILocation(line: 113, column: 7, scope: !14)
!82 = !DILocation(line: 113, column: 15, scope: !14)
!83 = !DILocation(line: 114, column: 6, scope: !84)
!84 = distinct !DILexicalBlock(scope: !14, file: !1, line: 114, column: 6)
!85 = !DILocation(line: 114, column: 11, scope: !84)
!86 = !DILocation(line: 114, column: 19, scope: !84)
!87 = !DILocation(line: 114, column: 6, scope: !14)
!88 = !DILocation(line: 115, column: 8, scope: !89)
!89 = distinct !DILexicalBlock(scope: !84, file: !1, line: 114, column: 28)
