; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_format_warc.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_read = type { %struct.archive, %struct.archive_entry*, i32, i64, i64, %struct.archive_read_client, [16 x %struct.archive_read_filter_bidder], %struct.archive_read_filter*, i32, i64, i32, i32, [16 x %struct.archive_format_descriptor], %struct.archive_format_descriptor*, %struct.archive_read_extract*, i32 (%struct.archive_read*)*, %struct.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !30, subprograms: !325, globals: !388)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_format_warc.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 75, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!20 = !DIEnumerator(name: "WT_NONE", value: 0)
!21 = !DIEnumerator(name: "WT_INFO", value: 1)
!22 = !DIEnumerator(name: "WT_META", value: 2)
!23 = !DIEnumerator(name: "WT_RSRC", value: 3)
!24 = !DIEnumerator(name: "WT_REQ", value: 4)
!25 = !DIEnumerator(name: "WT_RSP", value: 5)
!26 = !DIEnumerator(name: "WT_RVIS", value: 6)
!27 = !DIEnumerator(name: "WT_CONV", value: 7)
!28 = !DIEnumerator(name: "WT_CONT", value: 8)
!29 = !DIEnumerator(name: "LAST_WT", value: 9)
!30 = !{!31, !149, !50, !318, !319, !322, !122, !107, !72}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read", file: !33, line: 159, size: 20288, align: 64, elements: !34)
!33 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!34 = !{!35, !137, !138, !139, !140, !141, !185, !249, !250, !251, !252, !253, !254, !287, !289, !299, !300}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !32, file: !33, line: 160, baseType: !36, size: 1280, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !37, line: 89, size: 1280, align: 64, elements: !38)
!37 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!38 = !{!39, !41, !42, !110, !111, !112, !113, !114, !115, !116, !117, !125, !126, !127, !128, !131, !132, !133, !134, !135, !136}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !36, file: !37, line: 96, baseType: !40, size: 32, align: 32)
!40 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !36, file: !37, line: 97, baseType: !40, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !36, file: !37, line: 103, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !37, line: 63, size: 832, align: 64, elements: !45)
!45 = !{!46, !52, !53, !60, !61, !75, !81, !86, !87, !94, !95, !99, !103}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !44, file: !37, line: 64, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !51}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !44, file: !37, line: 65, baseType: !47, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !44, file: !37, line: 66, baseType: !54, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!50, !51, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !59, line: 180, flags: DIFlagFwdDecl)
!59 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !44, file: !37, line: 68, baseType: !47, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !44, file: !37, line: 69, baseType: !62, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !51, !70, !72}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !66, line: 109, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !68, line: 172, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!69 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 62, baseType: !74)
!73 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!74 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !44, file: !37, line: 71, baseType: !76, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!65, !51, !70, !72, !79}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !80, line: 40, baseType: !69)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !44, file: !37, line: 74, baseType: !82, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!50, !51, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !44, file: !37, line: 76, baseType: !54, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !44, file: !37, line: 78, baseType: !88, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!50, !51, !91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !44, file: !37, line: 81, baseType: !47, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !44, file: !37, line: 82, baseType: !96, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!79, !51, !50}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !44, file: !37, line: 83, baseType: !100, size: 64, align: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!50, !51, !50}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !44, file: !37, line: 84, baseType: !104, size: 64, align: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !51, !50}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !36, file: !37, line: 105, baseType: !50, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !36, file: !37, line: 106, baseType: !107, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !36, file: !37, line: 108, baseType: !50, size: 32, align: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !36, file: !37, line: 109, baseType: !107, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !36, file: !37, line: 112, baseType: !50, size: 32, align: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !36, file: !37, line: 114, baseType: !50, size: 32, align: 32, offset: 416)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !36, file: !37, line: 115, baseType: !107, size: 64, align: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !36, file: !37, line: 116, baseType: !118, size: 192, align: 64, offset: 512)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !119, line: 58, size: 192, align: 64, elements: !120)
!119 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!120 = !{!121, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !118, file: !119, line: 59, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !119, line: 60, baseType: !72, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !118, file: !119, line: 61, baseType: !72, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !36, file: !37, line: 118, baseType: !122, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !36, file: !37, line: 119, baseType: !40, size: 32, align: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !36, file: !37, line: 120, baseType: !40, size: 32, align: 32, offset: 800)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !36, file: !37, line: 121, baseType: !129, size: 64, align: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !119, line: 70, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !36, file: !37, line: 127, baseType: !107, size: 64, align: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !36, file: !37, line: 128, baseType: !79, size: 64, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !36, file: !37, line: 129, baseType: !79, size: 64, align: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !36, file: !37, line: 130, baseType: !72, size: 64, align: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !36, file: !37, line: 137, baseType: !109, size: 8, align: 8, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !36, file: !37, line: 138, baseType: !72, size: 64, align: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !32, file: !33, line: 162, baseType: !57, size: 64, align: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !32, file: !33, line: 165, baseType: !50, size: 32, align: 32, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !32, file: !33, line: 166, baseType: !79, size: 64, align: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !32, file: !33, line: 167, baseType: !79, size: 64, align: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !32, file: !33, line: 170, baseType: !142, size: 576, align: 64, offset: 1536)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_client", file: !33, line: 134, size: 576, align: 64, elements: !143)
!143 = !{!144, !150, !156, !162, !167, !170, !175, !176, !177, !178}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "opener", scope: !142, file: !33, line: 135, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !59, line: 241, baseType: !147)
!147 = !DISubroutineType(types: !148)
!148 = !{!50, !51, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !142, file: !33, line: 136, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_read_callback", file: !59, line: 218, baseType: !153)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !51, !149, !91}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !59, line: 95, baseType: !65)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "skipper", scope: !142, file: !33, line: 137, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_skip_callback", file: !59, line: 226, baseType: !159)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !51, !149, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !59, line: 73, baseType: !79)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !142, file: !33, line: 138, baseType: !163, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_seek_callback", file: !59, line: 233, baseType: !165)
!165 = !DISubroutineType(types: !166)
!166 = !{!161, !51, !149, !161, !50}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "closer", scope: !142, file: !33, line: 139, baseType: !168, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !59, line: 243, baseType: !147)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "switcher", scope: !142, file: !33, line: 140, baseType: !171, size: 64, align: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_switch_callback", file: !59, line: 249, baseType: !173)
!173 = !DISubroutineType(types: !174)
!174 = !{!50, !51, !149, !149}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !142, file: !33, line: 141, baseType: !40, size: 32, align: 32, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !142, file: !33, line: 142, baseType: !40, size: 32, align: 32, offset: 416)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !142, file: !33, line: 143, baseType: !79, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !142, file: !33, line: 144, baseType: !179, size: 64, align: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_data_node", file: !33, line: 129, size: 192, align: 64, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "begin_position", scope: !180, file: !33, line: 130, baseType: !79, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !180, file: !33, line: 131, baseType: !79, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !33, line: 132, baseType: !149, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bidders", scope: !32, file: !33, line: 173, baseType: !186, size: 6144, align: 64, offset: 2112)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 6144, align: 64, elements: !247)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter_bidder", file: !33, line: 60, size: 384, align: 64, elements: !188)
!188 = !{!189, !190, !191, !238, !239, !243}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !33, line: 62, baseType: !149, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !33, line: 64, baseType: !107, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !187, file: !33, line: 66, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!50, !195, !196}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter", file: !33, line: 82, size: 1408, align: 64, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !207, !211, !215, !219, !220, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !197, file: !33, line: 83, baseType: !79, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bidder", scope: !197, file: !33, line: 86, baseType: !195, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !197, file: !33, line: 87, baseType: !196, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !197, file: !33, line: 88, baseType: !31, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !197, file: !33, line: 90, baseType: !204, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!50, !196}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !197, file: !33, line: 92, baseType: !208, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!65, !196, !91}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !197, file: !33, line: 94, baseType: !212, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!79, !196, !79}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !197, file: !33, line: 96, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!79, !196, !79, !50}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !197, file: !33, line: 98, baseType: !204, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sswitch", scope: !197, file: !33, line: 100, baseType: !221, size: 64, align: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!50, !196, !40}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !33, line: 102, baseType: !149, size: 64, align: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !33, line: 104, baseType: !107, size: 64, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !197, file: !33, line: 105, baseType: !50, size: 32, align: 32, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !197, file: !33, line: 108, baseType: !122, size: 64, align: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !197, file: !33, line: 109, baseType: !72, size: 64, align: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !33, line: 110, baseType: !122, size: 64, align: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !197, file: !33, line: 111, baseType: !72, size: 64, align: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "client_buff", scope: !197, file: !33, line: 112, baseType: !70, size: 64, align: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "client_total", scope: !197, file: !33, line: 113, baseType: !72, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "client_next", scope: !197, file: !33, line: 114, baseType: !107, size: 64, align: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "client_avail", scope: !197, file: !33, line: 115, baseType: !72, size: 64, align: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_file", scope: !197, file: !33, line: 116, baseType: !109, size: 8, align: 8, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !197, file: !33, line: 117, baseType: !109, size: 8, align: 8, offset: 1352)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !197, file: !33, line: 118, baseType: !109, size: 8, align: 8, offset: 1360)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !187, file: !33, line: 69, baseType: !204, size: 64, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !187, file: !33, line: 71, baseType: !240, size: 64, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!50, !195, !107, !107}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !187, file: !33, line: 74, baseType: !244, size: 64, align: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!50, !195}
!247 = !{!248}
!248 = !DISubrange(count: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !32, file: !33, line: 176, baseType: !196, size: 64, align: 64, offset: 8256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_filter_bidding", scope: !32, file: !33, line: 179, baseType: !50, size: 32, align: 32, offset: 8320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "header_position", scope: !32, file: !33, line: 182, baseType: !79, size: 64, align: 64, offset: 8384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data_start_node", scope: !32, file: !33, line: 185, baseType: !40, size: 32, align: 32, offset: 8448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data_end_node", scope: !32, file: !33, line: 186, baseType: !40, size: 32, align: 32, offset: 8480)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !32, file: !33, line: 209, baseType: !255, size: 11264, align: 64, offset: 8512)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 11264, align: 64, elements: !247)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_format_descriptor", file: !33, line: 196, size: 704, align: 64, elements: !257)
!257 = !{!258, !259, !260, !264, !268, !272, !276, !280, !284, !285, !286}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !33, line: 197, baseType: !149, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !33, line: 198, baseType: !107, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !256, file: !33, line: 199, baseType: !261, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!50, !31, !50}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !256, file: !33, line: 200, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!50, !31, !107, !107}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !256, file: !33, line: 202, baseType: !269, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!50, !31, !57}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "read_data", scope: !256, file: !33, line: 203, baseType: !273, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!50, !31, !91, !92, !93}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_skip", scope: !256, file: !33, line: 204, baseType: !277, size: 64, align: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!50, !31}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "seek_data", scope: !256, file: !33, line: 205, baseType: !281, size: 64, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!79, !31, !79, !50}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !256, file: !33, line: 206, baseType: !277, size: 64, align: 64, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "format_capabilties", scope: !256, file: !33, line: 207, baseType: !277, size: 64, align: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "has_encrypted_entries", scope: !256, file: !33, line: 208, baseType: !277, size: 64, align: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !32, file: !33, line: 210, baseType: !288, size: 64, align: 64, offset: 19776)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !32, file: !33, line: 215, baseType: !290, size: 64, align: 64, offset: 19840)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_extract", file: !33, line: 151, size: 192, align: 64, elements: !292)
!292 = !{!293, !294, !298}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !291, file: !33, line: 152, baseType: !51, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress", scope: !291, file: !33, line: 155, baseType: !295, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !149}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress_user_data", scope: !291, file: !33, line: 156, baseType: !149, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_archive_extract", scope: !32, file: !33, line: 216, baseType: !277, size: 64, align: 64, offset: 19904)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !32, file: !33, line: 227, baseType: !301, size: 320, align: 64, offset: 19968)
!301 = !DICompositeType(tag: DW_TAG_structure_type, scope: !32, file: !33, line: 221, size: 320, align: 64, elements: !302)
!302 = !{!303, !309, !311, !312, !317}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !301, file: !33, line: 222, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_passphrase", file: !33, line: 146, size: 128, align: 64, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !305, file: !33, line: 147, baseType: !122, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !33, line: 148, baseType: !304, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !301, file: !33, line: 223, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !301, file: !33, line: 224, baseType: !50, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !301, file: !33, line: 225, baseType: !313, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !59, line: 256, baseType: !315)
!315 = !DISubroutineType(types: !316)
!316 = !{!107, !51, !149}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !301, file: !33, line: 226, baseType: !149, size: 64, align: 64, offset: 256)
!318 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !320, line: 75, baseType: !321)
!320 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !68, line: 139, baseType: !69)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !323, line: 63, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !68, line: 129, baseType: !40)
!325 = !{!326, !328, !329, !330, !333, !334, !337, !341, !344, !347, !348, !351, !355, !359, !376, !377, !385, !386, !387}
!326 = distinct !DISubprogram(name: "archive_read_support_format_warc", scope: !1, file: !1, line: 140, type: !48, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!327 = !{}
!328 = distinct !DISubprogram(name: "_warc_cleanup", scope: !1, file: !1, line: 168, type: !278, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!329 = distinct !DISubprogram(name: "_warc_bid", scope: !1, file: !1, line: 182, type: !262, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!330 = distinct !DISubprogram(name: "_warc_rdver", scope: !1, file: !1, line: 589, type: !331, isLocal: true, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!331 = !DISubroutineType(types: !332)
!332 = !{!40, !107, !72}
!333 = distinct !DISubprogram(name: "_warc_rdhdr", scope: !1, file: !1, line: 211, type: !270, isLocal: true, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!334 = distinct !DISubprogram(name: "_warc_find_eoh", scope: !1, file: !1, line: 805, type: !335, isLocal: true, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!335 = !DISubroutineType(types: !336)
!336 = !{!107, !107, !72}
!337 = distinct !DISubprogram(name: "xmemmem", scope: !1, file: !1, line: 429, type: !338, isLocal: true, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!338 = !DISubroutineType(types: !339)
!339 = !{!122, !107, !340, !107, !340}
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!341 = distinct !DISubprogram(name: "deconst", scope: !1, file: !1, line: 423, type: !342, isLocal: true, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!342 = !DISubroutineType(types: !343)
!343 = !{!149, !70}
!344 = distinct !DISubprogram(name: "_warc_rdlen", scope: !1, file: !1, line: 718, type: !345, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!345 = !DISubroutineType(types: !346)
!346 = !{!65, !107, !72}
!347 = distinct !DISubprogram(name: "_warc_find_eol", scope: !1, file: !1, line: 817, type: !335, isLocal: true, isDefinition: true, scopeLine: 818, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!348 = distinct !DISubprogram(name: "_warc_rdrtm", scope: !1, file: !1, line: 751, type: !349, isLocal: true, isDefinition: true, scopeLine: 752, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!349 = !DISubroutineType(types: !350)
!350 = !{!319, !107, !72}
!351 = distinct !DISubprogram(name: "xstrpisotime", scope: !1, file: !1, line: 535, type: !352, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!352 = !DISubroutineType(types: !353)
!353 = !{!319, !107, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!355 = distinct !DISubprogram(name: "strtoi_lim", scope: !1, file: !1, line: 487, type: !356, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!356 = !DISubroutineType(types: !357)
!357 = !{!50, !107, !358, !50, !50}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!359 = distinct !DISubprogram(name: "time_from_tm", scope: !1, file: !1, line: 510, type: !360, isLocal: true, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!360 = !DISubroutineType(types: !361)
!361 = !{!319, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !320, line: 133, size: 448, align: 64, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !363, file: !320, line: 135, baseType: !50, size: 32, align: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !363, file: !320, line: 136, baseType: !50, size: 32, align: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !363, file: !320, line: 137, baseType: !50, size: 32, align: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !363, file: !320, line: 138, baseType: !50, size: 32, align: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !363, file: !320, line: 139, baseType: !50, size: 32, align: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !363, file: !320, line: 140, baseType: !50, size: 32, align: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !363, file: !320, line: 141, baseType: !50, size: 32, align: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !363, file: !320, line: 142, baseType: !50, size: 32, align: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !363, file: !320, line: 143, baseType: !50, size: 32, align: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !363, file: !320, line: 146, baseType: !69, size: 64, align: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !363, file: !320, line: 147, baseType: !107, size: 64, align: 64, offset: 384)
!376 = distinct !DISubprogram(name: "_warc_rdtyp", scope: !1, file: !1, line: 632, type: !331, isLocal: true, isDefinition: true, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!377 = distinct !DISubprogram(name: "_warc_rduri", scope: !1, file: !1, line: 661, type: !378, isLocal: true, isDefinition: true, scopeLine: 662, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!378 = !DISubroutineType(types: !379)
!379 = !{!380, !107, !72}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "warc_string_t", file: !1, line: 100, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 97, size: 128, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !381, file: !1, line: 98, baseType: !72, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !381, file: !1, line: 99, baseType: !107, size: 64, align: 64, offset: 64)
!385 = distinct !DISubprogram(name: "_warc_rdmtm", scope: !1, file: !1, line: 778, type: !349, isLocal: true, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!386 = distinct !DISubprogram(name: "_warc_read", scope: !1, file: !1, line: 373, type: !274, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!387 = distinct !DISubprogram(name: "_warc_skip", scope: !1, file: !1, line: 410, type: !278, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: false, variables: !327)
!388 = !{!389, !393, !397, !401, !405, !409, !410, !414}
!389 = !DIGlobalVariable(name: "magic", scope: !330, file: !1, line: 591, type: !390, isLocal: true, isDefinition: true, variable: [6 x i8]* @_warc_rdver.magic)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 48, align: 8, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 6)
!393 = !DIGlobalVariable(name: "_marker", scope: !334, file: !1, line: 807, type: !394, isLocal: true, isDefinition: true, variable: [5 x i8]* @_warc_find_eoh._marker)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 40, align: 8, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 5)
!397 = !DIGlobalVariable(name: "_key", scope: !344, file: !1, line: 720, type: !398, isLocal: true, isDefinition: true, variable: [18 x i8]* @_warc_rdlen._key)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 144, align: 8, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 18)
!401 = !DIGlobalVariable(name: "_marker", scope: !347, file: !1, line: 819, type: !402, isLocal: true, isDefinition: true, variable: [3 x i8]* @_warc_find_eol._marker)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 24, align: 8, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 3)
!405 = !DIGlobalVariable(name: "_key", scope: !348, file: !1, line: 753, type: !406, isLocal: true, isDefinition: true, variable: [13 x i8]* @_warc_rdrtm._key)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 104, align: 8, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 13)
!409 = !DIGlobalVariable(name: "_key", scope: !376, file: !1, line: 634, type: !406, isLocal: true, isDefinition: true, variable: [13 x i8]* @_warc_rdtyp._key)
!410 = !DIGlobalVariable(name: "_key", scope: !377, file: !1, line: 663, type: !411, isLocal: true, isDefinition: true, variable: [19 x i8]* @_warc_rduri._key)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 152, align: 8, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 19)
!414 = !DIGlobalVariable(name: "_key", scope: !385, file: !1, line: 780, type: !415, isLocal: true, isDefinition: true, variable: [17 x i8]* @_warc_rdmtm._key)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 136, align: 8, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 17)
!418 = !{i32 2, !"Dwarf Version", i32 4}
!419 = !{i32 2, !"Debug Info Version", i32 3}
!420 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!421 = !DILocalVariable(name: "_a", arg: 1, scope: !326, file: !1, line: 140, type: !51)
!422 = !DIExpression()
!423 = !DILocation(line: 140, column: 50, scope: !326)
!424 = !DILocalVariable(name: "a", scope: !326, file: !1, line: 142, type: !31)
!425 = !DILocation(line: 142, column: 23, scope: !326)
!426 = !DILocation(line: 142, column: 50, scope: !326)
!427 = !DILocation(line: 142, column: 27, scope: !326)
!428 = !DILocalVariable(name: "w", scope: !326, file: !1, line: 143, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "warc_s", file: !1, line: 107, size: 576, align: 64, elements: !431)
!431 = !{!432, !433, !434, !435, !441, !442}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cntlen", scope: !430, file: !1, line: 109, baseType: !72, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cntoff", scope: !430, file: !1, line: 111, baseType: !72, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "unconsumed", scope: !430, file: !1, line: 113, baseType: !72, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !430, file: !1, line: 116, baseType: !436, size: 128, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "warc_strbuf_t", file: !1, line: 105, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 102, size: 128, align: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !437, file: !1, line: 103, baseType: !72, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !437, file: !1, line: 104, baseType: !122, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pver", scope: !430, file: !1, line: 118, baseType: !40, size: 32, align: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sver", scope: !430, file: !1, line: 120, baseType: !118, size: 192, align: 64, offset: 384)
!443 = !DILocation(line: 143, column: 17, scope: !326)
!444 = !DILocalVariable(name: "r", scope: !326, file: !1, line: 144, type: !50)
!445 = !DILocation(line: 144, column: 6, scope: !326)
!446 = !DILocation(line: 146, column: 2, scope: !326)
!447 = !DILocalVariable(name: "magic_test", scope: !448, file: !1, line: 146, type: !50)
!448 = distinct !DILexicalBlock(scope: !326, file: !1, line: 146, column: 2)
!449 = !DILocation(line: 146, column: 2, scope: !448)
!450 = !DILocation(line: 146, column: 2, scope: !451)
!451 = !DILexicalBlockFile(scope: !448, file: !1, discriminator: 1)
!452 = !DILocation(line: 146, column: 2, scope: !453)
!453 = !DILexicalBlockFile(scope: !454, file: !1, discriminator: 2)
!454 = distinct !DILexicalBlock(scope: !448, file: !1, line: 146, column: 2)
!455 = !DILocation(line: 146, column: 2, scope: !456)
!456 = !DILexicalBlockFile(scope: !448, file: !1, discriminator: 3)
!457 = !DILocation(line: 149, column: 11, scope: !458)
!458 = distinct !DILexicalBlock(scope: !326, file: !1, line: 149, column: 6)
!459 = !DILocation(line: 149, column: 9, scope: !458)
!460 = !DILocation(line: 149, column: 34, scope: !458)
!461 = !DILocation(line: 149, column: 6, scope: !326)
!462 = !DILocation(line: 150, column: 22, scope: !463)
!463 = distinct !DILexicalBlock(scope: !458, file: !1, line: 149, column: 43)
!464 = !DILocation(line: 150, column: 25, scope: !463)
!465 = !DILocation(line: 150, column: 3, scope: !463)
!466 = !DILocation(line: 152, column: 3, scope: !463)
!467 = !DILocation(line: 156, column: 3, scope: !326)
!468 = !DILocation(line: 156, column: 6, scope: !326)
!469 = !DILocation(line: 155, column: 6, scope: !326)
!470 = !DILocation(line: 155, column: 4, scope: !326)
!471 = !DILocation(line: 160, column: 6, scope: !472)
!472 = distinct !DILexicalBlock(scope: !326, file: !1, line: 160, column: 6)
!473 = !DILocation(line: 160, column: 8, scope: !472)
!474 = !DILocation(line: 160, column: 6, scope: !326)
!475 = !DILocation(line: 161, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !472, file: !1, line: 160, column: 23)
!477 = !DILocation(line: 161, column: 3, scope: !476)
!478 = !DILocation(line: 162, column: 11, scope: !476)
!479 = !DILocation(line: 162, column: 3, scope: !476)
!480 = !DILocation(line: 164, column: 2, scope: !326)
!481 = !DILocation(line: 165, column: 1, scope: !326)
!482 = !DILocalVariable(name: "a", arg: 1, scope: !329, file: !1, line: 182, type: !31)
!483 = !DILocation(line: 182, column: 32, scope: !329)
!484 = !DILocalVariable(name: "best_bid", arg: 2, scope: !329, file: !1, line: 182, type: !50)
!485 = !DILocation(line: 182, column: 39, scope: !329)
!486 = !DILocalVariable(name: "hdr", scope: !329, file: !1, line: 184, type: !107)
!487 = !DILocation(line: 184, column: 14, scope: !329)
!488 = !DILocalVariable(name: "nrd", scope: !329, file: !1, line: 185, type: !65)
!489 = !DILocation(line: 185, column: 10, scope: !329)
!490 = !DILocalVariable(name: "ver", scope: !329, file: !1, line: 186, type: !40)
!491 = !DILocation(line: 186, column: 15, scope: !329)
!492 = !DILocation(line: 188, column: 8, scope: !329)
!493 = !DILocation(line: 191, column: 34, scope: !494)
!494 = distinct !DILexicalBlock(scope: !329, file: !1, line: 191, column: 6)
!495 = !DILocation(line: 191, column: 13, scope: !494)
!496 = !DILocation(line: 191, column: 11, scope: !494)
!497 = !DILocation(line: 191, column: 49, scope: !494)
!498 = !DILocation(line: 191, column: 6, scope: !329)
!499 = !DILocation(line: 193, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !494, file: !1, line: 191, column: 58)
!501 = !DILocation(line: 194, column: 13, scope: !502)
!502 = distinct !DILexicalBlock(scope: !494, file: !1, line: 194, column: 13)
!503 = !DILocation(line: 194, column: 17, scope: !502)
!504 = !DILocation(line: 194, column: 13, scope: !494)
