; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_getdate.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LEXICON = type { i64, i8*, i32, i64 }
%struct.token = type { i32, i64 }
%struct.gdstate = type { %struct.token*, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i32, i64, i64, i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !39, subprograms: !49, globals: !127)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_getdate.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3, !8, !23, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DSTMODE", file: !1, line: 51, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7}
!5 = !DIEnumerator(name: "DSTon", value: 0)
!6 = !DIEnumerator(name: "DSToff", value: 1)
!7 = !DIEnumerator(name: "DSTmaybe", value: 2)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 46, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "/usr/include/ctype.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!10 = !{!11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22}
!11 = !DIEnumerator(name: "_ISupper", value: 256)
!12 = !DIEnumerator(name: "_ISlower", value: 512)
!13 = !DIEnumerator(name: "_ISalpha", value: 1024)
!14 = !DIEnumerator(name: "_ISdigit", value: 2048)
!15 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!16 = !DIEnumerator(name: "_ISspace", value: 8192)
!17 = !DIEnumerator(name: "_ISprint", value: 16384)
!18 = !DIEnumerator(name: "_ISgraph", value: 32768)
!19 = !DIEnumerator(name: "_ISblank", value: 1)
!20 = !DIEnumerator(name: "_IScntrl", value: 2)
!21 = !DIEnumerator(name: "_ISpunct", value: 4)
!22 = !DIEnumerator(name: "_ISalnum", value: 8)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 55, size: 32, align: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!25 = !DIEnumerator(name: "tAGO", value: 260)
!26 = !DIEnumerator(name: "tDAY", value: 261)
!27 = !DIEnumerator(name: "tDAYZONE", value: 262)
!28 = !DIEnumerator(name: "tAMPM", value: 263)
!29 = !DIEnumerator(name: "tMONTH", value: 264)
!30 = !DIEnumerator(name: "tMONTH_UNIT", value: 265)
!31 = !DIEnumerator(name: "tSEC_UNIT", value: 266)
!32 = !DIEnumerator(name: "tUNUMBER", value: 267)
!33 = !DIEnumerator(name: "tZONE", value: 268)
!34 = !DIEnumerator(name: "tDST", value: 269)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 53, size: 32, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "tAM", value: 0)
!38 = !DIEnumerator(name: "tPM", value: 1)
!39 = !{!40, !41, !42, !43, !44, !45}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !46, line: 75, baseType: !47)
!46 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !48, line: 139, baseType: !41)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!49 = !{!50, !57, !74, !79, !110, !111, !112, !113, !114, !115, !118, !121, !124}
!50 = distinct !DISubprogram(name: "__archive_get_date", scope: !1, file: !1, line: 897, type: !51, isLocal: false, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!51 = !DISubroutineType(types: !52)
!52 = !{!45, !45, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !{}
!57 = distinct !DISubprogram(name: "difftm", scope: !1, file: !1, line: 871, type: !58, isLocal: true, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!58 = !DISubroutineType(types: !59)
!59 = !{!41, !60, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !46, line: 133, size: 448, align: 64, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !61, file: !46, line: 135, baseType: !42, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !61, file: !46, line: 136, baseType: !42, size: 32, align: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !61, file: !46, line: 137, baseType: !42, size: 32, align: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !61, file: !46, line: 138, baseType: !42, size: 32, align: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !61, file: !46, line: 139, baseType: !42, size: 32, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !61, file: !46, line: 140, baseType: !42, size: 32, align: 32, offset: 160)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !61, file: !46, line: 141, baseType: !42, size: 32, align: 32, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !61, file: !46, line: 142, baseType: !42, size: 32, align: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !61, file: !46, line: 143, baseType: !42, size: 32, align: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !61, file: !46, line: 146, baseType: !41, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !61, file: !46, line: 147, baseType: !53, size: 64, align: 64, offset: 384)
!74 = distinct !DISubprogram(name: "nexttoken", scope: !1, file: !1, line: 785, type: !75, isLocal: true, isDefinition: true, scopeLine: 786, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!75 = !DISubroutineType(types: !76)
!76 = !{!42, !77, !78}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!79 = distinct !DISubprogram(name: "phrase", scope: !1, file: !1, line: 452, type: !80, isLocal: true, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!80 = !DISubroutineType(types: !81)
!81 = !{!42, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "gdstate", file: !1, line: 62, size: 1088, align: 64, elements: !84)
!84 = !{!85, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tokenp", scope: !83, file: !1, line: 63, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "token", file: !1, line: 57, size: 128, align: 64, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !87, file: !1, line: 57, baseType: !42, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !87, file: !1, line: 57, baseType: !45, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "HaveYear", scope: !83, file: !1, line: 67, baseType: !42, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "HaveMonth", scope: !83, file: !1, line: 68, baseType: !42, size: 32, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "HaveDay", scope: !83, file: !1, line: 69, baseType: !42, size: 32, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "HaveWeekDay", scope: !83, file: !1, line: 70, baseType: !42, size: 32, align: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "HaveTime", scope: !83, file: !1, line: 71, baseType: !42, size: 32, align: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "HaveZone", scope: !83, file: !1, line: 72, baseType: !42, size: 32, align: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "HaveRel", scope: !83, file: !1, line: 73, baseType: !42, size: 32, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Timezone", scope: !83, file: !1, line: 75, baseType: !45, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !83, file: !1, line: 76, baseType: !45, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !83, file: !1, line: 77, baseType: !45, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Minutes", scope: !83, file: !1, line: 78, baseType: !45, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !83, file: !1, line: 79, baseType: !45, size: 64, align: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", scope: !83, file: !1, line: 80, baseType: !45, size: 64, align: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !83, file: !1, line: 81, baseType: !45, size: 64, align: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "DSTmode", scope: !83, file: !1, line: 83, baseType: !3, size: 32, align: 32, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "DayOrdinal", scope: !83, file: !1, line: 85, baseType: !45, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "DayNumber", scope: !83, file: !1, line: 86, baseType: !45, size: 64, align: 64, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "RelMonth", scope: !83, file: !1, line: 89, baseType: !45, size: 64, align: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "RelSeconds", scope: !83, file: !1, line: 90, baseType: !45, size: 64, align: 64, offset: 1024)
!110 = distinct !DISubprogram(name: "timephrase", scope: !1, file: !1, line: 104, type: !80, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!111 = distinct !DISubprogram(name: "zonephrase", scope: !1, file: !1, line: 174, type: !80, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!112 = distinct !DISubprogram(name: "datephrase", scope: !1, file: !1, line: 207, type: !80, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!113 = distinct !DISubprogram(name: "dayphrase", scope: !1, file: !1, line: 423, type: !80, isLocal: true, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!114 = distinct !DISubprogram(name: "relunitphrase", scope: !1, file: !1, line: 348, type: !80, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!115 = distinct !DISubprogram(name: "Convert", scope: !1, file: !1, line: 690, type: !116, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!116 = !DISubroutineType(types: !117)
!117 = !{!45, !45, !45, !45, !45, !45, !45, !45, !3}
!118 = distinct !DISubprogram(name: "RelativeMonth", scope: !1, file: !1, line: 763, type: !119, isLocal: true, isDefinition: true, scopeLine: 764, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!119 = !DISubroutineType(types: !120)
!120 = !{!45, !45, !45, !45}
!121 = distinct !DISubprogram(name: "DSTcorrect", scope: !1, file: !1, line: 733, type: !122, isLocal: true, isDefinition: true, scopeLine: 734, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!122 = !DISubroutineType(types: !123)
!123 = !{!45, !45, !45}
!124 = distinct !DISubprogram(name: "RelativeDate", scope: !1, file: !1, line: 745, type: !125, isLocal: true, isDefinition: true, scopeLine: 747, flags: DIFlagPrototyped, isOptimized: false, variables: !56)
!125 = !DISubroutineType(types: !126)
!126 = !{!45, !45, !45, !42, !45, !45}
!127 = !{!128, !142}
!128 = !DIGlobalVariable(name: "TimeWords", scope: !0, file: !1, line: 523, type: !129, isLocal: true, isDefinition: true, variable: [137 x %struct.LEXICON]* @TimeWords)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 35072, align: 64, elements: !140)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "LEXICON", file: !1, line: 518, size: 256, align: 64, elements: !132)
!132 = !{!133, !137, !138, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !131, file: !1, line: 519, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !135, line: 62, baseType: !136)
!135 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!136 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !1, line: 520, baseType: !53, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !1, line: 521, baseType: !42, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !1, line: 522, baseType: !45, size: 64, align: 64, offset: 192)
!140 = !{!141}
!141 = !DISubrange(count: 137)
!142 = !DIGlobalVariable(name: "DaysInMonth", scope: !115, file: !1, line: 694, type: !143, isLocal: true, isDefinition: true, variable: [12 x i32]* @Convert.DaysInMonth)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 384, align: 32, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 12)
!146 = !{i32 2, !"Dwarf Version", i32 4}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!149 = !DILocalVariable(name: "now", arg: 1, scope: !50, file: !1, line: 897, type: !45)
!150 = !DIExpression()
!151 = !DILocation(line: 897, column: 27, scope: !50)
!152 = !DILocalVariable(name: "p", arg: 2, scope: !50, file: !1, line: 897, type: !53)
!153 = !DILocation(line: 897, column: 44, scope: !50)
!154 = !DILocalVariable(name: "tokens", scope: !50, file: !1, line: 899, type: !155)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 32768, align: 64, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256)
!158 = !DILocation(line: 899, column: 15, scope: !50)
!159 = !DILocalVariable(name: "_gds", scope: !50, file: !1, line: 900, type: !83)
!160 = !DILocation(line: 900, column: 17, scope: !50)
!161 = !DILocalVariable(name: "lasttoken", scope: !50, file: !1, line: 901, type: !86)
!162 = !DILocation(line: 901, column: 16, scope: !50)
!163 = !DILocalVariable(name: "gds", scope: !50, file: !1, line: 902, type: !82)
!164 = !DILocation(line: 902, column: 18, scope: !50)
!165 = !DILocalVariable(name: "local", scope: !50, file: !1, line: 903, type: !61)
!166 = !DILocation(line: 903, column: 12, scope: !50)
!167 = !DILocalVariable(name: "tm", scope: !50, file: !1, line: 903, type: !60)
!168 = !DILocation(line: 903, column: 20, scope: !50)
!169 = !DILocalVariable(name: "gmt", scope: !50, file: !1, line: 904, type: !61)
!170 = !DILocation(line: 904, column: 12, scope: !50)
!171 = !DILocalVariable(name: "gmt_ptr", scope: !50, file: !1, line: 904, type: !60)
!172 = !DILocation(line: 904, column: 18, scope: !50)
!173 = !DILocalVariable(name: "Start", scope: !50, file: !1, line: 905, type: !45)
!174 = !DILocation(line: 905, column: 10, scope: !50)
!175 = !DILocalVariable(name: "tod", scope: !50, file: !1, line: 906, type: !45)
!176 = !DILocation(line: 906, column: 10, scope: !50)
!177 = !DILocalVariable(name: "tzone", scope: !50, file: !1, line: 907, type: !41)
!178 = !DILocation(line: 907, column: 8, scope: !50)
!179 = !DILocation(line: 910, column: 2, scope: !50)
!180 = !DILocation(line: 912, column: 2, scope: !50)
!181 = !DILocation(line: 913, column: 6, scope: !50)
!182 = !DILocation(line: 916, column: 2, scope: !50)
!183 = !DILocation(line: 917, column: 7, scope: !50)
!184 = !DILocation(line: 917, column: 5, scope: !50)
!185 = !DILocation(line: 918, column: 6, scope: !186)
!186 = distinct !DILexicalBlock(scope: !50, file: !1, line: 918, column: 6)
!187 = !DILocation(line: 918, column: 9, scope: !186)
!188 = !DILocation(line: 918, column: 6, scope: !50)
!189 = !DILocation(line: 919, column: 3, scope: !186)
!190 = !DILocation(line: 920, column: 11, scope: !50)
!191 = !DILocation(line: 920, column: 10, scope: !50)
!192 = !DILocation(line: 924, column: 2, scope: !50)
!193 = !DILocation(line: 925, column: 12, scope: !50)
!194 = !DILocation(line: 925, column: 10, scope: !50)
!195 = !DILocation(line: 926, column: 6, scope: !196)
!196 = distinct !DILexicalBlock(scope: !50, file: !1, line: 926, column: 6)
!197 = !DILocation(line: 926, column: 14, scope: !196)
!198 = !DILocation(line: 926, column: 6, scope: !50)
!199 = !DILocation(line: 928, column: 10, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !1, line: 926, column: 23)
!201 = !DILocation(line: 928, column: 9, scope: !200)
!202 = !DILocation(line: 929, column: 2, scope: !200)
!203 = !DILocation(line: 930, column: 6, scope: !204)
