; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_disk_posix.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_entry = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !42, subprograms: !333, globals: !449)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_disk_posix.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 80, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/statvfs.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "ST_RDONLY", value: 1)
!7 = !DIEnumerator(name: "ST_NOSUID", value: 2)
!8 = !DIEnumerator(name: "ST_NODEV", value: 4)
!9 = !DIEnumerator(name: "ST_NOEXEC", value: 8)
!10 = !DIEnumerator(name: "ST_SYNCHRONOUS", value: 16)
!11 = !DIEnumerator(name: "ST_MANDLOCK", value: 64)
!12 = !DIEnumerator(name: "ST_WRITE", value: 128)
!13 = !DIEnumerator(name: "ST_APPEND", value: 256)
!14 = !DIEnumerator(name: "ST_IMMUTABLE", value: 512)
!15 = !DIEnumerator(name: "ST_NOATIME", value: 1024)
!16 = !DIEnumerator(name: "ST_NODIRATIME", value: 2048)
!17 = !DIEnumerator(name: "ST_RELATIME", value: 4096)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 24, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!21 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!22 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!23 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!24 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!25 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!26 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!27 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!28 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!29 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!30 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!31 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!32 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!33 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!34 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!35 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!36 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!37 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!38 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!39 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!40 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!41 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!42 = !{!43, !311, !91, !331, !332, !182, !270}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_disk", file: !45, line: 39, size: 2432, align: 64, elements: !46)
!45 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_disk_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!46 = !{!47, !149, !150, !151, !152, !297, !301, !305, !306, !307, !312, !316, !317, !318, !319, !320, !324, !325, !326, !330}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !44, file: !45, line: 40, baseType: !48, size: 1280, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !49, line: 89, size: 1280, align: 64, elements: !50)
!49 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!50 = !{!51, !53, !54, !122, !123, !124, !125, !126, !127, !128, !129, !137, !138, !139, !140, !143, !144, !145, !146, !147, !148}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !48, file: !49, line: 96, baseType: !52, size: 32, align: 32)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !48, file: !49, line: 97, baseType: !52, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !48, file: !49, line: 103, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !49, line: 63, size: 832, align: 64, elements: !57)
!57 = !{!58, !64, !65, !72, !73, !87, !93, !98, !99, !106, !107, !111, !115}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !56, file: !49, line: 64, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !63}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !56, file: !49, line: 65, baseType: !59, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !56, file: !49, line: 66, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!62, !63, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !71, line: 180, flags: DIFlagFwdDecl)
!71 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !56, file: !49, line: 68, baseType: !59, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !56, file: !49, line: 69, baseType: !74, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !63, !82, !84}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !78, line: 109, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !80, line: 172, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!81 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 62, baseType: !86)
!85 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!86 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !56, file: !49, line: 71, baseType: !88, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!77, !63, !82, !84, !91}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !92, line: 40, baseType: !81)
!92 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !56, file: !49, line: 74, baseType: !94, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!62, !63, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !56, file: !49, line: 76, baseType: !66, size: 64, align: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !56, file: !49, line: 78, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!62, !63, !103, !104, !105}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !56, file: !49, line: 81, baseType: !59, size: 64, align: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !56, file: !49, line: 82, baseType: !108, size: 64, align: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!91, !63, !62}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !56, file: !49, line: 83, baseType: !112, size: 64, align: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!62, !63, !62}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !56, file: !49, line: 84, baseType: !116, size: 64, align: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !63, !62}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !48, file: !49, line: 105, baseType: !62, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !48, file: !49, line: 106, baseType: !119, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !48, file: !49, line: 108, baseType: !62, size: 32, align: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !48, file: !49, line: 109, baseType: !119, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !48, file: !49, line: 112, baseType: !62, size: 32, align: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !48, file: !49, line: 114, baseType: !62, size: 32, align: 32, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !48, file: !49, line: 115, baseType: !119, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !48, file: !49, line: 116, baseType: !130, size: 192, align: 64, offset: 512)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !131, line: 58, size: 192, align: 64, elements: !132)
!131 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!132 = !{!133, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !130, file: !131, line: 59, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !130, file: !131, line: 60, baseType: !84, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !130, file: !131, line: 61, baseType: !84, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !48, file: !49, line: 118, baseType: !134, size: 64, align: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !48, file: !49, line: 119, baseType: !52, size: 32, align: 32, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !48, file: !49, line: 120, baseType: !52, size: 32, align: 32, offset: 800)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !48, file: !49, line: 121, baseType: !141, size: 64, align: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !131, line: 70, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !48, file: !49, line: 127, baseType: !119, size: 64, align: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !48, file: !49, line: 128, baseType: !91, size: 64, align: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !48, file: !49, line: 129, baseType: !91, size: 64, align: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !48, file: !49, line: 130, baseType: !84, size: 64, align: 64, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !48, file: !49, line: 137, baseType: !121, size: 8, align: 8, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !48, file: !49, line: 138, baseType: !84, size: 64, align: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !44, file: !45, line: 43, baseType: !69, size: 64, align: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "symlink_mode", scope: !44, file: !45, line: 51, baseType: !121, size: 8, align: 8, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "follow_symlinks", scope: !44, file: !45, line: 58, baseType: !121, size: 8, align: 8, offset: 1352)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !44, file: !45, line: 61, baseType: !153, size: 64, align: 64, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "tree", file: !1, line: 197, size: 4608, align: 64, elements: !155)
!155 = !{!156, !185, !186, !191, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !254, !255, !256, !257, !258, !264, !265, !266, !267, !268, !269, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !154, file: !1, line: 198, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "tree_entry", file: !1, line: 147, size: 1088, align: 64, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !158, file: !1, line: 148, baseType: !62, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !1, line: 149, baseType: !157, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !158, file: !1, line: 150, baseType: !157, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !1, line: 151, baseType: !130, size: 192, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dirname_length", scope: !158, file: !1, line: 152, baseType: !84, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !158, file: !1, line: 153, baseType: !91, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !158, file: !1, line: 154, baseType: !91, size: 64, align: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !158, file: !1, line: 155, baseType: !62, size: 32, align: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_id", scope: !158, file: !1, line: 156, baseType: !62, size: 32, align: 32, offset: 608)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "symlink_parent_fd", scope: !158, file: !1, line: 158, baseType: !62, size: 32, align: 32, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "restore_time", scope: !158, file: !1, line: 160, baseType: !171, size: 384, align: 64, offset: 704)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "restore_time", file: !1, line: 137, size: 384, align: 64, elements: !172)
!172 = !{!173, !174, !178, !179, !180, !181, !184}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !1, line: 138, baseType: !119, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !171, file: !1, line: 139, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !176, line: 75, baseType: !177)
!176 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !80, line: 139, baseType: !81)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mtime_nsec", scope: !171, file: !1, line: 140, baseType: !81, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !171, file: !1, line: 141, baseType: !175, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "atime_nsec", scope: !171, file: !1, line: 142, baseType: !81, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !171, file: !1, line: 143, baseType: !182, size: 32, align: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !78, line: 70, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !80, line: 129, baseType: !52)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "noatime", scope: !171, file: !1, line: 144, baseType: !62, size: 32, align: 32, offset: 352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !154, file: !1, line: 199, baseType: !157, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !154, file: !1, line: 200, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !189, line: 127, baseType: !190)
!189 = !DIFile(filename: "/usr/include/dirent.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !189, line: 127, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "de", scope: !154, file: !1, line: 202, baseType: !192, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !194, line: 22, size: 2240, align: 64, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!195 = !{!196, !198, !200, !202, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !193, file: !194, line: 25, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !80, line: 127, baseType: !86)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !193, file: !194, line: 26, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 131, baseType: !81)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !193, file: !194, line: 31, baseType: !201, size: 16, align: 16, offset: 128)
!201 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !193, file: !194, line: 32, baseType: !203, size: 8, align: 8, offset: 144)
!203 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !193, file: !194, line: 33, baseType: !205, size: 2048, align: 8, offset: 152)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2048, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dirent", scope: !154, file: !1, line: 204, baseType: !192, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dirent_allocated", scope: !154, file: !1, line: 205, baseType: !84, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !1, line: 207, baseType: !62, size: 32, align: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "visit_type", scope: !154, file: !1, line: 208, baseType: !62, size: 32, align: 32, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tree_errno", scope: !154, file: !1, line: 210, baseType: !62, size: 32, align: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !154, file: !1, line: 213, baseType: !130, size: 192, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !154, file: !1, line: 216, baseType: !119, size: 64, align: 64, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dirname_length", scope: !154, file: !1, line: 218, baseType: !84, size: 64, align: 64, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !154, file: !1, line: 220, baseType: !62, size: 32, align: 32, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "openCount", scope: !154, file: !1, line: 221, baseType: !62, size: 32, align: 32, offset: 864)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "maxOpenCount", scope: !154, file: !1, line: 222, baseType: !62, size: 32, align: 32, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "initial_dir_fd", scope: !154, file: !1, line: 223, baseType: !62, size: 32, align: 32, offset: 928)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "working_dir_fd", scope: !154, file: !1, line: 224, baseType: !62, size: 32, align: 32, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !154, file: !1, line: 226, baseType: !222, size: 1152, align: 64, offset: 1024)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !223, line: 46, size: 1152, align: 64, elements: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!224 = !{!225, !227, !228, !230, !231, !233, !235, !236, !237, !238, !240, !242, !248, !249, !250}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !222, file: !223, line: 48, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !80, line: 124, baseType: !86)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !222, file: !223, line: 53, baseType: !197, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !222, file: !223, line: 61, baseType: !229, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !80, line: 130, baseType: !86)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !222, file: !223, line: 62, baseType: !183, size: 32, align: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !222, file: !223, line: 64, baseType: !232, size: 32, align: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !80, line: 125, baseType: !52)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !222, file: !223, line: 65, baseType: !234, size: 32, align: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !80, line: 126, baseType: !52)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !222, file: !223, line: 67, baseType: !62, size: 32, align: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !222, file: !223, line: 69, baseType: !226, size: 64, align: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !222, file: !223, line: 74, baseType: !199, size: 64, align: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !222, file: !223, line: 78, baseType: !239, size: 64, align: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !80, line: 153, baseType: !81)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !222, file: !223, line: 80, baseType: !241, size: 64, align: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !80, line: 158, baseType: !81)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !222, file: !223, line: 91, baseType: !243, size: 128, align: 64, offset: 576)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !176, line: 120, size: 128, align: 64, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !243, file: !176, line: 122, baseType: !177, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !243, file: !176, line: 123, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !80, line: 175, baseType: !81)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !222, file: !223, line: 92, baseType: !243, size: 128, align: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !222, file: !223, line: 93, baseType: !243, size: 128, align: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !222, file: !223, line: 106, baseType: !251, size: 192, align: 64, offset: 960)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 192, align: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 3)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !154, file: !1, line: 227, baseType: !222, size: 1152, align: 64, offset: 2176)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "descend", scope: !154, file: !1, line: 228, baseType: !62, size: 32, align: 32, offset: 3328)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !154, file: !1, line: 229, baseType: !62, size: 32, align: 32, offset: 3360)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "restore_time", scope: !154, file: !1, line: 231, baseType: !171, size: 384, align: 64, offset: 3392)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_list", scope: !154, file: !1, line: 236, baseType: !259, size: 64, align: 64, offset: 3776)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "entry_sparse", file: !1, line: 233, size: 128, align: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !260, file: !1, line: 234, baseType: !91, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !260, file: !1, line: 235, baseType: !91, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "current_sparse", scope: !154, file: !1, line: 236, baseType: !259, size: 64, align: 64, offset: 3840)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_count", scope: !154, file: !1, line: 237, baseType: !62, size: 32, align: 32, offset: 3904)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_list_size", scope: !154, file: !1, line: 238, baseType: !62, size: 32, align: 32, offset: 3936)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "initial_symlink_mode", scope: !154, file: !1, line: 240, baseType: !121, size: 8, align: 8, offset: 3968)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "symlink_mode", scope: !154, file: !1, line: 241, baseType: !121, size: 8, align: 8, offset: 3976)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "current_filesystem", scope: !154, file: !1, line: 242, baseType: !270, size: 64, align: 64, offset: 4032)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "filesystem", file: !1, line: 163, size: 704, align: 64, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !284, !285}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !271, file: !1, line: 164, baseType: !91, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "synthetic", scope: !271, file: !1, line: 165, baseType: !62, size: 32, align: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !271, file: !1, line: 166, baseType: !62, size: 32, align: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "noatime", scope: !271, file: !1, line: 167, baseType: !62, size: 32, align: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !271, file: !1, line: 169, baseType: !84, size: 64, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "incr_xfer_size", scope: !271, file: !1, line: 171, baseType: !81, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "max_xfer_size", scope: !271, file: !1, line: 172, baseType: !81, size: 64, align: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "min_xfer_size", scope: !271, file: !1, line: 173, baseType: !81, size: 64, align: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_align", scope: !271, file: !1, line: 174, baseType: !81, size: 64, align: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_ptr", scope: !271, file: !1, line: 180, baseType: !283, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !271, file: !1, line: 182, baseType: !283, size: 64, align: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "buff_size", scope: !271, file: !1, line: 183, baseType: !84, size: 64, align: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "filesystem_table", scope: !154, file: !1, line: 243, baseType: !270, size: 64, align: 64, offset: 4096)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "initial_filesystem_id", scope: !154, file: !1, line: 244, baseType: !62, size: 32, align: 32, offset: 4160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "current_filesystem_id", scope: !154, file: !1, line: 245, baseType: !62, size: 32, align: 32, offset: 4192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "max_filesystem_id", scope: !154, file: !1, line: 246, baseType: !62, size: 32, align: 32, offset: 4224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_filesystem", scope: !154, file: !1, line: 247, baseType: !62, size: 32, align: 32, offset: 4256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "entry_fd", scope: !154, file: !1, line: 249, baseType: !62, size: 32, align: 32, offset: 4288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "entry_eof", scope: !154, file: !1, line: 250, baseType: !62, size: 32, align: 32, offset: 4320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "entry_remaining_bytes", scope: !154, file: !1, line: 251, baseType: !91, size: 64, align: 64, offset: 4352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "entry_total", scope: !154, file: !1, line: 252, baseType: !91, size: 64, align: 64, offset: 4416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "entry_buff", scope: !154, file: !1, line: 253, baseType: !283, size: 64, align: 64, offset: 4480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "entry_buff_size", scope: !154, file: !1, line: 254, baseType: !84, size: 64, align: 64, offset: 4544)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "open_on_current_dir", scope: !44, file: !45, line: 62, baseType: !298, size: 64, align: 64, offset: 1472)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!62, !153, !119, !62}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tree_current_dir_fd", scope: !44, file: !45, line: 63, baseType: !302, size: 64, align: 64, offset: 1536)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!62, !153}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tree_enter_working_dir", scope: !44, file: !45, line: 64, baseType: !302, size: 64, align: 64, offset: 1600)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !45, line: 67, baseType: !62, size: 32, align: 32, offset: 1664)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_gname", scope: !44, file: !45, line: 69, baseType: !308, size: 64, align: 64, offset: 1728)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!119, !311, !91}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_gname", scope: !44, file: !45, line: 70, baseType: !313, size: 64, align: 64, offset: 1792)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !311}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_gname_data", scope: !44, file: !45, line: 71, baseType: !311, size: 64, align: 64, offset: 1856)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_uname", scope: !44, file: !45, line: 72, baseType: !308, size: 64, align: 64, offset: 1920)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_uname", scope: !44, file: !45, line: 73, baseType: !313, size: 64, align: 64, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_uname_data", scope: !44, file: !45, line: 74, baseType: !311, size: 64, align: 64, offset: 2048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_filter_func", scope: !44, file: !45, line: 76, baseType: !321, size: 64, align: 64, offset: 2112)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!62, !63, !311, !69}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_filter_data", scope: !44, file: !45, line: 78, baseType: !311, size: 64, align: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "matching", scope: !44, file: !45, line: 81, baseType: !63, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_cb_func", scope: !44, file: !45, line: 84, baseType: !327, size: 64, align: 64, offset: 2304)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !63, !311, !69}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_cb_data", scope: !44, file: !45, line: 86, baseType: !311, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !78, line: 86, baseType: !199)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !92, line: 122, baseType: !86)
!333 = !{!334, !338, !339, !342, !343, !346, !347, !348, !349, !350, !351, !354, !357, !358, !359, !362, !368, !369, !370, !371, !374, !375, !378, !379, !380, !384, !385, !386, !389, !390, !391, !394, !395, !396, !399, !400, !401, !404, !407, !408, !409, !414, !415, !418, !421, !422, !423, !426, !429, !432, !433, !434, !435, !438, !441, !442, !445, !446, !447, !448}
!334 = distinct !DISubprogram(name: "archive_read_disk_gname", scope: !1, file: !1, line: 390, type: !335, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!119, !63, !91}
!337 = !{}
!338 = distinct !DISubprogram(name: "archive_read_disk_uname", scope: !1, file: !1, line: 402, type: !335, isLocal: false, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!339 = distinct !DISubprogram(name: "archive_read_disk_set_gname_lookup", scope: !1, file: !1, line: 414, type: !340, isLocal: false, isDefinition: true, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!340 = !DISubroutineType(types: !341)
!341 = !{!62, !63, !311, !308, !313}
!342 = distinct !DISubprogram(name: "archive_read_disk_set_uname_lookup", scope: !1, file: !1, line: 433, type: !340, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!343 = distinct !DISubprogram(name: "archive_read_disk_new", scope: !1, file: !1, line: 455, type: !344, isLocal: false, isDefinition: true, scopeLine: 456, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!344 = !DISubroutineType(types: !345)
!345 = !{!63}
!346 = distinct !DISubprogram(name: "archive_read_disk_set_symlink_logical", scope: !1, file: !1, line: 533, type: !60, isLocal: false, isDefinition: true, scopeLine: 534, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!347 = distinct !DISubprogram(name: "archive_read_disk_set_symlink_physical", scope: !1, file: !1, line: 543, type: !60, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!348 = distinct !DISubprogram(name: "archive_read_disk_set_symlink_hybrid", scope: !1, file: !1, line: 553, type: !60, isLocal: false, isDefinition: true, scopeLine: 554, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!349 = distinct !DISubprogram(name: "archive_read_disk_set_atime_restored", scope: !1, file: !1, line: 563, type: !60, isLocal: false, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!350 = distinct !DISubprogram(name: "archive_read_disk_set_behavior", scope: !1, file: !1, line: 583, type: !113, isLocal: false, isDefinition: true, scopeLine: 584, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!351 = distinct !DISubprogram(name: "archive_read_disk_set_matching", scope: !1, file: !1, line: 1211, type: !352, isLocal: false, isDefinition: true, scopeLine: 1214, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!352 = !DISubroutineType(types: !353)
!353 = !{!62, !63, !63, !327, !311}
!354 = distinct !DISubprogram(name: "archive_read_disk_set_metadata_filter_callback", scope: !1, file: !1, line: 1225, type: !355, isLocal: false, isDefinition: true, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!355 = !DISubroutineType(types: !356)
!356 = !{!62, !63, !321, !311}
!357 = distinct !DISubprogram(name: "archive_read_disk_can_descend", scope: !1, file: !1, line: 1240, type: !60, isLocal: false, isDefinition: true, scopeLine: 1241, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!358 = distinct !DISubprogram(name: "archive_read_disk_descend", scope: !1, file: !1, line: 1257, type: !60, isLocal: false, isDefinition: true, scopeLine: 1258, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!359 = distinct !DISubprogram(name: "archive_read_disk_open", scope: !1, file: !1, line: 1283, type: !360, isLocal: false, isDefinition: true, scopeLine: 1284, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!360 = !DISubroutineType(types: !361)
!361 = !{!62, !63, !119}
!362 = distinct !DISubprogram(name: "archive_read_disk_open_w", scope: !1, file: !1, line: 1296, type: !363, isLocal: false, isDefinition: true, scopeLine: 1297, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!363 = !DISubroutineType(types: !364)
!364 = !{!62, !63, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !85, line: 90, baseType: !62)
!368 = distinct !DISubprogram(name: "archive_read_disk_current_filesystem", scope: !1, file: !1, line: 1353, type: !60, isLocal: false, isDefinition: true, scopeLine: 1354, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!369 = distinct !DISubprogram(name: "archive_read_disk_current_filesystem_is_synthetic", scope: !1, file: !1, line: 1417, type: !60, isLocal: false, isDefinition: true, scopeLine: 1418, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!370 = distinct !DISubprogram(name: "archive_read_disk_current_filesystem_is_remote", scope: !1, file: !1, line: 1432, type: !60, isLocal: false, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!371 = distinct !DISubprogram(name: "archive_read_disk_vtable", scope: !1, file: !1, line: 373, type: !372, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!372 = !DISubroutineType(types: !373)
!373 = !{!55}
!374 = distinct !DISubprogram(name: "_archive_read_free", scope: !1, file: !1, line: 476, type: !60, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!375 = distinct !DISubprogram(name: "tree_free", scope: !1, file: !1, line: 2644, type: !376, isLocal: true, isDefinition: true, scopeLine: 2645, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !153}
!378 = distinct !DISubprogram(name: "_archive_read_close", scope: !1, file: !1, line: 505, type: !60, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!379 = distinct !DISubprogram(name: "tree_close", scope: !1, file: !1, line: 2610, type: !376, isLocal: true, isDefinition: true, scopeLine: 2611, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!380 = distinct !DISubprogram(name: "close_and_restore_time", scope: !1, file: !1, line: 1958, type: !381, isLocal: true, isDefinition: true, scopeLine: 1959, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!381 = !DISubroutineType(types: !382)
!382 = !{!62, !62, !153, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!384 = distinct !DISubprogram(name: "tree_pop", scope: !1, file: !1, line: 2270, type: !376, isLocal: true, isDefinition: true, scopeLine: 2271, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!385 = distinct !DISubprogram(name: "_archive_read_data_block", scope: !1, file: !1, line: 690, type: !101, isLocal: true, isDefinition: true, scopeLine: 692, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!386 = distinct !DISubprogram(name: "tree_current_access_path", scope: !1, file: !1, line: 2592, type: !387, isLocal: true, isDefinition: true, scopeLine: 2593, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!387 = !DISubroutineType(types: !388)
!388 = !{!119, !153}
!389 = distinct !DISubprogram(name: "tree_current_path", scope: !1, file: !1, line: 2601, type: !387, isLocal: true, isDefinition: true, scopeLine: 2602, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!390 = distinct !DISubprogram(name: "tree_enter_initial_dir", scope: !1, file: !1, line: 2223, type: !303, isLocal: true, isDefinition: true, scopeLine: 2224, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!391 = distinct !DISubprogram(name: "setup_suitable_read_buffer", scope: !1, file: !1, line: 628, type: !392, isLocal: true, isDefinition: true, scopeLine: 629, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!392 = !DISubroutineType(types: !393)
!393 = !{!62, !43}
!394 = distinct !DISubprogram(name: "_archive_read_next_header", scope: !1, file: !1, line: 1090, type: !95, isLocal: true, isDefinition: true, scopeLine: 1091, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!395 = distinct !DISubprogram(name: "_archive_read_next_header2", scope: !1, file: !1, line: 1101, type: !67, isLocal: true, isDefinition: true, scopeLine: 1102, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!396 = distinct !DISubprogram(name: "next_entry", scope: !1, file: !1, line: 853, type: !397, isLocal: true, isDefinition: true, scopeLine: 855, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!397 = !DISubroutineType(types: !398)
!398 = !{!62, !43, !153, !69}
!399 = distinct !DISubprogram(name: "tree_next", scope: !1, file: !1, line: 2292, type: !303, isLocal: true, isDefinition: true, scopeLine: 2293, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!400 = distinct !DISubprogram(name: "tree_dir_next_posix", scope: !1, file: !1, line: 2350, type: !303, isLocal: true, isDefinition: true, scopeLine: 2351, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!401 = distinct !DISubprogram(name: "tree_dup", scope: !1, file: !1, line: 2026, type: !402, isLocal: true, isDefinition: true, scopeLine: 2027, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!402 = !DISubroutineType(types: !403)
!403 = !{!62, !62}
!404 = distinct !DISubprogram(name: "tree_append", scope: !1, file: !1, line: 2085, type: !405, isLocal: true, isDefinition: true, scopeLine: 2086, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !153, !119, !84}
!407 = distinct !DISubprogram(name: "tree_descent", scope: !1, file: !1, line: 2152, type: !303, isLocal: true, isDefinition: true, scopeLine: 2153, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!408 = distinct !DISubprogram(name: "tree_ascend", scope: !1, file: !1, line: 2187, type: !303, isLocal: true, isDefinition: true, scopeLine: 2188, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!409 = distinct !DISubprogram(name: "tree_current_lstat", scope: !1, file: !1, line: 2465, type: !410, isLocal: true, isDefinition: true, scopeLine: 2466, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !153}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!414 = distinct !DISubprogram(name: "tree_current_stat", scope: !1, file: !1, line: 2444, type: !410, isLocal: true, isDefinition: true, scopeLine: 2445, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!415 = distinct !DISubprogram(name: "tree_target_is_same_as_parent", scope: !1, file: !1, line: 2560, type: !416, isLocal: true, isDefinition: true, scopeLine: 2561, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!416 = !DISubroutineType(types: !417)
!417 = !{!62, !153, !412}
!418 = distinct !DISubprogram(name: "update_current_filesystem", scope: !1, file: !1, line: 1364, type: !419, isLocal: true, isDefinition: true, scopeLine: 1365, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!419 = !DISubroutineType(types: !420)
!420 = !{!62, !43, !91}
!421 = distinct !DISubprogram(name: "setup_current_filesystem", scope: !1, file: !1, line: 1695, type: !392, isLocal: true, isDefinition: true, scopeLine: 1696, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!422 = distinct !DISubprogram(name: "tree_current_is_symblic_link_target", scope: !1, file: !1, line: 2577, type: !303, isLocal: true, isDefinition: true, scopeLine: 2578, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!423 = distinct !DISubprogram(name: "get_xfer_size", scope: !1, file: !1, line: 1445, type: !424, isLocal: true, isDefinition: true, scopeLine: 1446, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!424 = !DISubroutineType(types: !425)
!425 = !{!62, !153, !62, !119}
!426 = distinct !DISubprogram(name: "setup_sparse", scope: !1, file: !1, line: 1173, type: !427, isLocal: true, isDefinition: true, scopeLine: 1174, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!427 = !DISubroutineType(types: !428)
!428 = !{!62, !43, !69}
!429 = distinct !DISubprogram(name: "setup_symlink_mode", scope: !1, file: !1, line: 521, type: !430, isLocal: true, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !43, !121, !62}
!432 = distinct !DISubprogram(name: "trivial_lookup_gname", scope: !1, file: !1, line: 608, type: !309, isLocal: true, isDefinition: true, scopeLine: 609, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!433 = distinct !DISubprogram(name: "trivial_lookup_uname", scope: !1, file: !1, line: 616, type: !309, isLocal: true, isDefinition: true, scopeLine: 617, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!434 = distinct !DISubprogram(name: "_archive_read_disk_open", scope: !1, file: !1, line: 1327, type: !360, isLocal: true, isDefinition: true, scopeLine: 1328, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!435 = distinct !DISubprogram(name: "tree_reopen", scope: !1, file: !1, line: 2123, type: !436, isLocal: true, isDefinition: true, scopeLine: 2124, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!436 = !DISubroutineType(types: !437)
!437 = !{!153, !153, !119, !62}
!438 = distinct !DISubprogram(name: "tree_open", scope: !1, file: !1, line: 2110, type: !439, isLocal: true, isDefinition: true, scopeLine: 2111, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!439 = !DISubroutineType(types: !440)
!440 = !{!153, !119, !62, !62}
!441 = distinct !DISubprogram(name: "open_on_current_dir", scope: !1, file: !1, line: 2014, type: !299, isLocal: true, isDefinition: true, scopeLine: 2015, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!442 = distinct !DISubprogram(name: "tree_push", scope: !1, file: !1, line: 2051, type: !443, isLocal: true, isDefinition: true, scopeLine: 2053, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !153, !119, !62, !91, !91, !383}
!445 = distinct !DISubprogram(name: "tree_enter_working_dir", scope: !1, file: !1, line: 2241, type: !303, isLocal: true, isDefinition: true, scopeLine: 2242, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!446 = distinct !DISubprogram(name: "tree_current_dir_fd", scope: !1, file: !1, line: 2261, type: !303, isLocal: true, isDefinition: true, scopeLine: 2262, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!447 = distinct !DISubprogram(name: "tree_current_is_dir", scope: !1, file: !1, line: 2487, type: !303, isLocal: true, isDefinition: true, scopeLine: 2488, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!448 = distinct !DISubprogram(name: "tree_current_is_physical_dir", scope: !1, file: !1, line: 2525, type: !303, isLocal: true, isDefinition: true, scopeLine: 2526, flags: DIFlagPrototyped, isOptimized: false, variables: !337)
!449 = !{!450, !451, !452, !454, !455}
!450 = !DIGlobalVariable(name: "av", scope: !371, file: !1, line: 375, type: !56, isLocal: true, isDefinition: true, variable: %struct.archive_vtable* @archive_read_disk_vtable.av)
!451 = !DIGlobalVariable(name: "inited", scope: !371, file: !1, line: 376, type: !62, isLocal: true, isDefinition: true, variable: i32* @archive_read_disk_vtable.inited)
!452 = !DIGlobalVariable(name: "can_dupfd_cloexec", scope: !401, file: !1, line: 2030, type: !453, isLocal: true, isDefinition: true, variable: i32* @tree_dup.can_dupfd_cloexec)
!453 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!454 = !DIGlobalVariable(name: "lst", scope: !422, file: !1, line: 2579, type: !412, isLocal: true, isDefinition: true, variable: %struct.stat** @tree_current_is_symblic_link_target.lst)
!455 = !DIGlobalVariable(name: "st", scope: !422, file: !1, line: 2579, type: !412, isLocal: true, isDefinition: true, variable: %struct.stat** @tree_current_is_symblic_link_target.st)
!456 = !{i32 2, !"Dwarf Version", i32 4}
!457 = !{i32 2, !"Debug Info Version", i32 3}
!458 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!459 = !DILocalVariable(name: "_a", arg: 1, scope: !334, file: !1, line: 390, type: !63)
!460 = !DIExpression()
!461 = !DILocation(line: 390, column: 41, scope: !334)
!462 = !DILocalVariable(name: "gid", arg: 2, scope: !334, file: !1, line: 390, type: !91)
!463 = !DILocation(line: 390, column: 53, scope: !334)
!464 = !DILocalVariable(name: "a", scope: !334, file: !1, line: 392, type: !43)
!465 = !DILocation(line: 392, column: 28, scope: !334)
!466 = !DILocation(line: 392, column: 60, scope: !334)
!467 = !DILocation(line: 392, column: 32, scope: !334)
!468 = !DILocation(line: 393, column: 42, scope: !469)
!469 = distinct !DILexicalBlock(scope: !334, file: !1, line: 393, column: 6)
!470 = !DILocation(line: 393, column: 20, scope: !469)
!471 = !DILocation(line: 393, column: 17, scope: !469)
!472 = !DILocation(line: 393, column: 6, scope: !334)
!473 = !DILocation(line: 395, column: 3, scope: !469)
!474 = !DILocation(line: 396, column: 6, scope: !475)
!475 = distinct !DILexicalBlock(scope: !334, file: !1, line: 396, column: 6)
!476 = !DILocation(line: 396, column: 9, scope: !475)
!477 = !DILocation(line: 396, column: 22, scope: !475)
!478 = !DILocation(line: 396, column: 6, scope: !334)
!479 = !DILocation(line: 397, column: 3, scope: !475)
!480 = !DILocation(line: 398, column: 12, scope: !334)
!481 = !DILocation(line: 398, column: 15, scope: !334)
!482 = !DILocation(line: 398, column: 29, scope: !334)
!483 = !DILocation(line: 398, column: 32, scope: !334)
!484 = !DILocation(line: 398, column: 51, scope: !334)
!485 = !DILocation(line: 398, column: 10, scope: !334)
!486 = !DILocation(line: 398, column: 2, scope: !334)
!487 = !DILocation(line: 399, column: 1, scope: !334)
!488 = !DILocalVariable(name: "_a", arg: 1, scope: !338, file: !1, line: 402, type: !63)
!489 = !DILocation(line: 402, column: 41, scope: !338)
!490 = !DILocalVariable(name: "uid", arg: 2, scope: !338, file: !1, line: 402, type: !91)
!491 = !DILocation(line: 402, column: 53, scope: !338)
!492 = !DILocalVariable(name: "a", scope: !338, file: !1, line: 404, type: !43)
!493 = !DILocation(line: 404, column: 28, scope: !338)
!494 = !DILocation(line: 404, column: 60, scope: !338)
!495 = !DILocation(line: 404, column: 32, scope: !338)
!496 = !DILocation(line: 405, column: 42, scope: !497)
!497 = distinct !DILexicalBlock(scope: !338, file: !1, line: 405, column: 6)
!498 = !DILocation(line: 405, column: 20, scope: !497)
!499 = !DILocation(line: 405, column: 17, scope: !497)
!500 = !DILocation(line: 405, column: 6, scope: !338)
!501 = !DILocation(line: 407, column: 3, scope: !497)
!502 = !DILocation(line: 408, column: 6, scope: !503)
!503 = distinct !DILexicalBlock(scope: !338, file: !1, line: 408, column: 6)
!504 = !DILocation(line: 408, column: 9, scope: !503)
!505 = !DILocation(line: 408, column: 22, scope: !503)
!506 = !DILocation(line: 408, column: 6, scope: !338)
!507 = !DILocation(line: 409, column: 3, scope: !503)
!508 = !DILocation(line: 410, column: 12, scope: !338)
!509 = !DILocation(line: 410, column: 15, scope: !338)
!510 = !DILocation(line: 410, column: 29, scope: !338)
!511 = !DILocation(line: 410, column: 32, scope: !338)
!512 = !DILocation(line: 410, column: 51, scope: !338)
!513 = !DILocation(line: 410, column: 10, scope: !338)
!514 = !DILocation(line: 410, column: 2, scope: !338)
!515 = !DILocation(line: 411, column: 1, scope: !338)
!516 = !DILocalVariable(name: "_a", arg: 1, scope: !339, file: !1, line: 414, type: !63)
!517 = !DILocation(line: 414, column: 52, scope: !339)
!518 = !DILocalVariable(name: "private_data", arg: 2, scope: !339, file: !1, line: 415, type: !311)
!519 = !DILocation(line: 415, column: 11, scope: !339)
!520 = !DILocalVariable(name: "lookup_gname", arg: 3, scope: !339, file: !1, line: 416, type: !308)
!521 = !DILocation(line: 416, column: 20, scope: !339)
!522 = !DILocalVariable(name: "cleanup_gname", arg: 4, scope: !339, file: !1, line: 417, type: !313)
!523 = !DILocation(line: 417, column: 12, scope: !339)
!524 = !DILocalVariable(name: "a", scope: !339, file: !1, line: 419, type: !43)
!525 = !DILocation(line: 419, column: 28, scope: !339)
!526 = !DILocation(line: 419, column: 60, scope: !339)
!527 = !DILocation(line: 419, column: 32, scope: !339)
!528 = !DILocation(line: 420, column: 2, scope: !339)
!529 = !DILocalVariable(name: "magic_test", scope: !530, file: !1, line: 420, type: !62)
!530 = distinct !DILexicalBlock(scope: !339, file: !1, line: 420, column: 2)
!531 = !DILocation(line: 420, column: 2, scope: !530)
!532 = !DILocation(line: 420, column: 2, scope: !533)
!533 = !DILexicalBlockFile(scope: !530, file: !1, discriminator: 1)
!534 = !DILocation(line: 420, column: 2, scope: !535)
!535 = !DILexicalBlockFile(scope: !536, file: !1, discriminator: 2)
!536 = distinct !DILexicalBlock(scope: !530, file: !1, line: 420, column: 2)
!537 = !DILocation(line: 420, column: 2, scope: !538)
!538 = !DILexicalBlockFile(scope: !530, file: !1, discriminator: 3)
!539 = !DILocation(line: 423, column: 6, scope: !540)
!540 = distinct !DILexicalBlock(scope: !339, file: !1, line: 423, column: 6)
!541 = !DILocation(line: 423, column: 9, scope: !540)
!542 = !DILocation(line: 423, column: 23, scope: !540)
!543 = !DILocation(line: 423, column: 31, scope: !540)
!544 = !DILocation(line: 423, column: 34, scope: !545)
!545 = !DILexicalBlockFile(scope: !540, file: !1, discriminator: 1)
!546 = !DILocation(line: 423, column: 37, scope: !545)
!547 = !DILocation(line: 423, column: 55, scope: !545)
!548 = !DILocation(line: 423, column: 6, scope: !545)
!549 = !DILocation(line: 424, column: 4, scope: !540)
!550 = !DILocation(line: 424, column: 7, scope: !540)
!551 = !DILocation(line: 424, column: 22, scope: !540)
!552 = !DILocation(line: 424, column: 25, scope: !540)
!553 = !DILocation(line: 424, column: 3, scope: !540)
!554 = !DILocation(line: 426, column: 20, scope: !339)
!555 = !DILocation(line: 426, column: 2, scope: !339)
!556 = !DILocation(line: 426, column: 5, scope: !339)
!557 = !DILocation(line: 426, column: 18, scope: !339)
!558 = !DILocation(line: 427, column: 21, scope: !339)
!559 = !DILocation(line: 427, column: 2, scope: !339)
!560 = !DILocation(line: 427, column: 5, scope: !339)
!561 = !DILocation(line: 427, column: 19, scope: !339)
!562 = !DILocation(line: 428, column: 25, scope: !339)
!563 = !DILocation(line: 428, column: 2, scope: !339)
!564 = !DILocation(line: 428, column: 5, scope: !339)
!565 = !DILocation(line: 428, column: 23, scope: !339)
!566 = !DILocation(line: 429, column: 2, scope: !339)
!567 = !DILocation(line: 430, column: 1, scope: !339)
!568 = !DILocalVariable(name: "_a", arg: 1, scope: !342, file: !1, line: 433, type: !63)
!569 = !DILocation(line: 433, column: 52, scope: !342)
!570 = !DILocalVariable(name: "private_data", arg: 2, scope: !342, file: !1, line: 434, type: !311)
!571 = !DILocation(line: 434, column: 11, scope: !342)
!572 = !DILocalVariable(name: "lookup_uname", arg: 3, scope: !342, file: !1, line: 435, type: !308)
!573 = !DILocation(line: 435, column: 20, scope: !342)
!574 = !DILocalVariable(name: "cleanup_uname", arg: 4, scope: !342, file: !1, line: 436, type: !313)
!575 = !DILocation(line: 436, column: 12, scope: !342)
!576 = !DILocalVariable(name: "a", scope: !342, file: !1, line: 438, type: !43)
!577 = !DILocation(line: 438, column: 28, scope: !342)
!578 = !DILocation(line: 438, column: 60, scope: !342)
!579 = !DILocation(line: 438, column: 32, scope: !342)
!580 = !DILocation(line: 439, column: 2, scope: !342)
!581 = !DILocalVariable(name: "magic_test", scope: !582, file: !1, line: 439, type: !62)
!582 = distinct !DILexicalBlock(scope: !342, file: !1, line: 439, column: 2)
!583 = !DILocation(line: 439, column: 2, scope: !582)
!584 = !DILocation(line: 439, column: 2, scope: !585)
!585 = !DILexicalBlockFile(scope: !582, file: !1, discriminator: 1)
!586 = !DILocation(line: 439, column: 2, scope: !587)
!587 = !DILexicalBlockFile(scope: !588, file: !1, discriminator: 2)
!588 = distinct !DILexicalBlock(scope: !582, file: !1, line: 439, column: 2)
!589 = !DILocation(line: 439, column: 2, scope: !590)
!590 = !DILexicalBlockFile(scope: !582, file: !1, discriminator: 3)
!591 = !DILocation(line: 442, column: 6, scope: !592)
!592 = distinct !DILexicalBlock(scope: !342, file: !1, line: 442, column: 6)
!593 = !DILocation(line: 442, column: 9, scope: !592)
!594 = !DILocation(line: 442, column: 23, scope: !592)
!595 = !DILocation(line: 442, column: 31, scope: !592)
!596 = !DILocation(line: 442, column: 34, scope: !597)
!597 = !DILexicalBlockFile(scope: !592, file: !1, discriminator: 1)
!598 = !DILocation(line: 442, column: 37, scope: !597)
!599 = !DILocation(line: 442, column: 55, scope: !597)
!600 = !DILocation(line: 442, column: 6, scope: !597)
!601 = !DILocation(line: 443, column: 4, scope: !592)
!602 = !DILocation(line: 443, column: 7, scope: !592)
!603 = !DILocation(line: 443, column: 22, scope: !592)
!604 = !DILocation(line: 443, column: 25, scope: !592)
!605 = !DILocation(line: 443, column: 3, scope: !592)
!606 = !DILocation(line: 445, column: 20, scope: !342)
!607 = !DILocation(line: 445, column: 2, scope: !342)
!608 = !DILocation(line: 445, column: 5, scope: !342)
!609 = !DILocation(line: 445, column: 18, scope: !342)
!610 = !DILocation(line: 446, column: 21, scope: !342)
!611 = !DILocation(line: 446, column: 2, scope: !342)
!612 = !DILocation(line: 446, column: 5, scope: !342)
!613 = !DILocation(line: 446, column: 19, scope: !342)
!614 = !DILocation(line: 447, column: 25, scope: !342)
!615 = !DILocation(line: 447, column: 2, scope: !342)
!616 = !DILocation(line: 447, column: 5, scope: !342)
!617 = !DILocation(line: 447, column: 23, scope: !342)
!618 = !DILocation(line: 448, column: 2, scope: !342)
!619 = !DILocation(line: 449, column: 1, scope: !342)
!620 = !DILocalVariable(name: "a", scope: !343, file: !1, line: 457, type: !43)
!621 = !DILocation(line: 457, column: 28, scope: !343)
!622 = !DILocation(line: 459, column: 34, scope: !343)
!623 = !DILocation(line: 459, column: 6, scope: !343)
!624 = !DILocation(line: 459, column: 4, scope: !343)
!625 = !DILocation(line: 460, column: 6, scope: !626)
!626 = distinct !DILexicalBlock(scope: !343, file: !1, line: 460, column: 6)
!627 = !DILocation(line: 460, column: 8, scope: !626)
!628 = !DILocation(line: 460, column: 6, scope: !343)
!629 = !DILocation(line: 461, column: 3, scope: !626)
!630 = !DILocation(line: 462, column: 2, scope: !343)
!631 = !DILocation(line: 462, column: 5, scope: !343)
!632 = !DILocation(line: 462, column: 13, scope: !343)
!633 = !DILocation(line: 462, column: 19, scope: !343)
!634 = !DILocation(line: 463, column: 2, scope: !343)
!635 = !DILocation(line: 463, column: 5, scope: !343)
!636 = !DILocation(line: 463, column: 13, scope: !343)
!637 = !DILocation(line: 463, column: 19, scope: !343)
!638 = !DILocation(line: 464, column: 22, scope: !343)
!639 = !DILocation(line: 464, column: 2, scope: !343)
!640 = !DILocation(line: 464, column: 5, scope: !343)
!641 = !DILocation(line: 464, column: 13, scope: !343)
!642 = !DILocation(line: 464, column: 20, scope: !343)
!643 = !DILocation(line: 465, column: 33, scope: !343)
!644 = !DILocation(line: 465, column: 36, scope: !343)
!645 = !DILocation(line: 465, column: 13, scope: !343)
!646 = !DILocation(line: 465, column: 2, scope: !343)
!647 = !DILocation(line: 465, column: 5, scope: !343)
!648 = !DILocation(line: 465, column: 11, scope: !343)
!649 = !DILocation(line: 466, column: 2, scope: !343)
!650 = !DILocation(line: 466, column: 5, scope: !343)
!651 = !DILocation(line: 466, column: 18, scope: !343)
!652 = !DILocation(line: 467, column: 2, scope: !343)
!653 = !DILocation(line: 467, column: 5, scope: !343)
!654 = !DILocation(line: 467, column: 18, scope: !343)
!655 = !DILocation(line: 468, column: 2, scope: !343)
!656 = !DILocation(line: 468, column: 5, scope: !343)
!657 = !DILocation(line: 468, column: 11, scope: !343)
!658 = !DILocation(line: 469, column: 2, scope: !343)
!659 = !DILocation(line: 469, column: 5, scope: !343)
!660 = !DILocation(line: 469, column: 25, scope: !343)
!661 = !DILocation(line: 470, column: 2, scope: !343)
!662 = !DILocation(line: 470, column: 5, scope: !343)
!663 = !DILocation(line: 470, column: 25, scope: !343)
!664 = !DILocation(line: 471, column: 2, scope: !343)
!665 = !DILocation(line: 471, column: 5, scope: !343)
!666 = !DILocation(line: 471, column: 28, scope: !343)
!667 = !DILocation(line: 472, column: 11, scope: !343)
!668 = !DILocation(line: 472, column: 14, scope: !343)
!669 = !DILocation(line: 472, column: 2, scope: !343)
!670 = !DILocation(line: 473, column: 1, scope: !343)
!671 = !DILocation(line: 378, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !371, file: !1, line: 378, column: 6)
!673 = !DILocation(line: 378, column: 6, scope: !371)
!674 = !DILocation(line: 379, column: 19, scope: !675)
!675 = distinct !DILexicalBlock(scope: !672, file: !1, line: 378, column: 15)
!676 = !DILocation(line: 380, column: 20, scope: !675)
!677 = !DILocation(line: 381, column: 30, scope: !675)
!678 = !DILocation(line: 382, column: 31, scope: !675)
!679 = !DILocation(line: 383, column: 32, scope: !675)
!680 = !DILocation(line: 384, column: 10, scope: !675)
!681 = !DILocation(line: 385, column: 2, scope: !675)
!682 = !DILocation(line: 386, column: 2, scope: !371)
!683 = !DILocalVariable(name: "private_data", arg: 1, scope: !433, file: !1, line: 616, type: !311)
!684 = !DILocation(line: 616, column: 28, scope: !433)
!685 = !DILocalVariable(name: "uid", arg: 2, scope: !433, file: !1, line: 616, type: !91)
!686 = !DILocation(line: 616, column: 50, scope: !433)
!687 = !DILocation(line: 618, column: 8, scope: !433)
!688 = !DILocation(line: 619, column: 8, scope: !433)
!689 = !DILocation(line: 620, column: 2, scope: !433)
!690 = !DILocalVariable(name: "private_data", arg: 1, scope: !432, file: !1, line: 608, type: !311)
!691 = !DILocation(line: 608, column: 28, scope: !432)
!692 = !DILocalVariable(name: "gid", arg: 2, scope: !432, file: !1, line: 608, type: !91)
!693 = !DILocation(line: 608, column: 50, scope: !432)
!694 = !DILocation(line: 610, column: 8, scope: !432)
!695 = !DILocation(line: 611, column: 8, scope: !432)
!696 = !DILocation(line: 612, column: 2, scope: !432)
!697 = !DILocalVariable(name: "t", arg: 1, scope: !441, file: !1, line: 2014, type: !153)
!698 = !DILocation(line: 2014, column: 34, scope: !441)
!699 = !DILocalVariable(name: "path", arg: 2, scope: !441, file: !1, line: 2014, type: !119)
!700 = !DILocation(line: 2014, column: 49, scope: !441)
!701 = !DILocalVariable(name: "flags", arg: 3, scope: !441, file: !1, line: 2014, type: !62)
!702 = !DILocation(line: 2014, column: 59, scope: !441)
!703 = !DILocation(line: 2017, column: 37, scope: !441)
!704 = !DILocation(line: 2017, column: 17, scope: !441)
!705 = !DILocation(line: 2017, column: 41, scope: !441)
!706 = !DILocation(line: 2017, column: 47, scope: !441)
!707 = !DILocation(line: 2017, column: 10, scope: !708)
!708 = !DILexicalBlockFile(scope: !441, file: !1, discriminator: 1)
!709 = !DILocation(line: 2017, column: 2, scope: !441)
!710 = !DILocalVariable(name: "t", arg: 1, scope: !446, file: !1, line: 2261, type: !153)
!711 = !DILocation(line: 2261, column: 34, scope: !446)
!712 = !DILocation(line: 2263, column: 10, scope: !446)
!713 = !DILocation(line: 2263, column: 13, scope: !446)
!714 = !DILocation(line: 2263, column: 2, scope: !446)
!715 = !DILocalVariable(name: "t", arg: 1, scope: !445, file: !1, line: 2241, type: !153)
!716 = !DILocation(line: 2241, column: 37, scope: !445)
!717 = !DILocalVariable(name: "r", scope: !445, file: !1, line: 2243, type: !62)
!718 = !DILocation(line: 2243, column: 6, scope: !445)
!719 = !DILocation(line: 2250, column: 6, scope: !720)
!720 = distinct !DILexicalBlock(scope: !445, file: !1, line: 2250, column: 6)
!721 = !DILocation(line: 2250, column: 9, scope: !720)
!722 = !DILocation(line: 2250, column: 15, scope: !720)
!723 = !DILocation(line: 2250, column: 19, scope: !720)
!724 = !DILocation(line: 2250, column: 23, scope: !725)
!725 = !DILexicalBlockFile(scope: !720, file: !1, discriminator: 1)
!726 = !DILocation(line: 2250, column: 26, scope: !725)
!727 = !DILocation(line: 2250, column: 32, scope: !725)
!728 = !DILocation(line: 2250, column: 48, scope: !725)
!729 = !DILocation(line: 2250, column: 6, scope: !725)
!730 = !DILocation(line: 2251, column: 14, scope: !731)
!731 = distinct !DILexicalBlock(scope: !720, file: !1, line: 2250, column: 54)
!732 = !DILocation(line: 2251, column: 17, scope: !731)
!733 = !DILocation(line: 2251, column: 7, scope: !731)
!734 = !DILocation(line: 2251, column: 5, scope: !731)
!735 = !DILocation(line: 2252, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !731, file: !1, line: 2252, column: 7)
!737 = !DILocation(line: 2252, column: 9, scope: !736)
!738 = !DILocation(line: 2252, column: 7, scope: !731)
!739 = !DILocation(line: 2253, column: 4, scope: !740)
!740 = distinct !DILexicalBlock(scope: !736, file: !1, line: 2252, column: 15)
!741 = !DILocation(line: 2253, column: 7, scope: !740)
!742 = !DILocation(line: 2253, column: 13, scope: !740)
!743 = !DILocation(line: 2254, column: 4, scope: !740)
!744 = !DILocation(line: 2254, column: 7, scope: !740)
!745 = !DILocation(line: 2254, column: 13, scope: !740)
!746 = !DILocation(line: 2255, column: 3, scope: !740)
!747 = !DILocation(line: 2256, column: 2, scope: !731)
!748 = !DILocation(line: 2257, column: 10, scope: !445)
!749 = !DILocation(line: 2257, column: 2, scope: !445)
!750 = !DILocalVariable(name: "_a", arg: 1, scope: !346, file: !1, line: 533, type: !63)
!751 = !DILocation(line: 533, column: 55, scope: !346)
!752 = !DILocalVariable(name: "a", scope: !346, file: !1, line: 535, type: !43)
!753 = !DILocation(line: 535, column: 28, scope: !346)
!754 = !DILocation(line: 535, column: 60, scope: !346)
!755 = !DILocation(line: 535, column: 32, scope: !346)
!756 = !DILocation(line: 536, column: 2, scope: !346)
!757 = !DILocalVariable(name: "magic_test", scope: !758, file: !1, line: 536, type: !62)
!758 = distinct !DILexicalBlock(scope: !346, file: !1, line: 536, column: 2)
!759 = !DILocation(line: 536, column: 2, scope: !758)
!760 = !DILocation(line: 536, column: 2, scope: !761)
!761 = !DILexicalBlockFile(scope: !758, file: !1, discriminator: 1)
!762 = !DILocation(line: 536, column: 2, scope: !763)
!763 = !DILexicalBlockFile(scope: !764, file: !1, discriminator: 2)
!764 = distinct !DILexicalBlock(scope: !758, file: !1, line: 536, column: 2)
!765 = !DILocation(line: 536, column: 2, scope: !766)
!766 = !DILexicalBlockFile(scope: !758, file: !1, discriminator: 3)
!767 = !DILocation(line: 538, column: 21, scope: !346)
!768 = !DILocation(line: 538, column: 2, scope: !346)
!769 = !DILocation(line: 539, column: 2, scope: !346)
!770 = !DILocation(line: 540, column: 1, scope: !346)
!771 = !DILocalVariable(name: "a", arg: 1, scope: !429, file: !1, line: 521, type: !43)
!772 = !DILocation(line: 521, column: 46, scope: !429)
!773 = !DILocalVariable(name: "symlink_mode", arg: 2, scope: !429, file: !1, line: 521, type: !121)
!774 = !DILocation(line: 521, column: 54, scope: !429)
!775 = !DILocalVariable(name: "follow_symlinks", arg: 3, scope: !429, file: !1, line: 522, type: !62)
!776 = !DILocation(line: 522, column: 9, scope: !429)
!777 = !DILocation(line: 524, column: 20, scope: !429)
!778 = !DILocation(line: 524, column: 2, scope: !429)
!779 = !DILocation(line: 524, column: 5, scope: !429)
!780 = !DILocation(line: 524, column: 18, scope: !429)
!781 = !DILocation(line: 525, column: 23, scope: !429)
!782 = !DILocation(line: 525, column: 2, scope: !429)
!783 = !DILocation(line: 525, column: 5, scope: !429)
!784 = !DILocation(line: 525, column: 21, scope: !429)
!785 = !DILocation(line: 526, column: 6, scope: !786)
!786 = distinct !DILexicalBlock(scope: !429, file: !1, line: 526, column: 6)
!787 = !DILocation(line: 526, column: 9, scope: !786)
!788 = !DILocation(line: 526, column: 14, scope: !786)
!789 = !DILocation(line: 526, column: 6, scope: !429)
!790 = !DILocation(line: 527, column: 35, scope: !791)
!791 = distinct !DILexicalBlock(scope: !786, file: !1, line: 526, column: 23)
!792 = !DILocation(line: 527, column: 38, scope: !791)
!793 = !DILocation(line: 527, column: 3, scope: !791)
!794 = !DILocation(line: 527, column: 6, scope: !791)
!795 = !DILocation(line: 527, column: 12, scope: !791)
!796 = !DILocation(line: 527, column: 33, scope: !791)
!797 = !DILocation(line: 528, column: 27, scope: !791)
!798 = !DILocation(line: 528, column: 30, scope: !791)
!799 = !DILocation(line: 528, column: 3, scope: !791)
!800 = !DILocation(line: 528, column: 6, scope: !791)
!801 = !DILocation(line: 528, column: 12, scope: !791)
!802 = !DILocation(line: 528, column: 25, scope: !791)
!803 = !DILocation(line: 529, column: 2, scope: !791)
!804 = !DILocation(line: 530, column: 1, scope: !429)
!805 = !DILocalVariable(name: "_a", arg: 1, scope: !347, file: !1, line: 543, type: !63)
!806 = !DILocation(line: 543, column: 56, scope: !347)
!807 = !DILocalVariable(name: "a", scope: !347, file: !1, line: 545, type: !43)
!808 = !DILocation(line: 545, column: 28, scope: !347)
!809 = !DILocation(line: 545, column: 60, scope: !347)
!810 = !DILocation(line: 545, column: 32, scope: !347)
!811 = !DILocation(line: 546, column: 2, scope: !347)
!812 = !DILocalVariable(name: "magic_test", scope: !813, file: !1, line: 546, type: !62)
!813 = distinct !DILexicalBlock(scope: !347, file: !1, line: 546, column: 2)
!814 = !DILocation(line: 546, column: 2, scope: !813)
!815 = !DILocation(line: 546, column: 2, scope: !816)
!816 = !DILexicalBlockFile(scope: !813, file: !1, discriminator: 1)
!817 = !DILocation(line: 546, column: 2, scope: !818)
!818 = !DILexicalBlockFile(scope: !819, file: !1, discriminator: 2)
!819 = distinct !DILexicalBlock(scope: !813, file: !1, line: 546, column: 2)
!820 = !DILocation(line: 546, column: 2, scope: !821)
!821 = !DILexicalBlockFile(scope: !813, file: !1, discriminator: 3)
!822 = !DILocation(line: 548, column: 21, scope: !347)
!823 = !DILocation(line: 548, column: 2, scope: !347)
!824 = !DILocation(line: 549, column: 2, scope: !347)
!825 = !DILocation(line: 550, column: 1, scope: !347)
!826 = !DILocalVariable(name: "_a", arg: 1, scope: !348, file: !1, line: 553, type: !63)
!827 = !DILocation(line: 553, column: 54, scope: !348)
!828 = !DILocalVariable(name: "a", scope: !348, file: !1, line: 555, type: !43)
!829 = !DILocation(line: 555, column: 28, scope: !348)
!830 = !DILocation(line: 555, column: 60, scope: !348)
!831 = !DILocation(line: 555, column: 32, scope: !348)
!832 = !DILocation(line: 556, column: 2, scope: !348)
!833 = !DILocalVariable(name: "magic_test", scope: !834, file: !1, line: 556, type: !62)
!834 = distinct !DILexicalBlock(scope: !348, file: !1, line: 556, column: 2)
!835 = !DILocation(line: 556, column: 2, scope: !834)
!836 = !DILocation(line: 556, column: 2, scope: !837)
!837 = !DILexicalBlockFile(scope: !834, file: !1, discriminator: 1)
!838 = !DILocation(line: 556, column: 2, scope: !839)
!839 = !DILexicalBlockFile(scope: !840, file: !1, discriminator: 2)
!840 = distinct !DILexicalBlock(scope: !834, file: !1, line: 556, column: 2)
!841 = !DILocation(line: 556, column: 2, scope: !842)
!842 = !DILexicalBlockFile(scope: !834, file: !1, discriminator: 3)
!843 = !DILocation(line: 558, column: 21, scope: !348)
!844 = !DILocation(line: 558, column: 2, scope: !348)
!845 = !DILocation(line: 559, column: 2, scope: !348)
!846 = !DILocation(line: 560, column: 1, scope: !348)
!847 = !DILocalVariable(name: "_a", arg: 1, scope: !349, file: !1, line: 563, type: !63)
!848 = !DILocation(line: 563, column: 54, scope: !349)
!849 = !DILocalVariable(name: "a", scope: !349, file: !1, line: 565, type: !43)
!850 = !DILocation(line: 565, column: 28, scope: !349)
!851 = !DILocation(line: 565, column: 60, scope: !349)
!852 = !DILocation(line: 565, column: 32, scope: !349)
!853 = !DILocation(line: 566, column: 2, scope: !349)
!854 = !DILocalVariable(name: "magic_test", scope: !855, file: !1, line: 566, type: !62)
!855 = distinct !DILexicalBlock(scope: !349, file: !1, line: 566, column: 2)
!856 = !DILocation(line: 566, column: 2, scope: !855)
!857 = !DILocation(line: 566, column: 2, scope: !858)
!858 = !DILexicalBlockFile(scope: !855, file: !1, discriminator: 1)
!859 = !DILocation(line: 566, column: 2, scope: !860)
!860 = !DILexicalBlockFile(scope: !861, file: !1, discriminator: 2)
!861 = distinct !DILexicalBlock(scope: !855, file: !1, line: 566, column: 2)
!862 = !DILocation(line: 566, column: 2, scope: !863)
!863 = !DILexicalBlockFile(scope: !855, file: !1, discriminator: 3)
!864 = !DILocation(line: 569, column: 2, scope: !349)
!865 = !DILocation(line: 569, column: 5, scope: !349)
!866 = !DILocation(line: 569, column: 11, scope: !349)
!867 = !DILocation(line: 570, column: 6, scope: !868)
!868 = distinct !DILexicalBlock(scope: !349, file: !1, line: 570, column: 6)
!869 = !DILocation(line: 570, column: 9, scope: !868)
!870 = !DILocation(line: 570, column: 14, scope: !868)
!871 = !DILocation(line: 570, column: 6, scope: !349)
!872 = !DILocation(line: 571, column: 3, scope: !868)
!873 = !DILocation(line: 571, column: 6, scope: !868)
!874 = !DILocation(line: 571, column: 12, scope: !868)
!875 = !DILocation(line: 571, column: 18, scope: !868)
!876 = !DILocation(line: 572, column: 2, scope: !349)
!877 = !DILocation(line: 580, column: 1, scope: !349)
!878 = !DILocalVariable(name: "_a", arg: 1, scope: !350, file: !1, line: 583, type: !63)
!879 = !DILocation(line: 583, column: 48, scope: !350)
!880 = !DILocalVariable(name: "flags", arg: 2, scope: !350, file: !1, line: 583, type: !62)
!881 = !DILocation(line: 583, column: 56, scope: !350)
!882 = !DILocalVariable(name: "a", scope: !350, file: !1, line: 585, type: !43)
!883 = !DILocation(line: 585, column: 28, scope: !350)
!884 = !DILocation(line: 585, column: 60, scope: !350)
!885 = !DILocation(line: 585, column: 32, scope: !350)
!886 = !DILocalVariable(name: "r", scope: !350, file: !1, line: 586, type: !62)
!887 = !DILocation(line: 586, column: 6, scope: !350)
!888 = !DILocation(line: 588, column: 2, scope: !350)
!889 = !DILocalVariable(name: "magic_test", scope: !890, file: !1, line: 588, type: !62)
!890 = distinct !DILexicalBlock(scope: !350, file: !1, line: 588, column: 2)
!891 = !DILocation(line: 588, column: 2, scope: !890)
!892 = !DILocation(line: 588, column: 2, scope: !893)
!893 = !DILexicalBlockFile(scope: !890, file: !1, discriminator: 1)
!894 = !DILocation(line: 588, column: 2, scope: !895)
!895 = !DILexicalBlockFile(scope: !896, file: !1, discriminator: 2)
!896 = distinct !DILexicalBlock(scope: !890, file: !1, line: 588, column: 2)
!897 = !DILocation(line: 588, column: 2, scope: !898)
!898 = !DILexicalBlockFile(scope: !890, file: !1, discriminator: 3)
!899 = !DILocation(line: 591, column: 13, scope: !350)
!900 = !DILocation(line: 591, column: 2, scope: !350)
!901 = !DILocation(line: 591, column: 5, scope: !350)
!902 = !DILocation(line: 591, column: 11, scope: !350)
!903 = !DILocation(line: 593, column: 6, scope: !904)
!904 = distinct !DILexicalBlock(scope: !350, file: !1, line: 593, column: 6)
!905 = !DILocation(line: 593, column: 12, scope: !904)
!906 = !DILocation(line: 593, column: 6, scope: !350)
!907 = !DILocation(line: 594, column: 44, scope: !904)
!908 = !DILocation(line: 594, column: 7, scope: !904)
!909 = !DILocation(line: 594, column: 5, scope: !904)
!910 = !DILocation(line: 594, column: 3, scope: !904)
!911 = !DILocation(line: 596, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !913, file: !1, line: 596, column: 7)
!913 = distinct !DILexicalBlock(scope: !904, file: !1, line: 595, column: 7)
!914 = !DILocation(line: 596, column: 10, scope: !912)
!915 = !DILocation(line: 596, column: 15, scope: !912)
!916 = !DILocation(line: 596, column: 7, scope: !913)
!917 = !DILocation(line: 597, column: 4, scope: !912)
!918 = !DILocation(line: 597, column: 7, scope: !912)
!919 = !DILocation(line: 597, column: 13, scope: !912)
!920 = !DILocation(line: 597, column: 19, scope: !912)
!921 = !DILocation(line: 599, column: 10, scope: !350)
!922 = !DILocation(line: 599, column: 2, scope: !350)
!923 = !DILocation(line: 600, column: 1, scope: !350)
!924 = !DILocalVariable(name: "_a", arg: 1, scope: !351, file: !1, line: 1211, type: !63)
!925 = !DILocation(line: 1211, column: 48, scope: !351)
!926 = !DILocalVariable(name: "_ma", arg: 2, scope: !351, file: !1, line: 1211, type: !63)
!927 = !DILocation(line: 1211, column: 68, scope: !351)
!928 = !DILocalVariable(name: "_excluded_func", arg: 3, scope: !351, file: !1, line: 1212, type: !327)
!929 = !DILocation(line: 1212, column: 12, scope: !351)
!930 = !DILocalVariable(name: "_client_data", arg: 4, scope: !351, file: !1, line: 1213, type: !311)
!931 = !DILocation(line: 1213, column: 11, scope: !351)
!932 = !DILocalVariable(name: "a", scope: !351, file: !1, line: 1215, type: !43)
!933 = !DILocation(line: 1215, column: 28, scope: !351)
!934 = !DILocation(line: 1215, column: 60, scope: !351)
!935 = !DILocation(line: 1215, column: 32, scope: !351)
!936 = !DILocation(line: 1216, column: 2, scope: !351)
!937 = !DILocalVariable(name: "magic_test", scope: !938, file: !1, line: 1216, type: !62)
!938 = distinct !DILexicalBlock(scope: !351, file: !1, line: 1216, column: 2)
!939 = !DILocation(line: 1216, column: 2, scope: !938)
!940 = !DILocation(line: 1216, column: 2, scope: !941)
!941 = !DILexicalBlockFile(scope: !938, file: !1, discriminator: 1)
!942 = !DILocation(line: 1216, column: 2, scope: !943)
!943 = !DILexicalBlockFile(scope: !944, file: !1, discriminator: 2)
!944 = distinct !DILexicalBlock(scope: !938, file: !1, line: 1216, column: 2)
!945 = !DILocation(line: 1216, column: 2, scope: !946)
!946 = !DILexicalBlockFile(scope: !938, file: !1, discriminator: 3)
!947 = !DILocation(line: 1218, column: 16, scope: !351)
!948 = !DILocation(line: 1218, column: 2, scope: !351)
!949 = !DILocation(line: 1218, column: 5, scope: !351)
!950 = !DILocation(line: 1218, column: 14, scope: !351)
!951 = !DILocation(line: 1219, column: 24, scope: !351)
!952 = !DILocation(line: 1219, column: 2, scope: !351)
!953 = !DILocation(line: 1219, column: 5, scope: !351)
!954 = !DILocation(line: 1219, column: 22, scope: !351)
!955 = !DILocation(line: 1220, column: 24, scope: !351)
!956 = !DILocation(line: 1220, column: 2, scope: !351)
!957 = !DILocation(line: 1220, column: 5, scope: !351)
!958 = !DILocation(line: 1220, column: 22, scope: !351)
!959 = !DILocation(line: 1221, column: 2, scope: !351)
!960 = !DILocation(line: 1222, column: 1, scope: !351)
!961 = !DILocalVariable(name: "_a", arg: 1, scope: !354, file: !1, line: 1225, type: !63)
!962 = !DILocation(line: 1225, column: 64, scope: !354)
!963 = !DILocalVariable(name: "_metadata_filter_func", arg: 2, scope: !354, file: !1, line: 1226, type: !321)
!964 = !DILocation(line: 1226, column: 11, scope: !354)
!965 = !DILocalVariable(name: "_client_data", arg: 3, scope: !354, file: !1, line: 1227, type: !311)
!966 = !DILocation(line: 1227, column: 36, scope: !354)
!967 = !DILocalVariable(name: "a", scope: !354, file: !1, line: 1229, type: !43)
!968 = !DILocation(line: 1229, column: 28, scope: !354)
!969 = !DILocation(line: 1229, column: 60, scope: !354)
!970 = !DILocation(line: 1229, column: 32, scope: !354)
!971 = !DILocation(line: 1231, column: 2, scope: !354)
!972 = !DILocalVariable(name: "magic_test", scope: !973, file: !1, line: 1231, type: !62)
!973 = distinct !DILexicalBlock(scope: !354, file: !1, line: 1231, column: 2)
!974 = !DILocation(line: 1231, column: 2, scope: !973)
!975 = !DILocation(line: 1231, column: 2, scope: !976)
!976 = !DILexicalBlockFile(scope: !973, file: !1, discriminator: 1)
!977 = !DILocation(line: 1231, column: 2, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !1, discriminator: 2)
!979 = distinct !DILexicalBlock(scope: !973, file: !1, line: 1231, column: 2)
!980 = !DILocation(line: 1231, column: 2, scope: !981)
!981 = !DILexicalBlockFile(scope: !973, file: !1, discriminator: 3)
!982 = !DILocation(line: 1234, column: 28, scope: !354)
!983 = !DILocation(line: 1234, column: 2, scope: !354)
!984 = !DILocation(line: 1234, column: 5, scope: !354)
!985 = !DILocation(line: 1234, column: 26, scope: !354)
!986 = !DILocation(line: 1235, column: 28, scope: !354)
!987 = !DILocation(line: 1235, column: 2, scope: !354)
!988 = !DILocation(line: 1235, column: 5, scope: !354)
!989 = !DILocation(line: 1235, column: 26, scope: !354)
!990 = !DILocation(line: 1236, column: 2, scope: !354)
!991 = !DILocation(line: 1237, column: 1, scope: !354)
!992 = !DILocalVariable(name: "_a", arg: 1, scope: !357, file: !1, line: 1240, type: !63)
!993 = !DILocation(line: 1240, column: 47, scope: !357)
!994 = !DILocalVariable(name: "a", scope: !357, file: !1, line: 1242, type: !43)
!995 = !DILocation(line: 1242, column: 28, scope: !357)
!996 = !DILocation(line: 1242, column: 60, scope: !357)
!997 = !DILocation(line: 1242, column: 32, scope: !357)
!998 = !DILocalVariable(name: "t", scope: !357, file: !1, line: 1243, type: !153)
!999 = !DILocation(line: 1243, column: 15, scope: !357)
!1000 = !DILocation(line: 1243, column: 19, scope: !357)
!1001 = !DILocation(line: 1243, column: 22, scope: !357)
!1002 = !DILocation(line: 1245, column: 2, scope: !357)
!1003 = !DILocalVariable(name: "magic_test", scope: !1004, file: !1, line: 1245, type: !62)
!1004 = distinct !DILexicalBlock(scope: !357, file: !1, line: 1245, column: 2)
!1005 = !DILocation(line: 1245, column: 2, scope: !1004)
!1006 = !DILocation(line: 1245, column: 2, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !1004, file: !1, discriminator: 1)
!1008 = !DILocation(line: 1245, column: 2, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !1010, file: !1, discriminator: 2)
!1010 = distinct !DILexicalBlock(scope: !1004, file: !1, line: 1245, column: 2)
!1011 = !DILocation(line: 1245, column: 2, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !1004, file: !1, discriminator: 3)
!1013 = !DILocation(line: 1249, column: 10, scope: !357)
!1014 = !DILocation(line: 1249, column: 13, scope: !357)
!1015 = !DILocation(line: 1249, column: 24, scope: !357)
!1016 = !DILocation(line: 1249, column: 40, scope: !357)
!1017 = !DILocation(line: 1249, column: 43, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !357, file: !1, discriminator: 1)
!1019 = !DILocation(line: 1249, column: 46, scope: !1018)
!1020 = !DILocation(line: 1249, column: 40, scope: !1018)
!1021 = !DILocation(line: 1249, column: 40, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !357, file: !1, discriminator: 2)
!1023 = !DILocation(line: 1249, column: 2, scope: !1022)
!1024 = !DILocation(line: 1250, column: 1, scope: !357)
!1025 = !DILocalVariable(name: "_a", arg: 1, scope: !358, file: !1, line: 1257, type: !63)
!1026 = !DILocation(line: 1257, column: 43, scope: !358)
!1027 = !DILocalVariable(name: "a", scope: !358, file: !1, line: 1259, type: !43)
!1028 = !DILocation(line: 1259, column: 28, scope: !358)
!1029 = !DILocation(line: 1259, column: 60, scope: !358)
!1030 = !DILocation(line: 1259, column: 32, scope: !358)
!1031 = !DILocalVariable(name: "t", scope: !358, file: !1, line: 1260, type: !153)
!1032 = !DILocation(line: 1260, column: 15, scope: !358)
!1033 = !DILocation(line: 1260, column: 19, scope: !358)
!1034 = !DILocation(line: 1260, column: 22, scope: !358)
!1035 = !DILocation(line: 1262, column: 2, scope: !358)
!1036 = !DILocalVariable(name: "magic_test", scope: !1037, file: !1, line: 1262, type: !62)
!1037 = distinct !DILexicalBlock(scope: !358, file: !1, line: 1262, column: 2)
!1038 = !DILocation(line: 1262, column: 2, scope: !1037)
!1039 = !DILocation(line: 1262, column: 2, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1037, file: !1, discriminator: 1)
!1041 = !DILocation(line: 1262, column: 2, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1043, file: !1, discriminator: 2)
!1043 = distinct !DILexicalBlock(scope: !1037, file: !1, line: 1262, column: 2)
!1044 = !DILocation(line: 1262, column: 2, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1037, file: !1, discriminator: 3)
!1046 = !DILocation(line: 1266, column: 6, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !358, file: !1, line: 1266, column: 6)
!1048 = !DILocation(line: 1266, column: 9, scope: !1047)
!1049 = !DILocation(line: 1266, column: 20, scope: !1047)
!1050 = !DILocation(line: 1266, column: 36, scope: !1047)
!1051 = !DILocation(line: 1266, column: 40, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1047, file: !1, discriminator: 1)
!1053 = !DILocation(line: 1266, column: 43, scope: !1052)
!1054 = !DILocation(line: 1266, column: 6, scope: !1052)
!1055 = !DILocation(line: 1267, column: 3, scope: !1047)
!1056 = !DILocation(line: 1269, column: 35, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !358, file: !1, line: 1269, column: 6)
!1058 = !DILocation(line: 1269, column: 6, scope: !1057)
!1059 = !DILocation(line: 1269, column: 6, scope: !358)
!1060 = !DILocation(line: 1270, column: 13, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1057, file: !1, line: 1269, column: 39)
!1062 = !DILocation(line: 1270, column: 16, scope: !1061)
!1063 = !DILocation(line: 1270, column: 19, scope: !1061)
!1064 = !DILocation(line: 1270, column: 29, scope: !1061)
!1065 = !DILocation(line: 1270, column: 32, scope: !1061)
!1066 = !DILocation(line: 1271, column: 7, scope: !1061)
!1067 = !DILocation(line: 1271, column: 10, scope: !1061)
!1068 = !DILocation(line: 1271, column: 14, scope: !1061)
!1069 = !DILocation(line: 1271, column: 22, scope: !1061)
!1070 = !DILocation(line: 1271, column: 25, scope: !1061)
!1071 = !DILocation(line: 1271, column: 29, scope: !1061)
!1072 = !DILocation(line: 1271, column: 38, scope: !1061)
!1073 = !DILocation(line: 1271, column: 41, scope: !1061)
!1074 = !DILocation(line: 1270, column: 3, scope: !1061)
!1075 = !DILocation(line: 1272, column: 3, scope: !1061)
!1076 = !DILocation(line: 1272, column: 6, scope: !1061)
!1077 = !DILocation(line: 1272, column: 13, scope: !1061)
!1078 = !DILocation(line: 1272, column: 19, scope: !1061)
!1079 = !DILocation(line: 1273, column: 2, scope: !1061)
!1080 = !DILocation(line: 1273, column: 33, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 1)
!1082 = distinct !DILexicalBlock(scope: !1057, file: !1, line: 1273, column: 13)
!1083 = !DILocation(line: 1273, column: 13, scope: !1081)
!1084 = !DILocation(line: 1274, column: 13, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 1273, column: 37)
!1086 = !DILocation(line: 1274, column: 16, scope: !1085)
!1087 = !DILocation(line: 1274, column: 19, scope: !1085)
!1088 = !DILocation(line: 1274, column: 29, scope: !1085)
!1089 = !DILocation(line: 1274, column: 32, scope: !1085)
!1090 = !DILocation(line: 1275, column: 7, scope: !1085)
!1091 = !DILocation(line: 1275, column: 10, scope: !1085)
!1092 = !DILocation(line: 1275, column: 13, scope: !1085)
!1093 = !DILocation(line: 1275, column: 21, scope: !1085)
!1094 = !DILocation(line: 1275, column: 24, scope: !1085)
!1095 = !DILocation(line: 1275, column: 27, scope: !1085)
!1096 = !DILocation(line: 1275, column: 36, scope: !1085)
!1097 = !DILocation(line: 1275, column: 39, scope: !1085)
!1098 = !DILocation(line: 1274, column: 3, scope: !1085)
!1099 = !DILocation(line: 1276, column: 3, scope: !1085)
!1100 = !DILocation(line: 1276, column: 6, scope: !1085)
!1101 = !DILocation(line: 1276, column: 13, scope: !1085)
!1102 = !DILocation(line: 1276, column: 19, scope: !1085)
!1103 = !DILocation(line: 1277, column: 2, scope: !1085)
!1104 = !DILocation(line: 1278, column: 2, scope: !358)
!1105 = !DILocation(line: 1278, column: 5, scope: !358)
!1106 = !DILocation(line: 1278, column: 13, scope: !358)
!1107 = !DILocation(line: 1279, column: 2, scope: !358)
!1108 = !DILocation(line: 1280, column: 1, scope: !358)
!1109 = !DILocalVariable(name: "t", arg: 1, scope: !448, file: !1, line: 2525, type: !153)
!1110 = !DILocation(line: 2525, column: 43, scope: !448)
!1111 = !DILocalVariable(name: "st", scope: !448, file: !1, line: 2527, type: !412)
!1112 = !DILocation(line: 2527, column: 21, scope: !448)
!1113 = !DILocation(line: 2533, column: 6, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !448, file: !1, line: 2533, column: 6)
!1115 = !DILocation(line: 2533, column: 9, scope: !1114)
!1116 = !DILocation(line: 2533, column: 15, scope: !1114)
!1117 = !DILocation(line: 2533, column: 6, scope: !448)
!1118 = !DILocation(line: 2534, column: 26, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1114, file: !1, line: 2533, column: 26)
!1120 = !DILocation(line: 2534, column: 8, scope: !1119)
!1121 = !DILocation(line: 2534, column: 6, scope: !1119)
!1122 = !DILocation(line: 2535, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1119, file: !1, line: 2535, column: 7)
!1124 = !DILocation(line: 2535, column: 10, scope: !1123)
!1125 = !DILocation(line: 2535, column: 7, scope: !1119)
!1126 = !DILocation(line: 2536, column: 4, scope: !1123)
!1127 = !DILocation(line: 2537, column: 8, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1119, file: !1, line: 2537, column: 7)
!1129 = !DILocation(line: 2537, column: 7, scope: !1119)
!1130 = !DILocation(line: 2538, column: 4, scope: !1128)
!1131 = !DILocation(line: 2539, column: 2, scope: !1119)
!1132 = !DILocation(line: 2548, column: 26, scope: !448)
!1133 = !DILocation(line: 2548, column: 7, scope: !448)
!1134 = !DILocation(line: 2548, column: 5, scope: !448)
!1135 = !DILocation(line: 2550, column: 6, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !448, file: !1, line: 2550, column: 6)
!1137 = !DILocation(line: 2550, column: 9, scope: !1136)
!1138 = !DILocation(line: 2550, column: 6, scope: !448)
!1139 = !DILocation(line: 2551, column: 3, scope: !1136)
!1140 = !DILocation(line: 2553, column: 10, scope: !448)
!1141 = !DILocation(line: 2553, column: 2, scope: !448)
!1142 = !DILocation(line: 2554, column: 1, scope: !448)
!1143 = !DILocalVariable(name: "t", arg: 1, scope: !442, file: !1, line: 2051, type: !153)
!1144 = !DILocation(line: 2051, column: 24, scope: !442)
!1145 = !DILocalVariable(name: "path", arg: 2, scope: !442, file: !1, line: 2051, type: !119)
!1146 = !DILocation(line: 2051, column: 39, scope: !442)
!1147 = !DILocalVariable(name: "filesystem_id", arg: 3, scope: !442, file: !1, line: 2051, type: !62)
!1148 = !DILocation(line: 2051, column: 49, scope: !442)
!1149 = !DILocalVariable(name: "dev", arg: 4, scope: !442, file: !1, line: 2052, type: !91)
!1150 = !DILocation(line: 2052, column: 13, scope: !442)
!1151 = !DILocalVariable(name: "ino", arg: 5, scope: !442, file: !1, line: 2052, type: !91)
!1152 = !DILocation(line: 2052, column: 26, scope: !442)
!1153 = !DILocalVariable(name: "rt", arg: 6, scope: !442, file: !1, line: 2052, type: !383)
!1154 = !DILocation(line: 2052, column: 52, scope: !442)
!1155 = !DILocalVariable(name: "te", scope: !442, file: !1, line: 2054, type: !157)
!1156 = !DILocation(line: 2054, column: 21, scope: !442)
!1157 = !DILocation(line: 2056, column: 7, scope: !442)
!1158 = !DILocation(line: 2056, column: 5, scope: !442)
!1159 = !DILocation(line: 2057, column: 13, scope: !442)
!1160 = !DILocation(line: 2057, column: 16, scope: !442)
!1161 = !DILocation(line: 2057, column: 2, scope: !442)
!1162 = !DILocation(line: 2057, column: 6, scope: !442)
!1163 = !DILocation(line: 2057, column: 11, scope: !442)
!1164 = !DILocation(line: 2058, column: 15, scope: !442)
!1165 = !DILocation(line: 2058, column: 18, scope: !442)
!1166 = !DILocation(line: 2058, column: 2, scope: !442)
!1167 = !DILocation(line: 2058, column: 6, scope: !442)
!1168 = !DILocation(line: 2058, column: 13, scope: !442)
!1169 = !DILocation(line: 2059, column: 6, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !442, file: !1, line: 2059, column: 6)
!1171 = !DILocation(line: 2059, column: 10, scope: !1170)
!1172 = !DILocation(line: 2059, column: 6, scope: !442)
!1173 = !DILocation(line: 2060, column: 15, scope: !1170)
!1174 = !DILocation(line: 2060, column: 19, scope: !1170)
!1175 = !DILocation(line: 2060, column: 27, scope: !1170)
!1176 = !DILocation(line: 2060, column: 33, scope: !1170)
!1177 = !DILocation(line: 2060, column: 3, scope: !1170)
!1178 = !DILocation(line: 2060, column: 7, scope: !1170)
!1179 = !DILocation(line: 2060, column: 13, scope: !1170)
!1180 = !DILocation(line: 2061, column: 13, scope: !442)
!1181 = !DILocation(line: 2061, column: 2, scope: !442)
!1182 = !DILocation(line: 2061, column: 5, scope: !442)
!1183 = !DILocation(line: 2061, column: 11, scope: !442)
!1184 = !DILocation(line: 2062, column: 2, scope: !442)
!1185 = !DILocation(line: 2062, column: 2, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1187, file: !1, discriminator: 1)
!1187 = distinct !DILexicalBlock(scope: !442, file: !1, line: 2062, column: 2)
!1188 = !DILocation(line: 2063, column: 2, scope: !442)
!1189 = !DILocation(line: 2063, column: 6, scope: !442)
!1190 = !DILocation(line: 2063, column: 24, scope: !442)
!1191 = !DILocation(line: 2064, column: 2, scope: !442)
!1192 = !DILocation(line: 2064, column: 2, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !442, file: !1, discriminator: 1)
!1194 = !DILocation(line: 2064, column: 2, scope: !1195)
