; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_open_fd.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type opaque
%struct.write_fd_data = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [10 x i8] c"No memory\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"Couldn't stat fd %d\00", align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"Write error\00", align 1

; Function Attrs: nounwind uwtable
define i32 @archive_write_open_fd(%struct.archive* %a, i32 %fd) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %a.addr = alloca %struct.archive*, align 8
  %fd.addr = alloca i32, align 4
  %mine = alloca %struct.write_fd_data*, align 8
  store %struct.archive* %a, %struct.archive** %a.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.archive** %a.addr, metadata !37, metadata !38), !dbg !39
  store i32 %fd, i32* %fd.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %fd.addr, metadata !40, metadata !38), !dbg !41
  call void @llvm.dbg.declare(metadata %struct.write_fd_data** %mine, metadata !42, metadata !38), !dbg !43
  %call = call noalias i8* @malloc(i64 4) #5, !dbg !44
  %0 = bitcast i8* %call to %struct.write_fd_data*, !dbg !45

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !10)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_open_fd.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "write_fd_data", file: !1, line: 53, size: 32, align: 32, elements: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !5, file: !1, line: 54, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !{!11, !17, !20, !33}
!11 = distinct !DISubprogram(name: "archive_write_open_fd", scope: !1, file: !1, line: 62, type: !12, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!12 = !DISubroutineType(types: !13)
!13 = !{!8, !14, !8}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !16, line: 179, flags: DIFlagFwdDecl)
!16 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!17 = distinct !DISubprogram(name: "file_open", scope: !1, file: !1, line: 80, type: !18, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{!8, !14, !9}
!20 = distinct !DISubprogram(name: "file_write", scope: !1, file: !1, line: 118, type: !21, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !14, !9, !28, !30}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 109, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !26, line: 172, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 62, baseType: !32)
!31 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!32 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!33 = distinct !DISubprogram(name: "file_close", scope: !1, file: !1, line: 137, type: !18, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!34 = !{i32 2, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!37 = !DILocalVariable(name: "a", arg: 1, scope: !11, file: !1, line: 62, type: !14)
!38 = !DIExpression()
!39 = !DILocation(line: 62, column: 39, scope: !11)
!40 = !DILocalVariable(name: "fd", arg: 2, scope: !11, file: !1, line: 62, type: !8)
!41 = !DILocation(line: 62, column: 46, scope: !11)
!42 = !DILocalVariable(name: "mine", scope: !11, file: !1, line: 64, type: !4)
!43 = !DILocation(line: 64, column: 24, scope: !11)
!44 = !DILocation(line: 66, column: 33, scope: !11)
!45 = !DILocation(line: 66, column: 9, scope: !11)
!46 = !DILocation(line: 66, column: 7, scope: !11)
!47 = !DILocation(line: 67, column: 6, scope: !48)
!48 = distinct !DILexicalBlock(scope: !11, file: !1, line: 67, column: 6)
!49 = !DILocation(line: 67, column: 11, scope: !48)
!50 = !DILocation(line: 67, column: 6, scope: !11)
!51 = !DILocation(line: 68, column: 21, scope: !52)
!52 = distinct !DILexicalBlock(scope: !48, file: !1, line: 67, column: 20)
!53 = !DILocation(line: 68, column: 3, scope: !52)
!54 = !DILocation(line: 69, column: 3, scope: !52)
!55 = !DILocation(line: 71, column: 13, scope: !11)
!56 = !DILocation(line: 71, column: 2, scope: !11)
!57 = !DILocation(line: 71, column: 8, scope: !11)
!58 = !DILocation(line: 71, column: 11, scope: !11)
!59 = !DILocation(line: 75, column: 29, scope: !11)
!60 = !DILocation(line: 75, column: 32, scope: !11)
!61 = !DILocation(line: 75, column: 10, scope: !11)
!62 = !DILocation(line: 75, column: 2, scope: !11)
!63 = !DILocation(line: 77, column: 1, scope: !11)
!64 = !DILocalVariable(name: "a", arg: 1, scope: !17, file: !1, line: 80, type: !14)
!65 = !DILocation(line: 80, column: 27, scope: !17)
!66 = !DILocalVariable(name: "client_data", arg: 2, scope: !17, file: !1, line: 80, type: !9)
!67 = !DILocation(line: 80, column: 36, scope: !17)
!68 = !DILocalVariable(name: "mine", scope: !17, file: !1, line: 82, type: !4)
!69 = !DILocation(line: 82, column: 24, scope: !17)
!70 = !DILocalVariable(name: "st", scope: !17, file: !1, line: 83, type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !72, line: 46, size: 1152, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!73 = !{!74, !76, !78, !80, !83, !85, !87, !88, !89, !91, !93, !95, !103, !104, !105}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !71, file: !72, line: 48, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !26, line: 124, baseType: !32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !71, file: !72, line: 53, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !26, line: 127, baseType: !32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !71, file: !72, line: 61, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !26, line: 130, baseType: !32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !71, file: !72, line: 62, baseType: !81, size: 32, align: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !26, line: 129, baseType: !82)
!82 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !71, file: !72, line: 64, baseType: !84, size: 32, align: 32, offset: 224)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !26, line: 125, baseType: !82)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !71, file: !72, line: 65, baseType: !86, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !26, line: 126, baseType: !82)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !71, file: !72, line: 67, baseType: !8, size: 32, align: 32, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !71, file: !72, line: 69, baseType: !75, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !71, file: !72, line: 74, baseType: !90, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !26, line: 131, baseType: !27)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !71, file: !72, line: 78, baseType: !92, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !26, line: 153, baseType: !27)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !71, file: !72, line: 80, baseType: !94, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !26, line: 158, baseType: !27)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !71, file: !72, line: 91, baseType: !96, size: 128, align: 64, offset: 576)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !97, line: 120, size: 128, align: 64, elements: !98)
!97 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !96, file: !97, line: 122, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !26, line: 139, baseType: !27)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !96, file: !97, line: 123, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !26, line: 175, baseType: !27)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !71, file: !72, line: 92, baseType: !96, size: 128, align: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !71, file: !72, line: 93, baseType: !96, size: 128, align: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 106, baseType: !106, size: 192, align: 64, offset: 960)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 192, align: 64, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DILocation(line: 83, column: 14, scope: !17)
!110 = !DILocation(line: 85, column: 33, scope: !17)
!111 = !DILocation(line: 85, column: 9, scope: !17)
!112 = !DILocation(line: 85, column: 7, scope: !17)
!113 = !DILocation(line: 87, column: 12, scope: !114)
!114 = distinct !DILexicalBlock(scope: !17, file: !1, line: 87, column: 6)
!115 = !DILocation(line: 87, column: 18, scope: !114)
!116 = !DILocation(line: 87, column: 6, scope: !114)
!117 = !DILocation(line: 87, column: 27, scope: !114)
!118 = !DILocation(line: 87, column: 6, scope: !17)
!119 = !DILocation(line: 88, column: 21, scope: !120)
!120 = distinct !DILexicalBlock(scope: !114, file: !1, line: 87, column: 33)
!121 = !DILocation(line: 88, column: 24, scope: !120)
!122 = !DILocation(line: 88, column: 54, scope: !120)
!123 = !DILocation(line: 88, column: 60, scope: !120)
!124 = !DILocation(line: 88, column: 3, scope: !125)
!125 = !DILexicalBlockFile(scope: !120, file: !1, discriminator: 1)
!126 = !DILocation(line: 89, column: 3, scope: !120)
!127 = !DILocation(line: 95, column: 6, scope: !128)
!128 = distinct !DILexicalBlock(scope: !17, file: !1, line: 95, column: 6)
!129 = !DILocation(line: 95, column: 6, scope: !17)
!130 = !DILocation(line: 96, column: 31, scope: !128)
!131 = !DILocation(line: 96, column: 37, scope: !128)
!132 = !DILocation(line: 96, column: 48, scope: !128)
!133 = !DILocation(line: 96, column: 3, scope: !128)
!134 = !DILocation(line: 102, column: 44, scope: !135)
!135 = distinct !DILexicalBlock(scope: !17, file: !1, line: 102, column: 6)
!136 = !DILocation(line: 102, column: 6, scope: !135)
!137 = !DILocation(line: 102, column: 47, scope: !135)
!138 = !DILocation(line: 102, column: 6, scope: !17)
!139 = !DILocation(line: 106, column: 7, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !1, line: 106, column: 7)
!141 = distinct !DILexicalBlock(scope: !135, file: !1, line: 102, column: 52)
!142 = !DILocation(line: 106, column: 27, scope: !140)
!143 = !DILocation(line: 106, column: 30, scope: !144)
!144 = !DILexicalBlockFile(scope: !140, file: !1, discriminator: 1)
!145 = !DILocation(line: 106, column: 50, scope: !144)
!146 = !DILocation(line: 107, column: 7, scope: !140)
!147 = !DILocation(line: 107, column: 28, scope: !140)
!148 = !DILocation(line: 107, column: 32, scope: !144)
!149 = !DILocation(line: 107, column: 38, scope: !144)
!150 = !DILocation(line: 107, column: 41, scope: !144)
!151 = !DILocation(line: 106, column: 7, scope: !152)
!152 = !DILexicalBlockFile(scope: !141, file: !1, discriminator: 2)
!153 = !DILocation(line: 109, column: 42, scope: !140)
!154 = !DILocation(line: 109, column: 4, scope: !140)
!155 = !DILocation(line: 111, column: 42, scope: !140)
!156 = !DILocation(line: 111, column: 4, scope: !140)
!157 = !DILocation(line: 112, column: 2, scope: !141)
!158 = !DILocation(line: 114, column: 2, scope: !17)
!159 = !DILocation(line: 115, column: 1, scope: !17)
!160 = !DILocalVariable(name: "a", arg: 1, scope: !20, file: !1, line: 118, type: !14)
!161 = !DILocation(line: 118, column: 28, scope: !20)
!162 = !DILocalVariable(name: "client_data", arg: 2, scope: !20, file: !1, line: 118, type: !9)
!163 = !DILocation(line: 118, column: 37, scope: !20)
!164 = !DILocalVariable(name: "buff", arg: 3, scope: !20, file: !1, line: 118, type: !28)
!165 = !DILocation(line: 118, column: 62, scope: !20)
!166 = !DILocalVariable(name: "length", arg: 4, scope: !20, file: !1, line: 118, type: !30)
!167 = !DILocation(line: 118, column: 75, scope: !20)
!168 = !DILocalVariable(name: "mine", scope: !20, file: !1, line: 120, type: !4)
!169 = !DILocation(line: 120, column: 24, scope: !20)
