; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_stat.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.archive_entry = type { %struct.archive*, i8*, i32, %struct.aest, i32, %struct.archive_mstring, i64, i64, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, i8, i8*, i64, %struct.archive_acl, %struct.ae_xattr*, %struct.ae_xattr*, %struct.ae_sparse*, %struct.ae_sparse*, %struct.ae_sparse*, [12 x i8] }
%struct.archive = type opaque
%struct.aest = type { i64, i32, i64, i32, i64, i32, i64, i32, i64, i64, i32, i64, i64, i32, i64, i64, i64, i32, i64, i64, i64 }
%struct.archive_mstring = type { %struct.archive_string, %struct.archive_string, %struct.archive_wstring, %struct.archive_string, i32 }
%struct.archive_wstring = type { i32*, i64, i64 }
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_acl = type { i32, %struct.archive_acl_entry*, %struct.archive_acl_entry*, i32, i32*, i8*, i32 }
%struct.archive_acl_entry = type { %struct.archive_acl_entry*, i32, i32, i32, i32, %struct.archive_mstring }
%struct.ae_xattr = type { %struct.ae_xattr*, i8*, i8*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !18)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_stat.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5, !10, !12, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 49, baseType: !7)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !8, line: 126, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 82, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !8, line: 125, baseType: !9)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 55, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !8, line: 127, baseType: !14)
!14 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 74, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !8, line: 131, baseType: !17)
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !{!19}
!19 = distinct !DISubprogram(name: "archive_entry_stat", scope: !1, file: !1, line: 40, type: !20, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !58}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !25, line: 46, size: 1152, align: 64, elements: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!26 = !{!27, !29, !30, !32, !34, !35, !36, !38, !39, !40, !42, !44, !52, !53, !54}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !24, file: !25, line: 48, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !8, line: 124, baseType: !14)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !24, file: !25, line: 53, baseType: !13, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !24, file: !25, line: 61, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !8, line: 130, baseType: !14)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !24, file: !25, line: 62, baseType: !33, size: 32, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !8, line: 129, baseType: !9)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !24, file: !25, line: 64, baseType: !11, size: 32, align: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !24, file: !25, line: 65, baseType: !7, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !24, file: !25, line: 67, baseType: !37, size: 32, align: 32, offset: 288)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !24, file: !25, line: 69, baseType: !28, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !24, file: !25, line: 74, baseType: !16, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !24, file: !25, line: 78, baseType: !41, size: 64, align: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !8, line: 153, baseType: !17)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !24, file: !25, line: 80, baseType: !43, size: 64, align: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !8, line: 158, baseType: !17)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !24, file: !25, line: 91, baseType: !45, size: 128, align: 64, offset: 576)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !46, line: 120, size: 128, align: 64, elements: !47)
!46 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !45, file: !46, line: 122, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !8, line: 139, baseType: !17)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !45, file: !46, line: 123, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !8, line: 175, baseType: !17)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !24, file: !25, line: 92, baseType: !45, size: 128, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !24, file: !25, line: 93, baseType: !45, size: 128, align: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !24, file: !25, line: 106, baseType: !55, size: 192, align: 64, offset: 960)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 192, align: 64, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 3)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !60, line: 73, size: 8640, align: 64, elements: !61)
!60 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!61 = !{!62, !66, !67, !68, !97, !98, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !155, !163, !164, !171, !172, !173}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !59, file: !60, line: 74, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !65, line: 152, flags: DIFlagFwdDecl)
!65 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !59, file: !60, line: 96, baseType: !4, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stat_valid", scope: !59, file: !60, line: 97, baseType: !37, size: 32, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ae_stat", scope: !59, file: !60, line: 129, baseType: !69, size: 1344, align: 64, offset: 192)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "aest", file: !60, line: 99, size: 1344, align: 64, elements: !70)
!70 = !{!71, !74, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89, !91, !92, !93, !94, !95, !96}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "aest_atime", scope: !69, file: !60, line: 100, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !73, line: 40, baseType: !17)
!73 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "aest_atime_nsec", scope: !69, file: !60, line: 101, baseType: !75, size: 32, align: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !73, line: 51, baseType: !9)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ctime", scope: !69, file: !60, line: 102, baseType: !72, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ctime_nsec", scope: !69, file: !60, line: 103, baseType: !75, size: 32, align: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "aest_mtime", scope: !69, file: !60, line: 104, baseType: !72, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "aest_mtime_nsec", scope: !69, file: !60, line: 105, baseType: !75, size: 32, align: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "aest_birthtime", scope: !69, file: !60, line: 106, baseType: !72, size: 64, align: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "aest_birthtime_nsec", scope: !69, file: !60, line: 107, baseType: !75, size: 32, align: 32, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "aest_gid", scope: !69, file: !60, line: 108, baseType: !72, size: 64, align: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ino", scope: !69, file: !60, line: 109, baseType: !72, size: 64, align: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "aest_nlink", scope: !69, file: !60, line: 110, baseType: !75, size: 32, align: 32, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "aest_size", scope: !69, file: !60, line: 111, baseType: !86, size: 64, align: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !73, line: 55, baseType: !14)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "aest_uid", scope: !69, file: !60, line: 112, baseType: !72, size: 64, align: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "aest_dev_is_broken_down", scope: !69, file: !60, line: 121, baseType: !37, size: 32, align: 32, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "aest_dev", scope: !69, file: !60, line: 122, baseType: !90, size: 64, align: 64, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 44, baseType: !28)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "aest_devmajor", scope: !69, file: !60, line: 123, baseType: !90, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "aest_devminor", scope: !69, file: !60, line: 124, baseType: !90, size: 64, align: 64, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdev_is_broken_down", scope: !69, file: !60, line: 125, baseType: !37, size: 32, align: 32, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdev", scope: !69, file: !60, line: 126, baseType: !90, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdevmajor", scope: !69, file: !60, line: 127, baseType: !90, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdevminor", scope: !69, file: !60, line: 128, baseType: !90, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ae_set", scope: !59, file: !60, line: 131, baseType: !37, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_text", scope: !59, file: !60, line: 145, baseType: !99, size: 832, align: 64, offset: 1600)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_mstring", file: !100, line: 209, size: 832, align: 64, elements: !101)
!100 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!101 = !{!102, !112, !113, !121, !122}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs", scope: !99, file: !100, line: 210, baseType: !103, size: 192, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !100, line: 58, size: 192, align: 64, elements: !104)
!104 = !{!105, !108, !111}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !103, file: !100, line: 59, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !103, file: !100, line: 60, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 62, baseType: !14)
!110 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !103, file: !100, line: 61, baseType: !109, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "aes_utf8", scope: !99, file: !100, line: 211, baseType: !103, size: 192, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "aes_wcs", scope: !99, file: !100, line: 212, baseType: !114, size: 192, align: 64, offset: 384)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_wstring", file: !100, line: 64, size: 192, align: 64, elements: !115)
!115 = !{!116, !119, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !114, file: !100, line: 65, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !110, line: 90, baseType: !37)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !114, file: !100, line: 66, baseType: !109, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !114, file: !100, line: 67, baseType: !109, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs_in_locale", scope: !99, file: !100, line: 213, baseType: !103, size: 192, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "aes_set", scope: !99, file: !100, line: 218, baseType: !37, size: 32, align: 32, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_set", scope: !59, file: !60, line: 146, baseType: !14, size: 64, align: 64, offset: 2432)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_clear", scope: !59, file: !60, line: 147, baseType: !14, size: 64, align: 64, offset: 2496)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ae_gname", scope: !59, file: !60, line: 148, baseType: !99, size: 832, align: 64, offset: 2560)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ae_hardlink", scope: !59, file: !60, line: 149, baseType: !99, size: 832, align: 64, offset: 3392)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ae_pathname", scope: !59, file: !60, line: 150, baseType: !99, size: 832, align: 64, offset: 4224)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ae_symlink", scope: !59, file: !60, line: 151, baseType: !99, size: 832, align: 64, offset: 5056)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ae_uname", scope: !59, file: !60, line: 152, baseType: !99, size: 832, align: 64, offset: 5888)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ae_sourcepath", scope: !59, file: !60, line: 155, baseType: !99, size: 832, align: 64, offset: 6720)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "encryption", scope: !59, file: !60, line: 160, baseType: !107, size: 8, align: 8, offset: 7552)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata", scope: !59, file: !60, line: 162, baseType: !4, size: 64, align: 64, offset: 7616)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata_size", scope: !59, file: !60, line: 163, baseType: !109, size: 64, align: 64, offset: 7680)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !59, file: !60, line: 166, baseType: !135, size: 448, align: 64, offset: 7744)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl", file: !136, line: 46, size: 448, align: 64, elements: !137)
!136 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_acl_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!137 = !{!138, !140, !150, !151, !152, !153, !154}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !135, file: !136, line: 47, baseType: !139, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 63, baseType: !33)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "acl_head", scope: !135, file: !136, line: 48, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl_entry", file: !136, line: 37, size: 1024, align: 64, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !136, line: 38, baseType: !141, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !136, line: 39, baseType: !37, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !142, file: !136, line: 40, baseType: !37, size: 32, align: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "permset", scope: !142, file: !136, line: 41, baseType: !37, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !136, line: 42, baseType: !37, size: 32, align: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !136, line: 43, baseType: !99, size: 832, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "acl_p", scope: !135, file: !136, line: 49, baseType: !141, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "acl_state", scope: !135, file: !136, line: 50, baseType: !37, size: 32, align: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text_w", scope: !135, file: !136, line: 51, baseType: !117, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text", scope: !135, file: !136, line: 52, baseType: !106, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "acl_types", scope: !135, file: !136, line: 53, baseType: !37, size: 32, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_head", scope: !59, file: !60, line: 169, baseType: !156, size: 64, align: 64, offset: 8192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ae_xattr", file: !60, line: 38, size: 256, align: 64, elements: !158)
!158 = !{!159, !160, !161, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !60, line: 39, baseType: !156, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !60, line: 41, baseType: !106, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !157, file: !60, line: 42, baseType: !4, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !60, line: 43, baseType: !109, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_p", scope: !59, file: !60, line: 170, baseType: !156, size: 64, align: 64, offset: 8256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_head", scope: !59, file: !60, line: 173, baseType: !165, size: 64, align: 64, offset: 8320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ae_sparse", file: !60, line: 46, size: 192, align: 64, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !60, line: 47, baseType: !165, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !166, file: !60, line: 49, baseType: !72, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !166, file: !60, line: 50, baseType: !72, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_tail", scope: !59, file: !60, line: 174, baseType: !165, size: 64, align: 64, offset: 8384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_p", scope: !59, file: !60, line: 175, baseType: !165, size: 64, align: 64, offset: 8448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "strmode", scope: !59, file: !60, line: 178, baseType: !174, size: 96, align: 8, offset: 8512)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 96, align: 8, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 12)
!177 = !{i32 2, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!180 = !DILocalVariable(name: "entry", arg: 1, scope: !19, file: !1, line: 40, type: !58)
!181 = !DIExpression()
!182 = !DILocation(line: 40, column: 42, scope: !19)
!183 = !DILocalVariable(name: "st", scope: !19, file: !1, line: 42, type: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!185 = !DILocation(line: 42, column: 15, scope: !19)
!186 = !DILocation(line: 43, column: 6, scope: !187)
!187 = distinct !DILexicalBlock(scope: !19, file: !1, line: 43, column: 6)
!188 = !DILocation(line: 43, column: 13, scope: !187)
!189 = !DILocation(line: 43, column: 18, scope: !187)
!190 = !DILocation(line: 43, column: 6, scope: !19)
!191 = !DILocation(line: 44, column: 17, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !1, line: 43, column: 27)
!193 = !DILocation(line: 44, column: 3, scope: !192)
!194 = !DILocation(line: 44, column: 10, scope: !192)
!195 = !DILocation(line: 44, column: 15, scope: !192)
!196 = !DILocation(line: 45, column: 7, scope: !197)
!197 = distinct !DILexicalBlock(scope: !192, file: !1, line: 45, column: 7)
!198 = !DILocation(line: 45, column: 14, scope: !197)
!199 = !DILocation(line: 45, column: 19, scope: !197)
!200 = !DILocation(line: 45, column: 7, scope: !192)
!201 = !DILocation(line: 46, column: 4, scope: !197)
!202 = !DILocation(line: 47, column: 3, scope: !192)
!203 = !DILocation(line: 47, column: 10, scope: !192)
!204 = !DILocation(line: 47, column: 21, scope: !192)
!205 = !DILocation(line: 48, column: 2, scope: !192)
!206 = !DILocation(line: 58, column: 6, scope: !207)
!207 = distinct !DILexicalBlock(scope: !19, file: !1, line: 58, column: 6)
!208 = !DILocation(line: 58, column: 13, scope: !207)
!209 = !DILocation(line: 58, column: 6, scope: !19)
!210 = !DILocation(line: 59, column: 11, scope: !207)
!211 = !DILocation(line: 59, column: 18, scope: !207)
!212 = !DILocation(line: 59, column: 10, scope: !207)
!213 = !DILocation(line: 59, column: 3, scope: !207)
!214 = !DILocation(line: 61, column: 7, scope: !19)
!215 = !DILocation(line: 61, column: 14, scope: !19)
!216 = !DILocation(line: 61, column: 5, scope: !19)
!217 = !DILocation(line: 66, column: 37, scope: !19)
!218 = !DILocation(line: 66, column: 17, scope: !19)
!219 = !DILocation(line: 66, column: 2, scope: !19)
!220 = !DILocation(line: 66, column: 6, scope: !19)
!221 = !DILocation(line: 66, column: 15, scope: !19)
!222 = !DILocation(line: 70, column: 37, scope: !19)
!223 = !DILocation(line: 70, column: 17, scope: !19)
!224 = !DILocation(line: 70, column: 2, scope: !19)
!225 = !DILocation(line: 70, column: 6, scope: !19)
!226 = !DILocation(line: 70, column: 15, scope: !19)
!227 = !DILocation(line: 71, column: 37, scope: !19)
!228 = !DILocation(line: 71, column: 17, scope: !19)
!229 = !DILocation(line: 71, column: 2, scope: !19)
!230 = !DILocation(line: 71, column: 6, scope: !19)
!231 = !DILocation(line: 71, column: 15, scope: !19)
!232 = !DILocation(line: 72, column: 33, scope: !19)
!233 = !DILocation(line: 72, column: 15, scope: !19)
!234 = !DILocation(line: 72, column: 2, scope: !19)
!235 = !DILocation(line: 72, column: 6, scope: !19)
!236 = !DILocation(line: 72, column: 13, scope: !19)
!237 = !DILocation(line: 73, column: 40, scope: !19)
!238 = !DILocation(line: 73, column: 22, scope: !19)
!239 = !DILocation(line: 73, column: 15, scope: !19)
!240 = !DILocation(line: 73, column: 2, scope: !19)
!241 = !DILocation(line: 73, column: 6, scope: !19)
!242 = !DILocation(line: 73, column: 13, scope: !19)
!243 = !DILocation(line: 74, column: 40, scope: !19)
