; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_set_format_iso9660.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_rb_tree_ops = type { i32 (%struct.archive_rb_node*, %struct.archive_rb_node*)*, i32 (%struct.archive_rb_node*, i8*)* }
%struct.archive_rb_node = type { [2 x %struct.archive_rb_node*], i64 }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !366, subprograms: !568, globals: !950)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_set_format_iso9660.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3, !60, !65, !338, !344, !350, !356, !360}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !1, line: 197, size: 32, align: 32, elements: !56)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "isofile", file: !1, line: 160, size: 1600, align: 64, elements: !5)
!5 = !{!6, !8, !9, !10, !11, !15, !27, !28, !29, !30, !32, !46, !47, !48, !49}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "allnext", scope: !4, file: !1, line: 162, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "datanext", scope: !4, file: !1, line: 163, baseType: !7, size: 64, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "hlnext", scope: !4, file: !1, line: 165, baseType: !7, size: 64, align: 64, offset: 128)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "hardlink_target", scope: !4, file: !1, line: 166, baseType: !7, size: 64, align: 64, offset: 192)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !4, file: !1, line: 168, baseType: !12, size: 64, align: 64, offset: 256)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !14, line: 180, flags: DIFlagFwdDecl)
!14 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!15 = !DIDerivedType(tag: DW_TAG_member, name: "parentdir", scope: !4, file: !1, line: 173, baseType: !16, size: 192, align: 64, offset: 320)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !17, line: 58, size: 192, align: 64, elements: !18)
!17 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!18 = !{!19, !22, !26}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !16, file: !17, line: 59, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !16, file: !17, line: 60, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 62, baseType: !25)
!24 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!25 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !16, file: !17, line: 61, baseType: !23, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !4, file: !1, line: 174, baseType: !16, size: 192, align: 64, offset: 512)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "basename_utf16", scope: !4, file: !1, line: 175, baseType: !16, size: 192, align: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !4, file: !1, line: 176, baseType: !16, size: 192, align: 64, offset: 896)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dircnt", scope: !4, file: !1, line: 177, baseType: !31, size: 32, align: 32, offset: 1088)
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !4, file: !1, line: 194, baseType: !33, size: 256, align: 64, offset: 1152)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "content", file: !1, line: 183, size: 256, align: 64, elements: !34)
!34 = !{!35, !39, !40, !41, !44}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "offset_of_temp", scope: !33, file: !1, line: 184, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !37, line: 40, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!38 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !1, line: 185, baseType: !36, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !33, file: !1, line: 186, baseType: !31, size: 32, align: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !33, file: !1, line: 187, baseType: !42, size: 32, align: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !37, line: 51, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !1, line: 193, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cur_content", scope: !4, file: !1, line: 194, baseType: !45, size: 64, align: 64, offset: 1408)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "write_content", scope: !4, file: !1, line: 195, baseType: !31, size: 32, align: 32, offset: 1472)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "boot", scope: !4, file: !1, line: 201, baseType: !3, size: 32, align: 32, offset: 1504)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "zisofs", scope: !4, file: !1, line: 210, baseType: !50, size: 64, align: 32, offset: 1536)
!50 = !DICompositeType(tag: DW_TAG_structure_type, scope: !4, file: !1, line: 206, size: 64, align: 32, elements: !51)
!51 = !{!52, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !50, file: !1, line: 207, baseType: !53, size: 8, align: 8)
!53 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "log2_bs", scope: !50, file: !1, line: 208, baseType: !53, size: 8, align: 8, offset: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !50, file: !1, line: 209, baseType: !42, size: 32, align: 32, offset: 32)
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "NO", value: 0)
!58 = !DIEnumerator(name: "BOOT_CATALOG", value: 1)
!59 = !DIEnumerator(name: "BOOT_IMAGE", value: 2)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vdd_type", file: !1, line: 720, size: 32, align: 32, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "VDD_PRIMARY", value: 0)
!63 = !DIEnumerator(name: "VDD_JOLIET", value: 1)
!64 = !DIEnumerator(name: "VDD_ENHANCED", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !66, file: !1, line: 799, size: 32, align: 32, elements: !335)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "iso9660", file: !1, line: 679, size: 531392, align: 64, elements: !67)
!67 = !{!68, !73, !74, !75, !170, !171, !173, !174, !175, !176, !180, !181, !187, !192, !193, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !284, !285, !286, !290, !291, !292, !293, !294, !295, !310}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "birth_time", scope: !66, file: !1, line: 681, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !70, line: 75, baseType: !71)
!70 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !72, line: 139, baseType: !38)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "temp_fd", scope: !66, file: !1, line: 684, baseType: !31, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cur_file", scope: !66, file: !1, line: 686, baseType: !7, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cur_dirent", scope: !66, file: !1, line: 687, baseType: !76, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "isoent", file: !1, line: 213, size: 1920, align: 64, elements: !78)
!78 = !{!79, !90, !91, !92, !99, !124, !130, !131, !132, !133, !134, !135, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !168, !169}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !77, file: !1, line: 215, baseType: !80, size: 192, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_rb_node", file: !81, line: 34, size: 192, align: 64, elements: !82)
!81 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_rb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!82 = !{!83, !88}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "rb_nodes", scope: !80, file: !81, line: 35, baseType: !84, size: 128, align: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, align: 64, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!86 = !{!87}
!87 = !DISubrange(count: 2)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rb_info", scope: !80, file: !81, line: 41, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !37, line: 122, baseType: !25)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !77, file: !1, line: 217, baseType: !7, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !77, file: !1, line: 219, baseType: !76, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !77, file: !1, line: 225, baseType: !93, size: 192, align: 64, offset: 320)
!93 = !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !1, line: 221, size: 192, align: 64, elements: !94)
!94 = !{!95, !96, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !93, file: !1, line: 222, baseType: !76, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !93, file: !1, line: 223, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !93, file: !1, line: 224, baseType: !31, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !77, file: !1, line: 226, baseType: !100, size: 128, align: 64, offset: 512)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_rb_tree", file: !81, line: 80, size: 128, align: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "rbt_root", scope: !100, file: !81, line: 81, baseType: !85, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rbt_ops", scope: !100, file: !81, line: 82, baseType: !104, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_rb_tree_ops", file: !81, line: 75, size: 128, align: 64, elements: !107)
!107 = !{!108, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rbto_compare_nodes", scope: !106, file: !81, line: 76, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_rbto_compare_nodes_fn", file: !81, line: 70, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!31, !114, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rbto_compare_key", scope: !106, file: !81, line: 77, baseType: !117, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_rbto_compare_key_fn", file: !81, line: 72, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!31, !114, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !77, file: !1, line: 233, baseType: !125, size: 192, align: 64, offset: 640)
!125 = !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !1, line: 229, size: 192, align: 64, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !1, line: 230, baseType: !76, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !1, line: 231, baseType: !97, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !125, file: !1, line: 232, baseType: !31, size: 32, align: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "children_sorted", scope: !77, file: !1, line: 235, baseType: !97, size: 64, align: 64, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chnext", scope: !77, file: !1, line: 237, baseType: !76, size: 64, align: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "drnext", scope: !77, file: !1, line: 238, baseType: !76, size: 64, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ptnext", scope: !77, file: !1, line: 239, baseType: !76, size: 64, align: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dir_number", scope: !77, file: !1, line: 244, baseType: !31, size: 32, align: 32, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dr_len", scope: !77, file: !1, line: 250, baseType: !136, size: 128, align: 32, offset: 1120)
!136 = !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !1, line: 245, size: 128, align: 32, elements: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !136, file: !1, line: 246, baseType: !31, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !136, file: !1, line: 247, baseType: !31, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !136, file: !1, line: 248, baseType: !31, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !136, file: !1, line: 249, baseType: !31, size: 32, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "dir_location", scope: !77, file: !1, line: 251, baseType: !42, size: 32, align: 32, offset: 1248)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dir_block", scope: !77, file: !1, line: 252, baseType: !31, size: 32, align: 32, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !77, file: !1, line: 267, baseType: !20, size: 64, align: 64, offset: 1344)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ext_off", scope: !77, file: !1, line: 268, baseType: !31, size: 32, align: 32, offset: 1408)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ext_len", scope: !77, file: !1, line: 269, baseType: !31, size: 32, align: 32, offset: 1440)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !77, file: !1, line: 270, baseType: !31, size: 32, align: 32, offset: 1472)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mb_len", scope: !77, file: !1, line: 271, baseType: !31, size: 32, align: 32, offset: 1504)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rr_parent", scope: !77, file: !1, line: 277, baseType: !76, size: 64, align: 64, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rr_child", scope: !77, file: !1, line: 278, baseType: !76, size: 64, align: 64, offset: 1600)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "extr_rec_list", scope: !77, file: !1, line: 290, baseType: !152, size: 192, align: 64, offset: 1664)
!152 = !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !1, line: 286, size: 192, align: 64, elements: !153)
!153 = !{!154, !165, !167}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !152, file: !1, line: 287, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "extr_rec", file: !1, line: 125, size: 16512, align: 64, elements: !157)
!157 = !{!158, !159, !160, !164}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !156, file: !1, line: 126, baseType: !31, size: 32, align: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !156, file: !1, line: 127, baseType: !31, size: 32, align: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !156, file: !1, line: 128, baseType: !161, size: 16384, align: 8, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 16384, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 2048)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !1, line: 129, baseType: !155, size: 64, align: 64, offset: 16448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !152, file: !1, line: 288, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !152, file: !1, line: 289, baseType: !155, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "virtual", scope: !77, file: !1, line: 292, baseType: !31, size: 1, align: 32, offset: 1856)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !77, file: !1, line: 297, baseType: !31, size: 1, align: 32, offset: 1857)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "cur_dirstr", scope: !66, file: !1, line: 688, baseType: !16, size: 192, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_remaining", scope: !66, file: !1, line: 689, baseType: !172, size: 64, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !37, line: 55, baseType: !25)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "need_multi_extent", scope: !66, file: !1, line: 690, baseType: !31, size: 32, align: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be", scope: !66, file: !1, line: 693, baseType: !16, size: 192, align: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mbs", scope: !66, file: !1, line: 694, baseType: !16, size: 192, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sconv_to_utf16be", scope: !66, file: !1, line: 696, baseType: !177, size: 64, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !179, line: 36, flags: DIFlagFwdDecl)
!179 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_locale.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sconv_from_utf16be", scope: !66, file: !1, line: 697, baseType: !177, size: 64, align: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "all_file_list", scope: !66, file: !1, line: 703, baseType: !182, size: 128, align: 64, offset: 1088)
!182 = !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !1, line: 700, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !182, file: !1, line: 701, baseType: !7, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !182, file: !1, line: 702, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data_file_list", scope: !66, file: !1, line: 711, baseType: !188, size: 128, align: 64, offset: 1216)
!188 = !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !1, line: 708, size: 128, align: 64, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !188, file: !1, line: 709, baseType: !7, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !188, file: !1, line: 710, baseType: !186, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hardlink_rbtree", scope: !66, file: !1, line: 714, baseType: !100, size: 128, align: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !66, file: !1, line: 739, baseType: !194, size: 384, align: 64, offset: 1472)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdd", file: !1, line: 717, size: 384, align: 64, elements: !195)
!195 = !{!196, !197, !198, !206, !207, !208, !209, !210, !211}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rootent", scope: !194, file: !1, line: 719, baseType: !76, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vdd_type", scope: !194, file: !1, line: 724, baseType: !60, size: 32, align: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pathtbl", scope: !194, file: !1, line: 731, baseType: !199, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "path_table", file: !1, line: 726, size: 256, align: 64, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !200, file: !1, line: 727, baseType: !76, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !200, file: !1, line: 728, baseType: !97, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !200, file: !1, line: 729, baseType: !97, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !200, file: !1, line: 730, baseType: !31, size: 32, align: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "max_depth", scope: !194, file: !1, line: 732, baseType: !31, size: 32, align: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "path_table_block", scope: !194, file: !1, line: 734, baseType: !31, size: 32, align: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "path_table_size", scope: !194, file: !1, line: 735, baseType: !31, size: 32, align: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "location_type_L_path_table", scope: !194, file: !1, line: 736, baseType: !31, size: 32, align: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "location_type_M_path_table", scope: !194, file: !1, line: 737, baseType: !31, size: 32, align: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "total_dir_block", scope: !194, file: !1, line: 738, baseType: !31, size: 32, align: 32, offset: 352)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "joliet", scope: !66, file: !1, line: 739, baseType: !194, size: 384, align: 64, offset: 1856)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "volume_space_size", scope: !66, file: !1, line: 742, baseType: !31, size: 32, align: 32, offset: 2240)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "volume_sequence_number", scope: !66, file: !1, line: 743, baseType: !31, size: 32, align: 32, offset: 2272)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "total_file_block", scope: !66, file: !1, line: 744, baseType: !31, size: 32, align: 32, offset: 2304)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "volume_identifier", scope: !66, file: !1, line: 745, baseType: !16, size: 192, align: 64, offset: 2368)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "publisher_identifier", scope: !66, file: !1, line: 746, baseType: !16, size: 192, align: 64, offset: 2560)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data_preparer_identifier", scope: !66, file: !1, line: 747, baseType: !16, size: 192, align: 64, offset: 2752)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "application_identifier", scope: !66, file: !1, line: 748, baseType: !16, size: 192, align: 64, offset: 2944)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "copyright_file_identifier", scope: !66, file: !1, line: 749, baseType: !16, size: 192, align: 64, offset: 3136)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_file_identifier", scope: !66, file: !1, line: 750, baseType: !16, size: 192, align: 64, offset: 3328)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bibliographic_file_identifier", scope: !66, file: !1, line: 751, baseType: !16, size: 192, align: 64, offset: 3520)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "location_rrip_er", scope: !66, file: !1, line: 754, baseType: !31, size: 32, align: 32, offset: 3712)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "zisofs", scope: !66, file: !1, line: 787, baseType: !225, size: 1984, align: 64, offset: 3776)
!225 = !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !1, line: 757, size: 1984, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230, !234, !235, !237, !238, !239, !240, !241, !242, !281, !282, !283}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "detect_magic", scope: !225, file: !1, line: 758, baseType: !31, size: 1, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "making", scope: !225, file: !1, line: 759, baseType: !31, size: 1, align: 32, offset: 1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "allzero", scope: !225, file: !1, line: 760, baseType: !31, size: 1, align: 32, offset: 2)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "magic_buffer", scope: !225, file: !1, line: 761, baseType: !231, size: 512, align: 8, offset: 8)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, align: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "magic_cnt", scope: !225, file: !1, line: 762, baseType: !31, size: 32, align: 32, offset: 544)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers", scope: !225, file: !1, line: 775, baseType: !236, size: 64, align: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_allocated", scope: !225, file: !1, line: 776, baseType: !23, size: 64, align: 64, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_cnt", scope: !225, file: !1, line: 777, baseType: !31, size: 32, align: 32, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_idx", scope: !225, file: !1, line: 778, baseType: !31, size: 32, align: 32, offset: 736)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !225, file: !1, line: 779, baseType: !36, size: 64, align: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "block_offset", scope: !225, file: !1, line: 780, baseType: !36, size: 64, align: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !225, file: !1, line: 782, baseType: !243, size: 896, align: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !244, line: 101, baseType: !245)
!244 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !244, line: 82, size: 896, align: 64, elements: !246)
!246 = !{!247, !252, !254, !256, !257, !258, !259, !260, !265, !272, !277, !278, !279, !280}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !245, file: !244, line: 83, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !250, line: 276, baseType: !251)
!250 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zconf.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !250, line: 267, baseType: !53)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !245, file: !244, line: 84, baseType: !253, size: 32, align: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !250, line: 269, baseType: !43)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !245, file: !244, line: 85, baseType: !255, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !250, line: 270, baseType: !25)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !245, file: !244, line: 87, baseType: !248, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !245, file: !244, line: 88, baseType: !253, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !245, file: !244, line: 89, baseType: !255, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !245, file: !244, line: 91, baseType: !20, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !245, file: !244, line: 92, baseType: !261, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !244, line: 1346, size: 32, align: 32, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !262, file: !244, line: 1346, baseType: !31, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !245, file: !244, line: 94, baseType: !266, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !244, line: 77, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !270, !253, !253}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !250, line: 285, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !245, file: !244, line: 95, baseType: !273, size: 64, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !244, line: 78, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !270, !270}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !245, file: !244, line: 96, baseType: !270, size: 64, align: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !245, file: !244, line: 98, baseType: !31, size: 32, align: 32, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !245, file: !244, line: 99, baseType: !255, size: 64, align: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !245, file: !244, line: 100, baseType: !255, size: 64, align: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stream_valid", scope: !225, file: !1, line: 783, baseType: !31, size: 32, align: 32, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !225, file: !1, line: 784, baseType: !36, size: 64, align: 64, offset: 1856)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !225, file: !1, line: 785, baseType: !31, size: 32, align: 32, offset: 1920)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "directories_too_deep", scope: !66, file: !1, line: 789, baseType: !76, size: 64, align: 64, offset: 5760)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dircnt_max", scope: !66, file: !1, line: 790, baseType: !31, size: 32, align: 32, offset: 5824)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "wbuff", scope: !66, file: !1, line: 797, baseType: !287, size: 524288, align: 8, offset: 5856)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 524288, align: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 65536)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "wbuff_remaining", scope: !66, file: !1, line: 798, baseType: !23, size: 64, align: 64, offset: 530176)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wbuff_type", scope: !66, file: !1, line: 802, baseType: !65, size: 32, align: 32, offset: 530240)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "wbuff_offset", scope: !66, file: !1, line: 803, baseType: !36, size: 64, align: 64, offset: 530304)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "wbuff_written", scope: !66, file: !1, line: 804, baseType: !36, size: 64, align: 64, offset: 530368)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "wbuff_tail", scope: !66, file: !1, line: 805, baseType: !36, size: 64, align: 64, offset: 530432)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "el_torito", scope: !66, file: !1, line: 831, baseType: !296, size: 832, align: 64, offset: 530496)
!296 = !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !1, line: 808, size: 832, align: 64, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !309}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "catalog_filename", scope: !296, file: !1, line: 810, baseType: !16, size: 192, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !296, file: !1, line: 811, baseType: !76, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "boot_filename", scope: !296, file: !1, line: 813, baseType: !16, size: 192, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "boot", scope: !296, file: !1, line: 814, baseType: !76, size: 64, align: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "platform_id", scope: !296, file: !1, line: 816, baseType: !53, size: 8, align: 8, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !1, line: 820, baseType: !16, size: 192, align: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "media_type", scope: !296, file: !1, line: 821, baseType: !53, size: 8, align: 8, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "system_type", scope: !296, file: !1, line: 827, baseType: !53, size: 8, align: 8, offset: 776)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "boot_load_seg", scope: !296, file: !1, line: 828, baseType: !307, size: 16, align: 16, offset: 784)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !37, line: 49, baseType: !308)
!308 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "boot_load_size", scope: !296, file: !1, line: 829, baseType: !307, size: 16, align: 16, offset: 800)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !66, file: !1, line: 833, baseType: !311, size: 32, align: 32, offset: 531328)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "iso_option", file: !1, line: 312, size: 32, align: 32, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_file", scope: !311, file: !1, line: 323, baseType: !43, size: 1, align: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "application_id", scope: !311, file: !1, line: 340, baseType: !43, size: 1, align: 32, offset: 1)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "allow_vernum", scope: !311, file: !1, line: 353, baseType: !43, size: 1, align: 32, offset: 2)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "biblio_file", scope: !311, file: !1, line: 366, baseType: !43, size: 1, align: 32, offset: 3)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "boot", scope: !311, file: !1, line: 379, baseType: !43, size: 1, align: 32, offset: 4)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "boot_catalog", scope: !311, file: !1, line: 390, baseType: !43, size: 1, align: 32, offset: 5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info_table", scope: !311, file: !1, line: 404, baseType: !43, size: 1, align: 32, offset: 6)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "boot_load_seg", scope: !311, file: !1, line: 416, baseType: !43, size: 1, align: 32, offset: 7)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "boot_load_size", scope: !311, file: !1, line: 428, baseType: !43, size: 1, align: 32, offset: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "boot_type", scope: !311, file: !1, line: 452, baseType: !43, size: 2, align: 32, offset: 9)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !311, file: !1, line: 467, baseType: !43, size: 1, align: 32, offset: 11)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "copyright_file", scope: !311, file: !1, line: 480, baseType: !43, size: 1, align: 32, offset: 12)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !311, file: !1, line: 492, baseType: !43, size: 1, align: 32, offset: 13)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "iso_level", scope: !311, file: !1, line: 534, baseType: !43, size: 3, align: 32, offset: 14)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "joliet", scope: !311, file: !1, line: 555, baseType: !43, size: 2, align: 32, offset: 17)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "limit_depth", scope: !311, file: !1, line: 570, baseType: !43, size: 1, align: 32, offset: 19)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "limit_dirs", scope: !311, file: !1, line: 584, baseType: !43, size: 1, align: 32, offset: 20)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !311, file: !1, line: 595, baseType: !43, size: 1, align: 32, offset: 21)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "publisher", scope: !311, file: !1, line: 610, baseType: !43, size: 1, align: 32, offset: 22)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !311, file: !1, line: 636, baseType: !43, size: 2, align: 32, offset: 23)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "volume_id", scope: !311, file: !1, line: 650, baseType: !43, size: 1, align: 32, offset: 25)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "zisofs", scope: !311, file: !1, line: 672, baseType: !43, size: 1, align: 32, offset: 26)
!335 = !{!336, !337}
!336 = !DIEnumerator(name: "WB_TO_STREAM", value: 0)
!337 = !DIEnumerator(name: "WB_TO_TEMP", value: 1)
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dir_rec_type", file: !1, line: 849, size: 32, align: 32, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIEnumerator(name: "DIR_REC_VD", value: 0)
!341 = !DIEnumerator(name: "DIR_REC_SELF", value: 1)
!342 = !DIEnumerator(name: "DIR_REC_PARENT", value: 2)
!343 = !DIEnumerator(name: "DIR_REC_NORMAL", value: 3)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VD_type", file: !1, line: 839, size: 32, align: 32, elements: !345)
!345 = !{!346, !347, !348, !349}
!346 = !DIEnumerator(name: "VDT_BOOT_RECORD", value: 0)
!347 = !DIEnumerator(name: "VDT_PRIMARY", value: 1)
!348 = !DIEnumerator(name: "VDT_SUPPLEMENTARY", value: 2)
!349 = !DIEnumerator(name: "VDT_TERMINATOR", value: 255)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vdc", file: !1, line: 859, size: 32, align: 32, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIEnumerator(name: "VDC_STD", value: 0)
!353 = !DIEnumerator(name: "VDC_LOWERCASE", value: 1)
!354 = !DIEnumerator(name: "VDC_UCS2", value: 2)
!355 = !DIEnumerator(name: "VDC_UCS2_DIRECT", value: 3)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "char_type", file: !1, line: 898, size: 32, align: 32, elements: !357)
!357 = !{!358, !359}
!358 = !DIEnumerator(name: "A_CHAR", value: 0)
!359 = !DIEnumerator(name: "D_CHAR", value: 1)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "keytype", file: !1, line: 4004, size: 32, align: 32, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIEnumerator(name: "KEY_FLG", value: 0)
!363 = !DIEnumerator(name: "KEY_STR", value: 1)
!364 = !DIEnumerator(name: "KEY_INT", value: 2)
!365 = !DIEnumerator(name: "KEY_HEX", value: 3)
!366 = !{!367, !271, !307, !528, !530, !531, !429, !76, !85, !31, !533, !42, !23, !543, !453, !544, !122, !36, !253, !248, !89, !396, !20, !545, !551, !53, !557, !562, !21, !172, !155, !563, !565, !566}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write", file: !369, line: 72, size: 2816, align: 64, elements: !370)
!369 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!370 = !{!371, !449, !450, !451, !452, !455, !456, !461, !467, !470, !471, !472, !473, !499, !500, !501, !502, !506, !510, !511, !515, !519, !520, !521, !522, !527}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !368, file: !369, line: 73, baseType: !372, size: 1280, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !373, line: 89, size: 1280, align: 64, elements: !374)
!373 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!374 = !{!375, !376, !377, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !372, file: !373, line: 96, baseType: !43, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !372, file: !373, line: 97, baseType: !43, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !372, file: !373, line: 103, baseType: !378, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !373, line: 63, size: 832, align: 64, elements: !380)
!380 = !{!381, !386, !387, !391, !392, !399, !403, !408, !409, !416, !417, !421, !425}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !379, file: !373, line: 64, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!31, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !379, file: !373, line: 65, baseType: !382, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !379, file: !373, line: 66, baseType: !388, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!31, !385, !12}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !379, file: !373, line: 68, baseType: !382, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !379, file: !373, line: 69, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !385, !122, !23}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !397, line: 109, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !72, line: 172, baseType: !38)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !379, file: !373, line: 71, baseType: !400, size: 64, align: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!396, !385, !122, !23, !36}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !379, file: !373, line: 74, baseType: !404, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!31, !385, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !379, file: !373, line: 76, baseType: !388, size: 64, align: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !379, file: !373, line: 78, baseType: !410, size: 64, align: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!31, !385, !413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !379, file: !373, line: 81, baseType: !382, size: 64, align: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !379, file: !373, line: 82, baseType: !418, size: 64, align: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!36, !385, !31}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !379, file: !373, line: 83, baseType: !422, size: 64, align: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!31, !385, !31}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !379, file: !373, line: 84, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !385, !31}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !372, file: !373, line: 105, baseType: !31, size: 32, align: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !372, file: !373, line: 106, baseType: !429, size: 64, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !372, file: !373, line: 108, baseType: !31, size: 32, align: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !372, file: !373, line: 109, baseType: !429, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !372, file: !373, line: 112, baseType: !31, size: 32, align: 32, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !372, file: !373, line: 114, baseType: !31, size: 32, align: 32, offset: 416)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !372, file: !373, line: 115, baseType: !429, size: 64, align: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !372, file: !373, line: 116, baseType: !16, size: 192, align: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !372, file: !373, line: 118, baseType: !20, size: 64, align: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !372, file: !373, line: 119, baseType: !43, size: 32, align: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !372, file: !373, line: 120, baseType: !43, size: 32, align: 32, offset: 800)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !372, file: !373, line: 121, baseType: !177, size: 64, align: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !372, file: !373, line: 127, baseType: !429, size: 64, align: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !372, file: !373, line: 128, baseType: !36, size: 64, align: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !372, file: !373, line: 129, baseType: !36, size: 64, align: 64, offset: 1024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !372, file: !373, line: 130, baseType: !23, size: 64, align: 64, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !372, file: !373, line: 137, baseType: !21, size: 8, align: 8, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !372, file: !373, line: 138, baseType: !23, size: 64, align: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !368, file: !369, line: 76, baseType: !31, size: 32, align: 32, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !368, file: !369, line: 77, baseType: !36, size: 64, align: 64, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !368, file: !369, line: 78, baseType: !36, size: 64, align: 64, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nulls", scope: !368, file: !369, line: 81, baseType: !453, size: 64, align: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "null_length", scope: !368, file: !369, line: 82, baseType: !23, size: 64, align: 64, offset: 1536)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "client_opener", scope: !368, file: !369, line: 85, baseType: !457, size: 64, align: 64, offset: 1600)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !14, line: 241, baseType: !459)
!459 = !DISubroutineType(types: !460)
!460 = !{!31, !385, !271}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "client_writer", scope: !368, file: !369, line: 86, baseType: !462, size: 64, align: 64, offset: 1664)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_write_callback", file: !14, line: 237, baseType: !464)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !385, !271, !122, !23}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !14, line: 95, baseType: !396)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "client_closer", scope: !368, file: !369, line: 87, baseType: !468, size: 64, align: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !14, line: 243, baseType: !459)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !368, file: !369, line: 88, baseType: !271, size: 64, align: 64, offset: 1792)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !368, file: !369, line: 96, baseType: !31, size: 32, align: 32, offset: 1856)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !368, file: !369, line: 97, baseType: !31, size: 32, align: 32, offset: 1888)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "filter_first", scope: !368, file: !369, line: 102, baseType: !474, size: 64, align: 64, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write_filter", file: !369, line: 43, size: 768, align: 64, elements: !476)
!476 = !{!477, !478, !479, !480, !484, !488, !492, !493, !494, !495, !496, !497, !498}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !475, file: !369, line: 44, baseType: !36, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !475, file: !369, line: 45, baseType: !385, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_filter", scope: !475, file: !369, line: 46, baseType: !474, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !475, file: !369, line: 47, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!31, !474, !429, !429}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !475, file: !369, line: 49, baseType: !485, size: 64, align: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!31, !474}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !475, file: !369, line: 50, baseType: !489, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!31, !474, !122, !23}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !475, file: !369, line: 51, baseType: !485, size: 64, align: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !475, file: !369, line: 52, baseType: !485, size: 64, align: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !369, line: 53, baseType: !271, size: 64, align: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !475, file: !369, line: 54, baseType: !429, size: 64, align: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !475, file: !369, line: 55, baseType: !31, size: 32, align: 32, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !475, file: !369, line: 56, baseType: !31, size: 32, align: 32, offset: 672)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !475, file: !369, line: 57, baseType: !31, size: 32, align: 32, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "filter_last", scope: !368, file: !369, line: 103, baseType: !474, size: 64, align: 64, offset: 1984)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "format_data", scope: !368, file: !369, line: 109, baseType: !271, size: 64, align: 64, offset: 2048)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "format_name", scope: !368, file: !369, line: 110, baseType: !429, size: 64, align: 64, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "format_init", scope: !368, file: !369, line: 111, baseType: !503, size: 64, align: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!31, !367}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "format_options", scope: !368, file: !369, line: 112, baseType: !507, size: 64, align: 64, offset: 2240)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!31, !367, !429, !429}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "format_finish_entry", scope: !368, file: !369, line: 114, baseType: !503, size: 64, align: 64, offset: 2304)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "format_write_header", scope: !368, file: !369, line: 115, baseType: !512, size: 64, align: 64, offset: 2368)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!31, !367, !12}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "format_write_data", scope: !368, file: !369, line: 117, baseType: !516, size: 64, align: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!396, !367, !122, !23}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "format_close", scope: !368, file: !369, line: 119, baseType: !503, size: 64, align: 64, offset: 2496)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "format_free", scope: !368, file: !369, line: 120, baseType: !503, size: 64, align: 64, offset: 2560)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !368, file: !369, line: 126, baseType: !20, size: 64, align: 64, offset: 2624)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase_callback", scope: !368, file: !369, line: 127, baseType: !523, size: 64, align: 64, offset: 2688)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !14, line: 256, baseType: !525)
!525 = !DISubroutineType(types: !526)
!526 = !{!429, !385, !271}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase_client_data", scope: !368, file: !369, line: 128, baseType: !271, size: 64, align: 64, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !397, line: 70, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !72, line: 129, baseType: !43)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "hardlink", file: !1, line: 300, size: 384, align: 64, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !534, file: !1, line: 301, baseType: !80, size: 192, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !534, file: !1, line: 302, baseType: !31, size: 32, align: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "file_list", scope: !534, file: !1, line: 306, baseType: !539, size: 128, align: 64, offset: 256)
!539 = !DICompositeType(tag: DW_TAG_structure_type, scope: !534, file: !1, line: 303, size: 128, align: 64, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !539, file: !1, line: 304, baseType: !7, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !539, file: !1, line: 305, baseType: !186, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !37, line: 134, baseType: !38)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "idrent", file: !1, line: 871, size: 512, align: 64, elements: !548)
!548 = !{!549, !550, !552, !553, !554, !555, !556}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !547, file: !1, line: 872, baseType: !80, size: 192, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wnext", scope: !547, file: !1, line: 874, baseType: !551, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !547, file: !1, line: 875, baseType: !551, size: 64, align: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "isoent", scope: !547, file: !1, line: 877, baseType: !76, size: 64, align: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !547, file: !1, line: 878, baseType: !31, size: 32, align: 32, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "noff", scope: !547, file: !1, line: 879, baseType: !31, size: 32, align: 32, offset: 416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rename_num", scope: !547, file: !1, line: 880, baseType: !31, size: 32, align: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !558, line: 742, baseType: !559)
!558 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!31, !122, !122}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!568 = !{!569, !571, !572, !576, !580, !581, !584, !587, !590, !593, !596, !597, !598, !601, !604, !607, !610, !613, !614, !615, !616, !619, !622, !623, !624, !627, !631, !632, !633, !636, !639, !640, !643, !644, !645, !646, !647, !650, !651, !652, !655, !656, !657, !676, !677, !678, !681, !684, !685, !689, !692, !695, !696, !699, !700, !703, !706, !709, !712, !734, !737, !740, !741, !744, !745, !748, !751, !754, !757, !760, !766, !769, !770, !771, !772, !773, !774, !775, !776, !779, !782, !783, !784, !787, !790, !793, !796, !799, !802, !803, !804, !807, !825, !828, !831, !832, !835, !850, !853, !856, !859, !862, !865, !866, !869, !872, !875, !878, !879, !880, !883, !886, !889, !892, !895, !898, !899, !900, !903, !904, !907, !910, !911, !912, !913, !916, !919, !922, !923, !924, !925, !928, !929, !930, !931, !934, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!569 = distinct !DISubprogram(name: "archive_write_set_format_iso9660", scope: !1, file: !1, line: 1051, type: !383, isLocal: false, isDefinition: true, scopeLine: 1052, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!570 = !{}
!571 = distinct !DISubprogram(name: "iso9660_options", scope: !1, file: !1, line: 1251, type: !508, isLocal: true, isDefinition: true, scopeLine: 1252, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!572 = distinct !DISubprogram(name: "get_str_opt", scope: !1, file: !1, line: 1190, type: !573, isLocal: true, isDefinition: true, scopeLine: 1192, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!573 = !DISubroutineType(types: !574)
!574 = !{!31, !367, !575, !23, !429, !429}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!576 = distinct !DISubprogram(name: "get_num_opt", scope: !1, file: !1, line: 1205, type: !577, isLocal: true, isDefinition: true, scopeLine: 1207, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!577 = !DISubroutineType(types: !578)
!578 = !{!31, !367, !579, !31, !31, !429, !429}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!580 = distinct !DISubprogram(name: "iso9660_write_header", scope: !1, file: !1, line: 1522, type: !513, isLocal: true, isDefinition: true, scopeLine: 1523, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!581 = distinct !DISubprogram(name: "isofile_new", scope: !1, file: !1, line: 4626, type: !582, isLocal: true, isDefinition: true, scopeLine: 4627, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!582 = !DISubroutineType(types: !583)
!583 = !{!7, !367, !12}
!584 = distinct !DISubprogram(name: "isofile_gen_utility_names", scope: !1, file: !1, line: 4711, type: !585, isLocal: true, isDefinition: true, scopeLine: 4712, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!585 = !DISubroutineType(types: !586)
!586 = !{!31, !367, !7}
!587 = distinct !DISubprogram(name: "isofile_free", scope: !1, file: !1, line: 4652, type: !588, isLocal: true, isDefinition: true, scopeLine: 4653, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !7}
!590 = distinct !DISubprogram(name: "isofile_add_entry", scope: !1, file: !1, line: 4589, type: !591, isLocal: true, isDefinition: true, scopeLine: 4590, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !530, !7}
!593 = distinct !DISubprogram(name: "isoent_new", scope: !1, file: !1, line: 5108, type: !594, isLocal: true, isDefinition: true, scopeLine: 5109, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!594 = !DISubroutineType(types: !595)
!595 = !{!76, !7}
!596 = distinct !DISubprogram(name: "isoent_cmp_node", scope: !1, file: !1, line: 5221, type: !112, isLocal: true, isDefinition: true, scopeLine: 5223, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!597 = distinct !DISubprogram(name: "isoent_cmp_key", scope: !1, file: !1, line: 5231, type: !120, isLocal: true, isDefinition: true, scopeLine: 5232, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!598 = distinct !DISubprogram(name: "isoent_tree", scope: !1, file: !1, line: 5550, type: !599, isLocal: true, isDefinition: true, scopeLine: 5551, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!599 = !DISubroutineType(types: !600)
!600 = !{!31, !367, !97}
!601 = distinct !DISubprogram(name: "isoent_add_child_tail", scope: !1, file: !1, line: 5264, type: !602, isLocal: true, isDefinition: true, scopeLine: 5265, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!602 = !DISubroutineType(types: !603)
!603 = !{!31, !76, !76}
!604 = distinct !DISubprogram(name: "get_path_component", scope: !1, file: !1, line: 5527, type: !605, isLocal: true, isDefinition: true, scopeLine: 5528, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!605 = !DISubroutineType(types: !606)
!606 = !{!31, !20, !23, !429}
!607 = distinct !DISubprogram(name: "_isoent_free", scope: !1, file: !1, line: 5140, type: !608, isLocal: true, isDefinition: true, scopeLine: 5141, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !76}
!610 = distinct !DISubprogram(name: "isoent_find_child", scope: !1, file: !1, line: 5733, type: !611, isLocal: true, isDefinition: true, scopeLine: 5734, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!611 = !DISubroutineType(types: !612)
!612 = !{!76, !76, !429}
!613 = distinct !DISubprogram(name: "isofile_register_hardlink", scope: !1, file: !1, line: 4998, type: !585, isLocal: true, isDefinition: true, scopeLine: 4999, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!614 = distinct !DISubprogram(name: "zisofs_init", scope: !1, file: !1, line: 7416, type: !585, isLocal: true, isDefinition: true, scopeLine: 7417, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!615 = distinct !DISubprogram(name: "zisofs_init_zstream", scope: !1, file: !1, line: 7374, type: !504, isLocal: true, isDefinition: true, scopeLine: 7375, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!616 = distinct !DISubprogram(name: "write_null", scope: !1, file: !1, line: 3725, type: !617, isLocal: true, isDefinition: true, scopeLine: 3726, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!617 = !DISubroutineType(types: !618)
!618 = !{!31, !367, !23}
!619 = distinct !DISubprogram(name: "wb_buffptr", scope: !1, file: !1, line: 3612, type: !620, isLocal: true, isDefinition: true, scopeLine: 3613, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!620 = !DISubroutineType(types: !621)
!621 = !{!544, !367}
!622 = distinct !DISubprogram(name: "wb_consume", scope: !1, file: !1, line: 3646, type: !617, isLocal: true, isDefinition: true, scopeLine: 3647, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!623 = distinct !DISubprogram(name: "wb_write_out", scope: !1, file: !1, line: 3621, type: !504, isLocal: true, isDefinition: true, scopeLine: 3622, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!624 = distinct !DISubprogram(name: "write_to_temp", scope: !1, file: !1, line: 1640, type: !625, isLocal: true, isDefinition: true, scopeLine: 1641, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!625 = !DISubroutineType(types: !626)
!626 = !{!31, !367, !122, !23}
!627 = distinct !DISubprogram(name: "archive_le32enc", scope: !628, file: !628, line: 177, type: !629, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!628 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_endian.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!629 = !DISubroutineType(types: !630)
!630 = !{null, !271, !42}
!631 = distinct !DISubprogram(name: "iso9660_write_data", scope: !1, file: !1, line: 1789, type: !517, isLocal: true, isDefinition: true, scopeLine: 1790, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!632 = distinct !DISubprogram(name: "write_iso9660_data", scope: !1, file: !1, line: 1710, type: !517, isLocal: true, isDefinition: true, scopeLine: 1711, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!633 = distinct !DISubprogram(name: "zisofs_detect_magic", scope: !1, file: !1, line: 7505, type: !634, isLocal: true, isDefinition: true, scopeLine: 7506, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !367, !122, !23}
!636 = distinct !DISubprogram(name: "archive_le32dec", scope: !628, file: !628, line: 115, type: !637, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!637 = !DISubroutineType(types: !638)
!638 = !{!42, !122}
!639 = distinct !DISubprogram(name: "zisofs_write_to_temp", scope: !1, file: !1, line: 7597, type: !625, isLocal: true, isDefinition: true, scopeLine: 7598, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!640 = distinct !DISubprogram(name: "wb_set_offset", scope: !1, file: !1, line: 3667, type: !641, isLocal: true, isDefinition: true, scopeLine: 3668, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!641 = !DISubroutineType(types: !642)
!642 = !{!31, !367, !36}
!643 = distinct !DISubprogram(name: "wb_write_to_temp", scope: !1, file: !1, line: 1661, type: !625, isLocal: true, isDefinition: true, scopeLine: 1662, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!644 = distinct !DISubprogram(name: "wb_write_padding_to_temp", scope: !1, file: !1, line: 1696, type: !641, isLocal: true, isDefinition: true, scopeLine: 1697, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!645 = distinct !DISubprogram(name: "iso9660_finish_entry", scope: !1, file: !1, line: 1810, type: !504, isLocal: true, isDefinition: true, scopeLine: 1811, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!646 = distinct !DISubprogram(name: "zisofs_finish_entry", scope: !1, file: !1, line: 7710, type: !504, isLocal: true, isDefinition: true, scopeLine: 7711, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!647 = distinct !DISubprogram(name: "set_num_731", scope: !1, file: !1, line: 2460, type: !648, isLocal: true, isDefinition: true, scopeLine: 2461, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !544, !42}
!650 = distinct !DISubprogram(name: "isofile_add_data_file", scope: !1, file: !1, line: 4617, type: !591, isLocal: true, isDefinition: true, scopeLine: 4618, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!651 = distinct !DISubprogram(name: "iso9660_close", scope: !1, file: !1, line: 1852, type: !504, isLocal: true, isDefinition: true, scopeLine: 1853, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!652 = distinct !DISubprogram(name: "isoent_find_out_boot_file", scope: !1, file: !1, line: 7088, type: !653, isLocal: true, isDefinition: true, scopeLine: 7089, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!653 = !DISubroutineType(types: !654)
!654 = !{!31, !367, !76}
!655 = distinct !DISubprogram(name: "isoent_find_entry", scope: !1, file: !1, line: 5747, type: !611, isLocal: true, isDefinition: true, scopeLine: 5748, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!656 = distinct !DISubprogram(name: "zisofs_rewind_boot_file", scope: !1, file: !1, line: 8020, type: !504, isLocal: true, isDefinition: true, scopeLine: 8021, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!657 = distinct !DISubprogram(name: "zisofs_extract", scope: !1, file: !1, line: 7900, type: !658, isLocal: true, isDefinition: true, scopeLine: 7902, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!658 = !DISubroutineType(types: !659)
!659 = !{!396, !367, !660, !453, !23}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "zisofs_extract", file: !1, line: 7799, size: 1536, align: 64, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pz_log2_bs", scope: !661, file: !1, line: 7800, baseType: !31, size: 32, align: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pz_uncompressed_size", scope: !661, file: !1, line: 7801, baseType: !172, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_buffer_size", scope: !661, file: !1, line: 7802, baseType: !23, size: 64, align: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !661, file: !1, line: 7804, baseType: !31, size: 1, align: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "header_passed", scope: !661, file: !1, line: 7805, baseType: !31, size: 1, align: 32, offset: 193)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pz_offset", scope: !661, file: !1, line: 7807, baseType: !42, size: 32, align: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers", scope: !661, file: !1, line: 7808, baseType: !544, size: 64, align: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_size", scope: !661, file: !1, line: 7809, baseType: !23, size: 64, align: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_avail", scope: !661, file: !1, line: 7810, baseType: !23, size: 64, align: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "block_off", scope: !661, file: !1, line: 7811, baseType: !23, size: 64, align: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "block_avail", scope: !661, file: !1, line: 7812, baseType: !42, size: 32, align: 32, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !661, file: !1, line: 7814, baseType: !243, size: 896, align: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "stream_valid", scope: !661, file: !1, line: 7815, baseType: !31, size: 32, align: 32, offset: 1472)
!676 = distinct !DISubprogram(name: "zisofs_extract_init", scope: !1, file: !1, line: 7819, type: !658, isLocal: true, isDefinition: true, scopeLine: 7821, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!677 = distinct !DISubprogram(name: "isoent_create_boot_catalog", scope: !1, file: !1, line: 7106, type: !653, isLocal: true, isDefinition: true, scopeLine: 7107, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!678 = distinct !DISubprogram(name: "isoent_clone_tree", scope: !1, file: !1, line: 5315, type: !679, isLocal: true, isDefinition: true, scopeLine: 5317, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!679 = !DISubroutineType(types: !680)
!680 = !{!31, !367, !97, !76}
!681 = distinct !DISubprogram(name: "isoent_clone", scope: !1, file: !1, line: 5134, type: !682, isLocal: true, isDefinition: true, scopeLine: 5135, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!682 = !DISubroutineType(types: !683)
!683 = !{!76, !76}
!684 = distinct !DISubprogram(name: "isoent_make_path_table", scope: !1, file: !1, line: 6987, type: !504, isLocal: true, isDefinition: true, scopeLine: 6988, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!685 = distinct !DISubprogram(name: "isoent_alloc_path_table", scope: !1, file: !1, line: 6962, type: !686, isLocal: true, isDefinition: true, scopeLine: 6964, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!686 = !DISubroutineType(types: !687)
!687 = !{!31, !367, !688, !31}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!689 = distinct !DISubprogram(name: "isoent_collect_dirs", scope: !1, file: !1, line: 6622, type: !690, isLocal: true, isDefinition: true, scopeLine: 6623, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!690 = !DISubroutineType(types: !691)
!691 = !{!31, !688, !76, !31}
!692 = distinct !DISubprogram(name: "path_table_add_entry", scope: !1, file: !1, line: 6888, type: !693, isLocal: true, isDefinition: true, scopeLine: 6889, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !199, !76}
!695 = distinct !DISubprogram(name: "isoent_rr_move", scope: !1, file: !1, line: 6740, type: !504, isLocal: true, isDefinition: true, scopeLine: 6741, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!696 = distinct !DISubprogram(name: "isoent_remove_child", scope: !1, file: !1, line: 5288, type: !697, isLocal: true, isDefinition: true, scopeLine: 5289, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !76, !76}
!699 = distinct !DISubprogram(name: "isoent_add_child_head", scope: !1, file: !1, line: 5239, type: !602, isLocal: true, isDefinition: true, scopeLine: 5240, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!700 = distinct !DISubprogram(name: "path_table_last_entry", scope: !1, file: !1, line: 6897, type: !701, isLocal: true, isDefinition: true, scopeLine: 6898, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!701 = !DISubroutineType(types: !702)
!702 = !{!76, !199}
!703 = distinct !DISubprogram(name: "isoent_rr_move_dir", scope: !1, file: !1, line: 6659, type: !704, isLocal: true, isDefinition: true, scopeLine: 6661, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!704 = !DISubroutineType(types: !705)
!705 = !{!31, !367, !97, !76, !97}
!706 = distinct !DISubprogram(name: "isofile_connect_hardlink_files", scope: !1, file: !1, line: 5043, type: !707, isLocal: true, isDefinition: true, scopeLine: 5044, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !530}
!709 = distinct !DISubprogram(name: "isoent_traverse_tree", scope: !1, file: !1, line: 6549, type: !710, isLocal: true, isDefinition: true, scopeLine: 6550, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!710 = !DISubroutineType(types: !711)
!711 = !{!31, !367, !688}
!712 = distinct !DISubprogram(name: "idr_init", scope: !1, file: !1, line: 5807, type: !713, isLocal: true, isDefinition: true, scopeLine: 5808, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !530, !688, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !1, line: 870, size: 1472, align: 64, elements: !717)
!717 = !{!718, !719, !720, !726, !727, !728, !729, !730}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "idrent_pool", scope: !716, file: !1, line: 881, baseType: !551, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !716, file: !1, line: 883, baseType: !100, size: 128, align: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !716, file: !1, line: 888, baseType: !721, size: 128, align: 64, offset: 192)
!721 = !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !1, line: 885, size: 128, align: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !721, file: !1, line: 886, baseType: !551, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !721, file: !1, line: 887, baseType: !725, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !716, file: !1, line: 890, baseType: !31, size: 32, align: 32, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pool_idx", scope: !716, file: !1, line: 891, baseType: !31, size: 32, align: 32, offset: 352)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "num_size", scope: !716, file: !1, line: 892, baseType: !31, size: 32, align: 32, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "null_size", scope: !716, file: !1, line: 893, baseType: !31, size: 32, align: 32, offset: 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "char_map", scope: !716, file: !1, line: 895, baseType: !731, size: 1024, align: 8, offset: 448)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, align: 8, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 128)
!734 = distinct !DISubprogram(name: "idr_relaxed_filenames", scope: !1, file: !1, line: 5791, type: !735, isLocal: true, isDefinition: true, scopeLine: 5792, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !20}
!737 = distinct !DISubprogram(name: "isoent_gen_joliet_identifier", scope: !1, file: !1, line: 6224, type: !738, isLocal: true, isDefinition: true, scopeLine: 6226, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!738 = !DISubroutineType(types: !739)
!739 = !{!31, !367, !76, !715}
!740 = distinct !DISubprogram(name: "isoent_cmp_node_joliet", scope: !1, file: !1, line: 6504, type: !112, isLocal: true, isDefinition: true, scopeLine: 6506, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!741 = distinct !DISubprogram(name: "isoent_cmp_joliet_identifier", scope: !1, file: !1, line: 6436, type: !742, isLocal: true, isDefinition: true, scopeLine: 6437, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!742 = !DISubroutineType(types: !743)
!743 = !{!31, !531, !531}
!744 = distinct !DISubprogram(name: "isoent_cmp_key_joliet", scope: !1, file: !1, line: 6514, type: !120, isLocal: true, isDefinition: true, scopeLine: 6515, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!745 = distinct !DISubprogram(name: "idr_start", scope: !1, file: !1, line: 5854, type: !746, isLocal: true, isDefinition: true, scopeLine: 5856, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!746 = !DISubroutineType(types: !747)
!747 = !{!31, !367, !715, !31, !31, !31, !31, !104}
!748 = distinct !DISubprogram(name: "idr_ensure_poolsize", scope: !1, file: !1, line: 5831, type: !749, isLocal: true, isDefinition: true, scopeLine: 5833, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!749 = !DISubroutineType(types: !750)
!750 = !{!31, !367, !715, !31}
!751 = distinct !DISubprogram(name: "joliet_allowed_char", scope: !1, file: !1, line: 2212, type: !752, isLocal: true, isDefinition: true, scopeLine: 2213, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!752 = !DISubroutineType(types: !753)
!753 = !{!31, !53, !53}
!754 = distinct !DISubprogram(name: "archive_be16enc", scope: !628, file: !628, line: 139, type: !755, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !271, !307}
!757 = distinct !DISubprogram(name: "idr_register", scope: !1, file: !1, line: 5874, type: !758, isLocal: true, isDefinition: true, scopeLine: 5875, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !715, !76, !31, !31}
!760 = distinct !DISubprogram(name: "idr_resolve", scope: !1, file: !1, line: 5915, type: !761, isLocal: true, isDefinition: true, scopeLine: 5916, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !715, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !544, !31}
!766 = distinct !DISubprogram(name: "idr_extend_identifier", scope: !1, file: !1, line: 5898, type: !767, isLocal: true, isDefinition: true, scopeLine: 5899, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !551, !31, !31}
!769 = distinct !DISubprogram(name: "idr_set_num_beutf16", scope: !1, file: !1, line: 5949, type: !764, isLocal: true, isDefinition: true, scopeLine: 5950, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!770 = distinct !DISubprogram(name: "isoent_gen_iso9660_identifier", scope: !1, file: !1, line: 5974, type: !738, isLocal: true, isDefinition: true, scopeLine: 5976, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!771 = distinct !DISubprogram(name: "isoent_cmp_node_iso9660", scope: !1, file: !1, line: 6417, type: !112, isLocal: true, isDefinition: true, scopeLine: 6419, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!772 = distinct !DISubprogram(name: "isoent_cmp_iso9660_identifier", scope: !1, file: !1, line: 6345, type: !742, isLocal: true, isDefinition: true, scopeLine: 6346, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!773 = distinct !DISubprogram(name: "isoent_cmp_key_iso9660", scope: !1, file: !1, line: 6427, type: !120, isLocal: true, isDefinition: true, scopeLine: 6428, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!774 = distinct !DISubprogram(name: "idr_set_num", scope: !1, file: !1, line: 5931, type: !764, isLocal: true, isDefinition: true, scopeLine: 5932, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!775 = distinct !DISubprogram(name: "isoent_make_sorted_files", scope: !1, file: !1, line: 6523, type: !738, isLocal: true, isDefinition: true, scopeLine: 6525, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!776 = distinct !DISubprogram(name: "idr_cleanup", scope: !1, file: !1, line: 5825, type: !777, isLocal: true, isDefinition: true, scopeLine: 5826, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !715}
!779 = distinct !DISubprogram(name: "isoent_make_path_table_2", scope: !1, file: !1, line: 6910, type: !780, isLocal: true, isDefinition: true, scopeLine: 6912, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!780 = !DISubroutineType(types: !781)
!781 = !{!31, !367, !688, !31, !579}
!782 = distinct !DISubprogram(name: "_compare_path_table", scope: !1, file: !1, line: 6806, type: !560, isLocal: true, isDefinition: true, scopeLine: 6807, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!783 = distinct !DISubprogram(name: "_compare_path_table_joliet", scope: !1, file: !1, line: 6848, type: !560, isLocal: true, isDefinition: true, scopeLine: 6849, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!784 = distinct !DISubprogram(name: "calculate_path_table_size", scope: !1, file: !1, line: 4203, type: !785, isLocal: true, isDefinition: true, scopeLine: 4204, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !688}
!787 = distinct !DISubprogram(name: "isoent_setup_directory_location", scope: !1, file: !1, line: 5359, type: !788, isLocal: true, isDefinition: true, scopeLine: 5361, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !530, !31, !688}
!790 = distinct !DISubprogram(name: "calculate_directory_descriptors", scope: !1, file: !1, line: 4329, type: !791, isLocal: true, isDefinition: true, scopeLine: 4331, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!791 = !DISubroutineType(types: !792)
!792 = !{!31, !530, !688, !76, !31}
!793 = distinct !DISubprogram(name: "get_dir_rec_size", scope: !1, file: !1, line: 3597, type: !794, isLocal: true, isDefinition: true, scopeLine: 3599, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!794 = !DISubroutineType(types: !795)
!795 = !{!31, !530, !76, !338, !60}
!796 = distinct !DISubprogram(name: "set_directory_record", scope: !1, file: !1, line: 3437, type: !797, isLocal: true, isDefinition: true, scopeLine: 3440, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!797 = !DISubroutineType(types: !798)
!798 = !{!31, !544, !23, !76, !530, !338, !60}
!799 = distinct !DISubprogram(name: "set_num_711", scope: !1, file: !1, line: 2409, type: !800, isLocal: true, isDefinition: true, scopeLine: 2410, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !544, !53}
!802 = distinct !DISubprogram(name: "set_num_733", scope: !1, file: !1, line: 2480, type: !648, isLocal: true, isDefinition: true, scopeLine: 2481, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!803 = distinct !DISubprogram(name: "archive_be32enc", scope: !628, file: !628, line: 148, type: !629, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!804 = distinct !DISubprogram(name: "set_time_915", scope: !1, file: !1, line: 2562, type: !805, isLocal: true, isDefinition: true, scopeLine: 2563, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !544, !69}
!807 = distinct !DISubprogram(name: "get_tmfromtime", scope: !1, file: !1, line: 2521, type: !808, isLocal: true, isDefinition: true, scopeLine: 2522, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !810, !824}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !70, line: 133, size: 448, align: 64, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !811, file: !70, line: 135, baseType: !31, size: 32, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !811, file: !70, line: 136, baseType: !31, size: 32, align: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !811, file: !70, line: 137, baseType: !31, size: 32, align: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !811, file: !70, line: 138, baseType: !31, size: 32, align: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !811, file: !70, line: 139, baseType: !31, size: 32, align: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !811, file: !70, line: 140, baseType: !31, size: 32, align: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !811, file: !70, line: 141, baseType: !31, size: 32, align: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !811, file: !70, line: 142, baseType: !31, size: 32, align: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !811, file: !70, line: 143, baseType: !31, size: 32, align: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !811, file: !70, line: 146, baseType: !38, size: 64, align: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !811, file: !70, line: 147, baseType: !429, size: 64, align: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!825 = distinct !DISubprogram(name: "set_num_712", scope: !1, file: !1, line: 2419, type: !826, isLocal: true, isDefinition: true, scopeLine: 2420, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !544, !21}
!828 = distinct !DISubprogram(name: "set_num_723", scope: !1, file: !1, line: 2449, type: !829, isLocal: true, isDefinition: true, scopeLine: 2450, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !544, !307}
!831 = distinct !DISubprogram(name: "archive_le16enc", scope: !628, file: !628, line: 168, type: !755, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!832 = distinct !DISubprogram(name: "set_directory_record_rr", scope: !1, file: !1, line: 2786, type: !833, isLocal: true, isDefinition: true, scopeLine: 2788, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!833 = !DISubroutineType(types: !834)
!834 = !{!31, !544, !31, !76, !530, !338}
!835 = distinct !DISubprogram(name: "extra_open_record", scope: !1, file: !1, line: 2618, type: !836, isLocal: true, isDefinition: true, scopeLine: 2620, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!836 = !DISubroutineType(types: !837)
!837 = !{!544, !544, !31, !76, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, align: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_extr_rec", file: !1, line: 132, size: 448, align: 64, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use_extr", scope: !839, file: !1, line: 133, baseType: !31, size: 32, align: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !839, file: !1, line: 134, baseType: !544, size: 64, align: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "isoent", scope: !839, file: !1, line: 135, baseType: !76, size: 64, align: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ce_ptr", scope: !839, file: !1, line: 136, baseType: !544, size: 64, align: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cur_len", scope: !839, file: !1, line: 137, baseType: !31, size: 32, align: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dr_len", scope: !839, file: !1, line: 138, baseType: !31, size: 32, align: 32, offset: 288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !839, file: !1, line: 139, baseType: !31, size: 32, align: 32, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "extr_off", scope: !839, file: !1, line: 140, baseType: !31, size: 32, align: 32, offset: 352)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "extr_loc", scope: !839, file: !1, line: 141, baseType: !31, size: 32, align: 32, offset: 384)
!850 = distinct !DISubprogram(name: "extra_tell_used_size", scope: !1, file: !1, line: 2750, type: !851, isLocal: true, isDefinition: true, scopeLine: 2751, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !838, !31}
!853 = distinct !DISubprogram(name: "extra_next_record", scope: !1, file: !1, line: 2658, type: !854, isLocal: true, isDefinition: true, scopeLine: 2659, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!854 = !DISubroutineType(types: !855)
!855 = !{!544, !838, !31}
!856 = distinct !DISubprogram(name: "extra_get_record", scope: !1, file: !1, line: 2701, type: !857, isLocal: true, isDefinition: true, scopeLine: 2702, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!857 = !DISubroutineType(types: !858)
!858 = !{!544, !76, !579, !579, !579}
!859 = distinct !DISubprogram(name: "extra_last_record", scope: !1, file: !1, line: 2691, type: !860, isLocal: true, isDefinition: true, scopeLine: 2692, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!860 = !DISubroutineType(types: !861)
!861 = !{!155, !76}
!862 = distinct !DISubprogram(name: "set_SUSP_CE", scope: !1, file: !1, line: 2581, type: !863, isLocal: true, isDefinition: true, scopeLine: 2582, flags: DIFlagPrototyped, isOptimized: false, variables: !570)
!863 = !DISubroutineType(types: !864)
!864 = !{!31, !544, !31, !31, !31}
