; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_ppmd7.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.IPpmd7 = type { void (%struct.CPpmd7*)*, i32 (%struct.CPpmd7*, i32, %struct.ISzAlloc*)*, void (%struct.CPpmd7*, %struct.ISzAlloc*)*, void (%struct.CPpmd7*, i32)*, void (%struct.CPpmd7z_RangeDec*)*, void (%struct.CPpmd7z_RangeDec*)*, i32 (%struct.CPpmd7z_RangeDec*)*, i32 (%struct.CPpmd7z_RangeDec*)*, i32 (%struct.CPpmd7*, %struct.IPpmd7_RangeDec*)*, void (%struct.CPpmd7z_RangeEnc*)*, void (%struct.CPpmd7z_RangeEnc*)*, void (%struct.CPpmd7*, %struct.CPpmd7z_RangeEnc*, i32)* }
%struct.CPpmd7 = type { %struct.CPpmd7_Context_*, %struct.CPpmd7_Context_*, %struct.CPpmd_State*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i32, [38 x i8], [128 x i8], [38 x i32], [256 x i8], [256 x i8], [256 x i8], %struct.CPpmd_See, [25 x [16 x %struct.CPpmd_See]], [128 x [64 x i16]] }
%struct.CPpmd7_Context_ = type { i16, i16, i32, i32 }
%struct.CPpmd_State = type { i8, i8, i16, i16 }
%struct.CPpmd_See = type { i16, i8, i8 }
%struct.ISzAlloc = type { i8* (i8*, i64)*, void (i8*, i8*)* }
%struct.CPpmd7z_RangeDec = type { %struct.IPpmd7_RangeDec, i32, i32, i32, i32, %struct.IByteIn* }
%struct.IPpmd7_RangeDec = type { i32 (i8*, i32)*, void (i8*, i32, i32)*, i32 (i8*, i32)* }
%struct.IByteIn = type { %struct.archive_read*, i8 (i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !373, globals: !544)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_ppmd7.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !7, !8, !10, !26, !22, !17, !34, !350, !351, !46, !101, !352, !11, !9, !21, !354, !356, !357, !355, !359, !360, !362, !363, !371, !23}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !5, line: 19, baseType: !6)
!5 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_ppmd_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !5, line: 28, baseType: !9)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTX_PTR", file: !1, line: 52, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7_Context", file: !13, line: 40, baseType: !14)
!13 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_ppmd7_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "CPpmd7_Context_", file: !13, line: 34, size: 96, align: 32, elements: !15)
!15 = !{!16, !19, !20, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "NumStats", scope: !14, file: !13, line: 36, baseType: !17, size: 16, align: 16)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !5, line: 22, baseType: !18)
!18 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "SummFreq", scope: !14, file: !13, line: 37, baseType: !17, size: 16, align: 16, offset: 16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Stats", scope: !14, file: !13, line: 38, baseType: !21, size: 32, align: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd_State_Ref", file: !5, line: 136, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !5, line: 29, baseType: !23)
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Suffix", scope: !14, file: !13, line: 39, baseType: !25, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7_Context_Ref", file: !13, line: 32, baseType: !22)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd_State", file: !5, line: 128, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 122, size: 48, align: 16, elements: !29)
!29 = !{!30, !31, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Symbol", scope: !28, file: !5, line: 124, baseType: !4, size: 8, align: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Freq", scope: !28, file: !5, line: 125, baseType: !4, size: 8, align: 8, offset: 8)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "SuccessorLow", scope: !28, file: !5, line: 126, baseType: !17, size: 16, align: 16, offset: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "SuccessorHigh", scope: !28, file: !5, line: 127, baseType: !17, size: 16, align: 16, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7z_RangeDec", file: !13, line: 81, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 73, size: 384, align: 64, elements: !37)
!37 = !{!38, !52, !53, !54, !55, !56}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !36, file: !13, line: 75, baseType: !39, size: 192, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPpmd7_RangeDec", file: !13, line: 71, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 66, size: 192, align: 64, elements: !41)
!41 = !{!42, !47, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "GetThreshold", scope: !40, file: !13, line: 68, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!22, !46, !22}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Decode", scope: !40, file: !13, line: 69, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !46, !22, !22}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeBit", scope: !40, file: !13, line: 70, baseType: !43, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !36, file: !13, line: 76, baseType: !22, size: 32, align: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !36, file: !13, line: 77, baseType: !22, size: 32, align: 32, offset: 224)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Low", scope: !36, file: !13, line: 78, baseType: !22, size: 32, align: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Bottom", scope: !36, file: !13, line: 79, baseType: !22, size: 32, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Stream", scope: !36, file: !13, line: 80, baseType: !57, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IByteIn", file: !5, line: 64, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 60, size: 128, align: 64, elements: !60)
!60 = !{!61, !346}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !59, file: !5, line: 62, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read", file: !64, line: 159, size: 20288, align: 64, elements: !65)
!64 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!65 = !{!66, !166, !167, !168, !169, !170, !213, !277, !278, !279, !280, !281, !282, !315, !317, !327, !328}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !63, file: !64, line: 160, baseType: !67, size: 1280, align: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !68, line: 89, size: 1280, align: 64, elements: !69)
!68 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!69 = !{!70, !71, !72, !139, !140, !141, !142, !143, !144, !145, !146, !154, !155, !156, !157, !160, !161, !162, !163, !164, !165}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !67, file: !68, line: 96, baseType: !23, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !67, file: !68, line: 97, baseType: !23, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !67, file: !68, line: 103, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !68, line: 63, size: 832, align: 64, elements: !75)
!75 = !{!76, !81, !82, !89, !90, !104, !110, !115, !116, !123, !124, !128, !132}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !74, file: !68, line: 64, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!9, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !74, file: !68, line: 65, baseType: !77, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !74, file: !68, line: 66, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!9, !80, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !88, line: 180, flags: DIFlagFwdDecl)
!88 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !74, file: !68, line: 68, baseType: !77, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !74, file: !68, line: 69, baseType: !91, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !80, !99, !101}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !95, line: 102, baseType: !96)
!95 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !97, line: 172, baseType: !98)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!98 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !74, file: !68, line: 71, baseType: !105, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!94, !80, !99, !101, !108}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 40, baseType: !98)
!109 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !74, file: !68, line: 74, baseType: !111, size: 64, align: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!9, !80, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !74, file: !68, line: 76, baseType: !83, size: 64, align: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !74, file: !68, line: 78, baseType: !117, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!9, !80, !120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !74, file: !68, line: 81, baseType: !77, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !74, file: !68, line: 82, baseType: !125, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!108, !80, !9}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !74, file: !68, line: 83, baseType: !129, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!9, !80, !9}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !74, file: !68, line: 84, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !80, !9}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !67, file: !68, line: 105, baseType: !9, size: 32, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !67, file: !68, line: 106, baseType: !136, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !67, file: !68, line: 108, baseType: !9, size: 32, align: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !67, file: !68, line: 109, baseType: !136, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !67, file: !68, line: 112, baseType: !9, size: 32, align: 32, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !67, file: !68, line: 114, baseType: !9, size: 32, align: 32, offset: 416)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !67, file: !68, line: 115, baseType: !136, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !67, file: !68, line: 116, baseType: !147, size: 192, align: 64, offset: 512)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !148, line: 58, size: 192, align: 64, elements: !149)
!148 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!149 = !{!150, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !147, file: !148, line: 59, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !147, file: !148, line: 60, baseType: !101, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !147, file: !148, line: 61, baseType: !101, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !67, file: !68, line: 118, baseType: !151, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !67, file: !68, line: 119, baseType: !23, size: 32, align: 32, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !67, file: !68, line: 120, baseType: !23, size: 32, align: 32, offset: 800)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !67, file: !68, line: 121, baseType: !158, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !148, line: 70, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !67, file: !68, line: 127, baseType: !136, size: 64, align: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !67, file: !68, line: 128, baseType: !108, size: 64, align: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !67, file: !68, line: 129, baseType: !108, size: 64, align: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !67, file: !68, line: 130, baseType: !101, size: 64, align: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !67, file: !68, line: 137, baseType: !138, size: 8, align: 8, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !67, file: !68, line: 138, baseType: !101, size: 64, align: 64, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !63, file: !64, line: 162, baseType: !86, size: 64, align: 64, offset: 1280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !63, file: !64, line: 165, baseType: !9, size: 32, align: 32, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !63, file: !64, line: 166, baseType: !108, size: 64, align: 64, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !63, file: !64, line: 167, baseType: !108, size: 64, align: 64, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !63, file: !64, line: 170, baseType: !171, size: 576, align: 64, offset: 1536)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_client", file: !64, line: 134, size: 576, align: 64, elements: !172)
!172 = !{!173, !178, !184, !190, !195, !198, !203, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "opener", scope: !171, file: !64, line: 135, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !88, line: 241, baseType: !176)
!176 = !DISubroutineType(types: !177)
!177 = !{!9, !80, !46}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !171, file: !64, line: 136, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_read_callback", file: !88, line: 218, baseType: !181)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !80, !46, !120}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !88, line: 95, baseType: !94)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "skipper", scope: !171, file: !64, line: 137, baseType: !185, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_skip_callback", file: !88, line: 226, baseType: !187)
!187 = !DISubroutineType(types: !188)
!188 = !{!189, !80, !46, !189}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !88, line: 73, baseType: !108)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !171, file: !64, line: 138, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_seek_callback", file: !88, line: 233, baseType: !193)
!193 = !DISubroutineType(types: !194)
!194 = !{!189, !80, !46, !189, !9}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "closer", scope: !171, file: !64, line: 139, baseType: !196, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !88, line: 243, baseType: !176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "switcher", scope: !171, file: !64, line: 140, baseType: !199, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_switch_callback", file: !88, line: 249, baseType: !201)
!201 = !DISubroutineType(types: !202)
!202 = !{!9, !80, !46, !46}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !171, file: !64, line: 141, baseType: !23, size: 32, align: 32, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !171, file: !64, line: 142, baseType: !23, size: 32, align: 32, offset: 416)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !171, file: !64, line: 143, baseType: !108, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !171, file: !64, line: 144, baseType: !207, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_data_node", file: !64, line: 129, size: 192, align: 64, elements: !209)
!209 = !{!210, !211, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "begin_position", scope: !208, file: !64, line: 130, baseType: !108, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !208, file: !64, line: 131, baseType: !108, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !64, line: 132, baseType: !46, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bidders", scope: !63, file: !64, line: 173, baseType: !214, size: 6144, align: 64, offset: 2112)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 6144, align: 64, elements: !275)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter_bidder", file: !64, line: 60, size: 384, align: 64, elements: !216)
!216 = !{!217, !218, !219, !266, !267, !271}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !64, line: 62, baseType: !46, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !64, line: 64, baseType: !136, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !215, file: !64, line: 66, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!9, !223, !224}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter", file: !64, line: 82, size: 1408, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !235, !239, !243, !247, !248, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !225, file: !64, line: 83, baseType: !108, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bidder", scope: !225, file: !64, line: 86, baseType: !223, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !225, file: !64, line: 87, baseType: !224, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !225, file: !64, line: 88, baseType: !62, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !225, file: !64, line: 90, baseType: !232, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!9, !224}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !225, file: !64, line: 92, baseType: !236, size: 64, align: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!94, !224, !120}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !225, file: !64, line: 94, baseType: !240, size: 64, align: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!108, !224, !108}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !225, file: !64, line: 96, baseType: !244, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!108, !224, !108, !9}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !225, file: !64, line: 98, baseType: !232, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sswitch", scope: !225, file: !64, line: 100, baseType: !249, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!9, !224, !23}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !64, line: 102, baseType: !46, size: 64, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !64, line: 104, baseType: !136, size: 64, align: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !225, file: !64, line: 105, baseType: !9, size: 32, align: 32, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !225, file: !64, line: 108, baseType: !151, size: 64, align: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !225, file: !64, line: 109, baseType: !101, size: 64, align: 64, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !64, line: 110, baseType: !151, size: 64, align: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !225, file: !64, line: 111, baseType: !101, size: 64, align: 64, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "client_buff", scope: !225, file: !64, line: 112, baseType: !99, size: 64, align: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "client_total", scope: !225, file: !64, line: 113, baseType: !101, size: 64, align: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "client_next", scope: !225, file: !64, line: 114, baseType: !136, size: 64, align: 64, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "client_avail", scope: !225, file: !64, line: 115, baseType: !101, size: 64, align: 64, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_file", scope: !225, file: !64, line: 116, baseType: !138, size: 8, align: 8, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !225, file: !64, line: 117, baseType: !138, size: 8, align: 8, offset: 1352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !225, file: !64, line: 118, baseType: !138, size: 8, align: 8, offset: 1360)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !215, file: !64, line: 69, baseType: !232, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !215, file: !64, line: 71, baseType: !268, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!9, !223, !136, !136}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !215, file: !64, line: 74, baseType: !272, size: 64, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!9, !223}
!275 = !{!276}
!276 = !DISubrange(count: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !63, file: !64, line: 176, baseType: !224, size: 64, align: 64, offset: 8256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_filter_bidding", scope: !63, file: !64, line: 179, baseType: !9, size: 32, align: 32, offset: 8320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "header_position", scope: !63, file: !64, line: 182, baseType: !108, size: 64, align: 64, offset: 8384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data_start_node", scope: !63, file: !64, line: 185, baseType: !23, size: 32, align: 32, offset: 8448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data_end_node", scope: !63, file: !64, line: 186, baseType: !23, size: 32, align: 32, offset: 8480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !63, file: !64, line: 209, baseType: !283, size: 11264, align: 64, offset: 8512)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 11264, align: 64, elements: !275)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_format_descriptor", file: !64, line: 196, size: 704, align: 64, elements: !285)
!285 = !{!286, !287, !288, !292, !296, !300, !304, !308, !312, !313, !314}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !64, line: 197, baseType: !46, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !64, line: 198, baseType: !136, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !284, file: !64, line: 199, baseType: !289, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!9, !62, !9}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !284, file: !64, line: 200, baseType: !293, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!9, !62, !136, !136}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !284, file: !64, line: 202, baseType: !297, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!9, !62, !86}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "read_data", scope: !284, file: !64, line: 203, baseType: !301, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!9, !62, !120, !121, !122}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_skip", scope: !284, file: !64, line: 204, baseType: !305, size: 64, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!9, !62}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "seek_data", scope: !284, file: !64, line: 205, baseType: !309, size: 64, align: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!108, !62, !108, !9}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !284, file: !64, line: 206, baseType: !305, size: 64, align: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "format_capabilties", scope: !284, file: !64, line: 207, baseType: !305, size: 64, align: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "has_encrypted_entries", scope: !284, file: !64, line: 208, baseType: !305, size: 64, align: 64, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !63, file: !64, line: 210, baseType: !316, size: 64, align: 64, offset: 19776)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !63, file: !64, line: 215, baseType: !318, size: 64, align: 64, offset: 19840)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_extract", file: !64, line: 151, size: 192, align: 64, elements: !320)
!320 = !{!321, !322, !326}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !319, file: !64, line: 152, baseType: !80, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress", scope: !319, file: !64, line: 155, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !46}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress_user_data", scope: !319, file: !64, line: 156, baseType: !46, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_archive_extract", scope: !63, file: !64, line: 216, baseType: !305, size: 64, align: 64, offset: 19904)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !63, file: !64, line: 227, baseType: !329, size: 320, align: 64, offset: 19968)
!329 = !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !64, line: 221, size: 320, align: 64, elements: !330)
!330 = !{!331, !337, !339, !340, !345}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !329, file: !64, line: 222, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_passphrase", file: !64, line: 146, size: 128, align: 64, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !333, file: !64, line: 147, baseType: !151, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !64, line: 148, baseType: !332, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !329, file: !64, line: 223, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !329, file: !64, line: 224, baseType: !9, size: 32, align: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !329, file: !64, line: 225, baseType: !341, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !88, line: 256, baseType: !343)
!343 = !DISubroutineType(types: !344)
!344 = !{!136, !80, !46}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !329, file: !64, line: 226, baseType: !46, size: 64, align: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !59, file: !5, line: 63, baseType: !347, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!4, !46}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !109, line: 51, baseType: !23)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !109, line: 38, baseType: !9)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd_Void_Ref", file: !5, line: 144, baseType: !22)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd_Byte_Ref", file: !5, line: 152, baseType: !22)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7_Node_Ref", file: !1, line: 62, baseType: !22)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7_Node", file: !1, line: 70, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "CPpmd7_Node_", file: !1, line: 64, size: 96, align: 32, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Stamp", scope: !365, file: !1, line: 66, baseType: !17, size: 16, align: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "NU", scope: !365, file: !1, line: 67, baseType: !17, size: 16, align: 16, offset: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !365, file: !1, line: 68, baseType: !362, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Prev", scope: !365, file: !1, line: 69, baseType: !362, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!373 = !{!374, !430, !446, !449, !452, !453, !456, !459, !460, !461, !462, !463, !464, !465, !466, !469, !470, !471, !475, !476, !477, !480, !483, !486, !489, !490, !491, !494, !497, !498, !499, !500, !501, !502, !506, !507, !532, !533, !534, !537, !540, !543}
!374 = distinct !DISubprogram(name: "Ppmd7_Construct", scope: !1, file: !1, line: 87, type: !375, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7", file: !13, line: 62, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 44, size: 153472, align: 64, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !403, !407, !409, !413, !414, !415, !422, !426}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "MinContext", scope: !379, file: !13, line: 46, baseType: !11, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "MaxContext", scope: !379, file: !13, line: 46, baseType: !11, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "FoundState", scope: !379, file: !13, line: 47, baseType: !26, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "OrderFall", scope: !379, file: !13, line: 48, baseType: !23, size: 32, align: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "InitEsc", scope: !379, file: !13, line: 48, baseType: !23, size: 32, align: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PrevSuccess", scope: !379, file: !13, line: 48, baseType: !23, size: 32, align: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "MaxOrder", scope: !379, file: !13, line: 48, baseType: !23, size: 32, align: 32, offset: 288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "HiBitsFlag", scope: !379, file: !13, line: 48, baseType: !23, size: 32, align: 32, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RunLength", scope: !379, file: !13, line: 49, baseType: !8, size: 32, align: 32, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "InitRL", scope: !379, file: !13, line: 49, baseType: !8, size: 32, align: 32, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !379, file: !13, line: 51, baseType: !22, size: 32, align: 32, offset: 416)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "GlueCount", scope: !379, file: !13, line: 52, baseType: !22, size: 32, align: 32, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Base", scope: !379, file: !13, line: 53, baseType: !7, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "LoUnit", scope: !379, file: !13, line: 53, baseType: !7, size: 64, align: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "HiUnit", scope: !379, file: !13, line: 53, baseType: !7, size: 64, align: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Text", scope: !379, file: !13, line: 53, baseType: !7, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "UnitsStart", scope: !379, file: !13, line: 53, baseType: !7, size: 64, align: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "AlignOffset", scope: !379, file: !13, line: 54, baseType: !22, size: 32, align: 32, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Indx2Units", scope: !379, file: !13, line: 56, baseType: !400, size: 304, align: 8, offset: 864)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, align: 8, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 38)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Units2Indx", scope: !379, file: !13, line: 57, baseType: !404, size: 1024, align: 8, offset: 1168)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, align: 8, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "FreeList", scope: !379, file: !13, line: 58, baseType: !408, size: 1216, align: 32, offset: 2208)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 1216, align: 32, elements: !401)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "NS2Indx", scope: !379, file: !13, line: 59, baseType: !410, size: 2048, align: 8, offset: 3424)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, align: 8, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "NS2BSIndx", scope: !379, file: !13, line: 59, baseType: !410, size: 2048, align: 8, offset: 5472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "HB2Flag", scope: !379, file: !13, line: 59, baseType: !410, size: 2048, align: 8, offset: 7520)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "DummySee", scope: !379, file: !13, line: 60, baseType: !416, size: 32, align: 16, offset: 9568)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd_See", file: !5, line: 117, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 112, size: 32, align: 16, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Summ", scope: !417, file: !5, line: 114, baseType: !17, size: 16, align: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Shift", scope: !417, file: !5, line: 115, baseType: !4, size: 8, align: 8, offset: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !417, file: !5, line: 116, baseType: !4, size: 8, align: 8, offset: 24)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "See", scope: !379, file: !13, line: 60, baseType: !423, size: 12800, align: 16, offset: 9600)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 12800, align: 16, elements: !424)
!424 = !{!425, !276}
!425 = !DISubrange(count: 25)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "BinSumm", scope: !379, file: !13, line: 61, baseType: !427, size: 131072, align: 16, offset: 22400)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 131072, align: 16, elements: !428)
!428 = !{!406, !429}
!429 = !DISubrange(count: 64)
!430 = distinct !DISubprogram(name: "Ppmd7_Alloc", scope: !1, file: !1, line: 125, type: !431, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !377, !22, !434}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !5, line: 54, baseType: !9)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISzAlloc", file: !5, line: 77, baseType: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 73, size: 128, align: 64, elements: !437)
!437 = !{!438, !442}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Alloc", scope: !436, file: !5, line: 75, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!46, !46, !101}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !436, file: !5, line: 76, baseType: !443, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !46, !46}
!446 = distinct !DISubprogram(name: "Ppmd7_Free", scope: !1, file: !1, line: 118, type: !447, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !377, !434}
!449 = distinct !DISubprogram(name: "Ppmd7_Init", scope: !1, file: !1, line: 366, type: !450, isLocal: true, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !377, !23}
!452 = distinct !DISubprogram(name: "RestartModel", scope: !1, file: !1, line: 319, type: !375, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!453 = distinct !DISubprogram(name: "SetSuccessor", scope: !1, file: !1, line: 313, type: !454, isLocal: true, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !26, !355}
!456 = distinct !DISubprogram(name: "Ppmd7z_RangeDec_CreateVTable", scope: !1, file: !1, line: 846, type: !457, isLocal: true, isDefinition: true, scopeLine: 847, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !34}
!459 = distinct !DISubprogram(name: "Range_GetThreshold", scope: !1, file: !1, line: 770, type: !44, isLocal: true, isDefinition: true, scopeLine: 771, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!460 = distinct !DISubprogram(name: "Range_Decode_7z", scope: !1, file: !1, line: 793, type: !49, isLocal: true, isDefinition: true, scopeLine: 794, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!461 = distinct !DISubprogram(name: "Range_Normalize", scope: !1, file: !1, line: 776, type: !457, isLocal: true, isDefinition: true, scopeLine: 777, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!462 = distinct !DISubprogram(name: "Range_DecodeBit_7z", scope: !1, file: !1, line: 809, type: !44, isLocal: true, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!463 = distinct !DISubprogram(name: "PpmdRAR_RangeDec_CreateVTable", scope: !1, file: !1, line: 853, type: !457, isLocal: true, isDefinition: true, scopeLine: 854, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!464 = distinct !DISubprogram(name: "Range_Decode_RAR", scope: !1, file: !1, line: 801, type: !49, isLocal: true, isDefinition: true, scopeLine: 802, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!465 = distinct !DISubprogram(name: "Range_DecodeBit_RAR", scope: !1, file: !1, line: 829, type: !44, isLocal: true, isDefinition: true, scopeLine: 830, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!466 = distinct !DISubprogram(name: "Ppmd7z_RangeDec_Init", scope: !1, file: !1, line: 755, type: !467, isLocal: true, isDefinition: true, scopeLine: 756, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!467 = !DISubroutineType(types: !468)
!468 = !{!433, !34}
!469 = distinct !DISubprogram(name: "Ppmd_RangeDec_Init", scope: !1, file: !1, line: 745, type: !467, isLocal: true, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!470 = distinct !DISubprogram(name: "PpmdRAR_RangeDec_Init", scope: !1, file: !1, line: 762, type: !467, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!471 = distinct !DISubprogram(name: "Ppmd7_DecodeSymbol", scope: !1, file: !1, line: 862, type: !472, isLocal: true, isDefinition: true, scopeLine: 863, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!472 = !DISubroutineType(types: !473)
!473 = !{!9, !377, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!475 = distinct !DISubprogram(name: "Ppmd7_Update1_0", scope: !1, file: !1, line: 716, type: !375, isLocal: true, isDefinition: true, scopeLine: 717, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!476 = distinct !DISubprogram(name: "Rescale", scope: !1, file: !1, line: 603, type: !375, isLocal: true, isDefinition: true, scopeLine: 604, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!477 = distinct !DISubprogram(name: "InsertNode", scope: !1, file: !1, line: 152, type: !478, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !377, !46, !23}
!480 = distinct !DISubprogram(name: "ShrinkUnits", scope: !1, file: !1, line: 294, type: !481, isLocal: true, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!481 = !DISubroutineType(types: !482)
!482 = !{!46, !377, !46, !23, !23}
!483 = distinct !DISubprogram(name: "RemoveNode", scope: !1, file: !1, line: 158, type: !484, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!484 = !DISubroutineType(types: !485)
!485 = !{!46, !377, !23}
!486 = distinct !DISubprogram(name: "SplitBlock", scope: !1, file: !1, line: 165, type: !487, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !377, !46, !23, !23}
!489 = distinct !DISubprogram(name: "NextContext", scope: !1, file: !1, line: 692, type: !375, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!490 = distinct !DISubprogram(name: "UpdateModel", scope: !1, file: !1, line: 454, type: !375, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!491 = distinct !DISubprogram(name: "SwapStates", scope: !1, file: !1, line: 447, type: !492, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !26, !26}
!494 = distinct !DISubprogram(name: "CreateSuccessors", scope: !1, file: !1, line: 375, type: !495, isLocal: true, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!495 = !DISubroutineType(types: !496)
!496 = !{!10, !377, !433}
!497 = distinct !DISubprogram(name: "AllocUnitsRare", scope: !1, file: !1, line: 249, type: !484, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!498 = distinct !DISubprogram(name: "GlueFreeBlocks", scope: !1, file: !1, line: 177, type: !375, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!499 = distinct !DISubprogram(name: "AllocUnits", scope: !1, file: !1, line: 275, type: !484, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!500 = distinct !DISubprogram(name: "Ppmd7_Update1", scope: !1, file: !1, line: 701, type: !375, isLocal: true, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!501 = distinct !DISubprogram(name: "Ppmd7_UpdateBin", scope: !1, file: !1, line: 726, type: !375, isLocal: true, isDefinition: true, scopeLine: 727, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!502 = distinct !DISubprogram(name: "Ppmd7_MakeEscFreq", scope: !1, file: !1, line: 667, type: !503, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !377, !23, !356}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!506 = distinct !DISubprogram(name: "Ppmd7_Update2", scope: !1, file: !1, line: 734, type: !375, isLocal: true, isDefinition: true, scopeLine: 735, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!507 = distinct !DISubprogram(name: "Ppmd7z_RangeEnc_Init", scope: !1, file: !1, line: 976, type: !508, isLocal: true, isDefinition: true, scopeLine: 977, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPpmd7z_RangeEnc", file: !13, line: 92, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 85, size: 256, align: 64, elements: !513)
!513 = !{!514, !517, !518, !519, !520}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Low", scope: !512, file: !13, line: 87, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt64", file: !5, line: 48, baseType: !516)
!516 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Range", scope: !512, file: !13, line: 88, baseType: !22, size: 32, align: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Cache", scope: !512, file: !13, line: 89, baseType: !4, size: 8, align: 8, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "CacheSize", scope: !512, file: !13, line: 90, baseType: !515, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Stream", scope: !512, file: !13, line: 91, baseType: !521, size: 64, align: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "IByteOut", file: !5, line: 70, baseType: !523)
!523 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 66, size: 128, align: 64, elements: !524)
!524 = !{!525, !528}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !523, file: !5, line: 68, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write", file: !5, line: 68, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !523, file: !5, line: 69, baseType: !529, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !46, !4}
!532 = distinct !DISubprogram(name: "Ppmd7z_RangeEnc_FlushData", scope: !1, file: !1, line: 1034, type: !508, isLocal: true, isDefinition: true, scopeLine: 1035, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!533 = distinct !DISubprogram(name: "RangeEnc_ShiftLow", scope: !1, file: !1, line: 984, type: !508, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!534 = distinct !DISubprogram(name: "Ppmd7_EncodeSymbol", scope: !1, file: !1, line: 1044, type: !535, isLocal: true, isDefinition: true, scopeLine: 1045, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !377, !510, !9}
!537 = distinct !DISubprogram(name: "RangeEnc_Encode", scope: !1, file: !1, line: 1001, type: !538, isLocal: true, isDefinition: true, scopeLine: 1002, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !510, !22, !22, !22}
!540 = distinct !DISubprogram(name: "RangeEnc_EncodeBit_0", scope: !1, file: !1, line: 1012, type: !541, isLocal: true, isDefinition: true, scopeLine: 1013, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !510, !22}
!543 = distinct !DISubprogram(name: "RangeEnc_EncodeBit_1", scope: !1, file: !1, line: 1022, type: !541, isLocal: true, isDefinition: true, scopeLine: 1023, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!544 = !{!545, !571, !576}
!545 = !DIGlobalVariable(name: "__archive_ppmd7_functions", scope: !0, file: !1, line: 1154, type: !546, isLocal: false, isDefinition: true, variable: %struct.IPpmd7* @__archive_ppmd7_functions)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPpmd7", file: !13, line: 116, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 94, size: 768, align: 64, elements: !549)
!549 = !{!550, !552, !554, !556, !558, !560, !561, !563, !564, !566, !568, !569}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7_Construct", scope: !548, file: !13, line: 97, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7_Alloc", scope: !548, file: !13, line: 98, baseType: !553, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7_Free", scope: !548, file: !13, line: 99, baseType: !555, size: 64, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7_Init", scope: !548, file: !13, line: 100, baseType: !557, size: 64, align: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7z_RangeDec_CreateVTable", scope: !548, file: !13, line: 104, baseType: !559, size: 64, align: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "PpmdRAR_RangeDec_CreateVTable", scope: !548, file: !13, line: 105, baseType: !559, size: 64, align: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7z_RangeDec_Init", scope: !548, file: !13, line: 106, baseType: !562, size: 64, align: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "PpmdRAR_RangeDec_Init", scope: !548, file: !13, line: 107, baseType: !562, size: 64, align: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7_DecodeSymbol", scope: !548, file: !13, line: 109, baseType: !565, size: 64, align: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7z_RangeEnc_Init", scope: !548, file: !13, line: 112, baseType: !567, size: 64, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7z_RangeEnc_FlushData", scope: !548, file: !13, line: 113, baseType: !567, size: 64, align: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Ppmd7_EncodeSymbol", scope: !548, file: !13, line: 115, baseType: !570, size: 64, align: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!571 = !DIGlobalVariable(name: "kInitBinEsc", scope: !0, file: !1, line: 49, type: !572, isLocal: true, isDefinition: true, variable: [8 x i16]* @kInitBinEsc)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 128, align: 16, elements: !574)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!574 = !{!575}
!575 = !DISubrange(count: 8)
!576 = !DIGlobalVariable(name: "PPMD7_kExpEscape", scope: !0, file: !1, line: 50, type: !577, isLocal: true, isDefinition: true, variable: [16 x i8]* @PPMD7_kExpEscape)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 128, align: 8, elements: !275)
!578 = !{i32 2, !"Dwarf Version", i32 4}
!579 = !{i32 2, !"Debug Info Version", i32 3}
!580 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!581 = !DILocalVariable(name: "p", arg: 1, scope: !374, file: !1, line: 87, type: !377)
!582 = !DIExpression()
!583 = !DILocation(line: 87, column: 37, scope: !374)
!584 = !DILocalVariable(name: "i", scope: !374, file: !1, line: 89, type: !23)
!585 = !DILocation(line: 89, column: 12, scope: !374)
!586 = !DILocalVariable(name: "k", scope: !374, file: !1, line: 89, type: !23)
!587 = !DILocation(line: 89, column: 15, scope: !374)
!588 = !DILocalVariable(name: "m", scope: !374, file: !1, line: 89, type: !23)
!589 = !DILocation(line: 89, column: 18, scope: !374)
!590 = !DILocation(line: 91, column: 3, scope: !374)
!591 = !DILocation(line: 91, column: 6, scope: !374)
!592 = !DILocation(line: 91, column: 11, scope: !374)
!593 = !DILocation(line: 93, column: 10, scope: !594)
!594 = distinct !DILexicalBlock(scope: !374, file: !1, line: 93, column: 3)
!595 = !DILocation(line: 93, column: 17, scope: !594)
!596 = !DILocation(line: 93, column: 8, scope: !594)
!597 = !DILocation(line: 93, column: 22, scope: !598)
!598 = !DILexicalBlockFile(scope: !599, file: !1, discriminator: 1)
!599 = distinct !DILexicalBlock(scope: !594, file: !1, line: 93, column: 3)
!600 = !DILocation(line: 93, column: 24, scope: !598)
!601 = !DILocation(line: 93, column: 3, scope: !598)
!602 = !DILocalVariable(name: "step", scope: !603, file: !1, line: 95, type: !23)
!603 = distinct !DILexicalBlock(scope: !599, file: !1, line: 94, column: 3)
!604 = !DILocation(line: 95, column: 14, scope: !603)
!605 = !DILocation(line: 95, column: 22, scope: !603)
!606 = !DILocation(line: 95, column: 24, scope: !603)
!607 = !DILocation(line: 95, column: 22, scope: !608)
!608 = !DILexicalBlockFile(scope: !603, file: !1, discriminator: 1)
!609 = !DILocation(line: 95, column: 37, scope: !610)
!610 = !DILexicalBlockFile(scope: !603, file: !1, discriminator: 2)
!611 = !DILocation(line: 95, column: 39, scope: !610)
!612 = !DILocation(line: 95, column: 45, scope: !610)
!613 = !DILocation(line: 95, column: 22, scope: !610)
!614 = !DILocation(line: 95, column: 22, scope: !615)
!615 = !DILexicalBlockFile(scope: !603, file: !1, discriminator: 3)
!616 = !DILocation(line: 95, column: 14, scope: !615)
!617 = !DILocation(line: 96, column: 5, scope: !603)
!618 = !DILocation(line: 96, column: 37, scope: !619)
!619 = !DILexicalBlockFile(scope: !620, file: !1, discriminator: 1)
!620 = distinct !DILexicalBlock(scope: !603, file: !1, line: 96, column: 8)
!621 = !DILocation(line: 96, column: 31, scope: !619)
!622 = !DILocation(line: 96, column: 25, scope: !619)
!623 = !DILocation(line: 96, column: 10, scope: !619)
!624 = !DILocation(line: 96, column: 13, scope: !619)
!625 = !DILocation(line: 96, column: 29, scope: !619)
!626 = !DILocation(line: 96, column: 40, scope: !619)
!627 = !DILocation(line: 96, column: 48, scope: !610)
!628 = !DILocation(line: 96, column: 40, scope: !610)
!629 = !DILocation(line: 97, column: 30, scope: !603)
!630 = !DILocation(line: 97, column: 24, scope: !603)
