; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_filter_rpm.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_read = type { %struct.archive, %struct.archive_entry*, i32, i64, i64, %struct.archive_read_client, [16 x %struct.archive_read_filter_bidder], %struct.archive_read_filter*, i32, i64, i32, i32, [16 x %struct.archive_format_descriptor], %struct.archive_format_descriptor*, %struct.archive_read_extract*, i32 (%struct.archive_read*)*, %struct.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !29, subprograms: !311)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_filter_rpm.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !1, line: 45, size: 32, align: 32, elements: !23)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "rpm", file: !1, line: 40, size: 384, align: 64, elements: !5)
!5 = !{!6, !10, !14, !15, !20, !21}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !4, file: !1, line: 41, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 40, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!9 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "hpos", scope: !4, file: !1, line: 42, baseType: !11, size: 64, align: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 62, baseType: !13)
!12 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!13 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "hlen", scope: !4, file: !1, line: 43, baseType: !11, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !4, file: !1, line: 44, baseType: !16, size: 128, align: 8, offset: 192)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, align: 8, elements: !18)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !{!19}
!19 = !DISubrange(count: 16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !4, file: !1, line: 53, baseType: !3, size: 32, align: 32, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "first_header", scope: !4, file: !1, line: 54, baseType: !22, size: 32, align: 32, offset: 352)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "ST_LEAD", value: 0)
!25 = !DIEnumerator(name: "ST_HEADER", value: 1)
!26 = !DIEnumerator(name: "ST_HEADER_DATA", value: 2)
!27 = !DIEnumerator(name: "ST_PADDING", value: 3)
!28 = !DIEnumerator(name: "ST_ARCHIVE", value: 4)
!29 = !{!30, !141, !308, !11, !309}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read", file: !32, line: 159, size: 20288, align: 64, elements: !33)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!33 = !{!34, !129, !130, !131, !132, !133, !177, !239, !240, !241, !242, !243, !244, !277, !279, !289, !290}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !31, file: !32, line: 160, baseType: !35, size: 1280, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !36, line: 89, size: 1280, align: 64, elements: !37)
!36 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!37 = !{!38, !40, !41, !102, !103, !104, !105, !106, !107, !108, !109, !117, !118, !119, !120, !123, !124, !125, !126, !127, !128}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !35, file: !36, line: 96, baseType: !39, size: 32, align: 32)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !35, file: !36, line: 97, baseType: !39, size: 32, align: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !35, file: !36, line: 103, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !36, line: 63, size: 832, align: 64, elements: !44)
!44 = !{!45, !50, !51, !58, !59, !69, !73, !78, !79, !86, !87, !91, !95}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !43, file: !36, line: 64, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!22, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !43, file: !36, line: 65, baseType: !46, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !43, file: !36, line: 66, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!22, !49, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !57, line: 180, flags: DIFlagFwdDecl)
!57 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !43, file: !36, line: 68, baseType: !46, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !43, file: !36, line: 69, baseType: !60, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !49, !67, !11}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !64, line: 109, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !66, line: 172, baseType: !9)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !43, file: !36, line: 71, baseType: !70, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!63, !49, !67, !11, !7}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !43, file: !36, line: 74, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!22, !49, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !43, file: !36, line: 76, baseType: !52, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !43, file: !36, line: 78, baseType: !80, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!22, !49, !83, !84, !85}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !43, file: !36, line: 81, baseType: !46, size: 64, align: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !43, file: !36, line: 82, baseType: !88, size: 64, align: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!7, !49, !22}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !43, file: !36, line: 83, baseType: !92, size: 64, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!22, !49, !22}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !43, file: !36, line: 84, baseType: !96, size: 64, align: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !49, !22}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !35, file: !36, line: 105, baseType: !22, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !35, file: !36, line: 106, baseType: !99, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !35, file: !36, line: 108, baseType: !22, size: 32, align: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !35, file: !36, line: 109, baseType: !99, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !35, file: !36, line: 112, baseType: !22, size: 32, align: 32, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !35, file: !36, line: 114, baseType: !22, size: 32, align: 32, offset: 416)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !35, file: !36, line: 115, baseType: !99, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !35, file: !36, line: 116, baseType: !110, size: 192, align: 64, offset: 512)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !111, line: 58, size: 192, align: 64, elements: !112)
!111 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!112 = !{!113, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !110, file: !111, line: 59, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !110, file: !111, line: 60, baseType: !11, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !110, file: !111, line: 61, baseType: !11, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !35, file: !36, line: 118, baseType: !114, size: 64, align: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !35, file: !36, line: 119, baseType: !39, size: 32, align: 32, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !35, file: !36, line: 120, baseType: !39, size: 32, align: 32, offset: 800)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !35, file: !36, line: 121, baseType: !121, size: 64, align: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !111, line: 70, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !35, file: !36, line: 127, baseType: !99, size: 64, align: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !35, file: !36, line: 128, baseType: !7, size: 64, align: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !35, file: !36, line: 129, baseType: !7, size: 64, align: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !35, file: !36, line: 130, baseType: !11, size: 64, align: 64, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !35, file: !36, line: 137, baseType: !101, size: 8, align: 8, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !35, file: !36, line: 138, baseType: !11, size: 64, align: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !31, file: !32, line: 162, baseType: !55, size: 64, align: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !31, file: !32, line: 165, baseType: !22, size: 32, align: 32, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !31, file: !32, line: 166, baseType: !7, size: 64, align: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !31, file: !32, line: 167, baseType: !7, size: 64, align: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !31, file: !32, line: 170, baseType: !134, size: 576, align: 64, offset: 1536)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_client", file: !32, line: 134, size: 576, align: 64, elements: !135)
!135 = !{!136, !142, !148, !154, !159, !162, !167, !168, !169, !170}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "opener", scope: !134, file: !32, line: 135, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !57, line: 241, baseType: !139)
!139 = !DISubroutineType(types: !140)
!140 = !{!22, !49, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !134, file: !32, line: 136, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_read_callback", file: !57, line: 218, baseType: !145)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !49, !141, !83}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !57, line: 95, baseType: !63)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "skipper", scope: !134, file: !32, line: 137, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_skip_callback", file: !57, line: 226, baseType: !151)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !49, !141, !153}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !57, line: 73, baseType: !7)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !134, file: !32, line: 138, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_seek_callback", file: !57, line: 233, baseType: !157)
!157 = !DISubroutineType(types: !158)
!158 = !{!153, !49, !141, !153, !22}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "closer", scope: !134, file: !32, line: 139, baseType: !160, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !57, line: 243, baseType: !139)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "switcher", scope: !134, file: !32, line: 140, baseType: !163, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_switch_callback", file: !57, line: 249, baseType: !165)
!165 = !DISubroutineType(types: !166)
!166 = !{!22, !49, !141, !141}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !134, file: !32, line: 141, baseType: !39, size: 32, align: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !134, file: !32, line: 142, baseType: !39, size: 32, align: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !134, file: !32, line: 143, baseType: !7, size: 64, align: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !134, file: !32, line: 144, baseType: !171, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_data_node", file: !32, line: 129, size: 192, align: 64, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "begin_position", scope: !172, file: !32, line: 130, baseType: !7, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !172, file: !32, line: 131, baseType: !7, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !32, line: 132, baseType: !141, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "bidders", scope: !31, file: !32, line: 173, baseType: !178, size: 6144, align: 64, offset: 2112)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 6144, align: 64, elements: !18)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter_bidder", file: !32, line: 60, size: 384, align: 64, elements: !180)
!180 = !{!181, !182, !183, !230, !231, !235}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !32, line: 62, baseType: !141, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !32, line: 64, baseType: !99, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !179, file: !32, line: 66, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!22, !187, !188}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter", file: !32, line: 82, size: 1408, align: 64, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !199, !203, !207, !211, !212, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !189, file: !32, line: 83, baseType: !7, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "bidder", scope: !189, file: !32, line: 86, baseType: !187, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !189, file: !32, line: 87, baseType: !188, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !189, file: !32, line: 88, baseType: !30, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !189, file: !32, line: 90, baseType: !196, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!22, !188}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !189, file: !32, line: 92, baseType: !200, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!63, !188, !83}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !189, file: !32, line: 94, baseType: !204, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!7, !188, !7}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !189, file: !32, line: 96, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!7, !188, !7, !22}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !189, file: !32, line: 98, baseType: !196, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sswitch", scope: !189, file: !32, line: 100, baseType: !213, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!22, !188, !39}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !189, file: !32, line: 102, baseType: !141, size: 64, align: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !32, line: 104, baseType: !99, size: 64, align: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !189, file: !32, line: 105, baseType: !22, size: 32, align: 32, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !189, file: !32, line: 108, baseType: !114, size: 64, align: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !189, file: !32, line: 109, baseType: !11, size: 64, align: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !32, line: 110, baseType: !114, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !189, file: !32, line: 111, baseType: !11, size: 64, align: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "client_buff", scope: !189, file: !32, line: 112, baseType: !67, size: 64, align: 64, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "client_total", scope: !189, file: !32, line: 113, baseType: !11, size: 64, align: 64, offset: 1152)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "client_next", scope: !189, file: !32, line: 114, baseType: !99, size: 64, align: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "client_avail", scope: !189, file: !32, line: 115, baseType: !11, size: 64, align: 64, offset: 1280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_file", scope: !189, file: !32, line: 116, baseType: !101, size: 8, align: 8, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !189, file: !32, line: 117, baseType: !101, size: 8, align: 8, offset: 1352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !189, file: !32, line: 118, baseType: !101, size: 8, align: 8, offset: 1360)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !32, line: 69, baseType: !196, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !179, file: !32, line: 71, baseType: !232, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!22, !187, !99, !99}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !179, file: !32, line: 74, baseType: !236, size: 64, align: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!22, !187}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !31, file: !32, line: 176, baseType: !188, size: 64, align: 64, offset: 8256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_filter_bidding", scope: !31, file: !32, line: 179, baseType: !22, size: 32, align: 32, offset: 8320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "header_position", scope: !31, file: !32, line: 182, baseType: !7, size: 64, align: 64, offset: 8384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data_start_node", scope: !31, file: !32, line: 185, baseType: !39, size: 32, align: 32, offset: 8448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data_end_node", scope: !31, file: !32, line: 186, baseType: !39, size: 32, align: 32, offset: 8480)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !31, file: !32, line: 209, baseType: !245, size: 11264, align: 64, offset: 8512)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 11264, align: 64, elements: !18)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_format_descriptor", file: !32, line: 196, size: 704, align: 64, elements: !247)
!247 = !{!248, !249, !250, !254, !258, !262, !266, !270, !274, !275, !276}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !32, line: 197, baseType: !141, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !32, line: 198, baseType: !99, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !246, file: !32, line: 199, baseType: !251, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!22, !30, !22}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !246, file: !32, line: 200, baseType: !255, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!22, !30, !99, !99}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !246, file: !32, line: 202, baseType: !259, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!22, !30, !55}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "read_data", scope: !246, file: !32, line: 203, baseType: !263, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!22, !30, !83, !84, !85}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_skip", scope: !246, file: !32, line: 204, baseType: !267, size: 64, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!22, !30}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "seek_data", scope: !246, file: !32, line: 205, baseType: !271, size: 64, align: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!7, !30, !7, !22}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !246, file: !32, line: 206, baseType: !267, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "format_capabilties", scope: !246, file: !32, line: 207, baseType: !267, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "has_encrypted_entries", scope: !246, file: !32, line: 208, baseType: !267, size: 64, align: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !31, file: !32, line: 210, baseType: !278, size: 64, align: 64, offset: 19776)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !31, file: !32, line: 215, baseType: !280, size: 64, align: 64, offset: 19840)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_extract", file: !32, line: 151, size: 192, align: 64, elements: !282)
!282 = !{!283, !284, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !281, file: !32, line: 152, baseType: !49, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress", scope: !281, file: !32, line: 155, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !141}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress_user_data", scope: !281, file: !32, line: 156, baseType: !141, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_archive_extract", scope: !31, file: !32, line: 216, baseType: !267, size: 64, align: 64, offset: 19904)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !31, file: !32, line: 227, baseType: !291, size: 320, align: 64, offset: 19968)
!291 = !DICompositeType(tag: DW_TAG_structure_type, scope: !31, file: !32, line: 221, size: 320, align: 64, elements: !292)
!292 = !{!293, !299, !301, !302, !307}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !291, file: !32, line: 222, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_passphrase", file: !32, line: 146, size: 128, align: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !295, file: !32, line: 147, baseType: !114, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !32, line: 148, baseType: !294, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !291, file: !32, line: 223, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !291, file: !32, line: 224, baseType: !22, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !291, file: !32, line: 225, baseType: !303, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !57, line: 256, baseType: !305)
!305 = !DISubroutineType(types: !306)
!306 = !{!99, !49, !141}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !291, file: !32, line: 226, baseType: !141, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!311 = !{!312, !314, !315, !316, !317, !318, !323}
!312 = distinct !DISubprogram(name: "archive_read_support_compression_rpm", scope: !1, file: !1, line: 69, type: !47, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!313 = !{}
!314 = distinct !DISubprogram(name: "archive_read_support_filter_rpm", scope: !1, file: !1, line: 76, type: !47, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!315 = distinct !DISubprogram(name: "rpm_bidder_bid", scope: !1, file: !1, line: 97, type: !185, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!316 = distinct !DISubprogram(name: "rpm_bidder_init", scope: !1, file: !1, line: 137, type: !197, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!317 = distinct !DISubprogram(name: "rpm_filter_read", scope: !1, file: !1, line: 161, type: !201, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!318 = distinct !DISubprogram(name: "archive_be32dec", scope: !319, file: !319, line: 77, type: !320, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!319 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_endian.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !67}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 51, baseType: !39)
!323 = distinct !DISubprogram(name: "rpm_filter_close", scope: !1, file: !1, line: 280, type: !197, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, variables: !313)
!324 = !{i32 2, !"Dwarf Version", i32 4}
!325 = !{i32 2, !"Debug Info Version", i32 3}
!326 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!327 = !DILocalVariable(name: "a", arg: 1, scope: !312, file: !1, line: 69, type: !49)
!328 = !DIExpression()
!329 = !DILocation(line: 69, column: 54, scope: !312)
!330 = !DILocation(line: 71, column: 41, scope: !312)
!331 = !DILocation(line: 71, column: 9, scope: !312)
!332 = !DILocation(line: 71, column: 2, scope: !312)
!333 = !DILocalVariable(name: "_a", arg: 1, scope: !314, file: !1, line: 76, type: !49)
!334 = !DILocation(line: 76, column: 49, scope: !314)
!335 = !DILocalVariable(name: "a", scope: !314, file: !1, line: 78, type: !30)
!336 = !DILocation(line: 78, column: 23, scope: !314)
!337 = !DILocation(line: 78, column: 50, scope: !314)
!338 = !DILocation(line: 78, column: 27, scope: !314)
!339 = !DILocalVariable(name: "bidder", scope: !314, file: !1, line: 79, type: !187)
!340 = !DILocation(line: 79, column: 37, scope: !314)
!341 = !DILocation(line: 81, column: 2, scope: !314)
!342 = !DILocalVariable(name: "magic_test", scope: !343, file: !1, line: 81, type: !22)
!343 = distinct !DILexicalBlock(scope: !314, file: !1, line: 81, column: 2)
!344 = !DILocation(line: 81, column: 2, scope: !343)
!345 = !DILocation(line: 81, column: 2, scope: !346)
!346 = !DILexicalBlockFile(scope: !343, file: !1, discriminator: 1)
!347 = !DILocation(line: 81, column: 2, scope: !348)
!348 = !DILexicalBlockFile(scope: !349, file: !1, discriminator: 2)
!349 = distinct !DILexicalBlock(scope: !343, file: !1, line: 81, column: 2)
!350 = !DILocation(line: 81, column: 2, scope: !351)
!351 = !DILexicalBlockFile(scope: !343, file: !1, discriminator: 3)
