; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_options.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque

@.str = private unnamed_addr constant [13 x i8] c"Empty option\00", align 1
@.str.1 = private unnamed_addr constant [26 x i8] c"Unknown module name: `%s'\00", align 1
@.str.2 = private unnamed_addr constant [33 x i8] c"Undefined option: `%s%s%s%s%s%s'\00", align 1
@.str.3 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"!\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c":\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_options.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !{!9, !115, !118, !121}
!9 = distinct !DISubprogram(name: "_archive_set_option", scope: !1, file: !1, line: 40, type: !10, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !5, !5, !5, !12, !5, !110}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !15, line: 89, size: 1280, align: 64, elements: !16)
!15 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!16 = !{!17, !19, !20, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !104, !105, !106, !107, !108, !109}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !14, file: !15, line: 96, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !14, file: !15, line: 97, baseType: !18, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !14, file: !15, line: 103, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !15, line: 63, size: 832, align: 64, elements: !23)
!23 = !{!24, !28, !29, !36, !37, !51, !57, !62, !63, !70, !71, !75, !79}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !22, file: !15, line: 64, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!12, !13}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !22, file: !15, line: 65, baseType: !25, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !22, file: !15, line: 66, baseType: !30, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!12, !13, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !35, line: 180, flags: DIFlagFwdDecl)
!35 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !22, file: !15, line: 68, baseType: !25, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !22, file: !15, line: 69, baseType: !38, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !13, !46, !48}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 172, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!45 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 62, baseType: !50)
!49 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !22, file: !15, line: 71, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!41, !13, !46, !48, !55}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 40, baseType: !45)
!56 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !22, file: !15, line: 74, baseType: !58, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!12, !13, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !22, file: !15, line: 76, baseType: !30, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !22, file: !15, line: 78, baseType: !64, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!12, !13, !67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !22, file: !15, line: 81, baseType: !25, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !22, file: !15, line: 82, baseType: !72, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!55, !13, !12}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !22, file: !15, line: 83, baseType: !76, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!12, !13, !12}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !22, file: !15, line: 84, baseType: !80, size: 64, align: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!5, !13, !12}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !14, file: !15, line: 105, baseType: !12, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !14, file: !15, line: 106, baseType: !5, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !14, file: !15, line: 108, baseType: !12, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !14, file: !15, line: 109, baseType: !5, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !14, file: !15, line: 112, baseType: !12, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !14, file: !15, line: 114, baseType: !12, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !15, line: 115, baseType: !5, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !14, file: !15, line: 116, baseType: !91, size: 192, align: 64, offset: 512)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !92, line: 58, size: 192, align: 64, elements: !93)
!92 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !{!94, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !92, line: 59, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !92, line: 60, baseType: !48, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !91, file: !92, line: 61, baseType: !48, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !14, file: !15, line: 118, baseType: !95, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !14, file: !15, line: 119, baseType: !18, size: 32, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !14, file: !15, line: 120, baseType: !18, size: 32, align: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !14, file: !15, line: 121, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !92, line: 70, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !14, file: !15, line: 127, baseType: !5, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !14, file: !15, line: 128, baseType: !55, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !14, file: !15, line: 129, baseType: !55, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !14, file: !15, line: 130, baseType: !48, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !14, file: !15, line: 137, baseType: !7, size: 8, align: 8, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !14, file: !15, line: 138, baseType: !48, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "option_handler", file: !111, line: 31, baseType: !112)
!111 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_options_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!12, !13, !5, !5, !5}
!115 = distinct !DISubprogram(name: "_archive_set_either_option", scope: !1, file: !1, line: 76, type: !116, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!116 = !DISubroutineType(types: !117)
!117 = !{!12, !13, !5, !5, !5, !110, !110}
!118 = distinct !DISubprogram(name: "_archive_set_options", scope: !1, file: !1, line: 100, type: !119, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!119 = !DISubroutineType(types: !120)
!120 = !{!12, !13, !5, !12, !5, !110}
!121 = distinct !DISubprogram(name: "parse_option", scope: !1, file: !1, line: 170, type: !122, isLocal: true, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{!5, !124, !124, !124, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!125 = !{i32 2, !"Dwarf Version", i32 4}
!126 = !{i32 2, !"Debug Info Version", i32 3}
!127 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!128 = !DILocalVariable(name: "a", arg: 1, scope: !9, file: !1, line: 40, type: !13)
!129 = !DIExpression()
!130 = !DILocation(line: 40, column: 37, scope: !9)
!131 = !DILocalVariable(name: "m", arg: 2, scope: !9, file: !1, line: 41, type: !5)
!132 = !DILocation(line: 41, column: 17, scope: !9)
!133 = !DILocalVariable(name: "o", arg: 3, scope: !9, file: !1, line: 41, type: !5)
!134 = !DILocation(line: 41, column: 32, scope: !9)
!135 = !DILocalVariable(name: "v", arg: 4, scope: !9, file: !1, line: 41, type: !5)
!136 = !DILocation(line: 41, column: 47, scope: !9)
!137 = !DILocalVariable(name: "magic", arg: 5, scope: !9, file: !1, line: 42, type: !12)
!138 = !DILocation(line: 42, column: 9, scope: !9)
!139 = !DILocalVariable(name: "fn", arg: 6, scope: !9, file: !1, line: 42, type: !5)
!140 = !DILocation(line: 42, column: 28, scope: !9)
!141 = !DILocalVariable(name: "use_option", arg: 7, scope: !9, file: !1, line: 42, type: !110)
!142 = !DILocation(line: 42, column: 47, scope: !9)
!143 = !DILocalVariable(name: "mp", scope: !9, file: !1, line: 44, type: !5)
!144 = !DILocation(line: 44, column: 14, scope: !9)
!145 = !DILocalVariable(name: "op", scope: !9, file: !1, line: 44, type: !5)
!146 = !DILocation(line: 44, column: 19, scope: !9)
!147 = !DILocalVariable(name: "vp", scope: !9, file: !1, line: 44, type: !5)
!148 = !DILocation(line: 44, column: 24, scope: !9)
!149 = !DILocalVariable(name: "r", scope: !9, file: !1, line: 45, type: !12)
!150 = !DILocation(line: 45, column: 6, scope: !9)
!151 = !DILocation(line: 47, column: 2, scope: !9)
!152 = !DILocalVariable(name: "magic_test", scope: !153, file: !1, line: 47, type: !12)
!153 = distinct !DILexicalBlock(scope: !9, file: !1, line: 47, column: 2)
!154 = !DILocation(line: 47, column: 2, scope: !153)
!155 = !DILocation(line: 47, column: 2, scope: !156)
!156 = !DILexicalBlockFile(scope: !153, file: !1, discriminator: 1)
!157 = !DILocation(line: 47, column: 2, scope: !158)
!158 = !DILexicalBlockFile(scope: !159, file: !1, discriminator: 2)
!159 = distinct !DILexicalBlock(scope: !153, file: !1, line: 47, column: 2)
!160 = !DILocation(line: 47, column: 2, scope: !161)
!161 = !DILexicalBlockFile(scope: !153, file: !1, discriminator: 3)
!162 = !DILocation(line: 49, column: 8, scope: !9)
