; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_format_tar.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_read = type { %struct.archive, %struct.archive_entry*, i32, i64, i64, %struct.archive_read_client, [16 x %struct.archive_read_filter_bidder], %struct.archive_read_filter*, i32, i64, i32, i32, [16 x %struct.archive_format_descriptor], %struct.archive_format_descriptor*, %struct.archive_read_extract*, i32 (%struct.archive_read*)*, %struct.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !438, globals: !548)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_format_tar.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !291, !122, !336, !380, !23, !382, !383, !52, !384, !386, !45, !420, !13, !95, !422, !38, !80, !314}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read", file: !6, line: 159, size: 20288, align: 64, elements: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!7 = !{!8, !110, !111, !112, !113, !114, !158, !222, !223, !224, !225, !226, !227, !260, !262, !272, !273}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !5, file: !6, line: 160, baseType: !9, size: 1280, align: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !10, line: 89, size: 1280, align: 64, elements: !11)
!10 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!11 = !{!12, !14, !15, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !104, !105, !106, !107, !108, !109}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !9, file: !10, line: 96, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !9, file: !10, line: 97, baseType: !13, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !9, file: !10, line: 103, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !10, line: 63, size: 832, align: 64, elements: !18)
!18 = !{!19, !25, !26, !33, !34, !48, !54, !59, !60, !67, !68, !72, !76}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !17, file: !10, line: 64, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !24}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !17, file: !10, line: 65, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !17, file: !10, line: 66, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!23, !24, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !32, line: 180, flags: DIFlagFwdDecl)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !17, file: !10, line: 68, baseType: !20, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !17, file: !10, line: 69, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !24, !43, !45}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !39, line: 109, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !41, line: 172, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 62, baseType: !47)
!46 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !17, file: !10, line: 71, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!38, !24, !43, !45, !52}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !53, line: 40, baseType: !42)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !17, file: !10, line: 74, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!23, !24, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !17, file: !10, line: 76, baseType: !27, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !17, file: !10, line: 78, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!23, !24, !64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !17, file: !10, line: 81, baseType: !20, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !17, file: !10, line: 82, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!52, !24, !23}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !17, file: !10, line: 83, baseType: !73, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!23, !24, !23}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !17, file: !10, line: 84, baseType: !77, size: 64, align: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !24, !23}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !9, file: !10, line: 105, baseType: !23, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !9, file: !10, line: 106, baseType: !80, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !9, file: !10, line: 108, baseType: !23, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !9, file: !10, line: 109, baseType: !80, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !9, file: !10, line: 112, baseType: !23, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !9, file: !10, line: 114, baseType: !23, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 115, baseType: !80, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !9, file: !10, line: 116, baseType: !91, size: 192, align: 64, offset: 512)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !92, line: 58, size: 192, align: 64, elements: !93)
!92 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !{!94, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !92, line: 59, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !92, line: 60, baseType: !45, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !91, file: !92, line: 61, baseType: !45, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !9, file: !10, line: 118, baseType: !95, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !9, file: !10, line: 119, baseType: !13, size: 32, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !9, file: !10, line: 120, baseType: !13, size: 32, align: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !9, file: !10, line: 121, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !92, line: 70, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !9, file: !10, line: 127, baseType: !80, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !9, file: !10, line: 128, baseType: !52, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !9, file: !10, line: 129, baseType: !52, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !9, file: !10, line: 130, baseType: !45, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !9, file: !10, line: 137, baseType: !82, size: 8, align: 8, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !9, file: !10, line: 138, baseType: !45, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !5, file: !6, line: 162, baseType: !30, size: 64, align: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !5, file: !6, line: 165, baseType: !23, size: 32, align: 32, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !5, file: !6, line: 166, baseType: !52, size: 64, align: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !5, file: !6, line: 167, baseType: !52, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !5, file: !6, line: 170, baseType: !115, size: 576, align: 64, offset: 1536)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_client", file: !6, line: 134, size: 576, align: 64, elements: !116)
!116 = !{!117, !123, !129, !135, !140, !143, !148, !149, !150, !151}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "opener", scope: !115, file: !6, line: 135, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !32, line: 241, baseType: !120)
!120 = !DISubroutineType(types: !121)
!121 = !{!23, !24, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !115, file: !6, line: 136, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_read_callback", file: !32, line: 218, baseType: !126)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !24, !122, !64}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !32, line: 95, baseType: !38)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "skipper", scope: !115, file: !6, line: 137, baseType: !130, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_skip_callback", file: !32, line: 226, baseType: !132)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !24, !122, !134}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !32, line: 73, baseType: !52)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !115, file: !6, line: 138, baseType: !136, size: 64, align: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_seek_callback", file: !32, line: 233, baseType: !138)
!138 = !DISubroutineType(types: !139)
!139 = !{!134, !24, !122, !134, !23}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "closer", scope: !115, file: !6, line: 139, baseType: !141, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !32, line: 243, baseType: !120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "switcher", scope: !115, file: !6, line: 140, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_switch_callback", file: !32, line: 249, baseType: !146)
!146 = !DISubroutineType(types: !147)
!147 = !{!23, !24, !122, !122}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !115, file: !6, line: 141, baseType: !13, size: 32, align: 32, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !115, file: !6, line: 142, baseType: !13, size: 32, align: 32, offset: 416)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !115, file: !6, line: 143, baseType: !52, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !115, file: !6, line: 144, baseType: !152, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_data_node", file: !6, line: 129, size: 192, align: 64, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "begin_position", scope: !153, file: !6, line: 130, baseType: !52, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !153, file: !6, line: 131, baseType: !52, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !6, line: 132, baseType: !122, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bidders", scope: !5, file: !6, line: 173, baseType: !159, size: 6144, align: 64, offset: 2112)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 6144, align: 64, elements: !220)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter_bidder", file: !6, line: 60, size: 384, align: 64, elements: !161)
!161 = !{!162, !163, !164, !211, !212, !216}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !6, line: 62, baseType: !122, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !6, line: 64, baseType: !80, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !160, file: !6, line: 66, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!23, !168, !169}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter", file: !6, line: 82, size: 1408, align: 64, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !180, !184, !188, !192, !193, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !170, file: !6, line: 83, baseType: !52, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "bidder", scope: !170, file: !6, line: 86, baseType: !168, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !170, file: !6, line: 87, baseType: !169, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !170, file: !6, line: 88, baseType: !4, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !170, file: !6, line: 90, baseType: !177, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!23, !169}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !170, file: !6, line: 92, baseType: !181, size: 64, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!38, !169, !64}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !170, file: !6, line: 94, baseType: !185, size: 64, align: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!52, !169, !52}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !170, file: !6, line: 96, baseType: !189, size: 64, align: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!52, !169, !52, !23}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !170, file: !6, line: 98, baseType: !177, size: 64, align: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sswitch", scope: !170, file: !6, line: 100, baseType: !194, size: 64, align: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!23, !169, !13}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !170, file: !6, line: 102, baseType: !122, size: 64, align: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !6, line: 104, baseType: !80, size: 64, align: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !170, file: !6, line: 105, baseType: !23, size: 32, align: 32, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !170, file: !6, line: 108, baseType: !95, size: 64, align: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !170, file: !6, line: 109, baseType: !45, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !6, line: 110, baseType: !95, size: 64, align: 64, offset: 960)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !170, file: !6, line: 111, baseType: !45, size: 64, align: 64, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "client_buff", scope: !170, file: !6, line: 112, baseType: !43, size: 64, align: 64, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "client_total", scope: !170, file: !6, line: 113, baseType: !45, size: 64, align: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "client_next", scope: !170, file: !6, line: 114, baseType: !80, size: 64, align: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "client_avail", scope: !170, file: !6, line: 115, baseType: !45, size: 64, align: 64, offset: 1280)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_file", scope: !170, file: !6, line: 116, baseType: !82, size: 8, align: 8, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !170, file: !6, line: 117, baseType: !82, size: 8, align: 8, offset: 1352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !170, file: !6, line: 118, baseType: !82, size: 8, align: 8, offset: 1360)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !160, file: !6, line: 69, baseType: !177, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !6, line: 71, baseType: !213, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!23, !168, !80, !80}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !160, file: !6, line: 74, baseType: !217, size: 64, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!23, !168}
!220 = !{!221}
!221 = !DISubrange(count: 16)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !5, file: !6, line: 176, baseType: !169, size: 64, align: 64, offset: 8256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_filter_bidding", scope: !5, file: !6, line: 179, baseType: !23, size: 32, align: 32, offset: 8320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "header_position", scope: !5, file: !6, line: 182, baseType: !52, size: 64, align: 64, offset: 8384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data_start_node", scope: !5, file: !6, line: 185, baseType: !13, size: 32, align: 32, offset: 8448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data_end_node", scope: !5, file: !6, line: 186, baseType: !13, size: 32, align: 32, offset: 8480)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !5, file: !6, line: 209, baseType: !228, size: 11264, align: 64, offset: 8512)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 11264, align: 64, elements: !220)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_format_descriptor", file: !6, line: 196, size: 704, align: 64, elements: !230)
!230 = !{!231, !232, !233, !237, !241, !245, !249, !253, !257, !258, !259}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !6, line: 197, baseType: !122, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !6, line: 198, baseType: !80, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !229, file: !6, line: 199, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!23, !4, !23}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !229, file: !6, line: 200, baseType: !238, size: 64, align: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!23, !4, !80, !80}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !229, file: !6, line: 202, baseType: !242, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!23, !4, !30}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "read_data", scope: !229, file: !6, line: 203, baseType: !246, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!23, !4, !64, !65, !66}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_skip", scope: !229, file: !6, line: 204, baseType: !250, size: 64, align: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!23, !4}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "seek_data", scope: !229, file: !6, line: 205, baseType: !254, size: 64, align: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!52, !4, !52, !23}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !229, file: !6, line: 206, baseType: !250, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format_capabilties", scope: !229, file: !6, line: 207, baseType: !250, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "has_encrypted_entries", scope: !229, file: !6, line: 208, baseType: !250, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !5, file: !6, line: 210, baseType: !261, size: 64, align: 64, offset: 19776)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !5, file: !6, line: 215, baseType: !263, size: 64, align: 64, offset: 19840)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_extract", file: !6, line: 151, size: 192, align: 64, elements: !265)
!265 = !{!266, !267, !271}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !264, file: !6, line: 152, baseType: !24, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress", scope: !264, file: !6, line: 155, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !122}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress_user_data", scope: !264, file: !6, line: 156, baseType: !122, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_archive_extract", scope: !5, file: !6, line: 216, baseType: !250, size: 64, align: 64, offset: 19904)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !5, file: !6, line: 227, baseType: !274, size: 320, align: 64, offset: 19968)
!274 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !6, line: 221, size: 320, align: 64, elements: !275)
!275 = !{!276, !282, !284, !285, !290}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !274, file: !6, line: 222, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_passphrase", file: !6, line: 146, size: 128, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !278, file: !6, line: 147, baseType: !95, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !6, line: 148, baseType: !277, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !274, file: !6, line: 223, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !274, file: !6, line: 224, baseType: !23, size: 32, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !274, file: !6, line: 225, baseType: !286, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !32, line: 256, baseType: !288)
!288 = !DISubroutineType(types: !289)
!289 = !{!80, !24, !122}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !274, file: !6, line: 226, baseType: !122, size: 64, align: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "tar", file: !1, line: 120, size: 3520, align: 64, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text", scope: !292, file: !1, line: 121, baseType: !91, size: 192, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "entry_pathname", scope: !292, file: !1, line: 122, baseType: !91, size: 192, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "entry_pathname_override", scope: !292, file: !1, line: 124, baseType: !91, size: 192, align: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "entry_linkpath", scope: !292, file: !1, line: 125, baseType: !91, size: 192, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "entry_uname", scope: !292, file: !1, line: 126, baseType: !91, size: 192, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "entry_gname", scope: !292, file: !1, line: 127, baseType: !91, size: 192, align: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "longlink", scope: !292, file: !1, line: 128, baseType: !91, size: 192, align: 64, offset: 1152)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "longname", scope: !292, file: !1, line: 129, baseType: !91, size: 192, align: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pax_header", scope: !292, file: !1, line: 130, baseType: !91, size: 192, align: 64, offset: 1536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pax_global", scope: !292, file: !1, line: 131, baseType: !91, size: 192, align: 64, offset: 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !292, file: !1, line: 132, baseType: !91, size: 192, align: 64, offset: 1920)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pax_hdrcharset_binary", scope: !292, file: !1, line: 133, baseType: !23, size: 32, align: 32, offset: 2112)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "header_recursion_depth", scope: !292, file: !1, line: 134, baseType: !23, size: 32, align: 32, offset: 2144)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "entry_bytes_remaining", scope: !292, file: !1, line: 135, baseType: !52, size: 64, align: 64, offset: 2176)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "entry_offset", scope: !292, file: !1, line: 136, baseType: !52, size: 64, align: 64, offset: 2240)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "entry_padding", scope: !292, file: !1, line: 137, baseType: !52, size: 64, align: 64, offset: 2304)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "entry_bytes_unconsumed", scope: !292, file: !1, line: 138, baseType: !52, size: 64, align: 64, offset: 2368)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "realsize", scope: !292, file: !1, line: 139, baseType: !52, size: 64, align: 64, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_allowed", scope: !292, file: !1, line: 140, baseType: !23, size: 32, align: 32, offset: 2496)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_list", scope: !292, file: !1, line: 141, baseType: !314, size: 64, align: 64, offset: 2560)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "sparse_block", file: !1, line: 113, size: 256, align: 64, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !1, line: 114, baseType: !314, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !315, file: !1, line: 115, baseType: !52, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !315, file: !1, line: 116, baseType: !52, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "hole", scope: !315, file: !1, line: 117, baseType: !23, size: 32, align: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_last", scope: !292, file: !1, line: 142, baseType: !314, size: 64, align: 64, offset: 2624)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_offset", scope: !292, file: !1, line: 143, baseType: !52, size: 64, align: 64, offset: 2688)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_numbytes", scope: !292, file: !1, line: 144, baseType: !52, size: 64, align: 64, offset: 2752)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_gnu_major", scope: !292, file: !1, line: 145, baseType: !23, size: 32, align: 32, offset: 2816)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_gnu_minor", scope: !292, file: !1, line: 146, baseType: !23, size: 32, align: 32, offset: 2848)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_gnu_pending", scope: !292, file: !1, line: 147, baseType: !82, size: 8, align: 8, offset: 2880)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "localname", scope: !292, file: !1, line: 149, baseType: !91, size: 192, align: 64, offset: 2944)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "opt_sconv", scope: !292, file: !1, line: 150, baseType: !102, size: 64, align: 64, offset: 3136)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !292, file: !1, line: 151, baseType: !102, size: 64, align: 64, offset: 3200)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sconv_acl", scope: !292, file: !1, line: 152, baseType: !102, size: 64, align: 64, offset: 3264)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sconv_default", scope: !292, file: !1, line: 153, baseType: !102, size: 64, align: 64, offset: 3328)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_default_conversion", scope: !292, file: !1, line: 154, baseType: !23, size: 32, align: 32, offset: 3392)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "compat_2x", scope: !292, file: !1, line: 155, baseType: !23, size: 32, align: 32, offset: 3424)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "process_mac_extensions", scope: !292, file: !1, line: 156, baseType: !23, size: 32, align: 32, offset: 3456)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "read_concatenated_archives", scope: !292, file: !1, line: 157, baseType: !23, size: 32, align: 32, offset: 3488)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry_header_ustar", file: !1, line: 54, size: 4000, align: 8, elements: !339)
!339 = !{!340, !344, !348, !349, !350, !354, !355, !356, !360, !361, !365, !369, !373, !374, !375, !376}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !338, file: !1, line: 55, baseType: !341, size: 800, align: 8)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 800, align: 8, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 100)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !338, file: !1, line: 56, baseType: !345, size: 64, align: 8, offset: 800)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, align: 8, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !338, file: !1, line: 57, baseType: !345, size: 64, align: 8, offset: 864)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !338, file: !1, line: 58, baseType: !345, size: 64, align: 8, offset: 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !338, file: !1, line: 59, baseType: !351, size: 96, align: 8, offset: 992)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 96, align: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 12)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !338, file: !1, line: 60, baseType: !351, size: 96, align: 8, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !338, file: !1, line: 61, baseType: !345, size: 64, align: 8, offset: 1184)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "typeflag", scope: !338, file: !1, line: 62, baseType: !357, size: 8, align: 8, offset: 1248)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, align: 8, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 1)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !338, file: !1, line: 63, baseType: !341, size: 800, align: 8, offset: 1256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !338, file: !1, line: 64, baseType: !362, size: 48, align: 8, offset: 2056)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 48, align: 8, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 6)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !338, file: !1, line: 65, baseType: !366, size: 16, align: 8, offset: 2104)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 16, align: 8, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 2)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !338, file: !1, line: 66, baseType: !370, size: 256, align: 8, offset: 2120)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, align: 8, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !338, file: !1, line: 67, baseType: !370, size: 256, align: 8, offset: 2376)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rdevmajor", scope: !338, file: !1, line: 68, baseType: !345, size: 64, align: 8, offset: 2632)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rdevminor", scope: !338, file: !1, line: 69, baseType: !345, size: 64, align: 8, offset: 2696)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !338, file: !1, line: 70, baseType: !377, size: 1240, align: 8, offset: 2760)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 1240, align: 8, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 155)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!383 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !39, line: 70, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 129, baseType: !13)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry_header_gnutar", file: !1, line: 81, size: 3960, align: 8, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !418, !419}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !388, file: !1, line: 82, baseType: !341, size: 800, align: 8)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !388, file: !1, line: 83, baseType: !345, size: 64, align: 8, offset: 800)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !388, file: !1, line: 84, baseType: !345, size: 64, align: 8, offset: 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !388, file: !1, line: 85, baseType: !345, size: 64, align: 8, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !388, file: !1, line: 86, baseType: !351, size: 96, align: 8, offset: 992)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !388, file: !1, line: 87, baseType: !351, size: 96, align: 8, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !388, file: !1, line: 88, baseType: !345, size: 64, align: 8, offset: 1184)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "typeflag", scope: !388, file: !1, line: 89, baseType: !357, size: 8, align: 8, offset: 1248)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !388, file: !1, line: 90, baseType: !341, size: 800, align: 8, offset: 1256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !388, file: !1, line: 91, baseType: !345, size: 64, align: 8, offset: 2056)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !388, file: !1, line: 92, baseType: !370, size: 256, align: 8, offset: 2120)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !388, file: !1, line: 93, baseType: !370, size: 256, align: 8, offset: 2376)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rdevmajor", scope: !388, file: !1, line: 94, baseType: !345, size: 64, align: 8, offset: 2632)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rdevminor", scope: !388, file: !1, line: 95, baseType: !345, size: 64, align: 8, offset: 2696)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !388, file: !1, line: 96, baseType: !351, size: 96, align: 8, offset: 2760)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !388, file: !1, line: 97, baseType: !351, size: 96, align: 8, offset: 2856)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !388, file: !1, line: 98, baseType: !351, size: 96, align: 8, offset: 2952)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "longnames", scope: !388, file: !1, line: 99, baseType: !408, size: 32, align: 8, offset: 3048)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 32, align: 8, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 4)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !388, file: !1, line: 100, baseType: !357, size: 8, align: 8, offset: 3080)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", scope: !388, file: !1, line: 101, baseType: !413, size: 768, align: 8, offset: 3088)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 768, align: 8, elements: !409)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "gnu_sparse", file: !1, line: 76, size: 192, align: 8, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !414, file: !1, line: 77, baseType: !351, size: 96, align: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "numbytes", scope: !414, file: !1, line: 78, baseType: !351, size: 96, align: 8, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "isextended", scope: !388, file: !1, line: 102, baseType: !357, size: 8, align: 8, offset: 3856)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realsize", scope: !388, file: !1, line: 103, baseType: !351, size: 96, align: 8, offset: 3864)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !39, line: 60, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 124, baseType: !47)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "extended", scope: !425, file: !1, line: 2280, size: 4096, align: 8, elements: !428)
!425 = distinct !DISubprogram(name: "gnu_sparse_old_read", scope: !1, file: !1, line: 2275, type: !426, isLocal: true, isDefinition: true, scopeLine: 2277, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!426 = !DISubroutineType(types: !427)
!427 = !{!23, !4, !291, !386, !65}
!428 = !{!429, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", scope: !424, file: !1, line: 2281, baseType: !430, size: 4032, align: 8)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 4032, align: 8, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 21)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "isextended", scope: !424, file: !1, line: 2282, baseType: !357, size: 8, align: 8, offset: 4032)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !424, file: !1, line: 2283, baseType: !435, size: 56, align: 8, offset: 4040)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 56, align: 8, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 7)
!438 = !{!439, !440, !441, !442, !445, !446, !449, !452, !455, !456, !457, !460, !463, !464, !465, !468, !471, !475, !476, !477, !478, !481, !482, !483, !486, !489, !490, !493, !497, !500, !503, !506, !509, !512, !515, !518, !519, !425, !522, !527, !528, !529, !530, !533, !536, !540, !543, !546, !547}
!439 = distinct !DISubprogram(name: "archive_read_support_format_gnutar", scope: !1, file: !1, line: 234, type: !21, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!440 = distinct !DISubprogram(name: "archive_read_support_format_tar", scope: !1, file: !1, line: 243, type: !21, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!441 = distinct !DISubprogram(name: "archive_read_format_tar_cleanup", scope: !1, file: !1, line: 280, type: !251, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!442 = distinct !DISubprogram(name: "gnu_clear_sparse_list", scope: !1, file: !1, line: 2250, type: !443, isLocal: true, isDefinition: true, scopeLine: 2251, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !291}
!445 = distinct !DISubprogram(name: "archive_read_format_tar_bid", scope: !1, file: !1, line: 356, type: !235, isLocal: true, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!446 = distinct !DISubprogram(name: "archive_block_is_null", scope: !1, file: !1, line: 928, type: !447, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!447 = !DISubroutineType(types: !448)
!448 = !{!23, !80}
!449 = distinct !DISubprogram(name: "checksum", scope: !1, file: !1, line: 873, type: !450, isLocal: true, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!450 = !DISubroutineType(types: !451)
!451 = !{!23, !4, !43}
!452 = distinct !DISubprogram(name: "tar_atol", scope: !1, file: !1, line: 2561, type: !453, isLocal: true, isDefinition: true, scopeLine: 2562, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!453 = !DISubroutineType(types: !454)
!454 = !{!52, !80, !45}
!455 = distinct !DISubprogram(name: "tar_atol256", scope: !1, file: !1, line: 2644, type: !453, isLocal: true, isDefinition: true, scopeLine: 2645, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!456 = distinct !DISubprogram(name: "tar_atol8", scope: !1, file: !1, line: 2622, type: !453, isLocal: true, isDefinition: true, scopeLine: 2623, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!457 = distinct !DISubprogram(name: "tar_atol_base_n", scope: !1, file: !1, line: 2578, type: !458, isLocal: true, isDefinition: true, scopeLine: 2579, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!458 = !DISubroutineType(types: !459)
!459 = !{!52, !80, !45, !23}
!460 = distinct !DISubprogram(name: "validate_number_field", scope: !1, file: !1, line: 327, type: !461, isLocal: true, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!461 = !DISubroutineType(types: !462)
!462 = !{!23, !80, !45}
!463 = distinct !DISubprogram(name: "archive_read_format_tar_options", scope: !1, file: !1, line: 424, type: !239, isLocal: true, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!464 = distinct !DISubprogram(name: "archive_read_format_tar_read_header", scope: !1, file: !1, line: 492, type: !243, isLocal: true, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
