; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_set_format_mtree.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_rb_tree_ops = type { i32 (%struct.archive_rb_node*, %struct.archive_rb_node*)*, i32 (%struct.archive_rb_node*, i8*)* }
%struct.archive_rb_node = type { [2 x %struct.archive_rb_node*], i64 }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !329, globals: !413)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_set_format_mtree.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !191, !123, !262, !325, !80, !204, !195, !23, !327, !13, !328, !114, !116, !45}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write", file: !6, line: 72, size: 2816, align: 64, elements: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!7 = !{!8, !110, !111, !112, !113, !117, !118, !124, !130, !133, !134, !135, !136, !162, !163, !164, !165, !169, !173, !174, !178, !182, !183, !184, !185, !190}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !5, file: !6, line: 73, baseType: !9, size: 1280, align: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !10, line: 89, size: 1280, align: 64, elements: !11)
!10 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!11 = !{!12, !14, !15, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !104, !105, !106, !107, !108, !109}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !9, file: !10, line: 96, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !9, file: !10, line: 97, baseType: !13, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !9, file: !10, line: 103, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !10, line: 63, size: 832, align: 64, elements: !18)
!18 = !{!19, !25, !26, !33, !34, !48, !54, !59, !60, !67, !68, !72, !76}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !17, file: !10, line: 64, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !24}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !17, file: !10, line: 65, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !17, file: !10, line: 66, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!23, !24, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !32, line: 180, flags: DIFlagFwdDecl)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !17, file: !10, line: 68, baseType: !20, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !17, file: !10, line: 69, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !24, !43, !45}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !39, line: 109, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !41, line: 172, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 62, baseType: !47)
!46 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !17, file: !10, line: 71, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!38, !24, !43, !45, !52}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !53, line: 40, baseType: !42)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !17, file: !10, line: 74, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!23, !24, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !17, file: !10, line: 76, baseType: !27, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !17, file: !10, line: 78, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!23, !24, !64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !17, file: !10, line: 81, baseType: !20, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !17, file: !10, line: 82, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!52, !24, !23}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !17, file: !10, line: 83, baseType: !73, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!23, !24, !23}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !17, file: !10, line: 84, baseType: !77, size: 64, align: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !24, !23}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !9, file: !10, line: 105, baseType: !23, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !9, file: !10, line: 106, baseType: !80, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !9, file: !10, line: 108, baseType: !23, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !9, file: !10, line: 109, baseType: !80, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !9, file: !10, line: 112, baseType: !23, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !9, file: !10, line: 114, baseType: !23, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 115, baseType: !80, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !9, file: !10, line: 116, baseType: !91, size: 192, align: 64, offset: 512)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !92, line: 58, size: 192, align: 64, elements: !93)
!92 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !{!94, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !92, line: 59, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !92, line: 60, baseType: !45, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !91, file: !92, line: 61, baseType: !45, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !9, file: !10, line: 118, baseType: !95, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !9, file: !10, line: 119, baseType: !13, size: 32, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !9, file: !10, line: 120, baseType: !13, size: 32, align: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !9, file: !10, line: 121, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !92, line: 70, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !9, file: !10, line: 127, baseType: !80, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !9, file: !10, line: 128, baseType: !52, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !9, file: !10, line: 129, baseType: !52, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !9, file: !10, line: 130, baseType: !45, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !9, file: !10, line: 137, baseType: !82, size: 8, align: 8, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !9, file: !10, line: 138, baseType: !45, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !5, file: !6, line: 76, baseType: !23, size: 32, align: 32, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !5, file: !6, line: 77, baseType: !52, size: 64, align: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !5, file: !6, line: 78, baseType: !52, size: 64, align: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nulls", scope: !5, file: !6, line: 81, baseType: !114, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "null_length", scope: !5, file: !6, line: 82, baseType: !45, size: 64, align: 64, offset: 1536)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "client_opener", scope: !5, file: !6, line: 85, baseType: !119, size: 64, align: 64, offset: 1600)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !32, line: 241, baseType: !121)
!121 = !DISubroutineType(types: !122)
!122 = !{!23, !24, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "client_writer", scope: !5, file: !6, line: 86, baseType: !125, size: 64, align: 64, offset: 1664)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_write_callback", file: !32, line: 237, baseType: !127)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !24, !123, !43, !45}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !32, line: 95, baseType: !38)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "client_closer", scope: !5, file: !6, line: 87, baseType: !131, size: 64, align: 64, offset: 1728)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !32, line: 243, baseType: !121)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !5, file: !6, line: 88, baseType: !123, size: 64, align: 64, offset: 1792)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !5, file: !6, line: 96, baseType: !23, size: 32, align: 32, offset: 1856)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !5, file: !6, line: 97, baseType: !23, size: 32, align: 32, offset: 1888)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "filter_first", scope: !5, file: !6, line: 102, baseType: !137, size: 64, align: 64, offset: 1920)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write_filter", file: !6, line: 43, size: 768, align: 64, elements: !139)
!139 = !{!140, !141, !142, !143, !147, !151, !155, !156, !157, !158, !159, !160, !161}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !138, file: !6, line: 44, baseType: !52, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !138, file: !6, line: 45, baseType: !24, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next_filter", scope: !138, file: !6, line: 46, baseType: !137, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !138, file: !6, line: 47, baseType: !144, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!23, !137, !80, !80}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !138, file: !6, line: 49, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!23, !137}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !138, file: !6, line: 50, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!23, !137, !43, !45}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !138, file: !6, line: 51, baseType: !148, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !138, file: !6, line: 52, baseType: !148, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !6, line: 53, baseType: !123, size: 64, align: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !6, line: 54, baseType: !80, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !138, file: !6, line: 55, baseType: !23, size: 32, align: 32, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !138, file: !6, line: 56, baseType: !23, size: 32, align: 32, offset: 672)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !138, file: !6, line: 57, baseType: !23, size: 32, align: 32, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "filter_last", scope: !5, file: !6, line: 103, baseType: !137, size: 64, align: 64, offset: 1984)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "format_data", scope: !5, file: !6, line: 109, baseType: !123, size: 64, align: 64, offset: 2048)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "format_name", scope: !5, file: !6, line: 110, baseType: !80, size: 64, align: 64, offset: 2112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "format_init", scope: !5, file: !6, line: 111, baseType: !166, size: 64, align: 64, offset: 2176)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!23, !4}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "format_options", scope: !5, file: !6, line: 112, baseType: !170, size: 64, align: 64, offset: 2240)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!23, !4, !80, !80}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "format_finish_entry", scope: !5, file: !6, line: 114, baseType: !166, size: 64, align: 64, offset: 2304)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "format_write_header", scope: !5, file: !6, line: 115, baseType: !175, size: 64, align: 64, offset: 2368)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!23, !4, !30}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "format_write_data", scope: !5, file: !6, line: 117, baseType: !179, size: 64, align: 64, offset: 2432)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!38, !4, !43, !45}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "format_close", scope: !5, file: !6, line: 119, baseType: !166, size: 64, align: 64, offset: 2496)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "format_free", scope: !5, file: !6, line: 120, baseType: !166, size: 64, align: 64, offset: 2560)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !5, file: !6, line: 126, baseType: !95, size: 64, align: 64, offset: 2624)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase_callback", scope: !5, file: !6, line: 127, baseType: !186, size: 64, align: 64, offset: 2688)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !32, line: 256, baseType: !188)
!188 = !DISubroutineType(types: !189)
!189 = !{!80, !24, !123}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase_client_data", scope: !5, file: !6, line: 128, baseType: !123, size: 64, align: 64, offset: 2752)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtree_writer", file: !1, line: 136, size: 2048, align: 64, elements: !193)
!193 = !{!194, !282, !283, !284, !285, !286, !287, !288, !289, !291, !302, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mtree_entry", scope: !192, file: !1, line: 137, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtree_entry", file: !1, line: 105, size: 2688, align: 64, elements: !197)
!197 = !{!198, !209, !210, !211, !246, !253, !254, !255, !256, !257, !258, !259, !260, !261, !264, !265, !266, !267, !268, !272, !273, !274, !275, !278, !279, !280, !281}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !196, file: !1, line: 106, baseType: !199, size: 192, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_rb_node", file: !200, line: 34, size: 192, align: 64, elements: !201)
!200 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_rb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!201 = !{!202, !207}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rb_nodes", scope: !199, file: !200, line: 35, baseType: !203, size: 128, align: 64)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, align: 64, elements: !205)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!205 = !{!206}
!206 = !DISubrange(count: 2)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rb_info", scope: !199, file: !200, line: 41, baseType: !208, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 122, baseType: !47)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !1, line: 107, baseType: !195, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !1, line: 108, baseType: !195, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dir_info", scope: !196, file: !1, line: 109, baseType: !212, size: 64, align: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "dir_info", file: !1, line: 72, size: 384, align: 64, elements: !214)
!214 = !{!215, !238, !244, !245}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !213, file: !1, line: 73, baseType: !216, size: 128, align: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_rb_tree", file: !200, line: 80, size: 128, align: 64, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rbt_root", scope: !216, file: !200, line: 81, baseType: !204, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rbt_ops", scope: !216, file: !200, line: 82, baseType: !220, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_rb_tree_ops", file: !200, line: 75, size: 128, align: 64, elements: !223)
!223 = !{!224, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rbto_compare_nodes", scope: !222, file: !200, line: 76, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_rbto_compare_nodes_fn", file: !200, line: 70, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!23, !230, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rbto_compare_key", scope: !222, file: !200, line: 77, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_rbto_compare_key_fn", file: !200, line: 72, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!23, !230, !43}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !213, file: !1, line: 74, baseType: !239, size: 128, align: 64, offset: 128)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtree_chain", file: !1, line: 64, size: 128, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !239, file: !1, line: 65, baseType: !195, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !239, file: !1, line: 66, baseType: !243, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "chnext", scope: !213, file: !1, line: 75, baseType: !195, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "virtual", scope: !213, file: !1, line: 76, baseType: !23, size: 32, align: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reg_info", scope: !196, file: !1, line: 110, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "reg_info", file: !1, line: 82, size: 64, align: 32, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "compute_sum", scope: !248, file: !1, line: 83, baseType: !23, size: 32, align: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !248, file: !1, line: 84, baseType: !252, size: 32, align: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 51, baseType: !13)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parentdir", scope: !196, file: !1, line: 112, baseType: !91, size: 192, align: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !196, file: !1, line: 113, baseType: !91, size: 192, align: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !196, file: !1, line: 114, baseType: !91, size: 192, align: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !196, file: !1, line: 115, baseType: !91, size: 192, align: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !196, file: !1, line: 116, baseType: !91, size: 192, align: 64, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !196, file: !1, line: 117, baseType: !91, size: 192, align: 64, offset: 1408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fflags_text", scope: !196, file: !1, line: 118, baseType: !91, size: 192, align: 64, offset: 1600)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !196, file: !1, line: 119, baseType: !13, size: 32, align: 32, offset: 1792)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !196, file: !1, line: 120, baseType: !262, size: 32, align: 32, offset: 1824)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !39, line: 70, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 129, baseType: !13)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !196, file: !1, line: 121, baseType: !262, size: 32, align: 32, offset: 1856)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !1, line: 122, baseType: !52, size: 64, align: 64, offset: 1920)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !196, file: !1, line: 123, baseType: !52, size: 64, align: 64, offset: 1984)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !196, file: !1, line: 124, baseType: !52, size: 64, align: 64, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !196, file: !1, line: 125, baseType: !269, size: 64, align: 64, offset: 2112)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !270, line: 75, baseType: !271)
!270 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 139, baseType: !42)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mtime_nsec", scope: !196, file: !1, line: 126, baseType: !42, size: 64, align: 64, offset: 2176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fflags_set", scope: !196, file: !1, line: 127, baseType: !47, size: 64, align: 64, offset: 2240)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fflags_clear", scope: !196, file: !1, line: 128, baseType: !47, size: 64, align: 64, offset: 2304)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rdevmajor", scope: !196, file: !1, line: 129, baseType: !276, size: 64, align: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !39, line: 60, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 124, baseType: !47)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rdevminor", scope: !196, file: !1, line: 130, baseType: !276, size: 64, align: 64, offset: 2432)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "devmajor", scope: !196, file: !1, line: 131, baseType: !276, size: 64, align: 64, offset: 2496)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "devminor", scope: !196, file: !1, line: 132, baseType: !276, size: 64, align: 64, offset: 2560)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !196, file: !1, line: 133, baseType: !52, size: 64, align: 64, offset: 2624)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !192, file: !1, line: 138, baseType: !195, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cur_dirent", scope: !192, file: !1, line: 139, baseType: !195, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cur_dirstr", scope: !192, file: !1, line: 140, baseType: !91, size: 192, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "file_list", scope: !192, file: !1, line: 141, baseType: !239, size: 128, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ebuf", scope: !192, file: !1, line: 143, baseType: !91, size: 192, align: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !1, line: 144, baseType: !91, size: 192, align: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !192, file: !1, line: 145, baseType: !23, size: 32, align: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "entry_bytes_remaining", scope: !192, file: !1, line: 146, baseType: !290, size: 64, align: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 55, baseType: !47)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !192, file: !1, line: 160, baseType: !292, size: 448, align: 64, offset: 1024)
!292 = !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !1, line: 151, size: 448, align: 64, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "processing", scope: !292, file: !1, line: 152, baseType: !23, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !1, line: 153, baseType: !262, size: 32, align: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !292, file: !1, line: 154, baseType: !23, size: 32, align: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !292, file: !1, line: 155, baseType: !52, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !292, file: !1, line: 156, baseType: !52, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !292, file: !1, line: 157, baseType: !262, size: 32, align: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "fflags_set", scope: !292, file: !1, line: 158, baseType: !47, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fflags_clear", scope: !292, file: !1, line: 159, baseType: !47, size: 64, align: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "acs", scope: !192, file: !1, line: 161, baseType: !303, size: 256, align: 64, offset: 1472)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "att_counter_set", file: !1, line: 57, size: 256, align: 64, elements: !304)
!304 = !{!305, !313, !314, !315}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "uid_list", scope: !303, file: !1, line: 58, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "attr_counter", file: !1, line: 50, size: 256, align: 64, elements: !308)
!308 = !{!309, !310, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !1, line: 51, baseType: !306, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !1, line: 52, baseType: !306, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "m_entry", scope: !307, file: !1, line: 53, baseType: !195, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !307, file: !1, line: 54, baseType: !23, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "gid_list", scope: !303, file: !1, line: 59, baseType: !306, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mode_list", scope: !303, file: !1, line: 60, baseType: !306, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags_list", scope: !303, file: !1, line: 61, baseType: !306, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "classic", scope: !192, file: !1, line: 162, baseType: !23, size: 32, align: 32, offset: 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !192, file: !1, line: 163, baseType: !23, size: 32, align: 32, offset: 1760)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "compute_sum", scope: !192, file: !1, line: 166, baseType: !23, size: 32, align: 32, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !192, file: !1, line: 167, baseType: !252, size: 32, align: 32, offset: 1824)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "crc_len", scope: !192, file: !1, line: 168, baseType: !290, size: 64, align: 64, offset: 1856)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !192, file: !1, line: 188, baseType: !23, size: 32, align: 32, offset: 1920)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dironly", scope: !192, file: !1, line: 221, baseType: !23, size: 32, align: 32, offset: 1952)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !192, file: !1, line: 223, baseType: !23, size: 32, align: 32, offset: 1984)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "output_global_set", scope: !192, file: !1, line: 224, baseType: !23, size: 32, align: 32, offset: 2016)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !53, line: 134, baseType: !42)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !53, line: 135, baseType: !47)
!329 = !{!330, !331, !332, !335, !338, !339, !340, !343, !344, !348, !349, !350, !353, !354, !355, !358, !361, !364, !367, !370, !373, !376, !377, !378, !379, !382, !385, !388, !391, !395, !396, !399, !400, !401, !404, !405, !406, !409, !410}
!330 = distinct !DISubprogram(name: "archive_write_set_format_mtree", scope: !1, file: !1, line: 1432, type: !21, isLocal: false, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!331 = distinct !DISubprogram(name: "archive_write_set_format_mtree_classic", scope: !1, file: !1, line: 1439, type: !21, isLocal: false, isDefinition: true, scopeLine: 1440, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!332 = distinct !DISubprogram(name: "archive_write_set_format_mtree_default", scope: !1, file: !1, line: 1392, type: !333, isLocal: true, isDefinition: true, scopeLine: 1393, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!333 = !DISubroutineType(types: !334)
!334 = !{!23, !24, !80}
!335 = distinct !DISubprogram(name: "mtree_entry_register_init", scope: !1, file: !1, line: 1930, type: !336, isLocal: true, isDefinition: true, scopeLine: 1931, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !191}
!338 = distinct !DISubprogram(name: "archive_write_mtree_free", scope: !1, file: !1, line: 1261, type: !167, isLocal: true, isDefinition: true, scopeLine: 1262, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!339 = distinct !DISubprogram(name: "mtree_entry_register_free", scope: !1, file: !1, line: 1937, type: !336, isLocal: true, isDefinition: true, scopeLine: 1938, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!340 = distinct !DISubprogram(name: "mtree_entry_free", scope: !1, file: !1, line: 868, type: !341, isLocal: true, isDefinition: true, scopeLine: 869, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !195}
!343 = distinct !DISubprogram(name: "attr_counter_set_free", scope: !1, file: !1, line: 732, type: !336, isLocal: true, isDefinition: true, scopeLine: 733, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!344 = distinct !DISubprogram(name: "attr_counter_free", scope: !1, file: !1, line: 598, type: !345, isLocal: true, isDefinition: true, scopeLine: 599, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!348 = distinct !DISubprogram(name: "archive_write_mtree_options", scope: !1, file: !1, line: 1280, type: !171, isLocal: true, isDefinition: true, scopeLine: 1282, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!349 = distinct !DISubprogram(name: "archive_write_mtree_header", scope: !1, file: !1, line: 883, type: !176, isLocal: true, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!350 = distinct !DISubprogram(name: "mtree_entry_new", scope: !1, file: !1, line: 791, type: !351, isLocal: true, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!351 = !DISubroutineType(types: !352)
!352 = !{!23, !4, !30, !243}
!353 = distinct !DISubprogram(name: "mtree_entry_cmp_node", scope: !1, file: !1, line: 1663, type: !228, isLocal: true, isDefinition: true, scopeLine: 1665, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
