; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_disk_entry_from_file.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_entry = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !187)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_disk_entry_from_file.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !130, !150, !152, !154, !23, !186}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_disk", file: !6, line: 39, size: 2432, align: 64, elements: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_disk_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!7 = !{!8, !110, !111, !112, !113, !116, !120, !124, !125, !126, !131, !135, !136, !137, !138, !139, !143, !144, !145, !149}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !5, file: !6, line: 40, baseType: !9, size: 1280, align: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !10, line: 89, size: 1280, align: 64, elements: !11)
!10 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!11 = !{!12, !14, !15, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !104, !105, !106, !107, !108, !109}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !9, file: !10, line: 96, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !9, file: !10, line: 97, baseType: !13, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !9, file: !10, line: 103, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !10, line: 63, size: 832, align: 64, elements: !18)
!18 = !{!19, !25, !26, !33, !34, !48, !54, !59, !60, !67, !68, !72, !76}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !17, file: !10, line: 64, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !24}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !17, file: !10, line: 65, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !17, file: !10, line: 66, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!23, !24, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !32, line: 180, flags: DIFlagFwdDecl)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !17, file: !10, line: 68, baseType: !20, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !17, file: !10, line: 69, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !24, !43, !45}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !39, line: 109, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !41, line: 172, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 62, baseType: !47)
!46 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !17, file: !10, line: 71, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!38, !24, !43, !45, !52}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !53, line: 40, baseType: !42)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !17, file: !10, line: 74, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!23, !24, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !17, file: !10, line: 76, baseType: !27, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !17, file: !10, line: 78, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!23, !24, !64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !17, file: !10, line: 81, baseType: !20, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !17, file: !10, line: 82, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!52, !24, !23}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !17, file: !10, line: 83, baseType: !73, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!23, !24, !23}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !17, file: !10, line: 84, baseType: !77, size: 64, align: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !24, !23}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !9, file: !10, line: 105, baseType: !23, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !9, file: !10, line: 106, baseType: !80, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !9, file: !10, line: 108, baseType: !23, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !9, file: !10, line: 109, baseType: !80, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !9, file: !10, line: 112, baseType: !23, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !9, file: !10, line: 114, baseType: !23, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 115, baseType: !80, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !9, file: !10, line: 116, baseType: !91, size: 192, align: 64, offset: 512)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !92, line: 58, size: 192, align: 64, elements: !93)
!92 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !{!94, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !92, line: 59, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !92, line: 60, baseType: !45, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !91, file: !92, line: 61, baseType: !45, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !9, file: !10, line: 118, baseType: !95, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !9, file: !10, line: 119, baseType: !13, size: 32, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !9, file: !10, line: 120, baseType: !13, size: 32, align: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !9, file: !10, line: 121, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !92, line: 70, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !9, file: !10, line: 127, baseType: !80, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !9, file: !10, line: 128, baseType: !52, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !9, file: !10, line: 129, baseType: !52, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !9, file: !10, line: 130, baseType: !45, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !9, file: !10, line: 137, baseType: !82, size: 8, align: 8, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !9, file: !10, line: 138, baseType: !45, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !5, file: !6, line: 43, baseType: !30, size: 64, align: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "symlink_mode", scope: !5, file: !6, line: 51, baseType: !82, size: 8, align: 8, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "follow_symlinks", scope: !5, file: !6, line: 58, baseType: !82, size: 8, align: 8, offset: 1352)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !5, file: !6, line: 61, baseType: !114, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "tree", file: !6, line: 36, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "open_on_current_dir", scope: !5, file: !6, line: 62, baseType: !117, size: 64, align: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!23, !114, !80, !23}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tree_current_dir_fd", scope: !5, file: !6, line: 63, baseType: !121, size: 64, align: 64, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!23, !114}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tree_enter_working_dir", scope: !5, file: !6, line: 64, baseType: !121, size: 64, align: 64, offset: 1600)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !6, line: 67, baseType: !23, size: 32, align: 32, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_gname", scope: !5, file: !6, line: 69, baseType: !127, size: 64, align: 64, offset: 1728)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!80, !130, !52}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_gname", scope: !5, file: !6, line: 70, baseType: !132, size: 64, align: 64, offset: 1792)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !130}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_gname_data", scope: !5, file: !6, line: 71, baseType: !130, size: 64, align: 64, offset: 1856)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_uname", scope: !5, file: !6, line: 72, baseType: !127, size: 64, align: 64, offset: 1920)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_uname", scope: !5, file: !6, line: 73, baseType: !132, size: 64, align: 64, offset: 1984)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_uname_data", scope: !5, file: !6, line: 74, baseType: !130, size: 64, align: 64, offset: 2048)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_filter_func", scope: !5, file: !6, line: 76, baseType: !140, size: 64, align: 64, offset: 2112)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!23, !24, !130, !30}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_filter_data", scope: !5, file: !6, line: 78, baseType: !130, size: 64, align: 64, offset: 2176)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "matching", scope: !5, file: !6, line: 81, baseType: !24, size: 64, align: 64, offset: 2240)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_cb_func", scope: !5, file: !6, line: 84, baseType: !146, size: 64, align: 64, offset: 2304)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !24, !130, !30}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "excluded_cb_data", scope: !5, file: !6, line: 86, baseType: !130, size: 64, align: 64, offset: 2368)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !39, line: 70, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 129, baseType: !13)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !39, line: 86, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 131, baseType: !42)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !156, line: 27, size: 256, align: 64, elements: !157)
!156 = !DIFile(filename: "/usr/include/linux/fiemap.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!157 = !{!158, !162, !163, !165, !166, !167, !168}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !155, file: !156, line: 28, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !160, line: 30, baseType: !161)
!160 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!161 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !155, file: !156, line: 30, baseType: !159, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !155, file: !156, line: 32, baseType: !164, size: 32, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !160, line: 26, baseType: !13)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !155, file: !156, line: 33, baseType: !164, size: 32, align: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !155, file: !156, line: 34, baseType: !164, size: 32, align: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !155, file: !156, line: 35, baseType: !164, size: 32, align: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !155, file: !156, line: 36, baseType: !169, align: 64, offset: 256)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, align: 64, elements: !184)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !156, line: 16, size: 448, align: 64, elements: !171)
!171 = !{!172, !173, !174, !175, !179, !180}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !170, file: !156, line: 17, baseType: !159, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !170, file: !156, line: 19, baseType: !159, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !170, file: !156, line: 21, baseType: !159, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !170, file: !156, line: 22, baseType: !176, size: 128, align: 64, offset: 192)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 128, align: 64, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 2)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !170, file: !156, line: 23, baseType: !164, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !170, file: !156, line: 24, baseType: !181, size: 96, align: 32, offset: 352)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 96, align: 32, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 3)
!184 = !{!185}
!185 = !DISubrange(count: 0)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 55, baseType: !47)
!187 = !{!188, !226, !230, !231, !232, !233}
!188 = distinct !DISubprogram(name: "archive_read_disk_entry_from_file", scope: !1, file: !1, line: 149, type: !189, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!189 = !DISubroutineType(types: !190)
!190 = !{!23, !24, !30, !23, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !194, line: 46, size: 1152, align: 64, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!195 = !{!196, !198, !200, !202, !203, !205, !207, !208, !209, !210, !212, !214, !222, !223, !224}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !193, file: !194, line: 48, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 124, baseType: !47)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !193, file: !194, line: 53, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !41, line: 127, baseType: !47)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !193, file: !194, line: 61, baseType: !201, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !41, line: 130, baseType: !47)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !193, file: !194, line: 62, baseType: !151, size: 32, align: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !193, file: !194, line: 64, baseType: !204, size: 32, align: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 125, baseType: !13)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !193, file: !194, line: 65, baseType: !206, size: 32, align: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 126, baseType: !13)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !193, file: !194, line: 67, baseType: !23, size: 32, align: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !193, file: !194, line: 69, baseType: !197, size: 64, align: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !193, file: !194, line: 74, baseType: !153, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !193, file: !194, line: 78, baseType: !211, size: 64, align: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !41, line: 153, baseType: !42)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !193, file: !194, line: 80, baseType: !213, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !41, line: 158, baseType: !42)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !193, file: !194, line: 91, baseType: !215, size: 128, align: 64, offset: 576)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !216, line: 120, size: 128, align: 64, elements: !217)
!216 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!217 = !{!218, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !215, file: !216, line: 122, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 139, baseType: !42)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !215, file: !216, line: 123, baseType: !221, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !41, line: 175, baseType: !42)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !193, file: !194, line: 92, baseType: !215, size: 128, align: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !193, file: !194, line: 93, baseType: !215, size: 128, align: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !193, file: !194, line: 106, baseType: !225, size: 192, align: 64, offset: 960)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 192, align: 64, elements: !182)
!226 = distinct !DISubprogram(name: "setup_mac_metadata", scope: !1, file: !1, line: 419, type: !227, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!227 = !DISubroutineType(types: !228)
!228 = !{!23, !4, !30, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!230 = distinct !DISubprogram(name: "setup_acls", scope: !1, file: !1, line: 1403, type: !227, isLocal: true, isDefinition: true, scopeLine: 1405, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!231 = distinct !DISubprogram(name: "setup_xattrs", scope: !1, file: !1, line: 1738, type: !227, isLocal: true, isDefinition: true, scopeLine: 1740, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!232 = distinct !DISubprogram(name: "setup_sparse", scope: !1, file: !1, line: 1875, type: !227, isLocal: true, isDefinition: true, scopeLine: 1877, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!233 = distinct !DISubprogram(name: "setup_sparse_fiemap", scope: !1, file: !1, line: 1767, type: !227, isLocal: true, isDefinition: true, scopeLine: 1769, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!234 = !{i32 2, !"Dwarf Version", i32 4}
!235 = !{i32 2, !"Debug Info Version", i32 3}
!236 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!237 = !DILocalVariable(name: "_a", arg: 1, scope: !188, file: !1, line: 149, type: !24)
!238 = !DIExpression()
!239 = !DILocation(line: 149, column: 51, scope: !188)
!240 = !DILocalVariable(name: "entry", arg: 2, scope: !188, file: !1, line: 150, type: !30)
!241 = !DILocation(line: 150, column: 27, scope: !188)
!242 = !DILocalVariable(name: "fd", arg: 3, scope: !188, file: !1, line: 151, type: !23)
!243 = !DILocation(line: 151, column: 9, scope: !188)
!244 = !DILocalVariable(name: "st", arg: 4, scope: !188, file: !1, line: 152, type: !191)
!245 = !DILocation(line: 152, column: 24, scope: !188)
!246 = !DILocalVariable(name: "a", scope: !188, file: !1, line: 154, type: !4)
!247 = !DILocation(line: 154, column: 28, scope: !188)
!248 = !DILocation(line: 154, column: 60, scope: !188)
!249 = !DILocation(line: 154, column: 32, scope: !188)
!250 = !DILocalVariable(name: "path", scope: !188, file: !1, line: 155, type: !80)
!251 = !DILocation(line: 155, column: 14, scope: !188)
!252 = !DILocalVariable(name: "name", scope: !188, file: !1, line: 155, type: !80)
!253 = !DILocation(line: 155, column: 21, scope: !188)
!254 = !DILocalVariable(name: "s", scope: !188, file: !1, line: 156, type: !193)
!255 = !DILocation(line: 156, column: 14, scope: !188)
!256 = !DILocalVariable(name: "initial_fd", scope: !188, file: !1, line: 157, type: !23)
!257 = !DILocation(line: 157, column: 6, scope: !188)
!258 = !DILocation(line: 157, column: 19, scope: !188)
!259 = !DILocalVariable(name: "r", scope: !188, file: !1, line: 158, type: !23)
!260 = !DILocation(line: 158, column: 6, scope: !188)
!261 = !DILocalVariable(name: "r1", scope: !188, file: !1, line: 158, type: !23)
!262 = !DILocation(line: 158, column: 9, scope: !188)
!263 = !DILocation(line: 160, column: 22, scope: !188)
!264 = !DILocation(line: 160, column: 2, scope: !188)
!265 = !DILocation(line: 161, column: 34, scope: !188)
!266 = !DILocation(line: 161, column: 9, scope: !188)
!267 = !DILocation(line: 161, column: 7, scope: !188)
!268 = !DILocation(line: 162, column: 6, scope: !269)
!269 = distinct !DILexicalBlock(scope: !188, file: !1, line: 162, column: 6)
!270 = !DILocation(line: 162, column: 11, scope: !269)
!271 = !DILocation(line: 162, column: 6, scope: !188)
!272 = !DILocation(line: 163, column: 33, scope: !269)
!273 = !DILocation(line: 163, column: 10, scope: !269)
!274 = !DILocation(line: 163, column: 8, scope: !269)
