; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_open_filename.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.write_file_data = type { i32, %struct.archive_mstring }
%struct.archive_mstring = type { %struct.archive_string, %struct.archive_string, %struct.archive_wstring, %struct.archive_string, i32 }
%struct.archive_wstring = type { i32*, i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !40)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_open_filename.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5, !36, !38}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "write_file_data", file: !1, line: 59, size: 896, align: 64, elements: !7)
!7 = !{!8, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !6, file: !1, line: 60, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !6, file: !1, line: 61, baseType: !11, size: 832, align: 64, offset: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_mstring", file: !12, line: 209, size: 832, align: 64, elements: !13)
!12 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!13 = !{!14, !25, !26, !34, !35}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs", scope: !11, file: !12, line: 210, baseType: !15, size: 192, align: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !12, line: 58, size: 192, align: 64, elements: !16)
!16 = !{!17, !20, !24}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !15, file: !12, line: 59, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !15, file: !12, line: 60, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 62, baseType: !23)
!22 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!23 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !15, file: !12, line: 61, baseType: !21, size: 64, align: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "aes_utf8", scope: !11, file: !12, line: 211, baseType: !15, size: 192, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "aes_wcs", scope: !11, file: !12, line: 212, baseType: !27, size: 192, align: 64, offset: 384)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_wstring", file: !12, line: 64, size: 192, align: 64, elements: !28)
!28 = !{!29, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !27, file: !12, line: 65, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !22, line: 90, baseType: !9)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !27, file: !12, line: 66, baseType: !21, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !27, file: !12, line: 67, baseType: !21, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs_in_locale", scope: !11, file: !12, line: 213, baseType: !15, size: 192, align: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "aes_set", scope: !11, file: !12, line: 218, baseType: !9, size: 32, align: 32, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!40 = !{!41, !131, !132, !135, !138, !141, !144}
!41 = distinct !DISubprogram(name: "archive_write_open_file", scope: !1, file: !1, line: 70, type: !42, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{!9, !44, !36}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !46, line: 89, size: 1280, align: 64, elements: !47)
!46 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !{!48, !50, !51, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !125, !126, !127, !128, !129, !130}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !45, file: !46, line: 96, baseType: !49, size: 32, align: 32)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !45, file: !46, line: 97, baseType: !49, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !45, file: !46, line: 103, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !46, line: 63, size: 832, align: 64, elements: !54)
!54 = !{!55, !59, !60, !67, !68, !79, !85, !90, !91, !98, !99, !103, !107}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !53, file: !46, line: 64, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!9, !44}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !53, file: !46, line: 65, baseType: !56, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !53, file: !46, line: 66, baseType: !61, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!9, !44, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !66, line: 180, flags: DIFlagFwdDecl)
!66 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !53, file: !46, line: 68, baseType: !56, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !53, file: !46, line: 69, baseType: !69, size: 64, align: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !44, !77, !21}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !73, line: 109, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !75, line: 172, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!76 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !53, file: !46, line: 71, baseType: !80, size: 64, align: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!72, !44, !77, !21, !83}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !84, line: 40, baseType: !76)
!84 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !53, file: !46, line: 74, baseType: !86, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!9, !44, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !53, file: !46, line: 76, baseType: !61, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !53, file: !46, line: 78, baseType: !92, size: 64, align: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!9, !44, !95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !53, file: !46, line: 81, baseType: !56, size: 64, align: 64, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !53, file: !46, line: 82, baseType: !100, size: 64, align: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!83, !44, !9}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !53, file: !46, line: 83, baseType: !104, size: 64, align: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!9, !44, !9}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !53, file: !46, line: 84, baseType: !108, size: 64, align: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!36, !44, !9}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !45, file: !46, line: 105, baseType: !9, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !45, file: !46, line: 106, baseType: !36, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !45, file: !46, line: 108, baseType: !9, size: 32, align: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !45, file: !46, line: 109, baseType: !36, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !45, file: !46, line: 112, baseType: !9, size: 32, align: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !45, file: !46, line: 114, baseType: !9, size: 32, align: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !45, file: !46, line: 115, baseType: !36, size: 64, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !45, file: !46, line: 116, baseType: !15, size: 192, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !45, file: !46, line: 118, baseType: !18, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !45, file: !46, line: 119, baseType: !49, size: 32, align: 32, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !45, file: !46, line: 120, baseType: !49, size: 32, align: 32, offset: 800)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !45, file: !46, line: 121, baseType: !123, size: 64, align: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !12, line: 70, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !45, file: !46, line: 127, baseType: !36, size: 64, align: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !45, file: !46, line: 128, baseType: !83, size: 64, align: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !45, file: !46, line: 129, baseType: !83, size: 64, align: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !45, file: !46, line: 130, baseType: !21, size: 64, align: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !45, file: !46, line: 137, baseType: !19, size: 8, align: 8, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !45, file: !46, line: 138, baseType: !21, size: 64, align: 64, offset: 1216)
!131 = distinct !DISubprogram(name: "archive_write_open_filename", scope: !1, file: !1, line: 76, type: !42, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!132 = distinct !DISubprogram(name: "archive_write_open_filename_w", scope: !1, file: !1, line: 86, type: !133, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!133 = !DISubroutineType(types: !134)
!134 = !{!9, !44, !38}
!135 = distinct !DISubprogram(name: "open_filename", scope: !1, file: !1, line: 96, type: !136, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!136 = !DISubroutineType(types: !137)
!137 = !{!9, !44, !9, !77}
!138 = distinct !DISubprogram(name: "file_open", scope: !1, file: !1, line: 131, type: !139, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!139 = !DISubroutineType(types: !140)
!140 = !{!9, !44, !4}
!141 = distinct !DISubprogram(name: "file_write", scope: !1, file: !1, line: 221, type: !142, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!142 = !DISubroutineType(types: !143)
!143 = !{!72, !44, !4, !77, !21}
!144 = distinct !DISubprogram(name: "file_close", scope: !1, file: !1, line: 241, type: !139, isLocal: true, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!148 = !DILocalVariable(name: "a", arg: 1, scope: !41, file: !1, line: 70, type: !44)
!149 = !DIExpression()
!150 = !DILocation(line: 70, column: 41, scope: !41)
!151 = !DILocalVariable(name: "filename", arg: 2, scope: !41, file: !1, line: 70, type: !36)
!152 = !DILocation(line: 70, column: 56, scope: !41)
!153 = !DILocation(line: 72, column: 38, scope: !41)
!154 = !DILocation(line: 72, column: 41, scope: !41)
!155 = !DILocation(line: 72, column: 10, scope: !41)
!156 = !DILocation(line: 72, column: 2, scope: !41)
!157 = !DILocalVariable(name: "a", arg: 1, scope: !131, file: !1, line: 76, type: !44)
!158 = !DILocation(line: 76, column: 45, scope: !131)
!159 = !DILocalVariable(name: "filename", arg: 2, scope: !131, file: !1, line: 76, type: !36)
!160 = !DILocation(line: 76, column: 60, scope: !131)
!161 = !DILocation(line: 79, column: 6, scope: !162)
!162 = distinct !DILexicalBlock(scope: !131, file: !1, line: 79, column: 6)
!163 = !DILocation(line: 79, column: 15, scope: !162)
!164 = !DILocation(line: 79, column: 23, scope: !162)
!165 = !DILocation(line: 79, column: 26, scope: !166)
!166 = !DILexicalBlockFile(scope: !162, file: !1, discriminator: 1)
!167 = !DILocation(line: 79, column: 38, scope: !166)
!168 = !DILocation(line: 79, column: 6, scope: !166)
!169 = !DILocation(line: 80, column: 33, scope: !162)
!170 = !DILocation(line: 80, column: 11, scope: !162)
!171 = !DILocation(line: 80, column: 3, scope: !162)
!172 = !DILocation(line: 82, column: 24, scope: !131)
!173 = !DILocation(line: 82, column: 30, scope: !131)
!174 = !DILocation(line: 82, column: 10, scope: !131)
!175 = !DILocation(line: 82, column: 2, scope: !131)
!176 = !DILocation(line: 83, column: 1, scope: !131)
!177 = !DILocalVariable(name: "a", arg: 1, scope: !135, file: !1, line: 96, type: !44)
!178 = !DILocation(line: 96, column: 31, scope: !135)
!179 = !DILocalVariable(name: "mbs_fn", arg: 2, scope: !135, file: !1, line: 96, type: !9)
!180 = !DILocation(line: 96, column: 38, scope: !135)
!181 = !DILocalVariable(name: "filename", arg: 3, scope: !135, file: !1, line: 96, type: !77)
!182 = !DILocation(line: 96, column: 58, scope: !135)
!183 = !DILocalVariable(name: "mine", scope: !135, file: !1, line: 98, type: !5)
!184 = !DILocation(line: 98, column: 26, scope: !135)
!185 = !DILocalVariable(name: "r", scope: !135, file: !1, line: 99, type: !9)
!186 = !DILocation(line: 99, column: 6, scope: !135)
!187 = !DILocation(line: 101, column: 35, scope: !135)
!188 = !DILocation(line: 101, column: 9, scope: !135)
!189 = !DILocation(line: 101, column: 7, scope: !135)
!190 = !DILocation(line: 102, column: 6, scope: !191)
!191 = distinct !DILexicalBlock(scope: !135, file: !1, line: 102, column: 6)
!192 = !DILocation(line: 102, column: 11, scope: !191)
!193 = !DILocation(line: 102, column: 6, scope: !135)
!194 = !DILocation(line: 103, column: 21, scope: !195)
!195 = distinct !DILexicalBlock(scope: !191, file: !1, line: 102, column: 20)
!196 = !DILocation(line: 103, column: 3, scope: !195)
!197 = !DILocation(line: 104, column: 3, scope: !195)
!198 = !DILocation(line: 106, column: 6, scope: !199)
!199 = distinct !DILexicalBlock(scope: !135, file: !1, line: 106, column: 6)
!200 = !DILocation(line: 106, column: 6, scope: !135)
!201 = !DILocation(line: 107, column: 33, scope: !199)
!202 = !DILocation(line: 107, column: 39, scope: !199)
!203 = !DILocation(line: 107, column: 49, scope: !199)
!204 = !DILocation(line: 107, column: 7, scope: !199)
!205 = !DILocation(line: 107, column: 5, scope: !199)
!206 = !DILocation(line: 107, column: 3, scope: !199)
!207 = !DILocation(line: 109, column: 33, scope: !199)
!208 = !DILocation(line: 109, column: 39, scope: !199)
!209 = !DILocation(line: 109, column: 49, scope: !199)
!210 = !DILocation(line: 109, column: 7, scope: !199)
!211 = !DILocation(line: 109, column: 5, scope: !199)
!212 = !DILocation(line: 110, column: 6, scope: !213)
!213 = distinct !DILexicalBlock(scope: !135, file: !1, line: 110, column: 6)
!214 = !DILocation(line: 110, column: 8, scope: !213)
!215 = !DILocation(line: 110, column: 6, scope: !135)
!216 = !DILocation(line: 111, column: 7, scope: !217)
!217 = distinct !DILexicalBlock(scope: !218, file: !1, line: 111, column: 7)
!218 = distinct !DILexicalBlock(scope: !213, file: !1, line: 110, column: 13)
!219 = !DILocation(line: 111, column: 13, scope: !217)
!220 = !DILocation(line: 111, column: 7, scope: !218)
!221 = !DILocation(line: 112, column: 22, scope: !222)
!222 = distinct !DILexicalBlock(scope: !217, file: !1, line: 111, column: 24)
!223 = !DILocation(line: 112, column: 4, scope: !222)
!224 = !DILocation(line: 113, column: 4, scope: !222)
!225 = !DILocation(line: 115, column: 7, scope: !226)
!226 = distinct !DILexicalBlock(scope: !218, file: !1, line: 115, column: 7)
!227 = !DILocation(line: 115, column: 7, scope: !218)
!228 = !DILocation(line: 116, column: 22, scope: !226)
!229 = !DILocation(line: 118, column: 22, scope: !226)
!230 = !DILocation(line: 116, column: 4, scope: !226)
!231 = !DILocation(line: 120, column: 22, scope: !226)
!232 = !DILocation(line: 122, column: 25, scope: !226)
!233 = !DILocation(line: 122, column: 8, scope: !226)
!234 = !DILocation(line: 120, column: 4, scope: !226)
!235 = !DILocation(line: 123, column: 3, scope: !218)
!236 = !DILocation(line: 125, column: 2, scope: !135)
!237 = !DILocation(line: 125, column: 8, scope: !135)
!238 = !DILocation(line: 125, column: 11, scope: !135)
!239 = !DILocation(line: 126, column: 29, scope: !135)
!240 = !DILocation(line: 126, column: 32, scope: !135)
!241 = !DILocation(line: 126, column: 10, scope: !135)
!242 = !DILocation(line: 126, column: 2, scope: !135)
!243 = !DILocation(line: 128, column: 1, scope: !135)
!244 = !DILocalVariable(name: "a", arg: 1, scope: !132, file: !1, line: 86, type: !44)
!245 = !DILocation(line: 86, column: 47, scope: !132)
!246 = !DILocalVariable(name: "filename", arg: 2, scope: !132, file: !1, line: 86, type: !38)
!247 = !DILocation(line: 86, column: 65, scope: !132)
!248 = !DILocation(line: 89, column: 6, scope: !249)
!249 = distinct !DILexicalBlock(scope: !132, file: !1, line: 89, column: 6)
!250 = !DILocation(line: 89, column: 15, scope: !249)
!251 = !DILocation(line: 89, column: 23, scope: !249)
!252 = !DILocation(line: 89, column: 26, scope: !253)
!253 = !DILexicalBlockFile(scope: !249, file: !1, discriminator: 1)
!254 = !DILocation(line: 89, column: 38, scope: !253)
!255 = !DILocation(line: 89, column: 6, scope: !253)
!256 = !DILocation(line: 90, column: 33, scope: !249)
!257 = !DILocation(line: 90, column: 11, scope: !249)
!258 = !DILocation(line: 90, column: 3, scope: !249)
!259 = !DILocation(line: 92, column: 24, scope: !132)
!260 = !DILocation(line: 92, column: 30, scope: !132)
!261 = !DILocation(line: 92, column: 10, scope: !132)
!262 = !DILocation(line: 92, column: 2, scope: !132)
!263 = !DILocation(line: 93, column: 1, scope: !132)
!264 = !DILocalVariable(name: "a", arg: 1, scope: !138, file: !1, line: 131, type: !44)
!265 = !DILocation(line: 131, column: 27, scope: !138)
!266 = !DILocalVariable(name: "client_data", arg: 2, scope: !138, file: !1, line: 131, type: !4)
!267 = !DILocation(line: 131, column: 36, scope: !138)
!268 = !DILocalVariable(name: "flags", scope: !138, file: !1, line: 133, type: !9)
!269 = !DILocation(line: 133, column: 6, scope: !138)
!270 = !DILocalVariable(name: "mine", scope: !138, file: !1, line: 134, type: !5)
!271 = !DILocation(line: 134, column: 26, scope: !138)
!272 = !DILocalVariable(name: "st", scope: !138, file: !1, line: 135, type: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !274, line: 46, size: 1152, align: 64, elements: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!275 = !{!276, !278, !280, !282, !284, !286, !288, !289, !290, !292, !294, !296, !304, !305, !306}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !273, file: !274, line: 48, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !75, line: 124, baseType: !23)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !273, file: !274, line: 53, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !75, line: 127, baseType: !23)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !273, file: !274, line: 61, baseType: !281, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !75, line: 130, baseType: !23)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !273, file: !274, line: 62, baseType: !283, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !75, line: 129, baseType: !49)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !273, file: !274, line: 64, baseType: !285, size: 32, align: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !75, line: 125, baseType: !49)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !273, file: !274, line: 65, baseType: !287, size: 32, align: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !75, line: 126, baseType: !49)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !273, file: !274, line: 67, baseType: !9, size: 32, align: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !273, file: !274, line: 69, baseType: !277, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !273, file: !274, line: 74, baseType: !291, size: 64, align: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 131, baseType: !76)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !273, file: !274, line: 78, baseType: !293, size: 64, align: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !75, line: 153, baseType: !76)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !273, file: !274, line: 80, baseType: !295, size: 64, align: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !75, line: 158, baseType: !76)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !273, file: !274, line: 91, baseType: !297, size: 128, align: 64, offset: 576)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !298, line: 120, size: 128, align: 64, elements: !299)
!298 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !297, file: !298, line: 122, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !75, line: 139, baseType: !76)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !297, file: !298, line: 123, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !75, line: 175, baseType: !76)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !273, file: !274, line: 92, baseType: !297, size: 128, align: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !273, file: !274, line: 93, baseType: !297, size: 128, align: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !273, file: !274, line: 106, baseType: !307, size: 192, align: 64, offset: 960)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 192, align: 64, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 3)
!310 = !DILocation(line: 135, column: 14, scope: !138)
!311 = !DILocalVariable(name: "wcs", scope: !138, file: !1, line: 139, type: !38)
!312 = !DILocation(line: 139, column: 17, scope: !138)
!313 = !DILocalVariable(name: "mbs", scope: !138, file: !1, line: 140, type: !36)
!314 = !DILocation(line: 140, column: 14, scope: !138)
!315 = !DILocation(line: 142, column: 35, scope: !138)
!316 = !DILocation(line: 142, column: 9, scope: !138)
!317 = !DILocation(line: 142, column: 7, scope: !138)
!318 = !DILocation(line: 143, column: 8, scope: !138)
!319 = !DILocation(line: 148, column: 6, scope: !138)
!320 = !DILocation(line: 148, column: 18, scope: !138)
!321 = !DILocation(line: 167, column: 30, scope: !322)
!322 = distinct !DILexicalBlock(scope: !138, file: !1, line: 167, column: 6)
!323 = !DILocation(line: 167, column: 34, scope: !322)
!324 = !DILocation(line: 167, column: 40, scope: !322)
!325 = !DILocation(line: 167, column: 6, scope: !322)
!326 = !DILocation(line: 167, column: 56, scope: !322)
!327 = !DILocation(line: 167, column: 6, scope: !138)
!328 = !DILocation(line: 168, column: 7, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !1, line: 168, column: 7)
!330 = distinct !DILexicalBlock(scope: !322, file: !1, line: 167, column: 62)
!331 = !DILocation(line: 168, column: 13, scope: !329)
!332 = !DILocation(line: 168, column: 7, scope: !330)
!333 = !DILocation(line: 169, column: 22, scope: !329)
!334 = !DILocation(line: 169, column: 25, scope: !329)
!335 = !DILocation(line: 169, column: 4, scope: !336)
!336 = !DILexicalBlockFile(scope: !329, file: !1, discriminator: 1)
!337 = !DILocation(line: 169, column: 4, scope: !329)
!338 = !DILocation(line: 171, column: 28, scope: !339)
!339 = distinct !DILexicalBlock(scope: !329, file: !1, line: 170, column: 8)
!340 = !DILocation(line: 171, column: 32, scope: !339)
!341 = !DILocation(line: 171, column: 38, scope: !339)
!342 = !DILocation(line: 171, column: 4, scope: !339)
!343 = !DILocation(line: 172, column: 22, scope: !339)
!344 = !DILocation(line: 172, column: 25, scope: !339)
!345 = !DILocation(line: 173, column: 37, scope: !339)
!346 = !DILocation(line: 172, column: 4, scope: !347)
!347 = !DILexicalBlockFile(scope: !339, file: !1, discriminator: 1)
!348 = !DILocation(line: 175, column: 3, scope: !330)
!349 = !DILocation(line: 177, column: 18, scope: !138)
!350 = !DILocation(line: 177, column: 23, scope: !138)
!351 = !DILocation(line: 177, column: 13, scope: !138)
!352 = !DILocation(line: 177, column: 2, scope: !138)
!353 = !DILocation(line: 177, column: 8, scope: !138)
!354 = !DILocation(line: 177, column: 11, scope: !138)
!355 = !DILocation(line: 178, column: 32, scope: !138)
!356 = !DILocation(line: 178, column: 38, scope: !138)
!357 = !DILocation(line: 178, column: 2, scope: !138)
!358 = !DILocation(line: 180, column: 6, scope: !359)
!359 = distinct !DILexicalBlock(scope: !138, file: !1, line: 180, column: 6)
!360 = !DILocation(line: 180, column: 12, scope: !359)
!361 = !DILocation(line: 180, column: 15, scope: !359)
!362 = !DILocation(line: 180, column: 6, scope: !138)
!363 = !DILocation(line: 181, column: 7, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !1, line: 181, column: 7)
!365 = distinct !DILexicalBlock(scope: !359, file: !1, line: 180, column: 20)
!366 = !DILocation(line: 181, column: 11, scope: !364)
!367 = !DILocation(line: 181, column: 7, scope: !365)
!368 = !DILocation(line: 182, column: 22, scope: !364)
!369 = !DILocation(line: 182, column: 25, scope: !364)
!370 = !DILocation(line: 182, column: 55, scope: !364)
!371 = !DILocation(line: 182, column: 4, scope: !372)
!372 = !DILexicalBlockFile(scope: !364, file: !1, discriminator: 1)
