; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.flag = type { i8*, i32*, i64, i64 }
%struct.archive_entry = type { %struct.archive*, i8*, i32, %struct.aest, i32, %struct.archive_mstring, i64, i64, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, %struct.archive_mstring, i8, i8*, i64, %struct.archive_acl, %struct.ae_xattr*, %struct.ae_xattr*, %struct.ae_sparse*, %struct.ae_sparse*, %struct.ae_sparse*, [12 x i8] }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !211, globals: !471)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5, !171, !210, !93}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !7, line: 73, size: 8640, align: 64, elements: !8)
!7 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!8 = !{!9, !108, !109, !110, !139, !140, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !188, !196, !197, !204, !205, !206}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !6, file: !7, line: 74, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !12, line: 89, size: 1280, align: 64, elements: !13)
!12 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!13 = !{!14, !16, !17, !81, !82, !83, !84, !85, !86, !87, !88, !96, !97, !98, !99, !102, !103, !104, !105, !106, !107}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !11, file: !12, line: 96, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !12, line: 97, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !11, file: !12, line: 103, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !12, line: 63, size: 832, align: 64, elements: !20)
!20 = !{!21, !26, !27, !31, !32, !46, !52, !57, !58, !65, !66, !70, !74}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !19, file: !12, line: 64, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !10}
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !19, file: !12, line: 65, baseType: !22, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !19, file: !12, line: 66, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!25, !10, !5}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !19, file: !12, line: 68, baseType: !22, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !19, file: !12, line: 69, baseType: !33, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !10, !41, !43}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !37, line: 109, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !39, line: 172, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!40 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 62, baseType: !45)
!44 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !19, file: !12, line: 71, baseType: !47, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!36, !10, !41, !43, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !51, line: 40, baseType: !40)
!51 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !19, file: !12, line: 74, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!25, !10, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !19, file: !12, line: 76, baseType: !28, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !19, file: !12, line: 78, baseType: !59, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!25, !10, !62, !63, !64}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !19, file: !12, line: 81, baseType: !22, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !19, file: !12, line: 82, baseType: !67, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!50, !10, !25}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !19, file: !12, line: 83, baseType: !71, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!25, !10, !25}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !19, file: !12, line: 84, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !10, !25}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !11, file: !12, line: 105, baseType: !25, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !11, file: !12, line: 106, baseType: !78, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !11, file: !12, line: 108, baseType: !25, size: 32, align: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !11, file: !12, line: 109, baseType: !78, size: 64, align: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !11, file: !12, line: 112, baseType: !25, size: 32, align: 32, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !11, file: !12, line: 114, baseType: !25, size: 32, align: 32, offset: 416)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !11, file: !12, line: 115, baseType: !78, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !11, file: !12, line: 116, baseType: !89, size: 192, align: 64, offset: 512)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !90, line: 58, size: 192, align: 64, elements: !91)
!90 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!91 = !{!92, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !89, file: !90, line: 59, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !89, file: !90, line: 60, baseType: !43, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !89, file: !90, line: 61, baseType: !43, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !11, file: !12, line: 118, baseType: !93, size: 64, align: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !11, file: !12, line: 119, baseType: !15, size: 32, align: 32, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !11, file: !12, line: 120, baseType: !15, size: 32, align: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !11, file: !12, line: 121, baseType: !100, size: 64, align: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !90, line: 70, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !11, file: !12, line: 127, baseType: !78, size: 64, align: 64, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !11, file: !12, line: 128, baseType: !50, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !11, file: !12, line: 129, baseType: !50, size: 64, align: 64, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !11, file: !12, line: 130, baseType: !43, size: 64, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !11, file: !12, line: 137, baseType: !80, size: 8, align: 8, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !11, file: !12, line: 138, baseType: !43, size: 64, align: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !6, file: !7, line: 96, baseType: !4, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "stat_valid", scope: !6, file: !7, line: 97, baseType: !25, size: 32, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ae_stat", scope: !6, file: !7, line: 129, baseType: !111, size: 1344, align: 64, offset: 192)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "aest", file: !7, line: 99, size: 1344, align: 64, elements: !112)
!112 = !{!113, !114, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !127, !128, !129, !133, !134, !135, !136, !137, !138}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "aest_atime", scope: !111, file: !7, line: 100, baseType: !50, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "aest_atime_nsec", scope: !111, file: !7, line: 101, baseType: !115, size: 32, align: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !51, line: 51, baseType: !15)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ctime", scope: !111, file: !7, line: 102, baseType: !50, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ctime_nsec", scope: !111, file: !7, line: 103, baseType: !115, size: 32, align: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "aest_mtime", scope: !111, file: !7, line: 104, baseType: !50, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "aest_mtime_nsec", scope: !111, file: !7, line: 105, baseType: !115, size: 32, align: 32, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "aest_birthtime", scope: !111, file: !7, line: 106, baseType: !50, size: 64, align: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "aest_birthtime_nsec", scope: !111, file: !7, line: 107, baseType: !115, size: 32, align: 32, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "aest_gid", scope: !111, file: !7, line: 108, baseType: !50, size: 64, align: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aest_ino", scope: !111, file: !7, line: 109, baseType: !50, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "aest_nlink", scope: !111, file: !7, line: 110, baseType: !115, size: 32, align: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "aest_size", scope: !111, file: !7, line: 111, baseType: !126, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !51, line: 55, baseType: !45)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "aest_uid", scope: !111, file: !7, line: 112, baseType: !50, size: 64, align: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "aest_dev_is_broken_down", scope: !111, file: !7, line: 121, baseType: !25, size: 32, align: 32, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aest_dev", scope: !111, file: !7, line: 122, baseType: !130, size: 64, align: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !131, line: 44, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !39, line: 124, baseType: !45)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "aest_devmajor", scope: !111, file: !7, line: 123, baseType: !130, size: 64, align: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "aest_devminor", scope: !111, file: !7, line: 124, baseType: !130, size: 64, align: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdev_is_broken_down", scope: !111, file: !7, line: 125, baseType: !25, size: 32, align: 32, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdev", scope: !111, file: !7, line: 126, baseType: !130, size: 64, align: 64, offset: 1152)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdevmajor", scope: !111, file: !7, line: 127, baseType: !130, size: 64, align: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "aest_rdevminor", scope: !111, file: !7, line: 128, baseType: !130, size: 64, align: 64, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ae_set", scope: !6, file: !7, line: 131, baseType: !25, size: 32, align: 32, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_text", scope: !6, file: !7, line: 145, baseType: !141, size: 832, align: 64, offset: 1600)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_mstring", file: !90, line: 209, size: 832, align: 64, elements: !142)
!142 = !{!143, !144, !145, !153, !154}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs", scope: !141, file: !90, line: 210, baseType: !89, size: 192, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "aes_utf8", scope: !141, file: !90, line: 211, baseType: !89, size: 192, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "aes_wcs", scope: !141, file: !90, line: 212, baseType: !146, size: 192, align: 64, offset: 384)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_wstring", file: !90, line: 64, size: 192, align: 64, elements: !147)
!147 = !{!148, !151, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !146, file: !90, line: 65, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !44, line: 90, baseType: !25)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !90, line: 66, baseType: !43, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !146, file: !90, line: 67, baseType: !43, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs_in_locale", scope: !141, file: !90, line: 213, baseType: !89, size: 192, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aes_set", scope: !141, file: !90, line: 218, baseType: !25, size: 32, align: 32, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_set", scope: !6, file: !7, line: 146, baseType: !45, size: 64, align: 64, offset: 2432)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ae_fflags_clear", scope: !6, file: !7, line: 147, baseType: !45, size: 64, align: 64, offset: 2496)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ae_gname", scope: !6, file: !7, line: 148, baseType: !141, size: 832, align: 64, offset: 2560)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ae_hardlink", scope: !6, file: !7, line: 149, baseType: !141, size: 832, align: 64, offset: 3392)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ae_pathname", scope: !6, file: !7, line: 150, baseType: !141, size: 832, align: 64, offset: 4224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ae_symlink", scope: !6, file: !7, line: 151, baseType: !141, size: 832, align: 64, offset: 5056)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ae_uname", scope: !6, file: !7, line: 152, baseType: !141, size: 832, align: 64, offset: 5888)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ae_sourcepath", scope: !6, file: !7, line: 155, baseType: !141, size: 832, align: 64, offset: 6720)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "encryption", scope: !6, file: !7, line: 160, baseType: !80, size: 8, align: 8, offset: 7552)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata", scope: !6, file: !7, line: 162, baseType: !4, size: 64, align: 64, offset: 7616)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata_size", scope: !6, file: !7, line: 163, baseType: !43, size: 64, align: 64, offset: 7680)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !6, file: !7, line: 166, baseType: !167, size: 448, align: 64, offset: 7744)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl", file: !168, line: 46, size: 448, align: 64, elements: !169)
!168 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_acl_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!169 = !{!170, !173, !183, !184, !185, !186, !187}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !167, file: !168, line: 47, baseType: !171, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !131, line: 63, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !39, line: 129, baseType: !15)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "acl_head", scope: !167, file: !168, line: 48, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl_entry", file: !168, line: 37, size: 1024, align: 64, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !168, line: 38, baseType: !174, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !168, line: 39, baseType: !25, size: 32, align: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !175, file: !168, line: 40, baseType: !25, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "permset", scope: !175, file: !168, line: 41, baseType: !25, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !175, file: !168, line: 42, baseType: !25, size: 32, align: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !168, line: 43, baseType: !141, size: 832, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "acl_p", scope: !167, file: !168, line: 49, baseType: !174, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "acl_state", scope: !167, file: !168, line: 50, baseType: !25, size: 32, align: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text_w", scope: !167, file: !168, line: 51, baseType: !149, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text", scope: !167, file: !168, line: 52, baseType: !93, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "acl_types", scope: !167, file: !168, line: 53, baseType: !25, size: 32, align: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_head", scope: !6, file: !7, line: 169, baseType: !189, size: 64, align: 64, offset: 8192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "ae_xattr", file: !7, line: 38, size: 256, align: 64, elements: !191)
!191 = !{!192, !193, !194, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !7, line: 39, baseType: !189, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !7, line: 41, baseType: !93, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !190, file: !7, line: 42, baseType: !4, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !190, file: !7, line: 43, baseType: !43, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "xattr_p", scope: !6, file: !7, line: 170, baseType: !189, size: 64, align: 64, offset: 8256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_head", scope: !6, file: !7, line: 173, baseType: !198, size: 64, align: 64, offset: 8320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "ae_sparse", file: !7, line: 46, size: 192, align: 64, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !7, line: 47, baseType: !198, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !199, file: !7, line: 49, baseType: !50, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !199, file: !7, line: 50, baseType: !50, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_tail", scope: !6, file: !7, line: 174, baseType: !198, size: 64, align: 64, offset: 8384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_p", scope: !6, file: !7, line: 175, baseType: !198, size: 64, align: 64, offset: 8448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "strmode", scope: !6, file: !7, line: 178, baseType: !207, size: 96, align: 8, offset: 8512)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 96, align: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 12)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!211 = !{!212, !215, !216, !219, !222, !225, !231, !234, !237, !238, !239, !240, !241, !242, !243, !246, !247, !248, !249, !252, !256, !259, !264, !265, !266, !271, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !316, !319, !322, !325, !328, !331, !332, !333, !336, !339, !342, !343, !344, !345, !346, !347, !348, !349, !350, !353, !354, !355, !356, !357, !358, !361, !362, !363, !364, !365, !366, !367, !368, !369, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !404, !405, !406, !409, !412, !416, !417, !420, !423, !424, !427, !428, !432, !435, !438, !441, !444, !447, !450, !453, !456, !459, !462, !465, !468}
!212 = distinct !DISubprogram(name: "archive_entry_clear", scope: !1, file: !1, line: 155, type: !213, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!213 = !DISubroutineType(types: !214)
!214 = !{!5, !5}
!215 = distinct !DISubprogram(name: "archive_entry_clone", scope: !1, file: !1, line: 176, type: !213, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!216 = distinct !DISubprogram(name: "archive_entry_free", scope: !1, file: !1, line: 235, type: !217, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !5}
!219 = distinct !DISubprogram(name: "archive_entry_new", scope: !1, file: !1, line: 242, type: !220, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!220 = !DISubroutineType(types: !221)
!221 = !{!5}
!222 = distinct !DISubprogram(name: "archive_entry_new2", scope: !1, file: !1, line: 248, type: !223, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!223 = !DISubroutineType(types: !224)
!224 = !{!5, !10}
!225 = distinct !DISubprogram(name: "archive_entry_atime", scope: !1, file: !1, line: 264, type: !226, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !5}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !229, line: 75, baseType: !230)
!229 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !39, line: 139, baseType: !40)
!231 = distinct !DISubprogram(name: "archive_entry_atime_nsec", scope: !1, file: !1, line: 270, type: !232, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!232 = !DISubroutineType(types: !233)
!233 = !{!40, !5}
!234 = distinct !DISubprogram(name: "archive_entry_atime_is_set", scope: !1, file: !1, line: 276, type: !235, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!235 = !DISubroutineType(types: !236)
!236 = !{!25, !5}
!237 = distinct !DISubprogram(name: "archive_entry_birthtime", scope: !1, file: !1, line: 282, type: !226, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!238 = distinct !DISubprogram(name: "archive_entry_birthtime_nsec", scope: !1, file: !1, line: 288, type: !232, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!239 = distinct !DISubprogram(name: "archive_entry_birthtime_is_set", scope: !1, file: !1, line: 294, type: !235, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!240 = distinct !DISubprogram(name: "archive_entry_ctime", scope: !1, file: !1, line: 300, type: !226, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!241 = distinct !DISubprogram(name: "archive_entry_ctime_is_set", scope: !1, file: !1, line: 306, type: !235, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!242 = distinct !DISubprogram(name: "archive_entry_ctime_nsec", scope: !1, file: !1, line: 312, type: !232, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!243 = distinct !DISubprogram(name: "archive_entry_dev", scope: !1, file: !1, line: 318, type: !244, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!244 = !DISubroutineType(types: !245)
!245 = !{!130, !5}
!246 = distinct !DISubprogram(name: "archive_entry_dev_is_set", scope: !1, file: !1, line: 328, type: !235, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!247 = distinct !DISubprogram(name: "archive_entry_devmajor", scope: !1, file: !1, line: 334, type: !244, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!248 = distinct !DISubprogram(name: "archive_entry_devminor", scope: !1, file: !1, line: 343, type: !244, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!249 = distinct !DISubprogram(name: "archive_entry_filetype", scope: !1, file: !1, line: 352, type: !250, isLocal: false, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!250 = !DISubroutineType(types: !251)
!251 = !{!171, !5}
!252 = distinct !DISubprogram(name: "archive_entry_fflags", scope: !1, file: !1, line: 358, type: !253, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !5, !255, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!256 = distinct !DISubprogram(name: "archive_entry_fflags_text", scope: !1, file: !1, line: 375, type: !257, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!257 = !DISubroutineType(types: !258)
!258 = !{!78, !5}
!259 = distinct !DISubprogram(name: "archive_entry_gid", scope: !1, file: !1, line: 405, type: !260, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !5}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !263, line: 73, baseType: !50)
!263 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!264 = distinct !DISubprogram(name: "archive_entry_gname", scope: !1, file: !1, line: 411, type: !257, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!265 = distinct !DISubprogram(name: "archive_entry_gname_utf8", scope: !1, file: !1, line: 422, type: !257, isLocal: false, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!266 = distinct !DISubprogram(name: "archive_entry_gname_w", scope: !1, file: !1, line: 434, type: !267, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !5}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!271 = distinct !DISubprogram(name: "_archive_entry_gname_l", scope: !1, file: !1, line: 445, type: !272, isLocal: false, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!272 = !DISubroutineType(types: !273)
!273 = !{!25, !5, !274, !63, !100}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!275 = distinct !DISubprogram(name: "archive_entry_hardlink", scope: !1, file: !1, line: 452, type: !257, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!276 = distinct !DISubprogram(name: "archive_entry_hardlink_utf8", scope: !1, file: !1, line: 466, type: !257, isLocal: false, isDefinition: true, scopeLine: 467, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!277 = distinct !DISubprogram(name: "archive_entry_hardlink_w", scope: !1, file: !1, line: 480, type: !267, isLocal: false, isDefinition: true, scopeLine: 481, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!278 = distinct !DISubprogram(name: "_archive_entry_hardlink_l", scope: !1, file: !1, line: 494, type: !272, isLocal: false, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!279 = distinct !DISubprogram(name: "archive_entry_ino", scope: !1, file: !1, line: 506, type: !260, isLocal: false, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!280 = distinct !DISubprogram(name: "archive_entry_ino_is_set", scope: !1, file: !1, line: 512, type: !235, isLocal: false, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!281 = distinct !DISubprogram(name: "archive_entry_ino64", scope: !1, file: !1, line: 518, type: !260, isLocal: false, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!282 = distinct !DISubprogram(name: "archive_entry_mode", scope: !1, file: !1, line: 524, type: !250, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!283 = distinct !DISubprogram(name: "archive_entry_mtime", scope: !1, file: !1, line: 530, type: !226, isLocal: false, isDefinition: true, scopeLine: 531, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!284 = distinct !DISubprogram(name: "archive_entry_mtime_nsec", scope: !1, file: !1, line: 536, type: !232, isLocal: false, isDefinition: true, scopeLine: 537, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!285 = distinct !DISubprogram(name: "archive_entry_mtime_is_set", scope: !1, file: !1, line: 542, type: !235, isLocal: false, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!286 = distinct !DISubprogram(name: "archive_entry_nlink", scope: !1, file: !1, line: 548, type: !287, isLocal: false, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!287 = !DISubroutineType(types: !288)
!288 = !{!15, !5}
!289 = distinct !DISubprogram(name: "archive_entry_pathname", scope: !1, file: !1, line: 554, type: !257, isLocal: false, isDefinition: true, scopeLine: 555, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!290 = distinct !DISubprogram(name: "archive_entry_pathname_utf8", scope: !1, file: !1, line: 566, type: !257, isLocal: false, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!291 = distinct !DISubprogram(name: "archive_entry_pathname_w", scope: !1, file: !1, line: 578, type: !267, isLocal: false, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!292 = distinct !DISubprogram(name: "_archive_entry_pathname_l", scope: !1, file: !1, line: 590, type: !272, isLocal: false, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!293 = distinct !DISubprogram(name: "archive_entry_perm", scope: !1, file: !1, line: 597, type: !250, isLocal: false, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!294 = distinct !DISubprogram(name: "archive_entry_rdev", scope: !1, file: !1, line: 603, type: !244, isLocal: false, isDefinition: true, scopeLine: 604, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!295 = distinct !DISubprogram(name: "archive_entry_rdevmajor", scope: !1, file: !1, line: 613, type: !244, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!296 = distinct !DISubprogram(name: "archive_entry_rdevminor", scope: !1, file: !1, line: 622, type: !244, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!297 = distinct !DISubprogram(name: "archive_entry_size", scope: !1, file: !1, line: 631, type: !260, isLocal: false, isDefinition: true, scopeLine: 632, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!298 = distinct !DISubprogram(name: "archive_entry_size_is_set", scope: !1, file: !1, line: 637, type: !235, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!299 = distinct !DISubprogram(name: "archive_entry_sourcepath", scope: !1, file: !1, line: 643, type: !257, isLocal: false, isDefinition: true, scopeLine: 644, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!300 = distinct !DISubprogram(name: "archive_entry_sourcepath_w", scope: !1, file: !1, line: 655, type: !267, isLocal: false, isDefinition: true, scopeLine: 656, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!301 = distinct !DISubprogram(name: "archive_entry_symlink", scope: !1, file: !1, line: 665, type: !257, isLocal: false, isDefinition: true, scopeLine: 666, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!302 = distinct !DISubprogram(name: "archive_entry_symlink_utf8", scope: !1, file: !1, line: 679, type: !257, isLocal: false, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!303 = distinct !DISubprogram(name: "archive_entry_symlink_w", scope: !1, file: !1, line: 693, type: !267, isLocal: false, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!304 = distinct !DISubprogram(name: "_archive_entry_symlink_l", scope: !1, file: !1, line: 707, type: !272, isLocal: false, isDefinition: true, scopeLine: 709, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!305 = distinct !DISubprogram(name: "archive_entry_uid", scope: !1, file: !1, line: 719, type: !260, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!306 = distinct !DISubprogram(name: "archive_entry_uname", scope: !1, file: !1, line: 725, type: !257, isLocal: false, isDefinition: true, scopeLine: 726, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!307 = distinct !DISubprogram(name: "archive_entry_uname_utf8", scope: !1, file: !1, line: 736, type: !257, isLocal: false, isDefinition: true, scopeLine: 737, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!308 = distinct !DISubprogram(name: "archive_entry_uname_w", scope: !1, file: !1, line: 747, type: !267, isLocal: false, isDefinition: true, scopeLine: 748, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!309 = distinct !DISubprogram(name: "_archive_entry_uname_l", scope: !1, file: !1, line: 758, type: !272, isLocal: false, isDefinition: true, scopeLine: 760, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!310 = distinct !DISubprogram(name: "archive_entry_is_data_encrypted", scope: !1, file: !1, line: 765, type: !235, isLocal: false, isDefinition: true, scopeLine: 766, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!311 = distinct !DISubprogram(name: "archive_entry_is_metadata_encrypted", scope: !1, file: !1, line: 771, type: !235, isLocal: false, isDefinition: true, scopeLine: 772, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!312 = distinct !DISubprogram(name: "archive_entry_is_encrypted", scope: !1, file: !1, line: 777, type: !235, isLocal: false, isDefinition: true, scopeLine: 778, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!313 = distinct !DISubprogram(name: "archive_entry_set_filetype", scope: !1, file: !1, line: 787, type: !314, isLocal: false, isDefinition: true, scopeLine: 788, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !5, !15}
!316 = distinct !DISubprogram(name: "archive_entry_set_fflags", scope: !1, file: !1, line: 795, type: !317, isLocal: false, isDefinition: true, scopeLine: 797, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !5, !45, !45}
!319 = distinct !DISubprogram(name: "archive_entry_copy_fflags_text", scope: !1, file: !1, line: 804, type: !320, isLocal: false, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!320 = !DISubroutineType(types: !321)
!321 = !{!78, !5, !78}
!322 = distinct !DISubprogram(name: "archive_entry_copy_fflags_text_w", scope: !1, file: !1, line: 813, type: !323, isLocal: false, isDefinition: true, scopeLine: 815, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!323 = !DISubroutineType(types: !324)
!324 = !{!269, !5, !269}
!325 = distinct !DISubprogram(name: "archive_entry_set_gid", scope: !1, file: !1, line: 822, type: !326, isLocal: false, isDefinition: true, scopeLine: 823, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !5, !50}
!328 = distinct !DISubprogram(name: "archive_entry_set_gname", scope: !1, file: !1, line: 829, type: !329, isLocal: false, isDefinition: true, scopeLine: 830, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !5, !78}
!331 = distinct !DISubprogram(name: "archive_entry_set_gname_utf8", scope: !1, file: !1, line: 835, type: !329, isLocal: false, isDefinition: true, scopeLine: 836, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!332 = distinct !DISubprogram(name: "archive_entry_copy_gname", scope: !1, file: !1, line: 841, type: !329, isLocal: false, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!333 = distinct !DISubprogram(name: "archive_entry_copy_gname_w", scope: !1, file: !1, line: 847, type: !334, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !5, !269}
!336 = distinct !DISubprogram(name: "archive_entry_update_gname_utf8", scope: !1, file: !1, line: 853, type: !337, isLocal: false, isDefinition: true, scopeLine: 854, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!337 = !DISubroutineType(types: !338)
!338 = !{!25, !5, !78}
!339 = distinct !DISubprogram(name: "_archive_entry_copy_gname_l", scope: !1, file: !1, line: 864, type: !340, isLocal: false, isDefinition: true, scopeLine: 866, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!340 = !DISubroutineType(types: !341)
!341 = !{!25, !5, !78, !43, !100}
!342 = distinct !DISubprogram(name: "archive_entry_set_ino", scope: !1, file: !1, line: 871, type: !326, isLocal: false, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!343 = distinct !DISubprogram(name: "archive_entry_set_ino64", scope: !1, file: !1, line: 879, type: !326, isLocal: false, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!344 = distinct !DISubprogram(name: "archive_entry_set_hardlink", scope: !1, file: !1, line: 887, type: !329, isLocal: false, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!345 = distinct !DISubprogram(name: "archive_entry_set_hardlink_utf8", scope: !1, file: !1, line: 897, type: !329, isLocal: false, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!346 = distinct !DISubprogram(name: "archive_entry_copy_hardlink", scope: !1, file: !1, line: 907, type: !329, isLocal: false, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!347 = distinct !DISubprogram(name: "archive_entry_copy_hardlink_w", scope: !1, file: !1, line: 917, type: !334, isLocal: false, isDefinition: true, scopeLine: 918, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!348 = distinct !DISubprogram(name: "archive_entry_update_hardlink_utf8", scope: !1, file: !1, line: 927, type: !337, isLocal: false, isDefinition: true, scopeLine: 928, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!349 = distinct !DISubprogram(name: "_archive_entry_copy_hardlink_l", scope: !1, file: !1, line: 942, type: !340, isLocal: false, isDefinition: true, scopeLine: 944, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!350 = distinct !DISubprogram(name: "archive_entry_set_atime", scope: !1, file: !1, line: 957, type: !351, isLocal: false, isDefinition: true, scopeLine: 958, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !5, !228, !40}
!353 = distinct !DISubprogram(name: "archive_entry_unset_atime", scope: !1, file: !1, line: 967, type: !217, isLocal: false, isDefinition: true, scopeLine: 968, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!354 = distinct !DISubprogram(name: "archive_entry_set_birthtime", scope: !1, file: !1, line: 974, type: !351, isLocal: false, isDefinition: true, scopeLine: 975, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!355 = distinct !DISubprogram(name: "archive_entry_unset_birthtime", scope: !1, file: !1, line: 984, type: !217, isLocal: false, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!356 = distinct !DISubprogram(name: "archive_entry_set_ctime", scope: !1, file: !1, line: 991, type: !351, isLocal: false, isDefinition: true, scopeLine: 992, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!357 = distinct !DISubprogram(name: "archive_entry_unset_ctime", scope: !1, file: !1, line: 1001, type: !217, isLocal: false, isDefinition: true, scopeLine: 1002, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!358 = distinct !DISubprogram(name: "archive_entry_set_dev", scope: !1, file: !1, line: 1008, type: !359, isLocal: false, isDefinition: true, scopeLine: 1009, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !5, !130}
!361 = distinct !DISubprogram(name: "archive_entry_set_devmajor", scope: !1, file: !1, line: 1017, type: !359, isLocal: false, isDefinition: true, scopeLine: 1018, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!362 = distinct !DISubprogram(name: "archive_entry_set_devminor", scope: !1, file: !1, line: 1026, type: !359, isLocal: false, isDefinition: true, scopeLine: 1027, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!363 = distinct !DISubprogram(name: "archive_entry_set_link", scope: !1, file: !1, line: 1036, type: !329, isLocal: false, isDefinition: true, scopeLine: 1037, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!364 = distinct !DISubprogram(name: "archive_entry_set_link_utf8", scope: !1, file: !1, line: 1045, type: !329, isLocal: false, isDefinition: true, scopeLine: 1046, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!365 = distinct !DISubprogram(name: "archive_entry_copy_link", scope: !1, file: !1, line: 1055, type: !329, isLocal: false, isDefinition: true, scopeLine: 1056, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!366 = distinct !DISubprogram(name: "archive_entry_copy_link_w", scope: !1, file: !1, line: 1065, type: !334, isLocal: false, isDefinition: true, scopeLine: 1066, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!367 = distinct !DISubprogram(name: "archive_entry_update_link_utf8", scope: !1, file: !1, line: 1074, type: !337, isLocal: false, isDefinition: true, scopeLine: 1075, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!368 = distinct !DISubprogram(name: "_archive_entry_copy_link_l", scope: !1, file: !1, line: 1091, type: !340, isLocal: false, isDefinition: true, scopeLine: 1093, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!369 = distinct !DISubprogram(name: "archive_entry_set_mode", scope: !1, file: !1, line: 1106, type: !370, isLocal: false, isDefinition: true, scopeLine: 1107, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !5, !171}
!372 = distinct !DISubprogram(name: "archive_entry_set_mtime", scope: !1, file: !1, line: 1113, type: !351, isLocal: false, isDefinition: true, scopeLine: 1114, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!373 = distinct !DISubprogram(name: "archive_entry_unset_mtime", scope: !1, file: !1, line: 1123, type: !217, isLocal: false, isDefinition: true, scopeLine: 1124, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!374 = distinct !DISubprogram(name: "archive_entry_set_nlink", scope: !1, file: !1, line: 1130, type: !314, isLocal: false, isDefinition: true, scopeLine: 1131, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!375 = distinct !DISubprogram(name: "archive_entry_set_pathname", scope: !1, file: !1, line: 1137, type: !329, isLocal: false, isDefinition: true, scopeLine: 1138, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!376 = distinct !DISubprogram(name: "archive_entry_set_pathname_utf8", scope: !1, file: !1, line: 1143, type: !329, isLocal: false, isDefinition: true, scopeLine: 1144, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!377 = distinct !DISubprogram(name: "archive_entry_copy_pathname", scope: !1, file: !1, line: 1149, type: !329, isLocal: false, isDefinition: true, scopeLine: 1150, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!378 = distinct !DISubprogram(name: "archive_entry_copy_pathname_w", scope: !1, file: !1, line: 1155, type: !334, isLocal: false, isDefinition: true, scopeLine: 1156, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!379 = distinct !DISubprogram(name: "archive_entry_update_pathname_utf8", scope: !1, file: !1, line: 1161, type: !337, isLocal: false, isDefinition: true, scopeLine: 1162, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!380 = distinct !DISubprogram(name: "_archive_entry_copy_pathname_l", scope: !1, file: !1, line: 1172, type: !340, isLocal: false, isDefinition: true, scopeLine: 1174, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!381 = distinct !DISubprogram(name: "archive_entry_set_perm", scope: !1, file: !1, line: 1180, type: !370, isLocal: false, isDefinition: true, scopeLine: 1181, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!382 = distinct !DISubprogram(name: "archive_entry_set_rdev", scope: !1, file: !1, line: 1188, type: !359, isLocal: false, isDefinition: true, scopeLine: 1189, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!383 = distinct !DISubprogram(name: "archive_entry_set_rdevmajor", scope: !1, file: !1, line: 1196, type: !359, isLocal: false, isDefinition: true, scopeLine: 1197, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!384 = distinct !DISubprogram(name: "archive_entry_set_rdevminor", scope: !1, file: !1, line: 1204, type: !359, isLocal: false, isDefinition: true, scopeLine: 1205, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!385 = distinct !DISubprogram(name: "archive_entry_set_size", scope: !1, file: !1, line: 1212, type: !326, isLocal: false, isDefinition: true, scopeLine: 1213, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!386 = distinct !DISubprogram(name: "archive_entry_unset_size", scope: !1, file: !1, line: 1220, type: !217, isLocal: false, isDefinition: true, scopeLine: 1221, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!387 = distinct !DISubprogram(name: "archive_entry_copy_sourcepath", scope: !1, file: !1, line: 1227, type: !329, isLocal: false, isDefinition: true, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!388 = distinct !DISubprogram(name: "archive_entry_copy_sourcepath_w", scope: !1, file: !1, line: 1233, type: !334, isLocal: false, isDefinition: true, scopeLine: 1234, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!389 = distinct !DISubprogram(name: "archive_entry_set_symlink", scope: !1, file: !1, line: 1239, type: !329, isLocal: false, isDefinition: true, scopeLine: 1240, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!390 = distinct !DISubprogram(name: "archive_entry_set_symlink_utf8", scope: !1, file: !1, line: 1249, type: !329, isLocal: false, isDefinition: true, scopeLine: 1250, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!391 = distinct !DISubprogram(name: "archive_entry_copy_symlink", scope: !1, file: !1, line: 1259, type: !329, isLocal: false, isDefinition: true, scopeLine: 1260, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!392 = distinct !DISubprogram(name: "archive_entry_copy_symlink_w", scope: !1, file: !1, line: 1269, type: !334, isLocal: false, isDefinition: true, scopeLine: 1270, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!393 = distinct !DISubprogram(name: "archive_entry_update_symlink_utf8", scope: !1, file: !1, line: 1279, type: !337, isLocal: false, isDefinition: true, scopeLine: 1280, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!394 = distinct !DISubprogram(name: "_archive_entry_copy_symlink_l", scope: !1, file: !1, line: 1294, type: !340, isLocal: false, isDefinition: true, scopeLine: 1296, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!395 = distinct !DISubprogram(name: "archive_entry_set_uid", scope: !1, file: !1, line: 1309, type: !326, isLocal: false, isDefinition: true, scopeLine: 1310, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!396 = distinct !DISubprogram(name: "archive_entry_set_uname", scope: !1, file: !1, line: 1316, type: !329, isLocal: false, isDefinition: true, scopeLine: 1317, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!397 = distinct !DISubprogram(name: "archive_entry_set_uname_utf8", scope: !1, file: !1, line: 1322, type: !329, isLocal: false, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!398 = distinct !DISubprogram(name: "archive_entry_copy_uname", scope: !1, file: !1, line: 1328, type: !329, isLocal: false, isDefinition: true, scopeLine: 1329, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!399 = distinct !DISubprogram(name: "archive_entry_copy_uname_w", scope: !1, file: !1, line: 1334, type: !334, isLocal: false, isDefinition: true, scopeLine: 1335, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!400 = distinct !DISubprogram(name: "archive_entry_update_uname_utf8", scope: !1, file: !1, line: 1340, type: !337, isLocal: false, isDefinition: true, scopeLine: 1341, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!401 = distinct !DISubprogram(name: "archive_entry_set_is_data_encrypted", scope: !1, file: !1, line: 1351, type: !402, isLocal: false, isDefinition: true, scopeLine: 1352, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !5, !80}
!404 = distinct !DISubprogram(name: "archive_entry_set_is_metadata_encrypted", scope: !1, file: !1, line: 1361, type: !402, isLocal: false, isDefinition: true, scopeLine: 1362, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!405 = distinct !DISubprogram(name: "_archive_entry_copy_uname_l", scope: !1, file: !1, line: 1371, type: !340, isLocal: false, isDefinition: true, scopeLine: 1373, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!406 = distinct !DISubprogram(name: "archive_entry_mac_metadata", scope: !1, file: !1, line: 1379, type: !407, isLocal: false, isDefinition: true, scopeLine: 1380, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!407 = !DISubroutineType(types: !408)
!408 = !{!41, !5, !63}
!409 = distinct !DISubprogram(name: "archive_entry_copy_mac_metadata", scope: !1, file: !1, line: 1386, type: !410, isLocal: false, isDefinition: true, scopeLine: 1388, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !5, !41, !43}
!412 = distinct !DISubprogram(name: "archive_entry_acl", scope: !1, file: !1, line: 1412, type: !413, isLocal: false, isDefinition: true, scopeLine: 1413, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !5}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!416 = distinct !DISubprogram(name: "archive_entry_acl_clear", scope: !1, file: !1, line: 1418, type: !217, isLocal: false, isDefinition: true, scopeLine: 1419, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!417 = distinct !DISubprogram(name: "archive_entry_acl_add_entry", scope: !1, file: !1, line: 1427, type: !418, isLocal: false, isDefinition: true, scopeLine: 1429, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!418 = !DISubroutineType(types: !419)
!419 = !{!25, !5, !25, !25, !25, !25, !78}
!420 = distinct !DISubprogram(name: "archive_entry_acl_add_entry_w", scope: !1, file: !1, line: 1437, type: !421, isLocal: false, isDefinition: true, scopeLine: 1439, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!421 = !DISubroutineType(types: !422)
!422 = !{!25, !5, !25, !25, !25, !25, !269}
!423 = distinct !DISubprogram(name: "archive_entry_acl_types", scope: !1, file: !1, line: 1448, type: !235, isLocal: false, isDefinition: true, scopeLine: 1449, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!424 = distinct !DISubprogram(name: "archive_entry_acl_count", scope: !1, file: !1, line: 1457, type: !425, isLocal: false, isDefinition: true, scopeLine: 1458, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!425 = !DISubroutineType(types: !426)
!426 = !{!25, !5, !25}
!427 = distinct !DISubprogram(name: "archive_entry_acl_reset", scope: !1, file: !1, line: 1468, type: !425, isLocal: false, isDefinition: true, scopeLine: 1469, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!428 = distinct !DISubprogram(name: "archive_entry_acl_next", scope: !1, file: !1, line: 1478, type: !429, isLocal: false, isDefinition: true, scopeLine: 1480, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!429 = !DISubroutineType(types: !430)
!430 = !{!25, !5, !25, !431, !431, !431, !431, !274}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!432 = distinct !DISubprogram(name: "archive_entry_acl_to_text_w", scope: !1, file: !1, line: 1494, type: !433, isLocal: false, isDefinition: true, scopeLine: 1496, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!433 = !DISubroutineType(types: !434)
!434 = !{!149, !5, !210, !25}
!435 = distinct !DISubprogram(name: "archive_entry_acl_to_text", scope: !1, file: !1, line: 1502, type: !436, isLocal: false, isDefinition: true, scopeLine: 1504, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!436 = !DISubroutineType(types: !437)
!437 = !{!93, !5, !210, !25}
!438 = distinct !DISubprogram(name: "_archive_entry_acl_to_text_l", scope: !1, file: !1, line: 1509, type: !439, isLocal: false, isDefinition: true, scopeLine: 1511, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!439 = !DISubroutineType(types: !440)
!440 = !{!93, !5, !210, !25, !100}
!441 = distinct !DISubprogram(name: "archive_entry_acl_from_text_w", scope: !1, file: !1, line: 1519, type: !442, isLocal: false, isDefinition: true, scopeLine: 1521, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!442 = !DISubroutineType(types: !443)
!443 = !{!25, !5, !269, !25}
!444 = distinct !DISubprogram(name: "archive_entry_acl_from_text", scope: !1, file: !1, line: 1526, type: !445, isLocal: false, isDefinition: true, scopeLine: 1528, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!445 = !DISubroutineType(types: !446)
!446 = !{!25, !5, !78, !25}
!447 = distinct !DISubprogram(name: "_archive_entry_acl_from_text_l", scope: !1, file: !1, line: 1533, type: !448, isLocal: false, isDefinition: true, scopeLine: 1535, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!448 = !DISubroutineType(types: !449)
!449 = !{!25, !5, !78, !25, !100}
!450 = distinct !DISubprogram(name: "archive_entry_acl_text_w", scope: !1, file: !1, line: 1561, type: !451, isLocal: false, isDefinition: true, scopeLine: 1562, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!451 = !DISubroutineType(types: !452)
!452 = !{!269, !5, !25}
!453 = distinct !DISubprogram(name: "archive_entry_acl_text", scope: !1, file: !1, line: 1575, type: !454, isLocal: false, isDefinition: true, scopeLine: 1576, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!454 = !DISubroutineType(types: !455)
!455 = !{!78, !5, !25}
!456 = distinct !DISubprogram(name: "_archive_entry_acl_text_l", scope: !1, file: !1, line: 1590, type: !457, isLocal: false, isDefinition: true, scopeLine: 1592, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!457 = !DISubroutineType(types: !458)
!458 = !{!25, !5, !25, !274, !63, !100}
!459 = distinct !DISubprogram(name: "archive_entry_acl_text_compat", scope: !1, file: !1, line: 1541, type: !460, isLocal: true, isDefinition: true, scopeLine: 1542, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!460 = !DISubroutineType(types: !461)
!461 = !{!25, !431}
!462 = distinct !DISubprogram(name: "ae_fflagstostr", scope: !1, file: !1, line: 1838, type: !463, isLocal: true, isDefinition: true, scopeLine: 1839, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!463 = !DISubroutineType(types: !464)
!464 = !{!93, !45, !45}
!465 = distinct !DISubprogram(name: "ae_strtofflags", scope: !1, file: !1, line: 1892, type: !466, isLocal: true, isDefinition: true, scopeLine: 1893, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!466 = !DISubroutineType(types: !467)
!467 = !{!78, !78, !255, !255}
!468 = distinct !DISubprogram(name: "ae_wcstofflags", scope: !1, file: !1, line: 1960, type: !469, isLocal: true, isDefinition: true, scopeLine: 1961, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!469 = !DISubroutineType(types: !470)
!470 = !{!269, !269, !255, !255}
!471 = !{!472}
!472 = !DIGlobalVariable(name: "flags", scope: !0, file: !1, line: 1646, type: !473, isLocal: true, isDefinition: true, variable: [25 x %struct.flag]* @flags)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 6400, align: 64, elements: !480)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "flag", file: !1, line: 1641, size: 256, align: 64, elements: !475)
!475 = !{!476, !477, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !1, line: 1642, baseType: !78, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wname", scope: !474, file: !1, line: 1643, baseType: !269, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !474, file: !1, line: 1644, baseType: !45, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !474, file: !1, line: 1645, baseType: !45, size: 64, align: 64, offset: 192)
!480 = !{!481}
!481 = !DISubrange(count: 25)
!482 = !{i32 2, !"Dwarf Version", i32 4}
!483 = !{i32 2, !"Debug Info Version", i32 3}
!484 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!485 = !DILocalVariable(name: "entry", arg: 1, scope: !212, file: !1, line: 155, type: !5)
!486 = !DIExpression()
!487 = !DILocation(line: 155, column: 43, scope: !212)
!488 = !DILocation(line: 157, column: 6, scope: !489)
!489 = distinct !DILexicalBlock(scope: !212, file: !1, line: 157, column: 6)
!490 = !DILocation(line: 157, column: 12, scope: !489)
!491 = !DILocation(line: 157, column: 6, scope: !212)
!492 = !DILocation(line: 158, column: 3, scope: !489)
!493 = !DILocation(line: 159, column: 25, scope: !212)
!494 = !DILocation(line: 159, column: 32, scope: !212)
!495 = !DILocation(line: 159, column: 2, scope: !212)
!496 = !DILocation(line: 160, column: 25, scope: !212)
!497 = !DILocation(line: 160, column: 32, scope: !212)
!498 = !DILocation(line: 160, column: 2, scope: !212)
!499 = !DILocation(line: 161, column: 25, scope: !212)
!500 = !DILocation(line: 161, column: 32, scope: !212)
!501 = !DILocation(line: 161, column: 2, scope: !212)
!502 = !DILocation(line: 162, column: 25, scope: !212)
!503 = !DILocation(line: 162, column: 32, scope: !212)
!504 = !DILocation(line: 162, column: 2, scope: !212)
!505 = !DILocation(line: 163, column: 25, scope: !212)
!506 = !DILocation(line: 163, column: 32, scope: !212)
!507 = !DILocation(line: 163, column: 2, scope: !212)
!508 = !DILocation(line: 164, column: 25, scope: !212)
!509 = !DILocation(line: 164, column: 32, scope: !212)
!510 = !DILocation(line: 164, column: 2, scope: !212)
!511 = !DILocation(line: 165, column: 25, scope: !212)
!512 = !DILocation(line: 165, column: 32, scope: !212)
!513 = !DILocation(line: 165, column: 2, scope: !212)
!514 = !DILocation(line: 166, column: 34, scope: !212)
!515 = !DILocation(line: 166, column: 2, scope: !212)
!516 = !DILocation(line: 167, column: 21, scope: !212)
!517 = !DILocation(line: 167, column: 28, scope: !212)
!518 = !DILocation(line: 167, column: 2, scope: !212)
!519 = !DILocation(line: 168, column: 28, scope: !212)
!520 = !DILocation(line: 168, column: 2, scope: !212)
!521 = !DILocation(line: 169, column: 29, scope: !212)
!522 = !DILocation(line: 169, column: 2, scope: !212)
!523 = !DILocation(line: 170, column: 7, scope: !212)
!524 = !DILocation(line: 170, column: 14, scope: !212)
!525 = !DILocation(line: 170, column: 2, scope: !212)
!526 = !DILocation(line: 171, column: 9, scope: !212)
!527 = !DILocation(line: 171, column: 2, scope: !212)
!528 = !DILocation(line: 172, column: 9, scope: !212)
!529 = !DILocation(line: 172, column: 2, scope: !212)
!530 = !DILocation(line: 173, column: 1, scope: !212)
!531 = !DILocalVariable(name: "entry", arg: 1, scope: !409, file: !1, line: 1386, type: !5)
!532 = !DILocation(line: 1386, column: 55, scope: !409)
!533 = !DILocalVariable(name: "p", arg: 2, scope: !409, file: !1, line: 1387, type: !41)
!534 = !DILocation(line: 1387, column: 17, scope: !409)
!535 = !DILocalVariable(name: "s", arg: 3, scope: !409, file: !1, line: 1387, type: !43)
!536 = !DILocation(line: 1387, column: 27, scope: !409)
!537 = !DILocation(line: 1389, column: 8, scope: !409)
!538 = !DILocation(line: 1389, column: 15, scope: !409)
!539 = !DILocation(line: 1389, column: 3, scope: !409)
!540 = !DILocation(line: 1390, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !409, file: !1, line: 1390, column: 7)
!542 = !DILocation(line: 1390, column: 9, scope: !541)
!543 = !DILocation(line: 1390, column: 17, scope: !541)
!544 = !DILocation(line: 1390, column: 20, scope: !545)
!545 = !DILexicalBlockFile(scope: !541, file: !1, discriminator: 1)
!546 = !DILocation(line: 1390, column: 22, scope: !545)
!547 = !DILocation(line: 1390, column: 7, scope: !545)
!548 = !DILocation(line: 1391, column: 5, scope: !549)
