; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_open_fd.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.read_fd_data = type { i32, i64, i8, i8* }

@.str = private unnamed_addr constant [17 x i8] c"Can't stat fd %d\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"No memory\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"Error reading fd %d\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"Error seeking\00", align 1
@.str.4 = private unnamed_addr constant [44 x i8] c"A file descriptor(%d) is not seekable(PIPE)\00", align 1
@.str.5 = private unnamed_addr constant [39 x i8] c"Error seeking in a file descriptor(%d)\00", align 1

; Function Attrs: nounwind uwtable
define i32 @archive_read_open_fd(%struct.archive* %a, i32 %fd, i64 %block_size) #0 !dbg !18 {
entry:
  %retval = alloca i32, align 4
  %a.addr = alloca %struct.archive*, align 8
  %fd.addr = alloca i32, align 4
  %block_size.addr = alloca i64, align 8
  %st = alloca %struct.stat, align 8
  %mine = alloca %struct.read_fd_data*, align 8
  %b = alloca i8*, align 8
  store %struct.archive* %a, %struct.archive** %a.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !17)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_open_fd.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "read_fd_data", file: !1, line: 53, size: 256, align: 64, elements: !6)
!6 = !{!7, !9, !13, !15}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !5, file: !1, line: 54, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !5, file: !1, line: 55, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 62, baseType: !12)
!11 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!12 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "use_lseek", scope: !5, file: !1, line: 56, baseType: !14, size: 8, align: 8, offset: 128)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !1, line: 57, baseType: !16, size: 64, align: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !{!18, !24, !35, !40, !43}
!18 = distinct !DISubprogram(name: "archive_read_open_fd", scope: !1, file: !1, line: 66, type: !19, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!19 = !DISubroutineType(types: !20)
!20 = !{!8, !21, !8, !10}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !23, line: 179, flags: DIFlagFwdDecl)
!23 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!24 = distinct !DISubprogram(name: "file_read", scope: !1, file: !1, line: 113, type: !25, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !21, !16, !32}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 109, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 172, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!35 = distinct !DISubprogram(name: "file_skip", scope: !1, file: !1, line: 132, type: !36, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !21, !16, !38}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !39, line: 40, baseType: !31)
!39 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!40 = distinct !DISubprogram(name: "file_seek", scope: !1, file: !1, line: 179, type: !41, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{!38, !21, !16, !38, !8}
!43 = distinct !DISubprogram(name: "file_close", scope: !1, file: !1, line: 203, type: !44, isLocal: true, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!44 = !DISubroutineType(types: !45)
!45 = !{!8, !21, !16}
!46 = !{i32 2, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!49 = !DILocalVariable(name: "a", arg: 1, scope: !18, file: !1, line: 66, type: !21)
!50 = !DIExpression()
!51 = !DILocation(line: 66, column: 38, scope: !18)
!52 = !DILocalVariable(name: "fd", arg: 2, scope: !18, file: !1, line: 66, type: !8)
!53 = !DILocation(line: 66, column: 45, scope: !18)
!54 = !DILocalVariable(name: "block_size", arg: 3, scope: !18, file: !1, line: 66, type: !10)
!55 = !DILocation(line: 66, column: 56, scope: !18)
!56 = !DILocalVariable(name: "st", scope: !18, file: !1, line: 68, type: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !58, line: 46, size: 1152, align: 64, elements: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!59 = !{!60, !62, !64, !66, !69, !71, !73, !74, !75, !77, !79, !81, !89, !90, !91}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !57, file: !58, line: 48, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !30, line: 124, baseType: !12)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !57, file: !58, line: 53, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !30, line: 127, baseType: !12)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !57, file: !58, line: 61, baseType: !65, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !30, line: 130, baseType: !12)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !57, file: !58, line: 62, baseType: !67, size: 32, align: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !30, line: 129, baseType: !68)
!68 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !57, file: !58, line: 64, baseType: !70, size: 32, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 125, baseType: !68)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !57, file: !58, line: 65, baseType: !72, size: 32, align: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !30, line: 126, baseType: !68)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !57, file: !58, line: 67, baseType: !8, size: 32, align: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !57, file: !58, line: 69, baseType: !61, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !57, file: !58, line: 74, baseType: !76, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 131, baseType: !31)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !57, file: !58, line: 78, baseType: !78, size: 64, align: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !30, line: 153, baseType: !31)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !57, file: !58, line: 80, baseType: !80, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !30, line: 158, baseType: !31)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !57, file: !58, line: 91, baseType: !82, size: 128, align: 64, offset: 576)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !83, line: 120, size: 128, align: 64, elements: !84)
!83 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !82, file: !83, line: 122, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 139, baseType: !31)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !82, file: !83, line: 123, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !30, line: 175, baseType: !31)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !57, file: !58, line: 92, baseType: !82, size: 128, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !57, file: !58, line: 93, baseType: !82, size: 128, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !57, file: !58, line: 106, baseType: !92, size: 192, align: 64, offset: 960)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 192, align: 64, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 3)
!95 = !DILocation(line: 68, column: 14, scope: !18)
!96 = !DILocalVariable(name: "mine", scope: !18, file: !1, line: 69, type: !4)
!97 = !DILocation(line: 69, column: 23, scope: !18)
!98 = !DILocalVariable(name: "b", scope: !18, file: !1, line: 70, type: !16)
!99 = !DILocation(line: 70, column: 8, scope: !18)
!100 = !DILocation(line: 72, column: 22, scope: !18)
!101 = !DILocation(line: 72, column: 2, scope: !18)
!102 = !DILocation(line: 73, column: 12, scope: !103)
!103 = distinct !DILexicalBlock(scope: !18, file: !1, line: 73, column: 6)
!104 = !DILocation(line: 73, column: 6, scope: !103)
!105 = !DILocation(line: 73, column: 21, scope: !103)
!106 = !DILocation(line: 73, column: 6, scope: !18)
!107 = !DILocation(line: 74, column: 21, scope: !108)
!108 = distinct !DILexicalBlock(scope: !103, file: !1, line: 73, column: 27)
!109 = !DILocation(line: 74, column: 24, scope: !108)
!110 = !DILocation(line: 74, column: 51, scope: !108)
!111 = !DILocation(line: 74, column: 3, scope: !112)
!112 = !DILexicalBlockFile(scope: !108, file: !1, discriminator: 1)
!113 = !DILocation(line: 75, column: 3, scope: !108)
!114 = !DILocation(line: 78, column: 32, scope: !18)
!115 = !DILocation(line: 78, column: 9, scope: !18)
!116 = !DILocation(line: 78, column: 7, scope: !18)
!117 = !DILocation(line: 79, column: 13, scope: !18)
!118 = !DILocation(line: 79, column: 6, scope: !18)
!119 = !DILocation(line: 79, column: 4, scope: !18)
!120 = !DILocation(line: 80, column: 6, scope: !121)
!121 = distinct !DILexicalBlock(scope: !18, file: !1, line: 80, column: 6)
!122 = !DILocation(line: 80, column: 11, scope: !121)
!123 = !DILocation(line: 80, column: 19, scope: !121)
!124 = !DILocation(line: 80, column: 22, scope: !125)
!125 = !DILexicalBlockFile(scope: !121, file: !1, discriminator: 1)
!126 = !DILocation(line: 80, column: 24, scope: !125)
!127 = !DILocation(line: 80, column: 6, scope: !125)
!128 = !DILocation(line: 81, column: 21, scope: !129)
!129 = distinct !DILexicalBlock(scope: !121, file: !1, line: 80, column: 33)
!130 = !DILocation(line: 81, column: 3, scope: !129)
!131 = !DILocation(line: 82, column: 8, scope: !129)
!132 = !DILocation(line: 82, column: 3, scope: !129)
!133 = !DILocation(line: 83, column: 8, scope: !129)
!134 = !DILocation(line: 83, column: 3, scope: !129)
!135 = !DILocation(line: 84, column: 3, scope: !129)
!136 = !DILocation(line: 86, column: 21, scope: !18)
!137 = !DILocation(line: 86, column: 2, scope: !18)
!138 = !DILocation(line: 86, column: 8, scope: !18)
!139 = !DILocation(line: 86, column: 19, scope: !18)
!140 = !DILocation(line: 87, column: 17, scope: !18)
!141 = !DILocation(line: 87, column: 2, scope: !18)
!142 = !DILocation(line: 87, column: 8, scope: !18)
!143 = !DILocation(line: 87, column: 15, scope: !18)
!144 = !DILocation(line: 88, column: 13, scope: !18)
!145 = !DILocation(line: 88, column: 2, scope: !18)
!146 = !DILocation(line: 88, column: 8, scope: !18)
!147 = !DILocation(line: 88, column: 11, scope: !18)
!148 = !DILocation(line: 96, column: 6, scope: !149)
!149 = distinct !DILexicalBlock(scope: !18, file: !1, line: 96, column: 6)
!150 = !DILocation(line: 96, column: 6, scope: !18)
!151 = !DILocation(line: 97, column: 38, scope: !152)
!152 = distinct !DILexicalBlock(scope: !149, file: !1, line: 96, column: 27)
!153 = !DILocation(line: 97, column: 44, scope: !152)
!154 = !DILocation(line: 97, column: 55, scope: !152)
!155 = !DILocation(line: 97, column: 3, scope: !152)
!156 = !DILocation(line: 98, column: 3, scope: !152)
!157 = !DILocation(line: 98, column: 9, scope: !152)
!158 = !DILocation(line: 98, column: 19, scope: !152)
!159 = !DILocation(line: 99, column: 2, scope: !152)
!160 = !DILocation(line: 104, column: 33, scope: !18)
