; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_open_filename.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.read_file_data = type { i32, i64, i8*, i32, i8, i32, %union.anon }
%union.anon = type { [1 x i32] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"No memory\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !39)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_open_filename.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fnt_e", file: !1, line: 79, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7}
!5 = !DIEnumerator(name: "FNT_STDIN", value: 0)
!6 = !DIEnumerator(name: "FNT_MBS", value: 1)
!7 = !DIEnumerator(name: "FNT_WCS", value: 2)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "read_file_data", file: !1, line: 73, size: 320, align: 64, elements: !12)
!12 = !{!13, !15, !19, !20, !26, !28, !29}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !11, file: !1, line: 74, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !11, file: !1, line: 75, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 62, baseType: !18)
!17 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!18 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !11, file: !1, line: 76, baseType: !9, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !11, file: !1, line: 77, baseType: !21, size: 32, align: 32, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !22, line: 63, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !24, line: 129, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!25 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "use_lseek", scope: !11, file: !1, line: 78, baseType: !27, size: 8, align: 8, offset: 224)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filename_type", scope: !11, file: !1, line: 79, baseType: !3, size: 32, align: 32, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !11, file: !1, line: 83, baseType: !30, size: 32, align: 32, offset: 288)
!30 = !DICompositeType(tag: DW_TAG_union_type, scope: !11, file: !1, line: 80, size: 32, align: 32, elements: !31)
!31 = !{!32, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !30, file: !1, line: 81, baseType: !33, size: 8, align: 8)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, align: 8, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 1)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !30, file: !1, line: 82, baseType: !37, size: 32, align: 32)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, align: 32, elements: !34)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !17, line: 90, baseType: !14)
!39 = !{!40, !138, !139, !143, !148, !151, !154, !157, !158, !161, !162, !163}
!40 = distinct !DISubprogram(name: "archive_read_open_file", scope: !1, file: !1, line: 96, type: !41, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!41 = !DISubroutineType(types: !42)
!42 = !{!14, !43, !108, !16}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !45, line: 89, size: 1280, align: 64, elements: !46)
!45 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!46 = !{!47, !48, !49, !110, !111, !112, !113, !114, !115, !116, !117, !125, !126, !127, !128, !131, !132, !133, !134, !135, !136}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !44, file: !45, line: 96, baseType: !25, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !44, file: !45, line: 97, baseType: !25, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !44, file: !45, line: 103, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !45, line: 63, size: 832, align: 64, elements: !52)
!52 = !{!53, !57, !58, !65, !66, !76, !82, !87, !88, !95, !96, !100, !104}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !51, file: !45, line: 64, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!14, !43}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !51, file: !45, line: 65, baseType: !54, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !51, file: !45, line: 66, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!14, !43, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !64, line: 180, flags: DIFlagFwdDecl)
!64 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !51, file: !45, line: 68, baseType: !54, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !51, file: !45, line: 69, baseType: !67, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !43, !74, !16}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !71, line: 109, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !24, line: 172, baseType: !73)
!73 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !51, file: !45, line: 71, baseType: !77, size: 64, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!70, !43, !74, !16, !80}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !81, line: 40, baseType: !73)
!81 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !51, file: !45, line: 74, baseType: !83, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!14, !43, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !51, file: !45, line: 76, baseType: !59, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !51, file: !45, line: 78, baseType: !89, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!14, !43, !92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !51, file: !45, line: 81, baseType: !54, size: 64, align: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !51, file: !45, line: 82, baseType: !97, size: 64, align: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!80, !43, !14}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !51, file: !45, line: 83, baseType: !101, size: 64, align: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!14, !43, !14}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !51, file: !45, line: 84, baseType: !105, size: 64, align: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !43, !14}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !44, file: !45, line: 105, baseType: !14, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !44, file: !45, line: 106, baseType: !108, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !44, file: !45, line: 108, baseType: !14, size: 32, align: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !44, file: !45, line: 109, baseType: !108, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !44, file: !45, line: 112, baseType: !14, size: 32, align: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !44, file: !45, line: 114, baseType: !14, size: 32, align: 32, offset: 416)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !44, file: !45, line: 115, baseType: !108, size: 64, align: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !44, file: !45, line: 116, baseType: !118, size: 192, align: 64, offset: 512)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !119, line: 58, size: 192, align: 64, elements: !120)
!119 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!120 = !{!121, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !118, file: !119, line: 59, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !119, line: 60, baseType: !16, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !118, file: !119, line: 61, baseType: !16, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !44, file: !45, line: 118, baseType: !122, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !44, file: !45, line: 119, baseType: !25, size: 32, align: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !44, file: !45, line: 120, baseType: !25, size: 32, align: 32, offset: 800)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !44, file: !45, line: 121, baseType: !129, size: 64, align: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !119, line: 70, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !44, file: !45, line: 127, baseType: !108, size: 64, align: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !44, file: !45, line: 128, baseType: !80, size: 64, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !44, file: !45, line: 129, baseType: !80, size: 64, align: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !44, file: !45, line: 130, baseType: !16, size: 64, align: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !44, file: !45, line: 137, baseType: !27, size: 8, align: 8, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !44, file: !45, line: 138, baseType: !16, size: 64, align: 64, offset: 1216)
!137 = !{}
!138 = distinct !DISubprogram(name: "archive_read_open_filename", scope: !1, file: !1, line: 103, type: !41, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!139 = distinct !DISubprogram(name: "archive_read_open_filenames", scope: !1, file: !1, line: 113, type: !140, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!140 = !DISubroutineType(types: !141)
!141 = !{!14, !43, !142, !16}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!143 = distinct !DISubprogram(name: "archive_read_open_filename_w", scope: !1, file: !1, line: 159, type: !144, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!144 = !DISubroutineType(types: !145)
!145 = !{!14, !43, !146, !16}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!148 = distinct !DISubprogram(name: "file_open", scope: !1, file: !1, line: 218, type: !149, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!149 = !DISubroutineType(types: !150)
!150 = !{!14, !43, !9}
!151 = distinct !DISubprogram(name: "file_read", scope: !1, file: !1, line: 384, type: !152, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!152 = !DISubroutineType(types: !153)
!153 = !{!70, !43, !9, !92}
!154 = distinct !DISubprogram(name: "file_skip", scope: !1, file: !1, line: 490, type: !155, isLocal: true, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!155 = !DISubroutineType(types: !156)
!156 = !{!80, !43, !9, !80}
!157 = distinct !DISubprogram(name: "file_skip_lseek", scope: !1, file: !1, line: 443, type: !155, isLocal: true, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!158 = distinct !DISubprogram(name: "file_seek", scope: !1, file: !1, line: 506, type: !159, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!159 = !DISubroutineType(types: !160)
!160 = !{!80, !43, !9, !80, !14}
!161 = distinct !DISubprogram(name: "file_close", scope: !1, file: !1, line: 569, type: !149, isLocal: true, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!162 = distinct !DISubprogram(name: "file_close2", scope: !1, file: !1, line: 530, type: !149, isLocal: true, isDefinition: true, scopeLine: 531, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!163 = distinct !DISubprogram(name: "file_switch", scope: !1, file: !1, line: 578, type: !164, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: false, variables: !137)
!164 = !DISubroutineType(types: !165)
!165 = !{!14, !43, !9, !9}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!169 = !DILocalVariable(name: "a", arg: 1, scope: !40, file: !1, line: 96, type: !43)
!170 = !DIExpression()
!171 = !DILocation(line: 96, column: 40, scope: !40)
!172 = !DILocalVariable(name: "filename", arg: 2, scope: !40, file: !1, line: 96, type: !108)
!173 = !DILocation(line: 96, column: 55, scope: !40)
!174 = !DILocalVariable(name: "block_size", arg: 3, scope: !40, file: !1, line: 97, type: !16)
!175 = !DILocation(line: 97, column: 12, scope: !40)
!176 = !DILocation(line: 99, column: 37, scope: !40)
!177 = !DILocation(line: 99, column: 40, scope: !40)
!178 = !DILocation(line: 99, column: 50, scope: !40)
!179 = !DILocation(line: 99, column: 10, scope: !40)
!180 = !DILocation(line: 99, column: 2, scope: !40)
!181 = !DILocalVariable(name: "a", arg: 1, scope: !138, file: !1, line: 103, type: !43)
!182 = !DILocation(line: 103, column: 44, scope: !138)
!183 = !DILocalVariable(name: "filename", arg: 2, scope: !138, file: !1, line: 103, type: !108)
!184 = !DILocation(line: 103, column: 59, scope: !138)
!185 = !DILocalVariable(name: "block_size", arg: 3, scope: !138, file: !1, line: 104, type: !16)
!186 = !DILocation(line: 104, column: 12, scope: !138)
!187 = !DILocalVariable(name: "filenames", scope: !138, file: !1, line: 106, type: !188)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, align: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DILocation(line: 106, column: 14, scope: !138)
!192 = !DILocation(line: 107, column: 17, scope: !138)
!193 = !DILocation(line: 107, column: 2, scope: !138)
!194 = !DILocation(line: 107, column: 15, scope: !138)
!195 = !DILocation(line: 108, column: 2, scope: !138)
!196 = !DILocation(line: 108, column: 15, scope: !138)
!197 = !DILocation(line: 109, column: 37, scope: !138)
!198 = !DILocation(line: 109, column: 40, scope: !138)
!199 = !DILocation(line: 109, column: 51, scope: !138)
!200 = !DILocation(line: 109, column: 9, scope: !138)
!201 = !DILocation(line: 109, column: 2, scope: !138)
!202 = !DILocalVariable(name: "a", arg: 1, scope: !139, file: !1, line: 113, type: !43)
!203 = !DILocation(line: 113, column: 45, scope: !139)
!204 = !DILocalVariable(name: "filenames", arg: 2, scope: !139, file: !1, line: 113, type: !142)
!205 = !DILocation(line: 113, column: 61, scope: !139)
!206 = !DILocalVariable(name: "block_size", arg: 3, scope: !139, file: !1, line: 114, type: !16)
!207 = !DILocation(line: 114, column: 12, scope: !139)
!208 = !DILocalVariable(name: "mine", scope: !139, file: !1, line: 116, type: !10)
!209 = !DILocation(line: 116, column: 25, scope: !139)
!210 = !DILocalVariable(name: "filename", scope: !139, file: !1, line: 117, type: !108)
!211 = !DILocation(line: 117, column: 14, scope: !139)
!212 = !DILocation(line: 118, column: 6, scope: !213)
!213 = distinct !DILexicalBlock(scope: !139, file: !1, line: 118, column: 6)
!214 = !DILocation(line: 118, column: 6, scope: !139)
!215 = !DILocation(line: 119, column: 25, scope: !213)
!216 = !DILocation(line: 119, column: 14, scope: !213)
!217 = !DILocation(line: 119, column: 12, scope: !213)
!218 = !DILocation(line: 119, column: 3, scope: !213)
!219 = !DILocation(line: 121, column: 22, scope: !139)
!220 = !DILocation(line: 121, column: 2, scope: !139)
!221 = !DILocation(line: 122, column: 2, scope: !139)
!222 = !DILocation(line: 124, column: 7, scope: !223)
!223 = distinct !DILexicalBlock(scope: !224, file: !1, line: 124, column: 7)
!224 = distinct !DILexicalBlock(scope: !139, file: !1, line: 123, column: 2)
!225 = !DILocation(line: 124, column: 16, scope: !223)
!226 = !DILocation(line: 124, column: 7, scope: !224)
!227 = !DILocation(line: 125, column: 13, scope: !223)
!228 = !DILocation(line: 125, column: 4, scope: !223)
!229 = !DILocation(line: 127, column: 27, scope: !224)
!230 = !DILocation(line: 127, column: 20, scope: !224)
!231 = !DILocation(line: 127, column: 18, scope: !224)
!232 = !DILocation(line: 126, column: 35, scope: !224)
!233 = !DILocation(line: 126, column: 10, scope: !224)
!234 = !DILocation(line: 126, column: 8, scope: !224)
!235 = !DILocation(line: 128, column: 7, scope: !236)
!236 = distinct !DILexicalBlock(scope: !224, file: !1, line: 128, column: 7)
!237 = !DILocation(line: 128, column: 12, scope: !236)
!238 = !DILocation(line: 128, column: 7, scope: !224)
!239 = !DILocation(line: 129, column: 4, scope: !236)
!240 = !DILocation(line: 130, column: 10, scope: !224)
!241 = !DILocation(line: 130, column: 16, scope: !224)
!242 = !DILocation(line: 130, column: 25, scope: !224)
!243 = !DILocation(line: 130, column: 28, scope: !224)
!244 = !DILocation(line: 130, column: 3, scope: !224)
!245 = !DILocation(line: 131, column: 22, scope: !224)
!246 = !DILocation(line: 131, column: 3, scope: !224)
!247 = !DILocation(line: 131, column: 9, scope: !224)
!248 = !DILocation(line: 131, column: 20, scope: !224)
!249 = !DILocation(line: 132, column: 3, scope: !224)
!250 = !DILocation(line: 132, column: 9, scope: !224)
!251 = !DILocation(line: 132, column: 12, scope: !224)
!252 = !DILocation(line: 133, column: 3, scope: !224)
!253 = !DILocation(line: 133, column: 9, scope: !224)
!254 = !DILocation(line: 133, column: 16, scope: !224)
!255 = !DILocation(line: 134, column: 19, scope: !224)
!256 = !DILocation(line: 134, column: 25, scope: !224)
!257 = !DILocation(line: 134, column: 35, scope: !224)
!258 = !DILocation(line: 134, column: 3, scope: !224)
!259 = !DILocation(line: 134, column: 9, scope: !224)
!260 = !DILocation(line: 134, column: 17, scope: !224)
!261 = !DILocation(line: 135, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !224, file: !1, line: 135, column: 7)
!263 = !DILocation(line: 135, column: 16, scope: !262)
!264 = !DILocation(line: 135, column: 24, scope: !262)
!265 = !DILocation(line: 135, column: 27, scope: !266)
!266 = !DILexicalBlockFile(scope: !262, file: !1, discriminator: 1)
!267 = !DILocation(line: 135, column: 39, scope: !266)
!268 = !DILocation(line: 135, column: 7, scope: !266)
!269 = !DILocation(line: 136, column: 4, scope: !270)
!270 = distinct !DILexicalBlock(scope: !262, file: !1, line: 135, column: 48)
!271 = !DILocation(line: 136, column: 10, scope: !270)
!272 = !DILocation(line: 136, column: 24, scope: !270)
!273 = !DILocation(line: 137, column: 3, scope: !270)
!274 = !DILocation(line: 138, column: 4, scope: !262)
!275 = !DILocation(line: 138, column: 10, scope: !262)
!276 = !DILocation(line: 138, column: 24, scope: !262)
!277 = !DILocation(line: 139, column: 41, scope: !278)
!278 = distinct !DILexicalBlock(scope: !224, file: !1, line: 139, column: 7)
!279 = !DILocation(line: 139, column: 44, scope: !278)
!280 = !DILocation(line: 139, column: 7, scope: !278)
!281 = !DILocation(line: 139, column: 50, scope: !278)
!282 = !DILocation(line: 139, column: 7, scope: !224)
!283 = !DILocation(line: 140, column: 4, scope: !278)
!284 = !DILocation(line: 141, column: 7, scope: !285)
!285 = distinct !DILexicalBlock(scope: !224, file: !1, line: 141, column: 7)
!286 = !DILocation(line: 141, column: 17, scope: !285)
!287 = !DILocation(line: 141, column: 7, scope: !224)
!288 = !DILocation(line: 142, column: 4, scope: !285)
!289 = !DILocation(line: 143, column: 25, scope: !224)
!290 = !DILocation(line: 143, column: 14, scope: !224)
!291 = !DILocation(line: 143, column: 12, scope: !224)
!292 = !DILocation(line: 144, column: 2, scope: !224)
!293 = !DILocation(line: 144, column: 11, scope: !294)
!294 = !DILexicalBlockFile(scope: !139, file: !1, discriminator: 1)
!295 = !DILocation(line: 144, column: 20, scope: !294)
!296 = !DILocation(line: 144, column: 28, scope: !294)
!297 = !DILocation(line: 144, column: 31, scope: !298)
!298 = !DILexicalBlockFile(scope: !139, file: !1, discriminator: 2)
!299 = !DILocation(line: 144, column: 43, scope: !298)
!300 = !DILocation(line: 144, column: 2, scope: !301)
!301 = !DILexicalBlockFile(scope: !224, file: !1, discriminator: 3)
!302 = !DILocation(line: 145, column: 33, scope: !139)
!303 = !DILocation(line: 145, column: 2, scope: !139)
!304 = !DILocation(line: 146, column: 33, scope: !139)
!305 = !DILocation(line: 146, column: 2, scope: !139)
!306 = !DILocation(line: 147, column: 33, scope: !139)
!307 = !DILocation(line: 147, column: 2, scope: !139)
!308 = !DILocation(line: 148, column: 34, scope: !139)
!309 = !DILocation(line: 148, column: 2, scope: !139)
!310 = !DILocation(line: 149, column: 35, scope: !139)
!311 = !DILocation(line: 149, column: 2, scope: !139)
!312 = !DILocation(line: 150, column: 33, scope: !139)
!313 = !DILocation(line: 150, column: 2, scope: !139)
!314 = !DILocation(line: 152, column: 29, scope: !139)
!315 = !DILocation(line: 152, column: 10, scope: !139)
!316 = !DILocation(line: 152, column: 2, scope: !139)
!317 = !DILocation(line: 154, column: 20, scope: !139)
!318 = !DILocation(line: 154, column: 2, scope: !139)
!319 = !DILocation(line: 155, column: 2, scope: !139)
!320 = !DILocation(line: 156, column: 1, scope: !139)
!321 = !DILocalVariable(name: "a", arg: 1, scope: !148, file: !1, line: 218, type: !43)
!322 = !DILocation(line: 218, column: 27, scope: !148)
!323 = !DILocalVariable(name: "client_data", arg: 2, scope: !148, file: !1, line: 218, type: !9)
!324 = !DILocation(line: 218, column: 36, scope: !148)
!325 = !DILocalVariable(name: "st", scope: !148, file: !1, line: 220, type: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !327, line: 46, size: 1152, align: 64, elements: !328)
!327 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!328 = !{!329, !331, !333, !335, !336, !338, !340, !341, !342, !344, !346, !348, !356, !357, !358}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !326, file: !327, line: 48, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !24, line: 124, baseType: !18)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !326, file: !327, line: 53, baseType: !332, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !24, line: 127, baseType: !18)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !326, file: !327, line: 61, baseType: !334, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !24, line: 130, baseType: !18)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !326, file: !327, line: 62, baseType: !23, size: 32, align: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !326, file: !327, line: 64, baseType: !337, size: 32, align: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !24, line: 125, baseType: !25)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !326, file: !327, line: 65, baseType: !339, size: 32, align: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !24, line: 126, baseType: !25)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !326, file: !327, line: 67, baseType: !14, size: 32, align: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !326, file: !327, line: 69, baseType: !330, size: 64, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !326, file: !327, line: 74, baseType: !343, size: 64, align: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !24, line: 131, baseType: !73)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !326, file: !327, line: 78, baseType: !345, size: 64, align: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !24, line: 153, baseType: !73)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !326, file: !327, line: 80, baseType: !347, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !24, line: 158, baseType: !73)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !326, file: !327, line: 91, baseType: !349, size: 128, align: 64, offset: 576)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !350, line: 120, size: 128, align: 64, elements: !351)
!350 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !349, file: !350, line: 122, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !24, line: 139, baseType: !73)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !349, file: !350, line: 123, baseType: !355, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !24, line: 175, baseType: !73)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !326, file: !327, line: 92, baseType: !349, size: 128, align: 64, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !326, file: !327, line: 93, baseType: !349, size: 128, align: 64, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !326, file: !327, line: 106, baseType: !359, size: 192, align: 64, offset: 960)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 192, align: 64, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 3)
!362 = !DILocation(line: 220, column: 14, scope: !148)
!363 = !DILocalVariable(name: "mine", scope: !148, file: !1, line: 221, type: !10)
!364 = !DILocation(line: 221, column: 25, scope: !148)
!365 = !DILocation(line: 221, column: 57, scope: !148)
!366 = !DILocation(line: 221, column: 32, scope: !148)
!367 = !DILocalVariable(name: "buffer", scope: !148, file: !1, line: 222, type: !9)
!368 = !DILocation(line: 222, column: 8, scope: !148)
!369 = !DILocalVariable(name: "filename", scope: !148, file: !1, line: 223, type: !108)
!370 = !DILocation(line: 223, column: 14, scope: !148)
!371 = !DILocalVariable(name: "wfilename", scope: !148, file: !1, line: 224, type: !146)
!372 = !DILocation(line: 224, column: 17, scope: !148)
!373 = !DILocalVariable(name: "fd", scope: !148, file: !1, line: 225, type: !14)
!374 = !DILocation(line: 225, column: 6, scope: !148)
!375 = !DILocalVariable(name: "is_disk_like", scope: !148, file: !1, line: 226, type: !14)
!376 = !DILocation(line: 226, column: 6, scope: !148)
!377 = !DILocation(line: 235, column: 22, scope: !148)
!378 = !DILocation(line: 235, column: 2, scope: !148)
!379 = !DILocation(line: 236, column: 6, scope: !380)
!380 = distinct !DILexicalBlock(scope: !148, file: !1, line: 236, column: 6)
!381 = !DILocation(line: 236, column: 12, scope: !380)
!382 = !DILocation(line: 236, column: 26, scope: !380)
!383 = !DILocation(line: 236, column: 6, scope: !148)
!384 = !DILocation(line: 246, column: 6, scope: !385)
!385 = distinct !DILexicalBlock(scope: !380, file: !1, line: 236, column: 40)
!386 = !DILocation(line: 250, column: 12, scope: !385)
!387 = !DILocation(line: 251, column: 2, scope: !385)
!388 = !DILocation(line: 251, column: 13, scope: !389)
!389 = !DILexicalBlockFile(scope: !390, file: !1, discriminator: 1)
!390 = distinct !DILexicalBlock(scope: !380, file: !1, line: 251, column: 13)
!391 = !DILocation(line: 251, column: 19, scope: !389)
!392 = !DILocation(line: 251, column: 33, scope: !389)
!393 = !DILocation(line: 252, column: 14, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !1, line: 251, column: 45)
!395 = !DILocation(line: 252, column: 20, scope: !394)
!396 = !DILocation(line: 252, column: 29, scope: !394)
!397 = !DILocation(line: 252, column: 12, scope: !394)
!398 = !DILocation(line: 253, column: 13, scope: !394)
!399 = !DILocation(line: 253, column: 8, scope: !394)
!400 = !DILocation(line: 253, column: 6, scope: !394)
!401 = !DILocation(line: 254, column: 33, scope: !394)
!402 = !DILocation(line: 254, column: 3, scope: !394)
!403 = !DILocation(line: 255, column: 7, scope: !404)
!404 = distinct !DILexicalBlock(scope: !394, file: !1, line: 255, column: 7)
!405 = !DILocation(line: 255, column: 10, scope: !404)
!406 = !DILocation(line: 255, column: 7, scope: !394)
!407 = !DILocation(line: 256, column: 22, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !1, line: 255, column: 15)
!409 = !DILocation(line: 256, column: 25, scope: !408)
!410 = !DILocation(line: 257, column: 31, scope: !408)
!411 = !DILocation(line: 256, column: 4, scope: !412)
!412 = !DILexicalBlockFile(scope: !408, file: !1, discriminator: 1)
!413 = !DILocation(line: 258, column: 4, scope: !408)
!414 = !DILocation(line: 260, column: 2, scope: !394)
!415 = !DILocation(line: 278, column: 21, scope: !416)
!416 = distinct !DILexicalBlock(scope: !390, file: !1, line: 260, column: 9)
!417 = !DILocation(line: 278, column: 3, scope: !416)
!418 = !DILocation(line: 280, column: 3, scope: !416)
!419 = !DILocation(line: 283, column: 12, scope: !420)
!420 = distinct !DILexicalBlock(scope: !148, file: !1, line: 283, column: 6)
!421 = !DILocation(line: 283, column: 6, scope: !420)
