; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_format_iso9660.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_read = type { %struct.archive, %struct.archive_entry*, i32, i64, i64, %struct.archive_read_client, [16 x %struct.archive_read_filter_bidder], %struct.archive_read_filter*, i32, i64, i32, i32, [16 x %struct.archive_format_descriptor], %struct.archive_format_descriptor*, %struct.archive_read_extract*, i32 (%struct.archive_read*)*, %struct.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !497, globals: !614)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_support_format_iso9660.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !292, !123, !314, !488, !318, !80, !490, !335, !52, !492, !23, !45, !305, !493, !327, !374, !38, !445, !496, !43, !450}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read", file: !6, line: 159, size: 20288, align: 64, elements: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!7 = !{!8, !111, !112, !113, !114, !115, !159, !223, !224, !225, !226, !227, !228, !261, !263, !273, !274}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !5, file: !6, line: 160, baseType: !9, size: 1280, align: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !10, line: 89, size: 1280, align: 64, elements: !11)
!10 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!11 = !{!12, !14, !15, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !105, !106, !107, !108, !109, !110}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !9, file: !10, line: 96, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !9, file: !10, line: 97, baseType: !13, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !9, file: !10, line: 103, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !10, line: 63, size: 832, align: 64, elements: !18)
!18 = !{!19, !25, !26, !33, !34, !48, !54, !59, !60, !67, !68, !72, !76}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !17, file: !10, line: 64, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !24}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !17, file: !10, line: 65, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !17, file: !10, line: 66, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!23, !24, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !32, line: 180, flags: DIFlagFwdDecl)
!32 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !17, file: !10, line: 68, baseType: !20, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !17, file: !10, line: 69, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !24, !43, !45}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !39, line: 102, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !41, line: 172, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 62, baseType: !47)
!46 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!47 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !17, file: !10, line: 71, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!38, !24, !43, !45, !52}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !53, line: 40, baseType: !42)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !17, file: !10, line: 74, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!23, !24, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !17, file: !10, line: 76, baseType: !27, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !17, file: !10, line: 78, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!23, !24, !64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !17, file: !10, line: 81, baseType: !20, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !17, file: !10, line: 82, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!52, !24, !23}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !17, file: !10, line: 83, baseType: !73, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!23, !24, !23}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !17, file: !10, line: 84, baseType: !77, size: 64, align: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !24, !23}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !9, file: !10, line: 105, baseType: !23, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !9, file: !10, line: 106, baseType: !80, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !9, file: !10, line: 108, baseType: !23, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !9, file: !10, line: 109, baseType: !80, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !9, file: !10, line: 112, baseType: !23, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !9, file: !10, line: 114, baseType: !23, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 115, baseType: !80, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !9, file: !10, line: 116, baseType: !91, size: 192, align: 64, offset: 512)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !92, line: 58, size: 192, align: 64, elements: !93)
!92 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !{!94, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !92, line: 59, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !92, line: 60, baseType: !45, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !91, file: !92, line: 61, baseType: !45, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !9, file: !10, line: 118, baseType: !95, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !9, file: !10, line: 119, baseType: !13, size: 32, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !9, file: !10, line: 120, baseType: !13, size: 32, align: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !9, file: !10, line: 121, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !104, line: 36, flags: DIFlagFwdDecl)
!104 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_entry_locale.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !9, file: !10, line: 127, baseType: !80, size: 64, align: 64, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !9, file: !10, line: 128, baseType: !52, size: 64, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !9, file: !10, line: 129, baseType: !52, size: 64, align: 64, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !9, file: !10, line: 130, baseType: !45, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !9, file: !10, line: 137, baseType: !82, size: 8, align: 8, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !9, file: !10, line: 138, baseType: !45, size: 64, align: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !5, file: !6, line: 162, baseType: !30, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !5, file: !6, line: 165, baseType: !23, size: 32, align: 32, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !5, file: !6, line: 166, baseType: !52, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !5, file: !6, line: 167, baseType: !52, size: 64, align: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !5, file: !6, line: 170, baseType: !116, size: 576, align: 64, offset: 1536)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_client", file: !6, line: 134, size: 576, align: 64, elements: !117)
!117 = !{!118, !124, !130, !136, !141, !144, !149, !150, !151, !152}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "opener", scope: !116, file: !6, line: 135, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !32, line: 241, baseType: !121)
!121 = !DISubroutineType(types: !122)
!122 = !{!23, !24, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !116, file: !6, line: 136, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_read_callback", file: !32, line: 218, baseType: !127)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !24, !123, !64}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !32, line: 95, baseType: !38)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "skipper", scope: !116, file: !6, line: 137, baseType: !131, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_skip_callback", file: !32, line: 226, baseType: !133)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !24, !123, !135}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !32, line: 73, baseType: !52)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !116, file: !6, line: 138, baseType: !137, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_seek_callback", file: !32, line: 233, baseType: !139)
!139 = !DISubroutineType(types: !140)
!140 = !{!135, !24, !123, !135, !23}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "closer", scope: !116, file: !6, line: 139, baseType: !142, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !32, line: 243, baseType: !121)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "switcher", scope: !116, file: !6, line: 140, baseType: !145, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_switch_callback", file: !32, line: 249, baseType: !147)
!147 = !DISubroutineType(types: !148)
!148 = !{!23, !24, !123, !123}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !116, file: !6, line: 141, baseType: !13, size: 32, align: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !116, file: !6, line: 142, baseType: !13, size: 32, align: 32, offset: 416)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !116, file: !6, line: 143, baseType: !52, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !116, file: !6, line: 144, baseType: !153, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_data_node", file: !6, line: 129, size: 192, align: 64, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "begin_position", scope: !154, file: !6, line: 130, baseType: !52, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !154, file: !6, line: 131, baseType: !52, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !6, line: 132, baseType: !123, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bidders", scope: !5, file: !6, line: 173, baseType: !160, size: 6144, align: 64, offset: 2112)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 6144, align: 64, elements: !221)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter_bidder", file: !6, line: 60, size: 384, align: 64, elements: !162)
!162 = !{!163, !164, !165, !212, !213, !217}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !6, line: 62, baseType: !123, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !6, line: 64, baseType: !80, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !161, file: !6, line: 66, baseType: !166, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!23, !169, !170}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter", file: !6, line: 82, size: 1408, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !181, !185, !189, !193, !194, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !171, file: !6, line: 83, baseType: !52, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bidder", scope: !171, file: !6, line: 86, baseType: !169, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !171, file: !6, line: 87, baseType: !170, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !171, file: !6, line: 88, baseType: !4, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !171, file: !6, line: 90, baseType: !178, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!23, !170}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !171, file: !6, line: 92, baseType: !182, size: 64, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!38, !170, !64}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !171, file: !6, line: 94, baseType: !186, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!52, !170, !52}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !171, file: !6, line: 96, baseType: !190, size: 64, align: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!52, !170, !52, !23}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !171, file: !6, line: 98, baseType: !178, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sswitch", scope: !171, file: !6, line: 100, baseType: !195, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!23, !170, !13}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !6, line: 102, baseType: !123, size: 64, align: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !6, line: 104, baseType: !80, size: 64, align: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !171, file: !6, line: 105, baseType: !23, size: 32, align: 32, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !171, file: !6, line: 108, baseType: !95, size: 64, align: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !171, file: !6, line: 109, baseType: !45, size: 64, align: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !6, line: 110, baseType: !95, size: 64, align: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !171, file: !6, line: 111, baseType: !45, size: 64, align: 64, offset: 1024)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "client_buff", scope: !171, file: !6, line: 112, baseType: !43, size: 64, align: 64, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "client_total", scope: !171, file: !6, line: 113, baseType: !45, size: 64, align: 64, offset: 1152)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "client_next", scope: !171, file: !6, line: 114, baseType: !80, size: 64, align: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "client_avail", scope: !171, file: !6, line: 115, baseType: !45, size: 64, align: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_file", scope: !171, file: !6, line: 116, baseType: !82, size: 8, align: 8, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !171, file: !6, line: 117, baseType: !82, size: 8, align: 8, offset: 1352)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !171, file: !6, line: 118, baseType: !82, size: 8, align: 8, offset: 1360)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !161, file: !6, line: 69, baseType: !178, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !161, file: !6, line: 71, baseType: !214, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!23, !169, !80, !80}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !161, file: !6, line: 74, baseType: !218, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!23, !169}
!221 = !{!222}
!222 = !DISubrange(count: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !5, file: !6, line: 176, baseType: !170, size: 64, align: 64, offset: 8256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_filter_bidding", scope: !5, file: !6, line: 179, baseType: !23, size: 32, align: 32, offset: 8320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "header_position", scope: !5, file: !6, line: 182, baseType: !52, size: 64, align: 64, offset: 8384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data_start_node", scope: !5, file: !6, line: 185, baseType: !13, size: 32, align: 32, offset: 8448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data_end_node", scope: !5, file: !6, line: 186, baseType: !13, size: 32, align: 32, offset: 8480)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !5, file: !6, line: 209, baseType: !229, size: 11264, align: 64, offset: 8512)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 11264, align: 64, elements: !221)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_format_descriptor", file: !6, line: 196, size: 704, align: 64, elements: !231)
!231 = !{!232, !233, !234, !238, !242, !246, !250, !254, !258, !259, !260}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !6, line: 197, baseType: !123, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !6, line: 198, baseType: !80, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !230, file: !6, line: 199, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!23, !4, !23}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !230, file: !6, line: 200, baseType: !239, size: 64, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!23, !4, !80, !80}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !230, file: !6, line: 202, baseType: !243, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!23, !4, !30}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "read_data", scope: !230, file: !6, line: 203, baseType: !247, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!23, !4, !64, !65, !66}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_skip", scope: !230, file: !6, line: 204, baseType: !251, size: 64, align: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!23, !4}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "seek_data", scope: !230, file: !6, line: 205, baseType: !255, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!52, !4, !52, !23}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !230, file: !6, line: 206, baseType: !251, size: 64, align: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "format_capabilties", scope: !230, file: !6, line: 207, baseType: !251, size: 64, align: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "has_encrypted_entries", scope: !230, file: !6, line: 208, baseType: !251, size: 64, align: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !5, file: !6, line: 210, baseType: !262, size: 64, align: 64, offset: 19776)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !5, file: !6, line: 215, baseType: !264, size: 64, align: 64, offset: 19840)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_extract", file: !6, line: 151, size: 192, align: 64, elements: !266)
!266 = !{!267, !268, !272}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !265, file: !6, line: 152, baseType: !24, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress", scope: !265, file: !6, line: 155, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !123}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress_user_data", scope: !265, file: !6, line: 156, baseType: !123, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_archive_extract", scope: !5, file: !6, line: 216, baseType: !251, size: 64, align: 64, offset: 19904)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !5, file: !6, line: 227, baseType: !275, size: 320, align: 64, offset: 19968)
!275 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !6, line: 221, size: 320, align: 64, elements: !276)
!276 = !{!277, !283, !285, !286, !291}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !275, file: !6, line: 222, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_passphrase", file: !6, line: 146, size: 128, align: 64, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !279, file: !6, line: 147, baseType: !95, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !6, line: 148, baseType: !278, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !275, file: !6, line: 223, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !275, file: !6, line: 224, baseType: !23, size: 32, align: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !275, file: !6, line: 225, baseType: !287, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !32, line: 256, baseType: !289)
!289 = !DISubroutineType(types: !290)
!290 = !{!80, !24, !123}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !275, file: !6, line: 226, baseType: !123, size: 64, align: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "iso9660", file: !1, line: 316, size: 20608, align: 64, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !304, !375, !386, !387, !388, !389, !395, !400, !405, !406, !407, !408, !410, !415, !416, !417, !418, !419, !478, !479, !480, !481, !482, !483, !484}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !293, file: !1, line: 317, baseType: !23, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "opt_support_joliet", scope: !293, file: !1, line: 320, baseType: !23, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "opt_support_rockridge", scope: !293, file: !1, line: 321, baseType: !23, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !293, file: !1, line: 323, baseType: !91, size: 192, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "seenRockridge", scope: !293, file: !1, line: 324, baseType: !82, size: 8, align: 8, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "seenSUSP", scope: !293, file: !1, line: 325, baseType: !82, size: 8, align: 8, offset: 328)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "seenJoliet", scope: !293, file: !1, line: 326, baseType: !82, size: 8, align: 8, offset: 336)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "suspOffset", scope: !293, file: !1, line: 328, baseType: !303, size: 8, align: 8, offset: 344)
!303 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rr_moved", scope: !293, file: !1, line: 329, baseType: !305, size: 64, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_info", file: !1, line: 261, size: 2432, align: 64, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !330, !331, !332, !333, !334, !338, !341, !344, !345, !346, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !369}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "use_next", scope: !306, file: !1, line: 262, baseType: !305, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !306, file: !1, line: 263, baseType: !305, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !1, line: 264, baseType: !305, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "re_next", scope: !306, file: !1, line: 265, baseType: !305, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !306, file: !1, line: 266, baseType: !23, size: 32, align: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !306, file: !1, line: 267, baseType: !314, size: 64, align: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 55, baseType: !47)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !306, file: !1, line: 268, baseType: !314, size: 64, align: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !306, file: !1, line: 269, baseType: !314, size: 64, align: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ce_offset", scope: !306, file: !1, line: 270, baseType: !318, size: 32, align: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 51, baseType: !13)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ce_size", scope: !306, file: !1, line: 271, baseType: !318, size: 32, align: 32, offset: 544)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rr_moved", scope: !306, file: !1, line: 272, baseType: !82, size: 8, align: 8, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rr_moved_has_re_only", scope: !306, file: !1, line: 273, baseType: !82, size: 8, align: 8, offset: 584)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !306, file: !1, line: 274, baseType: !82, size: 8, align: 8, offset: 592)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "re_descendant", scope: !306, file: !1, line: 275, baseType: !82, size: 8, align: 8, offset: 600)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cl_offset", scope: !306, file: !1, line: 276, baseType: !314, size: 64, align: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "birthtime_is_set", scope: !306, file: !1, line: 277, baseType: !23, size: 32, align: 32, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "birthtime", scope: !306, file: !1, line: 278, baseType: !327, size: 64, align: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !328, line: 75, baseType: !329)
!328 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 139, baseType: !42)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !306, file: !1, line: 279, baseType: !327, size: 64, align: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !306, file: !1, line: 280, baseType: !327, size: 64, align: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !306, file: !1, line: 281, baseType: !327, size: 64, align: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !306, file: !1, line: 282, baseType: !314, size: 64, align: 64, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !306, file: !1, line: 283, baseType: !335, size: 32, align: 32, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !336, line: 70, baseType: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 129, baseType: !13)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !306, file: !1, line: 284, baseType: !339, size: 32, align: 32, offset: 1120)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !336, line: 80, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 125, baseType: !13)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !306, file: !1, line: 285, baseType: !342, size: 32, align: 32, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !336, line: 65, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 126, baseType: !13)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !306, file: !1, line: 286, baseType: !52, size: 64, align: 64, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nlinks", scope: !306, file: !1, line: 287, baseType: !23, size: 32, align: 32, offset: 1280)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !1, line: 288, baseType: !91, size: 192, align: 64, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be_name", scope: !306, file: !1, line: 289, baseType: !348, size: 64, align: 64, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be_bytes", scope: !306, file: !1, line: 290, baseType: !45, size: 64, align: 64, offset: 1600)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name_continues", scope: !306, file: !1, line: 291, baseType: !82, size: 8, align: 8, offset: 1664)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !306, file: !1, line: 292, baseType: !91, size: 192, align: 64, offset: 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "symlink_continues", scope: !306, file: !1, line: 293, baseType: !82, size: 8, align: 8, offset: 1920)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pz", scope: !306, file: !1, line: 295, baseType: !23, size: 32, align: 32, offset: 1952)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pz_log2_bs", scope: !306, file: !1, line: 296, baseType: !23, size: 32, align: 32, offset: 1984)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pz_uncompressed_size", scope: !306, file: !1, line: 297, baseType: !314, size: 64, align: 64, offset: 2048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "multi_extent", scope: !306, file: !1, line: 299, baseType: !23, size: 32, align: 32, offset: 2112)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !306, file: !1, line: 303, baseType: !358, size: 128, align: 64, offset: 2176)
!358 = !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !1, line: 300, size: 128, align: 64, elements: !359)
!359 = !{!360, !367}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !358, file: !1, line: 301, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "content", file: !1, line: 254, size: 192, align: 64, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !362, file: !1, line: 255, baseType: !314, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !362, file: !1, line: 256, baseType: !314, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !1, line: 257, baseType: !361, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !358, file: !1, line: 302, baseType: !368, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rede_files", scope: !306, file: !1, line: 307, baseType: !370, size: 128, align: 64, offset: 2304)
!370 = !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !1, line: 304, size: 128, align: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !370, file: !1, line: 305, baseType: !305, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !370, file: !1, line: 306, baseType: !374, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "read_ce_req", scope: !293, file: !1, line: 337, baseType: !376, size: 128, align: 64, offset: 448)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "read_ce_queue", file: !1, line: 330, size: 128, align: 64, elements: !377)
!377 = !{!378, !384, !385}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !376, file: !1, line: 334, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "read_ce_req", file: !1, line: 331, size: 128, align: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !380, file: !1, line: 332, baseType: !314, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !380, file: !1, line: 333, baseType: !305, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !376, file: !1, line: 335, baseType: !23, size: 32, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !376, file: !1, line: 336, baseType: !23, size: 32, align: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "previous_number", scope: !293, file: !1, line: 339, baseType: !52, size: 64, align: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "previous_pathname", scope: !293, file: !1, line: 340, baseType: !91, size: 192, align: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "use_files", scope: !293, file: !1, line: 342, baseType: !305, size: 64, align: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pending_files", scope: !293, file: !1, line: 343, baseType: !390, size: 128, align: 64, offset: 896)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "heap_queue", file: !1, line: 310, size: 128, align: 64, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !390, file: !1, line: 311, baseType: !374, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !390, file: !1, line: 312, baseType: !23, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !390, file: !1, line: 313, baseType: !23, size: 32, align: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cache_files", scope: !293, file: !1, line: 347, baseType: !396, size: 128, align: 64, offset: 1024)
!396 = !DICompositeType(tag: DW_TAG_structure_type, scope: !293, file: !1, line: 344, size: 128, align: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !396, file: !1, line: 345, baseType: !305, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !396, file: !1, line: 346, baseType: !374, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "re_files", scope: !293, file: !1, line: 351, baseType: !401, size: 128, align: 64, offset: 1152)
!401 = !DICompositeType(tag: DW_TAG_structure_type, scope: !293, file: !1, line: 348, size: 128, align: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !401, file: !1, line: 349, baseType: !305, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !401, file: !1, line: 350, baseType: !374, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "current_position", scope: !293, file: !1, line: 353, baseType: !314, size: 64, align: 64, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "logical_block_size", scope: !293, file: !1, line: 354, baseType: !38, size: 64, align: 64, offset: 1344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "volume_size", scope: !293, file: !1, line: 355, baseType: !314, size: 64, align: 64, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "volume_block", scope: !293, file: !1, line: 356, baseType: !409, size: 32, align: 32, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !53, line: 38, baseType: !23)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !293, file: !1, line: 361, baseType: !411, size: 64, align: 32, offset: 1504)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "vd", file: !1, line: 358, size: 64, align: 32, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !411, file: !1, line: 359, baseType: !23, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !411, file: !1, line: 360, baseType: !318, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "joliet", scope: !293, file: !1, line: 361, baseType: !411, size: 64, align: 32, offset: 1568)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "entry_sparse_offset", scope: !293, file: !1, line: 363, baseType: !52, size: 64, align: 64, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "entry_bytes_remaining", scope: !293, file: !1, line: 364, baseType: !52, size: 64, align: 64, offset: 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "entry_bytes_unconsumed", scope: !293, file: !1, line: 365, baseType: !45, size: 64, align: 64, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "entry_zisofs", scope: !293, file: !1, line: 366, baseType: !420, size: 1984, align: 64, offset: 1856)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "zisofs", file: !1, line: 223, size: 1984, align: 64, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !477}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pz", scope: !420, file: !1, line: 225, baseType: !23, size: 32, align: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pz_log2_bs", scope: !420, file: !1, line: 226, baseType: !23, size: 32, align: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pz_uncompressed_size", scope: !420, file: !1, line: 227, baseType: !314, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !420, file: !1, line: 229, baseType: !23, size: 32, align: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_buffer", scope: !420, file: !1, line: 230, baseType: !348, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_buffer_size", scope: !420, file: !1, line: 231, baseType: !45, size: 64, align: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pz_offset", scope: !420, file: !1, line: 233, baseType: !318, size: 32, align: 32, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !420, file: !1, line: 234, baseType: !430, size: 128, align: 8, offset: 352)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 128, align: 8, elements: !221)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "header_avail", scope: !420, file: !1, line: 235, baseType: !45, size: 64, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "header_passed", scope: !420, file: !1, line: 236, baseType: !23, size: 32, align: 32, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers", scope: !420, file: !1, line: 237, baseType: !348, size: 64, align: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_alloc", scope: !420, file: !1, line: 238, baseType: !45, size: 64, align: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_size", scope: !420, file: !1, line: 239, baseType: !45, size: 64, align: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "block_pointers_avail", scope: !420, file: !1, line: 240, baseType: !45, size: 64, align: 64, offset: 832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "block_off", scope: !420, file: !1, line: 241, baseType: !45, size: 64, align: 64, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "block_avail", scope: !420, file: !1, line: 242, baseType: !318, size: 32, align: 32, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !420, file: !1, line: 244, baseType: !440, size: 896, align: 64, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !441, line: 101, baseType: !442)
!441 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !441, line: 82, size: 896, align: 64, elements: !443)
!443 = !{!444, !449, !451, !453, !454, !455, !456, !457, !462, !468, !473, !474, !475, !476}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !442, file: !441, line: 83, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !447, line: 276, baseType: !448)
!447 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zconf.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !447, line: 267, baseType: !303)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !442, file: !441, line: 84, baseType: !450, size: 32, align: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !447, line: 269, baseType: !13)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !442, file: !441, line: 85, baseType: !452, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !447, line: 270, baseType: !47)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !442, file: !441, line: 87, baseType: !445, size: 64, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !442, file: !441, line: 88, baseType: !450, size: 32, align: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !442, file: !441, line: 89, baseType: !452, size: 64, align: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !442, file: !441, line: 91, baseType: !95, size: 64, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !442, file: !441, line: 92, baseType: !458, size: 64, align: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !441, line: 1346, size: 32, align: 32, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !459, file: !441, line: 1346, baseType: !23, size: 32, align: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !442, file: !441, line: 94, baseType: !463, size: 64, align: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !441, line: 77, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !467, !450, !450}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !447, line: 285, baseType: !123)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !442, file: !441, line: 95, baseType: !469, size: 64, align: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !441, line: 78, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !467, !467}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !442, file: !441, line: 96, baseType: !467, size: 64, align: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !442, file: !441, line: 98, baseType: !23, size: 32, align: 32, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !442, file: !441, line: 99, baseType: !452, size: 64, align: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !442, file: !441, line: 100, baseType: !452, size: 64, align: 64, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stream_valid", scope: !420, file: !1, line: 245, baseType: !23, size: 32, align: 32, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "entry_content", scope: !293, file: !1, line: 367, baseType: !361, size: 64, align: 64, offset: 3840)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sconv_utf16be", scope: !293, file: !1, line: 368, baseType: !102, size: 64, align: 64, offset: 3904)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be_path", scope: !293, file: !1, line: 373, baseType: !348, size: 64, align: 64, offset: 3968)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be_path_len", scope: !293, file: !1, line: 374, baseType: !45, size: 64, align: 64, offset: 4032)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be_previous_path", scope: !293, file: !1, line: 375, baseType: !348, size: 64, align: 64, offset: 4096)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "utf16be_previous_path_len", scope: !293, file: !1, line: 376, baseType: !45, size: 64, align: 64, offset: 4160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !293, file: !1, line: 378, baseType: !485, size: 16384, align: 8, offset: 4224)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 16384, align: 8, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 2048)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !336, line: 60, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 124, baseType: !47)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !53, line: 134, baseType: !42)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 122, baseType: !47)
!497 = !{!498, !499, !500, !503, !506, !512, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !527, !530, !533, !536, !553, !556, !559, !562, !563, !564, !565, !566, !569, !573, !576, !577, !580, !583, !584, !585, !588, !591, !592, !595, !596, !600, !603, !607, !608, !609, !610, !611}
!498 = distinct !DISubprogram(name: "archive_read_support_format_iso9660", scope: !1, file: !1, line: 447, type: !21, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!499 = distinct !DISubprogram(name: "archive_read_format_iso9660_bid", scope: !1, file: !1, line: 494, type: !236, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!500 = distinct !DISubprogram(name: "isPVD", scope: !1, file: !1, line: 861, type: !501, isLocal: true, isDefinition: true, scopeLine: 862, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!501 = !DISubroutineType(types: !502)
!502 = !{!23, !292, !488}
!503 = distinct !DISubprogram(name: "isNull", scope: !1, file: !1, line: 596, type: !504, isLocal: true, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!504 = !DISubroutineType(types: !505)
!505 = !{!23, !292, !488, !13, !13}
!506 = distinct !DISubprogram(name: "archive_le16dec", scope: !507, file: !507, line: 101, type: !508, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!507 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_endian.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !43}
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !53, line: 49, baseType: !511)
!511 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!512 = distinct !DISubprogram(name: "archive_le32dec", scope: !507, file: !507, line: 115, type: !513, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!513 = !DISubroutineType(types: !514)
!514 = !{!318, !43}
!515 = distinct !DISubprogram(name: "archive_be32dec", scope: !507, file: !507, line: 77, type: !513, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!516 = distinct !DISubprogram(name: "isJolietSVD", scope: !1, file: !1, line: 675, type: !501, isLocal: true, isDefinition: true, scopeLine: 676, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!517 = distinct !DISubprogram(name: "isBootRecord", scope: !1, file: !1, line: 613, type: !501, isLocal: true, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!518 = distinct !DISubprogram(name: "isEVD", scope: !1, file: !1, line: 783, type: !501, isLocal: true, isDefinition: true, scopeLine: 784, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!519 = distinct !DISubprogram(name: "isSVD", scope: !1, file: !1, line: 724, type: !501, isLocal: true, isDefinition: true, scopeLine: 725, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!520 = distinct !DISubprogram(name: "isVolumePartition", scope: !1, file: !1, line: 629, type: !501, isLocal: true, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!521 = distinct !DISubprogram(name: "isVDSetTerminator", scope: !1, file: !1, line: 655, type: !501, isLocal: true, isDefinition: true, scopeLine: 656, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!522 = distinct !DISubprogram(name: "archive_read_format_iso9660_options", scope: !1, file: !1, line: 566, type: !240, isLocal: true, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!523 = distinct !DISubprogram(name: "archive_read_format_iso9660_read_header", scope: !1, file: !1, line: 1166, type: !244, isLocal: true, isDefinition: true, scopeLine: 1168, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!524 = distinct !DISubprogram(name: "choose_volume", scope: !1, file: !1, line: 1078, type: !525, isLocal: true, isDefinition: true, scopeLine: 1079, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!525 = !DISubroutineType(types: !526)
!526 = !{!23, !4, !292}
!527 = distinct !DISubprogram(name: "parse_file_info", scope: !1, file: !1, line: 1751, type: !528, isLocal: true, isDefinition: true, scopeLine: 1753, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!528 = !DISubroutineType(types: !529)
!529 = !{!305, !4, !305, !488}
!530 = distinct !DISubprogram(name: "toi", scope: !1, file: !1, line: 3102, type: !531, isLocal: true, isDefinition: true, scopeLine: 3103, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!531 = !DISubroutineType(types: !532)
!532 = !{!13, !43, !23}
!533 = distinct !DISubprogram(name: "isodate7", scope: !1, file: !1, line: 3113, type: !534, isLocal: true, isDefinition: true, scopeLine: 3114, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!534 = !DISubroutineType(types: !535)
!535 = !{!327, !488}
!536 = distinct !DISubprogram(name: "time_from_tm", scope: !1, file: !1, line: 3167, type: !537, isLocal: true, isDefinition: true, scopeLine: 3168, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!537 = !DISubroutineType(types: !538)
!538 = !{!327, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !328, line: 133, size: 448, align: 64, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !540, file: !328, line: 135, baseType: !23, size: 32, align: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !540, file: !328, line: 136, baseType: !23, size: 32, align: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !540, file: !328, line: 137, baseType: !23, size: 32, align: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !540, file: !328, line: 138, baseType: !23, size: 32, align: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !540, file: !328, line: 139, baseType: !23, size: 32, align: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !540, file: !328, line: 140, baseType: !23, size: 32, align: 32, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !540, file: !328, line: 141, baseType: !23, size: 32, align: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !540, file: !328, line: 142, baseType: !23, size: 32, align: 32, offset: 224)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !540, file: !328, line: 143, baseType: !23, size: 32, align: 32, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !540, file: !328, line: 146, baseType: !42, size: 64, align: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !540, file: !328, line: 147, baseType: !80, size: 64, align: 64, offset: 384)
!553 = distinct !DISubprogram(name: "parse_rockridge", scope: !1, file: !1, line: 2096, type: !554, isLocal: true, isDefinition: true, scopeLine: 2098, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!554 = !DISubroutineType(types: !555)
!555 = !{!23, !4, !305, !488, !488}
!556 = distinct !DISubprogram(name: "register_CE", scope: !1, file: !1, line: 2260, type: !557, isLocal: true, isDefinition: true, scopeLine: 2262, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!557 = !DISubroutineType(types: !558)
!558 = !{!23, !4, !409, !305}
!559 = distinct !DISubprogram(name: "parse_rockridge_NM1", scope: !1, file: !1, line: 2422, type: !560, isLocal: true, isDefinition: true, scopeLine: 2424, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !305, !488, !23}
!562 = distinct !DISubprogram(name: "parse_rockridge_SL1", scope: !1, file: !1, line: 2540, type: !560, isLocal: true, isDefinition: true, scopeLine: 2542, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!563 = distinct !DISubprogram(name: "parse_rockridge_TF1", scope: !1, file: !1, line: 2467, type: !560, isLocal: true, isDefinition: true, scopeLine: 2469, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!564 = distinct !DISubprogram(name: "isodate17", scope: !1, file: !1, line: 3139, type: !534, isLocal: true, isDefinition: true, scopeLine: 3140, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!565 = distinct !DISubprogram(name: "parse_rockridge_ZF1", scope: !1, file: !1, line: 2627, type: !560, isLocal: true, isDefinition: true, scopeLine: 2629, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!566 = distinct !DISubprogram(name: "register_file", scope: !1, file: !1, line: 2640, type: !567, isLocal: true, isDefinition: true, scopeLine: 2641, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !292, !305}
!569 = distinct !DISubprogram(name: "heap_add_entry", scope: !1, file: !1, line: 2998, type: !570, isLocal: true, isDefinition: true, scopeLine: 3000, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!570 = !DISubroutineType(types: !571)
!571 = !{!23, !4, !572, !305, !314}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!573 = distinct !DISubprogram(name: "next_entry_seek", scope: !1, file: !1, line: 2672, type: !574, isLocal: true, isDefinition: true, scopeLine: 2674, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!574 = !DISubroutineType(types: !575)
!575 = !{!23, !4, !292, !374}
!576 = distinct !DISubprogram(name: "next_cache_entry", scope: !1, file: !1, line: 2710, type: !574, isLocal: true, isDefinition: true, scopeLine: 2712, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!577 = distinct !DISubprogram(name: "cache_get_entry", scope: !1, file: !1, line: 2984, type: !578, isLocal: true, isDefinition: true, scopeLine: 2985, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!578 = !DISubroutineType(types: !579)
!579 = !{!305, !292}
!580 = distinct !DISubprogram(name: "heap_get_entry", scope: !1, file: !1, line: 3055, type: !581, isLocal: true, isDefinition: true, scopeLine: 3056, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!581 = !DISubroutineType(types: !582)
!582 = !{!305, !572}
!583 = distinct !DISubprogram(name: "cache_add_entry", scope: !1, file: !1, line: 2976, type: !567, isLocal: true, isDefinition: true, scopeLine: 2977, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!584 = distinct !DISubprogram(name: "re_get_entry", scope: !1, file: !1, line: 2928, type: !578, isLocal: true, isDefinition: true, scopeLine: 2929, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!585 = distinct !DISubprogram(name: "rede_get_entry", scope: !1, file: !1, line: 2962, type: !586, isLocal: true, isDefinition: true, scopeLine: 2963, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!586 = !DISubroutineType(types: !587)
!587 = !{!305, !305}
!588 = distinct !DISubprogram(name: "rede_add_entry", scope: !1, file: !1, line: 2942, type: !589, isLocal: true, isDefinition: true, scopeLine: 2943, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!589 = !DISubroutineType(types: !590)
!590 = !{!23, !305}
!591 = distinct !DISubprogram(name: "re_add_entry", scope: !1, file: !1, line: 2920, type: !567, isLocal: true, isDefinition: true, scopeLine: 2921, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!592 = distinct !DISubprogram(name: "read_children", scope: !1, file: !1, line: 955, type: !593, isLocal: true, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!593 = !DISubroutineType(types: !594)
!594 = !{!23, !4, !305}
!595 = distinct !DISubprogram(name: "read_CE", scope: !1, file: !1, line: 2375, type: !525, isLocal: true, isDefinition: true, scopeLine: 2376, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!596 = distinct !DISubprogram(name: "next_CE", scope: !1, file: !1, line: 2332, type: !597, isLocal: true, isDefinition: true, scopeLine: 2333, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!600 = distinct !DISubprogram(name: "build_pathname_utf16be", scope: !1, file: !1, line: 3213, type: !601, isLocal: true, isDefinition: true, scopeLine: 3215, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!601 = !DISubroutineType(types: !602)
!602 = !{!23, !348, !45, !65, !305}
!603 = distinct !DISubprogram(name: "build_pathname", scope: !1, file: !1, line: 3192, type: !604, isLocal: true, isDefinition: true, scopeLine: 3193, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!604 = !DISubroutineType(types: !605)
!605 = !{!80, !606, !305, !23}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!607 = distinct !DISubprogram(name: "archive_read_format_iso9660_read_data_skip", scope: !1, file: !1, line: 1398, type: !252, isLocal: true, isDefinition: true, scopeLine: 1399, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!608 = distinct !DISubprogram(name: "archive_read_format_iso9660_read_data", scope: !1, file: !1, line: 1648, type: !248, isLocal: true, isDefinition: true, scopeLine: 1650, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!609 = distinct !DISubprogram(name: "zisofs_read_data", scope: !1, file: !1, line: 1409, type: !248, isLocal: true, isDefinition: true, scopeLine: 1411, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!610 = distinct !DISubprogram(name: "archive_read_format_iso9660_cleanup", scope: !1, file: !1, line: 1716, type: !252, isLocal: true, isDefinition: true, scopeLine: 1717, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!611 = distinct !DISubprogram(name: "release_files", scope: !1, file: !1, line: 2648, type: !612, isLocal: true, isDefinition: true, scopeLine: 2649, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !292}
!614 = !{!615}
!615 = !DIGlobalVariable(name: "zisofs_magic", scope: !0, file: !1, line: 219, type: !616, isLocal: true, isDefinition: true, variable: [8 x i8]* @zisofs_magic)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 64, align: 8, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 8)
!619 = !{i32 2, !"Dwarf Version", i32 4}
!620 = !{i32 2, !"Debug Info Version", i32 3}
!621 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!622 = !DILocalVariable(name: "_a", arg: 1, scope: !498, file: !1, line: 447, type: !24)
!623 = !DIExpression()
!624 = !DILocation(line: 447, column: 53, scope: !498)
!625 = !DILocalVariable(name: "a", scope: !498, file: !1, line: 449, type: !4)
!626 = !DILocation(line: 449, column: 23, scope: !498)
!627 = !DILocation(line: 449, column: 50, scope: !498)
!628 = !DILocation(line: 449, column: 27, scope: !498)
!629 = !DILocalVariable(name: "iso9660", scope: !498, file: !1, line: 450, type: !292)
!630 = !DILocation(line: 450, column: 18, scope: !498)
!631 = !DILocalVariable(name: "r", scope: !498, file: !1, line: 451, type: !23)
!632 = !DILocation(line: 451, column: 6, scope: !498)
!633 = !DILocation(line: 453, column: 2, scope: !498)
!634 = !DILocalVariable(name: "magic_test", scope: !635, file: !1, line: 453, type: !23)
!635 = distinct !DILexicalBlock(scope: !498, file: !1, line: 453, column: 2)
!636 = !DILocation(line: 453, column: 2, scope: !635)
!637 = !DILocation(line: 453, column: 2, scope: !638)
!638 = !DILexicalBlockFile(scope: !635, file: !1, discriminator: 1)
!639 = !DILocation(line: 453, column: 2, scope: !640)
!640 = !DILexicalBlockFile(scope: !641, file: !1, discriminator: 2)
!641 = distinct !DILexicalBlock(scope: !635, file: !1, line: 453, column: 2)
!642 = !DILocation(line: 453, column: 2, scope: !643)
!643 = !DILexicalBlockFile(scope: !635, file: !1, discriminator: 3)
!644 = !DILocation(line: 456, column: 30, scope: !498)
!645 = !DILocation(line: 456, column: 12, scope: !498)
!646 = !DILocation(line: 456, column: 10, scope: !498)
!647 = !DILocation(line: 457, column: 6, scope: !648)
!648 = distinct !DILexicalBlock(scope: !498, file: !1, line: 457, column: 6)
!649 = !DILocation(line: 457, column: 14, scope: !648)
!650 = !DILocation(line: 457, column: 6, scope: !498)
!651 = !DILocation(line: 458, column: 22, scope: !652)
!652 = distinct !DILexicalBlock(scope: !648, file: !1, line: 457, column: 23)
!653 = !DILocation(line: 458, column: 25, scope: !652)
!654 = !DILocation(line: 458, column: 3, scope: !652)
!655 = !DILocation(line: 460, column: 3, scope: !652)
!656 = !DILocation(line: 462, column: 2, scope: !498)
!657 = !DILocation(line: 462, column: 11, scope: !498)
!658 = !DILocation(line: 462, column: 17, scope: !498)
!659 = !DILocation(line: 463, column: 2, scope: !498)
!660 = !DILocation(line: 463, column: 11, scope: !498)
!661 = !DILocation(line: 463, column: 23, scope: !498)
!662 = !DILocation(line: 463, column: 29, scope: !498)
!663 = !DILocation(line: 464, column: 32, scope: !498)
!664 = !DILocation(line: 464, column: 41, scope: !498)
!665 = !DILocation(line: 464, column: 53, scope: !498)
!666 = !DILocation(line: 464, column: 2, scope: !498)
!667 = !DILocation(line: 464, column: 11, scope: !498)
!668 = !DILocation(line: 464, column: 23, scope: !498)
!669 = !DILocation(line: 464, column: 28, scope: !498)
!670 = !DILocation(line: 465, column: 2, scope: !498)
!671 = !DILocation(line: 465, column: 11, scope: !498)
!672 = !DILocation(line: 465, column: 20, scope: !498)
!673 = !DILocation(line: 465, column: 26, scope: !498)
!674 = !DILocation(line: 466, column: 29, scope: !498)
!675 = !DILocation(line: 466, column: 38, scope: !498)
!676 = !DILocation(line: 466, column: 47, scope: !498)
!677 = !DILocation(line: 466, column: 2, scope: !498)
!678 = !DILocation(line: 466, column: 11, scope: !498)
!679 = !DILocation(line: 466, column: 20, scope: !498)
!680 = !DILocation(line: 466, column: 25, scope: !498)
!681 = !DILocation(line: 468, column: 2, scope: !498)
!682 = !DILocation(line: 468, column: 11, scope: !498)
!683 = !DILocation(line: 468, column: 30, scope: !498)
!684 = !DILocation(line: 470, column: 2, scope: !498)
!685 = !DILocation(line: 470, column: 11, scope: !498)
!686 = !DILocation(line: 470, column: 33, scope: !498)
!687 = !DILocation(line: 472, column: 37, scope: !498)
!688 = !DILocation(line: 473, column: 6, scope: !498)
!689 = !DILocation(line: 472, column: 6, scope: !498)
!690 = !DILocation(line: 472, column: 4, scope: !498)
!691 = !DILocation(line: 485, column: 6, scope: !692)
!692 = distinct !DILexicalBlock(scope: !498, file: !1, line: 485, column: 6)
!693 = !DILocation(line: 485, column: 8, scope: !692)
!694 = !DILocation(line: 485, column: 6, scope: !498)
!695 = !DILocation(line: 486, column: 8, scope: !696)
!696 = distinct !DILexicalBlock(scope: !692, file: !1, line: 485, column: 23)
!697 = !DILocation(line: 486, column: 3, scope: !696)
!698 = !DILocation(line: 487, column: 11, scope: !696)
!699 = !DILocation(line: 487, column: 3, scope: !696)
!700 = !DILocation(line: 489, column: 2, scope: !498)
!701 = !DILocation(line: 490, column: 1, scope: !498)
!702 = !DILocalVariable(name: "a", arg: 1, scope: !499, file: !1, line: 494, type: !4)
!703 = !DILocation(line: 494, column: 54, scope: !499)
!704 = !DILocalVariable(name: "best_bid", arg: 2, scope: !499, file: !1, line: 494, type: !23)
!705 = !DILocation(line: 494, column: 61, scope: !499)
!706 = !DILocalVariable(name: "iso9660", scope: !499, file: !1, line: 496, type: !292)
!707 = !DILocation(line: 496, column: 18, scope: !499)
!708 = !DILocalVariable(name: "bytes_read", scope: !499, file: !1, line: 497, type: !38)
!709 = !DILocation(line: 497, column: 10, scope: !499)
!710 = !DILocalVariable(name: "p", scope: !499, file: !1, line: 498, type: !488)
!711 = !DILocation(line: 498, column: 23, scope: !499)
!712 = !DILocalVariable(name: "seenTerminator", scope: !499, file: !1, line: 499, type: !23)
!713 = !DILocation(line: 499, column: 6, scope: !499)
!714 = !DILocation(line: 503, column: 6, scope: !715)
!715 = distinct !DILexicalBlock(scope: !499, file: !1, line: 503, column: 6)
!716 = !DILocation(line: 503, column: 15, scope: !715)
!717 = !DILocation(line: 503, column: 6, scope: !499)
!718 = !DILocation(line: 504, column: 3, scope: !715)
!719 = !DILocation(line: 506, column: 31, scope: !499)
!720 = !DILocation(line: 506, column: 34, scope: !499)
!721 = !DILocation(line: 506, column: 42, scope: !499)
!722 = !DILocation(line: 506, column: 12, scope: !499)
!723 = !DILocation(line: 506, column: 10, scope: !499)
!724 = !DILocation(line: 514, column: 27, scope: !499)
!725 = !DILocation(line: 514, column: 6, scope: !499)
!726 = !DILocation(line: 514, column: 4, scope: !499)
!727 = !DILocation(line: 517, column: 6, scope: !728)
!728 = distinct !DILexicalBlock(scope: !499, file: !1, line: 517, column: 6)
!729 = !DILocation(line: 517, column: 8, scope: !728)
!730 = !DILocation(line: 517, column: 6, scope: !499)
!731 = !DILocation(line: 518, column: 6, scope: !728)
!732 = !DILocation(line: 521, column: 13, scope: !499)
!733 = !DILocation(line: 522, column: 4, scope: !499)
!734 = !DILocation(line: 525, column: 17, scope: !499)
!735 = !DILocation(line: 526, column: 2, scope: !499)
!736 = !DILocation(line: 526, column: 9, scope: !737)
!737 = !DILexicalBlockFile(scope: !738, file: !1, discriminator: 1)
!738 = distinct !DILexicalBlock(scope: !739, file: !1, line: 526, column: 2)
!739 = distinct !DILexicalBlock(scope: !499, file: !1, line: 526, column: 2)
!740 = !DILocation(line: 526, column: 20, scope: !737)
!741 = !DILocation(line: 526, column: 2, scope: !737)
!742 = !DILocation(line: 529, column: 7, scope: !743)
!743 = distinct !DILexicalBlock(scope: !744, file: !1, line: 529, column: 7)
!744 = distinct !DILexicalBlock(scope: !738, file: !1, line: 527, column: 65)
!745 = !DILocation(line: 529, column: 12, scope: !743)
!746 = !DILocation(line: 529, column: 17, scope: !743)
!747 = !DILocation(line: 529, column: 20, scope: !748)
!748 = !DILexicalBlockFile(scope: !743, file: !1, discriminator: 1)
!749 = !DILocation(line: 529, column: 25, scope: !748)
!750 = !DILocation(line: 529, column: 7, scope: !748)
!751 = !DILocation(line: 530, column: 4, scope: !743)
!752 = !DILocation(line: 532, column: 14, scope: !753)
!753 = distinct !DILexicalBlock(scope: !744, file: !1, line: 532, column: 7)
!754 = !DILocation(line: 532, column: 16, scope: !753)
!755 = !DILocation(line: 532, column: 7, scope: !753)
!756 = !DILocation(line: 532, column: 33, scope: !753)
!757 = !DILocation(line: 532, column: 7, scope: !744)
!758 = !DILocation(line: 533, column: 4, scope: !753)
!759 = !DILocation(line: 534, column: 13, scope: !760)
!760 = distinct !DILexicalBlock(scope: !744, file: !1, line: 534, column: 7)
!761 = !DILocation(line: 534, column: 22, scope: !760)
!762 = !DILocation(line: 534, column: 7, scope: !760)
!763 = !DILocation(line: 534, column: 7, scope: !744)
!764 = !DILocation(line: 535, column: 4, scope: !760)
!765 = !DILocation(line: 536, column: 8, scope: !766)
!766 = distinct !DILexicalBlock(scope: !744, file: !1, line: 536, column: 7)
!767 = !DILocation(line: 536, column: 17, scope: !766)
!768 = !DILocation(line: 536, column: 24, scope: !766)
!769 = !DILocation(line: 536, column: 7, scope: !744)
!770 = !DILocation(line: 537, column: 20, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !1, line: 537, column: 8)
!772 = distinct !DILexicalBlock(scope: !766, file: !1, line: 536, column: 34)
!773 = !DILocation(line: 537, column: 29, scope: !771)
!774 = !DILocation(line: 537, column: 8, scope: !771)
!775 = !DILocation(line: 537, column: 8, scope: !772)
!776 = !DILocation(line: 538, column: 5, scope: !771)
!777 = !DILocation(line: 539, column: 3, scope: !772)
!778 = !DILocation(line: 540, column: 20, scope: !779)
!779 = distinct !DILexicalBlock(scope: !744, file: !1, line: 540, column: 7)
!780 = !DILocation(line: 540, column: 29, scope: !779)
!781 = !DILocation(line: 540, column: 7, scope: !779)
!782 = !DILocation(line: 540, column: 7, scope: !744)
!783 = !DILocation(line: 541, column: 4, scope: !779)
!784 = !DILocation(line: 542, column: 13, scope: !785)
!785 = distinct !DILexicalBlock(scope: !744, file: !1, line: 542, column: 7)
!786 = !DILocation(line: 542, column: 22, scope: !785)
!787 = !DILocation(line: 542, column: 7, scope: !785)
!788 = !DILocation(line: 542, column: 7, scope: !744)
!789 = !DILocation(line: 543, column: 4, scope: !785)
!790 = !DILocation(line: 544, column: 13, scope: !791)
!791 = distinct !DILexicalBlock(scope: !744, file: !1, line: 544, column: 7)
!792 = !DILocation(line: 544, column: 22, scope: !791)
!793 = !DILocation(line: 544, column: 7, scope: !791)
!794 = !DILocation(line: 544, column: 7, scope: !744)
!795 = !DILocation(line: 545, column: 4, scope: !791)
!796 = !DILocation(line: 546, column: 25, scope: !797)
!797 = distinct !DILexicalBlock(scope: !744, file: !1, line: 546, column: 7)
!798 = !DILocation(line: 546, column: 34, scope: !797)
!799 = !DILocation(line: 546, column: 7, scope: !797)
!800 = !DILocation(line: 546, column: 7, scope: !744)
!801 = !DILocation(line: 547, column: 4, scope: !797)
!802 = !DILocation(line: 548, column: 25, scope: !803)
!803 = distinct !DILexicalBlock(scope: !744, file: !1, line: 548, column: 7)
!804 = !DILocation(line: 548, column: 34, scope: !803)
!805 = !DILocation(line: 548, column: 7, scope: !803)
!806 = !DILocation(line: 548, column: 7, scope: !744)
!807 = !DILocation(line: 549, column: 19, scope: !808)
!808 = distinct !DILexicalBlock(scope: !803, file: !1, line: 548, column: 38)
!809 = !DILocation(line: 550, column: 4, scope: !808)
!810 = !DILocation(line: 552, column: 3, scope: !744)
!811 = !DILocation(line: 527, column: 17, scope: !738)
!812 = !DILocation(line: 527, column: 42, scope: !738)
!813 = !DILocation(line: 526, column: 2, scope: !814)
!814 = !DILexicalBlockFile(scope: !738, file: !1, discriminator: 2)
!815 = !DILocation(line: 558, column: 6, scope: !816)
!816 = distinct !DILexicalBlock(scope: !499, file: !1, line: 558, column: 6)
!817 = !DILocation(line: 558, column: 21, scope: !816)
!818 = !DILocation(line: 558, column: 24, scope: !819)
!819 = !DILexicalBlockFile(scope: !816, file: !1, discriminator: 1)
!820 = !DILocation(line: 558, column: 33, scope: !819)
!821 = !DILocation(line: 558, column: 41, scope: !819)
!822 = !DILocation(line: 558, column: 50, scope: !819)
!823 = !DILocation(line: 558, column: 6, scope: !819)
!824 = !DILocation(line: 559, column: 3, scope: !816)
!825 = !DILocation(line: 562, column: 2, scope: !499)
!826 = !DILocation(line: 563, column: 1, scope: !499)
!827 = !DILocalVariable(name: "a", arg: 1, scope: !522, file: !1, line: 566, type: !4)
!828 = !DILocation(line: 566, column: 58, scope: !522)
!829 = !DILocalVariable(name: "key", arg: 2, scope: !522, file: !1, line: 567, type: !80)
!830 = !DILocation(line: 567, column: 15, scope: !522)
!831 = !DILocalVariable(name: "val", arg: 3, scope: !522, file: !1, line: 567, type: !80)
!832 = !DILocation(line: 567, column: 32, scope: !522)
!833 = !DILocalVariable(name: "iso9660", scope: !522, file: !1, line: 569, type: !292)
!834 = !DILocation(line: 569, column: 18, scope: !522)
!835 = !DILocation(line: 571, column: 31, scope: !522)
!836 = !DILocation(line: 571, column: 34, scope: !522)
!837 = !DILocation(line: 571, column: 42, scope: !522)
!838 = !DILocation(line: 571, column: 12, scope: !522)
!839 = !DILocation(line: 571, column: 10, scope: !522)
!840 = !DILocation(line: 573, column: 13, scope: !841)
!841 = distinct !DILexicalBlock(scope: !522, file: !1, line: 573, column: 6)
!842 = !DILocation(line: 573, column: 6, scope: !841)
!843 = !DILocation(line: 573, column: 28, scope: !841)
!844 = !DILocation(line: 573, column: 6, scope: !522)
!845 = !DILocation(line: 574, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !1, line: 574, column: 7)
!847 = distinct !DILexicalBlock(scope: !841, file: !1, line: 573, column: 34)
!848 = !DILocation(line: 574, column: 11, scope: !846)
!849 = !DILocation(line: 574, column: 19, scope: !846)
!850 = !DILocation(line: 574, column: 29, scope: !851)
!851 = !DILexicalBlockFile(scope: !846, file: !1, discriminator: 1)
!852 = !DILocation(line: 574, column: 22, scope: !851)
!853 = !DILocation(line: 574, column: 41, scope: !851)
!854 = !DILocation(line: 574, column: 46, scope: !851)
!855 = !DILocation(line: 575, column: 12, scope: !846)
!856 = !DILocation(line: 575, column: 5, scope: !846)
!857 = !DILocation(line: 575, column: 27, scope: !846)
!858 = !DILocation(line: 575, column: 32, scope: !846)
!859 = !DILocation(line: 576, column: 12, scope: !846)
!860 = !DILocation(line: 576, column: 5, scope: !846)
!861 = !DILocation(line: 576, column: 28, scope: !846)
!862 = !DILocation(line: 576, column: 33, scope: !846)
!863 = !DILocation(line: 577, column: 12, scope: !846)
!864 = !DILocation(line: 577, column: 5, scope: !846)
!865 = !DILocation(line: 577, column: 22, scope: !846)
!866 = !DILocation(line: 574, column: 7, scope: !867)
!867 = !DILexicalBlockFile(scope: !847, file: !1, discriminator: 2)
!868 = !DILocation(line: 578, column: 4, scope: !846)
!869 = !DILocation(line: 578, column: 13, scope: !846)
!870 = !DILocation(line: 578, column: 32, scope: !846)
!871 = !DILocation(line: 580, column: 4, scope: !846)
!872 = !DILocation(line: 580, column: 13, scope: !846)
!873 = !DILocation(line: 580, column: 32, scope: !846)
!874 = !DILocation(line: 581, column: 3, scope: !847)
!875 = !DILocation(line: 583, column: 13, scope: !876)
!876 = distinct !DILexicalBlock(scope: !522, file: !1, line: 583, column: 6)
!877 = !DILocation(line: 583, column: 6, scope: !876)
!878 = !DILocation(line: 583, column: 31, scope: !876)
!879 = !DILocation(line: 583, column: 36, scope: !876)
!880 = !DILocation(line: 584, column: 13, scope: !876)
!881 = !DILocation(line: 584, column: 6, scope: !876)
!882 = !DILocation(line: 584, column: 31, scope: !876)
!883 = !DILocation(line: 583, column: 6, scope: !884)
!884 = !DILexicalBlockFile(scope: !522, file: !1, discriminator: 1)
!885 = !DILocation(line: 585, column: 36, scope: !886)
!886 = distinct !DILexicalBlock(scope: !876, file: !1, line: 584, column: 37)
!887 = !DILocation(line: 585, column: 40, scope: !886)
!888 = !DILocation(line: 585, column: 3, scope: !886)
!889 = !DILocation(line: 585, column: 12, scope: !886)
!890 = !DILocation(line: 585, column: 34, scope: !886)
!891 = !DILocation(line: 586, column: 3, scope: !886)
!892 = !DILocation(line: 592, column: 2, scope: !522)
!893 = !DILocation(line: 593, column: 1, scope: !522)
!894 = !DILocalVariable(name: "a", arg: 1, scope: !523, file: !1, line: 1166, type: !4)
!895 = !DILocation(line: 1166, column: 62, scope: !523)
!896 = !DILocalVariable(name: "entry", arg: 2, scope: !523, file: !1, line: 1167, type: !30)
!897 = !DILocation(line: 1167, column: 27, scope: !523)
!898 = !DILocalVariable(name: "iso9660", scope: !523, file: !1, line: 1169, type: !292)
!899 = !DILocation(line: 1169, column: 18, scope: !523)
!900 = !DILocalVariable(name: "file", scope: !523, file: !1, line: 1170, type: !305)
!901 = !DILocation(line: 1170, column: 20, scope: !523)
!902 = !DILocalVariable(name: "r", scope: !523, file: !1, line: 1171, type: !23)
!903 = !DILocation(line: 1171, column: 6, scope: !523)
!904 = !DILocalVariable(name: "rd_r", scope: !523, file: !1, line: 1171, type: !23)
!905 = !DILocation(line: 1171, column: 9, scope: !523)
!906 = !DILocation(line: 1173, column: 31, scope: !523)
!907 = !DILocation(line: 1173, column: 34, scope: !523)
!908 = !DILocation(line: 1173, column: 42, scope: !523)
!909 = !DILocation(line: 1173, column: 12, scope: !523)
!910 = !DILocation(line: 1173, column: 10, scope: !523)
!911 = !DILocation(line: 1175, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !523, file: !1, line: 1175, column: 6)
!913 = !DILocation(line: 1175, column: 10, scope: !912)
!914 = !DILocation(line: 1175, column: 18, scope: !912)
!915 = !DILocation(line: 1175, column: 6, scope: !523)
!916 = !DILocation(line: 1176, column: 3, scope: !917)
!917 = distinct !DILexicalBlock(scope: !912, file: !1, line: 1175, column: 34)
!918 = !DILocation(line: 1176, column: 6, scope: !917)
!919 = !DILocation(line: 1176, column: 14, scope: !917)
!920 = !DILocation(line: 1176, column: 29, scope: !917)
!921 = !DILocation(line: 1177, column: 3, scope: !917)
!922 = !DILocation(line: 1177, column: 6, scope: !917)
!923 = !DILocation(line: 1177, column: 14, scope: !917)
!924 = !DILocation(line: 1177, column: 34, scope: !917)
!925 = !DILocation(line: 1178, column: 2, scope: !917)
!926 = !DILocation(line: 1180, column: 6, scope: !927)
!927 = distinct !DILexicalBlock(scope: !523, file: !1, line: 1180, column: 6)
!928 = !DILocation(line: 1180, column: 15, scope: !927)
!929 = !DILocation(line: 1180, column: 32, scope: !927)
!930 = !DILocation(line: 1180, column: 6, scope: !523)
!931 = !DILocation(line: 1181, column: 21, scope: !932)
!932 = distinct !DILexicalBlock(scope: !927, file: !1, line: 1180, column: 38)
!933 = !DILocation(line: 1181, column: 24, scope: !932)
!934 = !DILocation(line: 1181, column: 7, scope: !932)
!935 = !DILocation(line: 1181, column: 5, scope: !932)
!936 = !DILocation(line: 1182, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !932, file: !1, line: 1182, column: 7)
!938 = !DILocation(line: 1182, column: 9, scope: !937)
!939 = !DILocation(line: 1182, column: 7, scope: !932)
!940 = !DILocation(line: 1183, column: 12, scope: !937)
!941 = !DILocation(line: 1183, column: 4, scope: !937)
!942 = !DILocation(line: 1184, column: 2, scope: !932)
!943 = !DILocation(line: 1186, column: 7, scope: !523)
!944 = !DILocation(line: 1188, column: 22, scope: !523)
!945 = !DILocation(line: 1188, column: 25, scope: !523)
!946 = !DILocation(line: 1188, column: 6, scope: !523)
!947 = !DILocation(line: 1188, column: 4, scope: !523)
!948 = !DILocation(line: 1189, column: 6, scope: !949)
!949 = distinct !DILexicalBlock(scope: !523, file: !1, line: 1189, column: 6)
!950 = !DILocation(line: 1189, column: 8, scope: !949)
!951 = !DILocation(line: 1189, column: 6, scope: !523)
!952 = !DILocation(line: 1190, column: 11, scope: !949)
!953 = !DILocation(line: 1190, column: 3, scope: !949)
!954 = !DILocation(line: 1192, column: 6, scope: !955)
!955 = distinct !DILexicalBlock(scope: !523, file: !1, line: 1192, column: 6)
!956 = !DILocation(line: 1192, column: 15, scope: !955)
!957 = !DILocation(line: 1192, column: 6, scope: !523)
!958 = !DILocation(line: 1197, column: 7, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !1, line: 1197, column: 7)
!960 = distinct !DILexicalBlock(scope: !955, file: !1, line: 1192, column: 27)
!961 = !DILocation(line: 1197, column: 16, scope: !959)
!962 = !DILocation(line: 1197, column: 30, scope: !959)
!963 = !DILocation(line: 1197, column: 7, scope: !960)
!964 = !DILocation(line: 1200, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !959, file: !1, line: 1197, column: 39)
!966 = !DILocation(line: 1200, column: 10, scope: !965)
!967 = !DILocation(line: 1199, column: 8, scope: !965)
!968 = !DILocation(line: 1198, column: 4, scope: !965)
!969 = !DILocation(line: 1198, column: 13, scope: !965)
!970 = !DILocation(line: 1198, column: 27, scope: !965)
!971 = !DILocation(line: 1201, column: 8, scope: !972)
!972 = distinct !DILexicalBlock(scope: !965, file: !1, line: 1201, column: 8)
!973 = !DILocation(line: 1201, column: 17, scope: !972)
!974 = !DILocation(line: 1201, column: 31, scope: !972)
!975 = !DILocation(line: 1201, column: 8, scope: !965)
!976 = !DILocation(line: 1203, column: 5, scope: !972)
!977 = !DILocation(line: 1204, column: 3, scope: !965)
!978 = !DILocation(line: 1205, column: 7, scope: !979)
!979 = distinct !DILexicalBlock(scope: !960, file: !1, line: 1205, column: 7)
!980 = !DILocation(line: 1205, column: 16, scope: !979)
!981 = !DILocation(line: 1205, column: 29, scope: !979)
!982 = !DILocation(line: 1205, column: 7, scope: !960)
!983 = !DILocation(line: 1206, column: 28, scope: !984)
!984 = distinct !DILexicalBlock(scope: !979, file: !1, line: 1205, column: 38)
!985 = !DILocation(line: 1206, column: 4, scope: !984)
!986 = !DILocation(line: 1206, column: 13, scope: !984)
!987 = !DILocation(line: 1206, column: 26, scope: !984)
!988 = !DILocation(line: 1207, column: 8, scope: !989)
!989 = distinct !DILexicalBlock(scope: !984, file: !1, line: 1207, column: 8)
!990 = !DILocation(line: 1207, column: 17, scope: !989)
!991 = !DILocation(line: 1207, column: 30, scope: !989)
!992 = !DILocation(line: 1207, column: 8, scope: !984)
!993 = !DILocation(line: 1208, column: 24, scope: !994)
!994 = distinct !DILexicalBlock(scope: !989, file: !1, line: 1207, column: 39)
!995 = !DILocation(line: 1208, column: 27, scope: !994)
!996 = !DILocation(line: 1208, column: 5, scope: !994)
!997 = !DILocation(line: 1210, column: 5, scope: !994)
!998 = !DILocation(line: 1212, column: 3, scope: !984)
!999 = !DILocation(line: 1213, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !960, file: !1, line: 1213, column: 7)
!1001 = !DILocation(line: 1213, column: 16, scope: !1000)
!1002 = !DILocation(line: 1213, column: 38, scope: !1000)
!1003 = !DILocation(line: 1213, column: 7, scope: !960)
!1004 = !DILocation(line: 1214, column: 37, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 1213, column: 47)
!1006 = !DILocation(line: 1214, column: 4, scope: !1005)
!1007 = !DILocation(line: 1214, column: 13, scope: !1005)
!1008 = !DILocation(line: 1214, column: 35, scope: !1005)
!1009 = !DILocation(line: 1215, column: 8, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !1, line: 1215, column: 8)
!1011 = !DILocation(line: 1215, column: 17, scope: !1010)
!1012 = !DILocation(line: 1215, column: 39, scope: !1010)
!1013 = !DILocation(line: 1215, column: 8, scope: !1005)
!1014 = !DILocation(line: 1216, column: 24, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 1215, column: 48)
!1016 = !DILocation(line: 1216, column: 27, scope: !1015)
!1017 = !DILocation(line: 1216, column: 5, scope: !1015)
!1018 = !DILocation(line: 1218, column: 5, scope: !1015)
!1019 = !DILocation(line: 1220, column: 3, scope: !1005)
!1020 = !DILocation(line: 1222, column: 3, scope: !960)
!1021 = !DILocation(line: 1222, column: 12, scope: !960)
!1022 = !DILocation(line: 1222, column: 29, scope: !960)
!1023 = !DILocation(line: 1223, column: 30, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !960, file: !1, line: 1223, column: 7)
!1025 = !DILocation(line: 1223, column: 39, scope: !1024)
!1026 = !DILocation(line: 1224, column: 25, scope: !1024)
!1027 = !DILocation(line: 1224, column: 34, scope: !1024)
!1028 = !DILocation(line: 1224, column: 53, scope: !1024)
!1029 = !DILocation(line: 1223, column: 7, scope: !1024)
!1030 = !DILocation(line: 1224, column: 59, scope: !1024)
!1031 = !DILocation(line: 1223, column: 7, scope: !960)
!1032 = !DILocation(line: 1225, column: 23, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 1224, column: 65)
!1034 = !DILocation(line: 1225, column: 26, scope: !1033)
!1035 = !DILocation(line: 1225, column: 4, scope: !1033)
!1036 = !DILocation(line: 1228, column: 4, scope: !1033)
!1037 = !DILocation(line: 1231, column: 37, scope: !960)
!1038 = !DILocation(line: 1232, column: 21, scope: !960)
!1039 = !DILocation(line: 1232, column: 30, scope: !960)
!1040 = !DILocation(line: 1233, column: 7, scope: !960)
!1041 = !DILocation(line: 1233, column: 16, scope: !960)
!1042 = !DILocation(line: 1234, column: 7, scope: !960)
!1043 = !DILocation(line: 1234, column: 16, scope: !960)
!1044 = !DILocation(line: 1231, column: 7, scope: !960)
!1045 = !DILocation(line: 1231, column: 5, scope: !960)
!1046 = !DILocation(line: 1235, column: 7, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !960, file: !1, line: 1235, column: 7)
!1048 = !DILocation(line: 1235, column: 9, scope: !1047)
!1049 = !DILocation(line: 1235, column: 7, scope: !960)
!1050 = !DILocation(line: 1236, column: 8, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 1236, column: 8)
!1052 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 1235, column: 15)
!1053 = !DILocation(line: 1236, column: 14, scope: !1051)
!1054 = !DILocation(line: 1236, column: 8, scope: !1052)
!1055 = !DILocation(line: 1237, column: 24, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !1, line: 1236, column: 25)
!1057 = !DILocation(line: 1237, column: 27, scope: !1056)
!1058 = !DILocation(line: 1237, column: 5, scope: !1056)
!1059 = !DILocation(line: 1239, column: 5, scope: !1056)
!1060 = !DILocation(line: 1241, column: 23, scope: !1052)
!1061 = !DILocation(line: 1241, column: 26, scope: !1052)
!1062 = !DILocation(line: 1246, column: 10, scope: !1052)
!1063 = !DILocation(line: 1246, column: 19, scope: !1052)
!1064 = !DILocation(line: 1245, column: 8, scope: !1052)
!1065 = !DILocation(line: 1241, column: 4, scope: !1052)
!1066 = !DILocation(line: 1248, column: 9, scope: !1052)
!1067 = !DILocation(line: 1249, column: 3, scope: !1052)
!1068 = !DILocation(line: 1250, column: 2, scope: !960)
!1069 = !DILocalVariable(name: "path", scope: !1070, file: !1, line: 1251, type: !80)
!1070 = distinct !DILexicalBlock(scope: !955, file: !1, line: 1250, column: 9)
!1071 = !DILocation(line: 1251, column: 15, scope: !1070)
!1072 = !DILocation(line: 1251, column: 38, scope: !1070)
!1073 = !DILocation(line: 1251, column: 47, scope: !1070)
!1074 = !DILocation(line: 1251, column: 57, scope: !1070)
!1075 = !DILocation(line: 1251, column: 22, scope: !1070)
!1076 = !DILocation(line: 1252, column: 7, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1070, file: !1, line: 1252, column: 7)
!1078 = !DILocation(line: 1252, column: 12, scope: !1077)
!1079 = !DILocation(line: 1252, column: 7, scope: !1070)
!1080 = !DILocation(line: 1253, column: 23, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !1, line: 1252, column: 21)
!1082 = !DILocation(line: 1253, column: 26, scope: !1081)
!1083 = !DILocation(line: 1253, column: 4, scope: !1081)
!1084 = !DILocation(line: 1256, column: 4, scope: !1081)
!1085 = !DILocation(line: 1258, column: 4, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1077, file: !1, line: 1257, column: 10)
!1087 = !DILocation(line: 1259, column: 31, scope: !1086)
!1088 = !DILocation(line: 1259, column: 38, scope: !1086)
!1089 = !DILocation(line: 1259, column: 4, scope: !1086)
!1090 = !DILocation(line: 1263, column: 35, scope: !523)
!1091 = !DILocation(line: 1263, column: 41, scope: !523)
!1092 = !DILocation(line: 1263, column: 2, scope: !523)
