; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_util.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_string = type { i8*, i64, i64 }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string_conv = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [17 x i8] c"libarchive 3.3.1\00", align 1
@archive_version_details.str = internal global %struct.archive_string zeroinitializer, align 8
@archive_version_details.init = internal global i32 0, align 4
@.str.1 = private unnamed_addr constant [7 x i8] c" zlib/\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c" liblzma/\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c" bz2lib/\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !162)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_util.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !{!9, !109, !112, !115, !116, !117, !118, !119, !120, !121, !124, !125, !126, !127, !128, !129, !133, !134, !137, !140, !143, !146, !149, !152, !155, !159}
!9 = distinct !DISubprogram(name: "__archive_clean", scope: !1, file: !1, line: 74, type: !10, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13}
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !15, line: 89, size: 1280, align: 64, elements: !16)
!15 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!16 = !{!17, !19, !20, !83, !84, !85, !86, !87, !88, !89, !90, !97, !98, !99, !100, !103, !104, !105, !106, !107, !108}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !14, file: !15, line: 96, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !14, file: !15, line: 97, baseType: !18, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !14, file: !15, line: 103, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !15, line: 63, size: 832, align: 64, elements: !23)
!23 = !{!24, !26, !27, !34, !35, !49, !55, !60, !61, !68, !69, !73, !77}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !22, file: !15, line: 64, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !22, file: !15, line: 65, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !22, file: !15, line: 66, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!12, !13, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !33, line: 180, flags: DIFlagFwdDecl)
!33 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !22, file: !15, line: 68, baseType: !25, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !22, file: !15, line: 69, baseType: !36, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !13, !44, !46}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !40, line: 109, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !42, line: 172, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!43 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 62, baseType: !48)
!47 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !22, file: !15, line: 71, baseType: !50, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!39, !13, !44, !46, !53}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 40, baseType: !43)
!54 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !22, file: !15, line: 74, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!12, !13, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !22, file: !15, line: 76, baseType: !28, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !22, file: !15, line: 78, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!12, !13, !65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !22, file: !15, line: 81, baseType: !25, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !22, file: !15, line: 82, baseType: !70, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!53, !13, !12}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !22, file: !15, line: 83, baseType: !74, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!12, !13, !12}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !22, file: !15, line: 84, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !13, !12}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !14, file: !15, line: 105, baseType: !12, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !14, file: !15, line: 106, baseType: !81, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !14, file: !15, line: 108, baseType: !12, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !14, file: !15, line: 109, baseType: !81, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !14, file: !15, line: 112, baseType: !12, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !14, file: !15, line: 114, baseType: !12, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !15, line: 115, baseType: !81, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !14, file: !15, line: 116, baseType: !91, size: 192, align: 64, offset: 512)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !92, line: 58, size: 192, align: 64, elements: !93)
!92 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!93 = !{!94, !95, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !91, file: !92, line: 59, baseType: !6, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !92, line: 60, baseType: !46, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !91, file: !92, line: 61, baseType: !46, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !14, file: !15, line: 118, baseType: !6, size: 64, align: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !14, file: !15, line: 119, baseType: !18, size: 32, align: 32, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !14, file: !15, line: 120, baseType: !18, size: 32, align: 32, offset: 800)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !14, file: !15, line: 121, baseType: !101, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !92, line: 70, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !14, file: !15, line: 127, baseType: !81, size: 64, align: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !14, file: !15, line: 128, baseType: !53, size: 64, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !14, file: !15, line: 129, baseType: !53, size: 64, align: 64, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !14, file: !15, line: 130, baseType: !46, size: 64, align: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !14, file: !15, line: 137, baseType: !7, size: 8, align: 8, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !14, file: !15, line: 138, baseType: !46, size: 64, align: 64, offset: 1216)
!109 = distinct !DISubprogram(name: "archive_version_number", scope: !1, file: !1, line: 81, type: !110, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!110 = !DISubroutineType(types: !111)
!111 = !{!12}
!112 = distinct !DISubprogram(name: "archive_version_string", scope: !1, file: !1, line: 87, type: !113, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!113 = !DISubroutineType(types: !114)
!114 = !{!81}
!115 = distinct !DISubprogram(name: "archive_version_details", scope: !1, file: !1, line: 93, type: !113, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!116 = distinct !DISubprogram(name: "archive_zlib_version", scope: !1, file: !1, line: 131, type: !113, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!117 = distinct !DISubprogram(name: "archive_liblzma_version", scope: !1, file: !1, line: 141, type: !113, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!118 = distinct !DISubprogram(name: "archive_bzlib_version", scope: !1, file: !1, line: 151, type: !113, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!119 = distinct !DISubprogram(name: "archive_liblz4_version", scope: !1, file: !1, line: 161, type: !113, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!120 = distinct !DISubprogram(name: "archive_errno", scope: !1, file: !1, line: 175, type: !10, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!121 = distinct !DISubprogram(name: "archive_error_string", scope: !1, file: !1, line: 181, type: !122, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{!81, !13}
!124 = distinct !DISubprogram(name: "archive_file_count", scope: !1, file: !1, line: 191, type: !10, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!125 = distinct !DISubprogram(name: "archive_format", scope: !1, file: !1, line: 197, type: !10, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!126 = distinct !DISubprogram(name: "archive_format_name", scope: !1, file: !1, line: 203, type: !122, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!127 = distinct !DISubprogram(name: "archive_compression", scope: !1, file: !1, line: 210, type: !10, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!128 = distinct !DISubprogram(name: "archive_compression_name", scope: !1, file: !1, line: 216, type: !122, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!129 = distinct !DISubprogram(name: "archive_position_compressed", scope: !1, file: !1, line: 226, type: !130, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !13}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !33, line: 73, baseType: !53)
!133 = distinct !DISubprogram(name: "archive_position_uncompressed", scope: !1, file: !1, line: 235, type: !130, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!134 = distinct !DISubprogram(name: "archive_clear_error", scope: !1, file: !1, line: 241, type: !135, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !13}
!137 = distinct !DISubprogram(name: "archive_set_error", scope: !1, file: !1, line: 249, type: !138, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !13, !12, !81, null}
!140 = distinct !DISubprogram(name: "archive_copy_error", scope: !1, file: !1, line: 267, type: !141, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !13, !13}
!143 = distinct !DISubprogram(name: "__archive_errx", scope: !1, file: !1, line: 276, type: !144, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !12, !81}
!146 = distinct !DISubprogram(name: "__archive_mktemp", scope: !1, file: !1, line: 474, type: !147, isLocal: false, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!147 = !DISubroutineType(types: !148)
!148 = !{!12, !81}
!149 = distinct !DISubprogram(name: "__archive_ensure_cloexec_flag", scope: !1, file: !1, line: 580, type: !150, isLocal: false, isDefinition: true, scopeLine: 581, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !12}
!152 = distinct !DISubprogram(name: "archive_utility_string_sort", scope: !1, file: !1, line: 661, type: !153, isLocal: false, isDefinition: true, scopeLine: 662, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!153 = !DISubroutineType(types: !154)
!154 = !{!12, !5}
!155 = distinct !DISubprogram(name: "get_tempdir", scope: !1, file: !1, line: 450, type: !156, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!156 = !DISubroutineType(types: !157)
!157 = !{!12, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!159 = distinct !DISubprogram(name: "archive_utility_string_sort_helper", scope: !1, file: !1, line: 599, type: !160, isLocal: true, isDefinition: true, scopeLine: 600, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!160 = !DISubroutineType(types: !161)
!161 = !{!12, !5, !18}
!162 = !{!163, !164, !165}
!163 = !DIGlobalVariable(name: "str", scope: !115, file: !1, line: 95, type: !91, isLocal: true, isDefinition: true, variable: %struct.archive_string* @archive_version_details.str)
!164 = !DIGlobalVariable(name: "init", scope: !115, file: !1, line: 96, type: !12, isLocal: true, isDefinition: true, variable: i32* @archive_version_details.init)
!165 = !DIGlobalVariable(name: "msg1", scope: !143, file: !1, line: 278, type: !81, isLocal: true, isDefinition: true, variable: i8** @__archive_errx.msg1)
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!169 = !DILocalVariable(name: "a", arg: 1, scope: !9, file: !1, line: 74, type: !13)
!170 = !DIExpression()
!171 = !DILocation(line: 74, column: 33, scope: !9)
!172 = !DILocation(line: 76, column: 33, scope: !9)
!173 = !DILocation(line: 76, column: 2, scope: !9)
!174 = !DILocation(line: 77, column: 2, scope: !9)
!175 = !DILocation(line: 83, column: 2, scope: !109)
!176 = !DILocation(line: 89, column: 2, scope: !112)
!177 = !DILocalVariable(name: "zlib", scope: !115, file: !1, line: 97, type: !81)
!178 = !DILocation(line: 97, column: 14, scope: !115)
!179 = !DILocation(line: 97, column: 21, scope: !115)
!180 = !DILocalVariable(name: "liblzma", scope: !115, file: !1, line: 98, type: !81)
!181 = !DILocation(line: 98, column: 14, scope: !115)
!182 = !DILocation(line: 98, column: 24, scope: !115)
!183 = !DILocalVariable(name: "bzlib", scope: !115, file: !1, line: 99, type: !81)
!184 = !DILocation(line: 99, column: 14, scope: !115)
!185 = !DILocation(line: 99, column: 22, scope: !115)
!186 = !DILocalVariable(name: "liblz4", scope: !115, file: !1, line: 100, type: !81)
!187 = !DILocation(line: 100, column: 14, scope: !115)
!188 = !DILocation(line: 100, column: 23, scope: !115)
!189 = !DILocation(line: 102, column: 7, scope: !190)
!190 = distinct !DILexicalBlock(scope: !115, file: !1, line: 102, column: 6)
!191 = !DILocation(line: 102, column: 6, scope: !115)
!192 = !DILocation(line: 103, column: 3, scope: !193)
!193 = distinct !DILexicalBlock(scope: !190, file: !1, line: 102, column: 13)
!194 = !DILocation(line: 103, column: 3, scope: !195)
!195 = !DILexicalBlockFile(scope: !196, file: !1, discriminator: 1)
!196 = distinct !DILexicalBlock(scope: !193, file: !1, line: 103, column: 3)
!197 = !DILocation(line: 105, column: 3, scope: !193)
!198 = !DILocation(line: 106, column: 7, scope: !199)
!199 = distinct !DILexicalBlock(scope: !193, file: !1, line: 106, column: 7)
!200 = !DILocation(line: 106, column: 12, scope: !199)
!201 = !DILocation(line: 106, column: 7, scope: !193)
!202 = !DILocation(line: 107, column: 4, scope: !203)
!203 = distinct !DILexicalBlock(scope: !199, file: !1, line: 106, column: 21)
!204 = !DILocation(line: 108, column: 25, scope: !203)
!205 = !DILocation(line: 108, column: 4, scope: !203)
!206 = !DILocation(line: 109, column: 3, scope: !203)
!207 = !DILocation(line: 110, column: 7, scope: !208)
!208 = distinct !DILexicalBlock(scope: !193, file: !1, line: 110, column: 7)
!209 = !DILocation(line: 110, column: 7, scope: !193)
!210 = !DILocation(line: 111, column: 4, scope: !211)
!211 = distinct !DILexicalBlock(scope: !208, file: !1, line: 110, column: 16)
!212 = !DILocation(line: 112, column: 25, scope: !211)
!213 = !DILocation(line: 112, column: 4, scope: !211)
!214 = !DILocation(line: 113, column: 3, scope: !211)
!215 = !DILocation(line: 114, column: 7, scope: !216)
!216 = distinct !DILexicalBlock(scope: !193, file: !1, line: 114, column: 7)
!217 = !DILocation(line: 114, column: 7, scope: !193)
!218 = !DILocalVariable(name: "p", scope: !219, file: !1, line: 115, type: !81)
!219 = distinct !DILexicalBlock(scope: !216, file: !1, line: 114, column: 14)
!220 = !DILocation(line: 115, column: 16, scope: !219)
!221 = !DILocation(line: 115, column: 20, scope: !219)
!222 = !DILocalVariable(name: "sep", scope: !219, file: !1, line: 116, type: !81)
!223 = !DILocation(line: 116, column: 16, scope: !219)
!224 = !DILocation(line: 116, column: 29, scope: !219)
!225 = !DILocation(line: 116, column: 22, scope: !219)
!226 = !DILocation(line: 117, column: 8, scope: !227)
!227 = distinct !DILexicalBlock(scope: !219, file: !1, line: 117, column: 8)
!228 = !DILocation(line: 117, column: 12, scope: !227)
!229 = !DILocation(line: 117, column: 8, scope: !219)
!230 = !DILocation(line: 118, column: 11, scope: !227)
!231 = !DILocation(line: 118, column: 22, scope: !227)
!232 = !DILocation(line: 118, column: 15, scope: !227)
!233 = !DILocation(line: 118, column: 13, scope: !227)
!234 = !DILocation(line: 118, column: 9, scope: !227)
!235 = !DILocation(line: 118, column: 5, scope: !227)
!236 = !DILocation(line: 119, column: 4, scope: !219)
!237 = !DILocation(line: 120, column: 26, scope: !219)
!238 = !DILocation(line: 120, column: 29, scope: !219)
!239 = !DILocation(line: 120, column: 35, scope: !219)
!240 = !DILocation(line: 120, column: 33, scope: !219)
!241 = !DILocation(line: 120, column: 4, scope: !219)
!242 = !DILocation(line: 121, column: 3, scope: !219)
!243 = !DILocation(line: 122, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !193, file: !1, line: 122, column: 7)
!245 = !DILocation(line: 122, column: 7, scope: !193)
!246 = !DILocation(line: 123, column: 4, scope: !247)
!247 = distinct !DILexicalBlock(scope: !244, file: !1, line: 122, column: 15)
!248 = !DILocation(line: 124, column: 25, scope: !247)
!249 = !DILocation(line: 124, column: 4, scope: !247)
!250 = !DILocation(line: 125, column: 3, scope: !247)
!251 = !DILocation(line: 126, column: 2, scope: !193)
!252 = !DILocation(line: 127, column: 13, scope: !115)
!253 = !DILocation(line: 127, column: 2, scope: !115)
!254 = !DILocation(line: 134, column: 2, scope: !116)
!255 = !DILocation(line: 144, column: 2, scope: !117)
!256 = !DILocation(line: 154, column: 9, scope: !118)
!257 = !DILocation(line: 154, column: 2, scope: !118)
!258 = !DILocation(line: 170, column: 2, scope: !119)
!259 = !DILocalVariable(name: "a", arg: 1, scope: !120, file: !1, line: 175, type: !13)
!260 = !DILocation(line: 175, column: 31, scope: !120)
!261 = !DILocation(line: 177, column: 10, scope: !120)
!262 = !DILocation(line: 177, column: 13, scope: !120)
!263 = !DILocation(line: 177, column: 2, scope: !120)
!264 = !DILocalVariable(name: "a", arg: 1, scope: !121, file: !1, line: 181, type: !13)
!265 = !DILocation(line: 181, column: 38, scope: !121)
!266 = !DILocation(line: 184, column: 6, scope: !267)
!267 = distinct !DILexicalBlock(scope: !121, file: !1, line: 184, column: 6)
!268 = !DILocation(line: 184, column: 9, scope: !267)
!269 = !DILocation(line: 184, column: 15, scope: !267)
!270 = !DILocation(line: 184, column: 24, scope: !267)
!271 = !DILocation(line: 184, column: 29, scope: !272)
!272 = !DILexicalBlockFile(scope: !267, file: !1, discriminator: 1)
!273 = !DILocation(line: 184, column: 32, scope: !272)
!274 = !DILocation(line: 184, column: 28, scope: !272)
!275 = !DILocation(line: 184, column: 38, scope: !272)
!276 = !DILocation(line: 184, column: 6, scope: !272)
!277 = !DILocation(line: 185, column: 11, scope: !267)
!278 = !DILocation(line: 185, column: 14, scope: !267)
!279 = !DILocation(line: 185, column: 3, scope: !267)
!280 = !DILocation(line: 187, column: 3, scope: !267)
!281 = !DILocation(line: 188, column: 1, scope: !121)
!282 = !DILocalVariable(name: "a", arg: 1, scope: !124, file: !1, line: 191, type: !13)
!283 = !DILocation(line: 191, column: 36, scope: !124)
!284 = !DILocation(line: 193, column: 10, scope: !124)
!285 = !DILocation(line: 193, column: 13, scope: !124)
!286 = !DILocation(line: 193, column: 2, scope: !124)
!287 = !DILocalVariable(name: "a", arg: 1, scope: !125, file: !1, line: 197, type: !13)
!288 = !DILocation(line: 197, column: 32, scope: !125)
!289 = !DILocation(line: 199, column: 10, scope: !125)
!290 = !DILocation(line: 199, column: 13, scope: !125)
!291 = !DILocation(line: 199, column: 2, scope: !125)
!292 = !DILocalVariable(name: "a", arg: 1, scope: !126, file: !1, line: 203, type: !13)
!293 = !DILocation(line: 203, column: 37, scope: !126)
!294 = !DILocation(line: 205, column: 10, scope: !126)
!295 = !DILocation(line: 205, column: 13, scope: !126)
!296 = !DILocation(line: 205, column: 2, scope: !126)
!297 = !DILocalVariable(name: "a", arg: 1, scope: !127, file: !1, line: 210, type: !13)
!298 = !DILocation(line: 210, column: 37, scope: !127)
!299 = !DILocation(line: 212, column: 29, scope: !127)
!300 = !DILocation(line: 212, column: 9, scope: !127)
!301 = !DILocation(line: 212, column: 2, scope: !127)
!302 = !DILocalVariable(name: "a", arg: 1, scope: !128, file: !1, line: 216, type: !13)
!303 = !DILocation(line: 216, column: 42, scope: !128)
!304 = !DILocation(line: 218, column: 29, scope: !128)
!305 = !DILocation(line: 218, column: 9, scope: !128)
!306 = !DILocation(line: 218, column: 2, scope: !128)
!307 = !DILocalVariable(name: "a", arg: 1, scope: !129, file: !1, line: 226, type: !13)
!308 = !DILocation(line: 226, column: 45, scope: !129)
!309 = !DILocation(line: 228, column: 30, scope: !129)
!310 = !DILocation(line: 228, column: 9, scope: !129)
!311 = !DILocation(line: 228, column: 2, scope: !129)
!312 = !DILocalVariable(name: "a", arg: 1, scope: !133, file: !1, line: 235, type: !13)
!313 = !DILocation(line: 235, column: 47, scope: !133)
!314 = !DILocation(line: 237, column: 30, scope: !133)
!315 = !DILocation(line: 237, column: 9, scope: !133)
!316 = !DILocation(line: 237, column: 2, scope: !133)
!317 = !DILocalVariable(name: "a", arg: 1, scope: !134, file: !1, line: 241, type: !13)
!318 = !DILocation(line: 241, column: 37, scope: !134)
!319 = !DILocation(line: 243, column: 2, scope: !134)
!320 = !DILocation(line: 244, column: 2, scope: !134)
!321 = !DILocation(line: 244, column: 5, scope: !134)
!322 = !DILocation(line: 244, column: 11, scope: !134)
!323 = !DILocation(line: 245, column: 2, scope: !134)
!324 = !DILocation(line: 245, column: 5, scope: !134)
!325 = !DILocation(line: 245, column: 26, scope: !134)
!326 = !DILocation(line: 246, column: 1, scope: !134)
!327 = !DILocalVariable(name: "a", arg: 1, scope: !137, file: !1, line: 249, type: !13)
!328 = !DILocation(line: 249, column: 35, scope: !137)
!329 = !DILocalVariable(name: "error_number", arg: 2, scope: !137, file: !1, line: 249, type: !12)
!330 = !DILocation(line: 249, column: 42, scope: !137)
!331 = !DILocalVariable(name: "fmt", arg: 3, scope: !137, file: !1, line: 249, type: !81)
!332 = !DILocation(line: 249, column: 68, scope: !137)
!333 = !DILocalVariable(name: "ap", scope: !137, file: !1, line: 251, type: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !335, line: 79, baseType: !336)
!335 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !337, line: 50, baseType: !338)
!337 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stdarg.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 251, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 192, align: 64, elements: !346)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 251, size: 192, align: 64, elements: !341)
!341 = !{!342, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !340, file: !1, line: 251, baseType: !18, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !340, file: !1, line: 251, baseType: !18, size: 32, align: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !340, file: !1, line: 251, baseType: !4, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !340, file: !1, line: 251, baseType: !4, size: 64, align: 64, offset: 128)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DILocation(line: 251, column: 10, scope: !137)
!349 = !DILocation(line: 253, column: 28, scope: !137)
!350 = !DILocation(line: 253, column: 2, scope: !137)
!351 = !DILocation(line: 253, column: 5, scope: !137)
!352 = !DILocation(line: 253, column: 26, scope: !137)
!353 = !DILocation(line: 254, column: 6, scope: !354)
!354 = distinct !DILexicalBlock(scope: !137, file: !1, line: 254, column: 6)
!355 = !DILocation(line: 254, column: 10, scope: !354)
!356 = !DILocation(line: 254, column: 6, scope: !137)
!357 = !DILocation(line: 255, column: 3, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !1, line: 254, column: 19)
!359 = !DILocation(line: 255, column: 6, scope: !358)
!360 = !DILocation(line: 255, column: 12, scope: !358)
!361 = !DILocation(line: 256, column: 3, scope: !358)
!362 = !DILocation(line: 259, column: 2, scope: !137)
!363 = !DILocation(line: 260, column: 2, scope: !137)
!364 = !DILocation(line: 261, column: 28, scope: !137)
!365 = !DILocation(line: 261, column: 31, scope: !137)
!366 = !DILocation(line: 261, column: 46, scope: !137)
!367 = !DILocation(line: 261, column: 51, scope: !137)
!368 = !DILocation(line: 261, column: 2, scope: !137)
!369 = !DILocation(line: 262, column: 2, scope: !137)
!370 = !DILocation(line: 263, column: 13, scope: !137)
!371 = !DILocation(line: 263, column: 16, scope: !137)
!372 = !DILocation(line: 263, column: 29, scope: !137)
!373 = !DILocation(line: 263, column: 2, scope: !137)
!374 = !DILocation(line: 263, column: 5, scope: !137)
!375 = !DILocation(line: 263, column: 11, scope: !137)
!376 = !DILocation(line: 264, column: 1, scope: !137)
!377 = !DILocation(line: 264, column: 1, scope: !378)
!378 = !DILexicalBlockFile(scope: !137, file: !1, discriminator: 1)
!379 = !DILocalVariable(name: "dest", arg: 1, scope: !140, file: !1, line: 267, type: !13)
!380 = !DILocation(line: 267, column: 36, scope: !140)
!381 = !DILocalVariable(name: "src", arg: 2, scope: !140, file: !1, line: 267, type: !13)
!382 = !DILocation(line: 267, column: 58, scope: !140)
!383 = !DILocation(line: 269, column: 31, scope: !140)
!384 = !DILocation(line: 269, column: 36, scope: !140)
!385 = !DILocation(line: 269, column: 2, scope: !140)
!386 = !DILocation(line: 269, column: 8, scope: !140)
!387 = !DILocation(line: 269, column: 29, scope: !140)
!388 = !DILocation(line: 271, column: 2, scope: !140)
!389 = !DILocation(line: 272, column: 16, scope: !140)
!390 = !DILocation(line: 272, column: 22, scope: !140)
!391 = !DILocation(line: 272, column: 35, scope: !140)
!392 = !DILocation(line: 272, column: 2, scope: !140)
!393 = !DILocation(line: 272, column: 8, scope: !140)
!394 = !DILocation(line: 272, column: 14, scope: !140)
!395 = !DILocation(line: 273, column: 1, scope: !140)
!396 = !DILocalVariable(name: "retvalue", arg: 1, scope: !143, file: !1, line: 276, type: !12)
!397 = !DILocation(line: 276, column: 20, scope: !143)
!398 = !DILocalVariable(name: "msg", arg: 2, scope: !143, file: !1, line: 276, type: !81)
!399 = !DILocation(line: 276, column: 42, scope: !143)
!400 = !DILocalVariable(name: "s", scope: !143, file: !1, line: 279, type: !46)
!401 = !DILocation(line: 279, column: 9, scope: !143)
!402 = !DILocation(line: 281, column: 15, scope: !143)
!403 = !DILocation(line: 281, column: 28, scope: !143)
!404 = !DILocation(line: 281, column: 21, scope: !143)
!405 = !DILocation(line: 281, column: 6, scope: !406)
!406 = !DILexicalBlockFile(scope: !143, file: !1, discriminator: 1)
!407 = !DILocation(line: 281, column: 4, scope: !143)
!408 = !DILocation(line: 282, column: 8, scope: !143)
!409 = !DILocation(line: 283, column: 15, scope: !143)
!410 = !DILocation(line: 283, column: 27, scope: !143)
!411 = !DILocation(line: 283, column: 20, scope: !143)
!412 = !DILocation(line: 283, column: 6, scope: !406)
