; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_disk_posix.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, {}*, i8* (%struct.archive*, i32)* }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_entry = type opaque
%struct.archive_write_disk = type { %struct.archive, i32, %struct.fixup_entry*, %struct.fixup_entry*, i64, i32, i64, i64, i64, i64 (i8*, i8*, i64)*, void (i8*)*, i8*, i64 (i8*, i8*, i64)*, void (i8*)*, i8*, %struct.archive_string, %struct.stat, %struct.stat*, %struct.archive_entry*, i8*, %struct.archive_string, i32, i32, i32, i32, i64, i64, i64, i64, i32, i32, i64, i64, i32, i8*, i32, i8*, i64, i32, i32*, i8*, i64, i64, i32, i32, i8*, i64, i64, %struct.z_stream_s, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !304, globals: !391)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_disk_posix.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !163, !110, !113, !299, !300, !51, !301, !302, !22, !44, !303}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write_disk", file: !1, line: 216, size: 6336, align: 64, elements: !6)
!6 = !{!7, !109, !112, !166, !167, !168, !169, !170, !171, !175, !179, !183, !184, !185, !186, !187, !188, !223, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !242, !245, !246, !247, !248, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !297, !298}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !5, file: !1, line: 217, baseType: !8, size: 1280, align: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !9, line: 89, size: 1280, align: 64, elements: !10)
!9 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!10 = !{!11, !13, !14, !82, !83, !84, !85, !86, !87, !88, !89, !97, !98, !99, !100, !103, !104, !105, !106, !107, !108}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !8, file: !9, line: 96, baseType: !12, size: 32, align: 32)
!12 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !8, file: !9, line: 97, baseType: !12, size: 32, align: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !8, file: !9, line: 103, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !9, line: 63, size: 832, align: 64, elements: !17)
!17 = !{!18, !24, !25, !32, !33, !47, !53, !58, !59, !66, !67, !71, !75}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !16, file: !9, line: 64, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !16, file: !9, line: 65, baseType: !19, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !16, file: !9, line: 66, baseType: !26, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!22, !23, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !31, line: 180, flags: DIFlagFwdDecl)
!31 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !16, file: !9, line: 68, baseType: !19, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !16, file: !9, line: 69, baseType: !34, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !23, !42, !44}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !38, line: 109, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !40, line: 172, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 62, baseType: !46)
!45 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!46 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !16, file: !9, line: 71, baseType: !48, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!37, !23, !42, !44, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !52, line: 40, baseType: !41)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !16, file: !9, line: 74, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!22, !23, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !16, file: !9, line: 76, baseType: !26, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !16, file: !9, line: 78, baseType: !60, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!22, !23, !63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !16, file: !9, line: 81, baseType: !19, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !16, file: !9, line: 82, baseType: !68, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!51, !23, !22}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !16, file: !9, line: 83, baseType: !72, size: 64, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!22, !23, !22}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !16, file: !9, line: 84, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !23, !22}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !8, file: !9, line: 105, baseType: !22, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !8, file: !9, line: 106, baseType: !79, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !8, file: !9, line: 108, baseType: !22, size: 32, align: 32, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !8, file: !9, line: 109, baseType: !79, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !8, file: !9, line: 112, baseType: !22, size: 32, align: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !8, file: !9, line: 114, baseType: !22, size: 32, align: 32, offset: 416)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !8, file: !9, line: 115, baseType: !79, size: 64, align: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !8, file: !9, line: 116, baseType: !90, size: 192, align: 64, offset: 512)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !91, line: 58, size: 192, align: 64, elements: !92)
!91 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!92 = !{!93, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !90, file: !91, line: 59, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !90, file: !91, line: 60, baseType: !44, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !90, file: !91, line: 61, baseType: !44, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !8, file: !9, line: 118, baseType: !94, size: 64, align: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !8, file: !9, line: 119, baseType: !12, size: 32, align: 32, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !8, file: !9, line: 120, baseType: !12, size: 32, align: 32, offset: 800)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !8, file: !9, line: 121, baseType: !101, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !91, line: 70, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !8, file: !9, line: 127, baseType: !79, size: 64, align: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !8, file: !9, line: 128, baseType: !51, size: 64, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !8, file: !9, line: 129, baseType: !51, size: 64, align: 64, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !8, file: !9, line: 130, baseType: !44, size: 64, align: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !8, file: !9, line: 137, baseType: !81, size: 8, align: 8, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !8, file: !9, line: 138, baseType: !44, size: 64, align: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "user_umask", scope: !5, file: !1, line: 219, baseType: !110, size: 32, align: 32, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !38, line: 70, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 129, baseType: !12)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fixup_list", scope: !5, file: !1, line: 220, baseType: !113, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixup_entry", file: !1, line: 168, size: 1408, align: 64, elements: !115)
!115 = !{!116, !117, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !164, !165}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !1, line: 169, baseType: !113, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !114, file: !1, line: 170, baseType: !118, size: 448, align: 64, offset: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl", file: !119, line: 46, size: 448, align: 64, elements: !120)
!119 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_acl_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!120 = !{!121, !122, !146, !147, !148, !149, !150}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !118, file: !119, line: 47, baseType: !110, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "acl_head", scope: !118, file: !119, line: 48, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_acl_entry", file: !119, line: 37, size: 1024, align: 64, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !119, line: 38, baseType: !123, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !119, line: 39, baseType: !22, size: 32, align: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !124, file: !119, line: 40, baseType: !22, size: 32, align: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "permset", scope: !124, file: !119, line: 41, baseType: !22, size: 32, align: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !124, file: !119, line: 42, baseType: !22, size: 32, align: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !119, line: 43, baseType: !132, size: 832, align: 64, offset: 192)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_mstring", file: !91, line: 209, size: 832, align: 64, elements: !133)
!133 = !{!134, !135, !136, !144, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs", scope: !132, file: !91, line: 210, baseType: !90, size: 192, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "aes_utf8", scope: !132, file: !91, line: 211, baseType: !90, size: 192, align: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "aes_wcs", scope: !132, file: !91, line: 212, baseType: !137, size: 192, align: 64, offset: 384)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_wstring", file: !91, line: 64, size: 192, align: 64, elements: !138)
!138 = !{!139, !142, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !137, file: !91, line: 65, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !45, line: 90, baseType: !22)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !137, file: !91, line: 66, baseType: !44, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !137, file: !91, line: 67, baseType: !44, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "aes_mbs_in_locale", scope: !132, file: !91, line: 213, baseType: !90, size: 192, align: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "aes_set", scope: !132, file: !91, line: 218, baseType: !22, size: 32, align: 32, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "acl_p", scope: !118, file: !119, line: 49, baseType: !123, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "acl_state", scope: !118, file: !119, line: 50, baseType: !22, size: 32, align: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text_w", scope: !118, file: !119, line: 51, baseType: !140, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "acl_text", scope: !118, file: !119, line: 52, baseType: !94, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "acl_types", scope: !118, file: !119, line: 53, baseType: !22, size: 32, align: 32, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !114, file: !1, line: 171, baseType: !110, size: 32, align: 32, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !114, file: !1, line: 172, baseType: !51, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "birthtime", scope: !114, file: !1, line: 173, baseType: !51, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !114, file: !1, line: 174, baseType: !51, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !114, file: !1, line: 175, baseType: !51, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "atime_nanos", scope: !114, file: !1, line: 176, baseType: !46, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "birthtime_nanos", scope: !114, file: !1, line: 177, baseType: !46, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mtime_nanos", scope: !114, file: !1, line: 178, baseType: !46, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ctime_nanos", scope: !114, file: !1, line: 179, baseType: !46, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fflags_set", scope: !114, file: !1, line: 180, baseType: !46, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata_size", scope: !114, file: !1, line: 181, baseType: !44, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mac_metadata", scope: !114, file: !1, line: 182, baseType: !163, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !114, file: !1, line: 183, baseType: !22, size: 32, align: 32, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !1, line: 184, baseType: !94, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "current_fixup", scope: !5, file: !1, line: 221, baseType: !113, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "user_uid", scope: !5, file: !1, line: 222, baseType: !51, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !5, file: !1, line: 223, baseType: !22, size: 32, align: 32, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !5, file: !1, line: 224, baseType: !51, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !5, file: !1, line: 225, baseType: !51, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !5, file: !1, line: 226, baseType: !172, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !173, line: 75, baseType: !174)
!173 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 139, baseType: !41)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_gid", scope: !5, file: !1, line: 228, baseType: !176, size: 64, align: 64, offset: 1792)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!51, !163, !79, !51}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_gid", scope: !5, file: !1, line: 229, baseType: !180, size: 64, align: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !163}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_gid_data", scope: !5, file: !1, line: 230, baseType: !163, size: 64, align: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_uid", scope: !5, file: !1, line: 231, baseType: !176, size: 64, align: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_uid", scope: !5, file: !1, line: 232, baseType: !180, size: 64, align: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_uid_data", scope: !5, file: !1, line: 233, baseType: !163, size: 64, align: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "path_safe", scope: !5, file: !1, line: 238, baseType: !90, size: 192, align: 64, offset: 2176)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !5, file: !1, line: 245, baseType: !189, size: 1152, align: 64, offset: 2368)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !190, line: 46, size: 1152, align: 64, elements: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!191 = !{!192, !194, !196, !198, !199, !201, !203, !204, !205, !207, !209, !211, !217, !218, !219}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !189, file: !190, line: 48, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !40, line: 124, baseType: !46)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !189, file: !190, line: 53, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !40, line: 127, baseType: !46)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !189, file: !190, line: 61, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !40, line: 130, baseType: !46)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !189, file: !190, line: 62, baseType: !111, size: 32, align: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !189, file: !190, line: 64, baseType: !200, size: 32, align: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !40, line: 125, baseType: !12)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !189, file: !190, line: 65, baseType: !202, size: 32, align: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !40, line: 126, baseType: !12)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !189, file: !190, line: 67, baseType: !22, size: 32, align: 32, offset: 288)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !189, file: !190, line: 69, baseType: !193, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !189, file: !190, line: 74, baseType: !206, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 131, baseType: !41)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !189, file: !190, line: 78, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !40, line: 153, baseType: !41)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !189, file: !190, line: 80, baseType: !210, size: 64, align: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !40, line: 158, baseType: !41)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !189, file: !190, line: 91, baseType: !212, size: 128, align: 64, offset: 576)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !173, line: 120, size: 128, align: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !212, file: !173, line: 122, baseType: !174, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !212, file: !173, line: 123, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !40, line: 175, baseType: !41)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !189, file: !190, line: 92, baseType: !212, size: 128, align: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !189, file: !190, line: 93, baseType: !212, size: 128, align: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !189, file: !190, line: 106, baseType: !220, size: 192, align: 64, offset: 960)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 192, align: 64, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 3)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pst", scope: !5, file: !1, line: 246, baseType: !224, size: 64, align: 64, offset: 3520)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !5, file: !1, line: 249, baseType: !29, size: 64, align: 64, offset: 3584)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5, file: !1, line: 250, baseType: !94, size: 64, align: 64, offset: 3648)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_name_data", scope: !5, file: !1, line: 251, baseType: !90, size: 192, align: 64, offset: 3712)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "todo", scope: !5, file: !1, line: 253, baseType: !22, size: 32, align: 32, offset: 3904)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "deferred", scope: !5, file: !1, line: 255, baseType: !22, size: 32, align: 32, offset: 3936)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !1, line: 257, baseType: !22, size: 32, align: 32, offset: 3968)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !5, file: !1, line: 259, baseType: !22, size: 32, align: 32, offset: 4000)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !5, file: !1, line: 261, baseType: !51, size: 64, align: 64, offset: 4032)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fd_offset", scope: !5, file: !1, line: 263, baseType: !51, size: 64, align: 64, offset: 4096)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "total_bytes_written", scope: !5, file: !1, line: 265, baseType: !51, size: 64, align: 64, offset: 4160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !5, file: !1, line: 267, baseType: !51, size: 64, align: 64, offset: 4224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pwd", scope: !5, file: !1, line: 269, baseType: !22, size: 32, align: 32, offset: 4288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !5, file: !1, line: 271, baseType: !110, size: 32, align: 32, offset: 4320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !5, file: !1, line: 273, baseType: !51, size: 64, align: 64, offset: 4352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !5, file: !1, line: 274, baseType: !51, size: 64, align: 64, offset: 4416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "decmpfs_attr_size", scope: !5, file: !1, line: 279, baseType: !241, size: 32, align: 32, offset: 4480)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !52, line: 51, baseType: !12)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "decmpfs_header_p", scope: !5, file: !1, line: 280, baseType: !243, size: 64, align: 64, offset: 4544)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rsrc_xattr_options", scope: !5, file: !1, line: 282, baseType: !22, size: 32, align: 32, offset: 4608)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "resource_fork", scope: !5, file: !1, line: 284, baseType: !243, size: 64, align: 64, offset: 4672)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "resource_fork_allocated_size", scope: !5, file: !1, line: 285, baseType: !44, size: 64, align: 64, offset: 4736)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "decmpfs_block_count", scope: !5, file: !1, line: 286, baseType: !12, size: 32, align: 32, offset: 4800)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "decmpfs_block_info", scope: !5, file: !1, line: 287, baseType: !250, size: 64, align: 64, offset: 4864)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_buffer", scope: !5, file: !1, line: 289, baseType: !243, size: 64, align: 64, offset: 4928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_buffer_size", scope: !5, file: !1, line: 290, baseType: !44, size: 64, align: 64, offset: 4992)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_buffer_remaining", scope: !5, file: !1, line: 291, baseType: !44, size: 64, align: 64, offset: 5056)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_rsrc_position", scope: !5, file: !1, line: 294, baseType: !241, size: 32, align: 32, offset: 5120)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_rsrc_position_v", scope: !5, file: !1, line: 295, baseType: !241, size: 32, align: 32, offset: 5152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_buffer", scope: !5, file: !1, line: 297, baseType: !94, size: 64, align: 64, offset: 5184)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "block_remaining_bytes", scope: !5, file: !1, line: 298, baseType: !44, size: 64, align: 64, offset: 5248)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "file_remaining_bytes", scope: !5, file: !1, line: 299, baseType: !44, size: 64, align: 64, offset: 5312)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !5, file: !1, line: 301, baseType: !260, size: 896, align: 64, offset: 5376)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !261, line: 101, baseType: !262)
!261 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !261, line: 82, size: 896, align: 64, elements: !263)
!263 = !{!264, !269, !271, !273, !274, !275, !276, !277, !282, !288, !293, !294, !295, !296}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !262, file: !261, line: 83, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !267, line: 276, baseType: !268)
!267 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmzlib/zconf.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !267, line: 267, baseType: !244)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !262, file: !261, line: 84, baseType: !270, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !267, line: 269, baseType: !12)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !262, file: !261, line: 85, baseType: !272, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !267, line: 270, baseType: !46)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !262, file: !261, line: 87, baseType: !265, size: 64, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !262, file: !261, line: 88, baseType: !270, size: 32, align: 32, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !262, file: !261, line: 89, baseType: !272, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !262, file: !261, line: 91, baseType: !94, size: 64, align: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !261, line: 92, baseType: !278, size: 64, align: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !261, line: 1346, size: 32, align: 32, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !279, file: !261, line: 1346, baseType: !22, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !262, file: !261, line: 94, baseType: !283, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !261, line: 77, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !287, !270, !270}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !267, line: 285, baseType: !163)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !262, file: !261, line: 95, baseType: !289, size: 64, align: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !261, line: 78, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !287, !287}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !262, file: !261, line: 96, baseType: !287, size: 64, align: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !262, file: !261, line: 98, baseType: !22, size: 32, align: 32, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !262, file: !261, line: 99, baseType: !272, size: 64, align: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !262, file: !261, line: 100, baseType: !272, size: 64, align: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "stream_valid", scope: !5, file: !1, line: 302, baseType: !22, size: 32, align: 32, offset: 6272)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "decmpfs_compression_level", scope: !5, file: !1, line: 303, baseType: !22, size: 32, align: 32, offset: 6304)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !38, line: 60, baseType: !193)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !38, line: 48, baseType: !195)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !52, line: 55, baseType: !46)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !52, line: 134, baseType: !41)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !52, line: 135, baseType: !46)
!304 = !{!305, !306, !309, !312, !313, !317, !318, !321, !324, !325, !328, !331, !334, !337, !340, !341, !342, !343, !346, !351, !354, !355, !356, !359, !362, !365, !366, !367, !368, !369, !372, !373, !374, !375, !378, !379, !382, !383, !384, !385, !386, !389, !390}
!305 = distinct !DISubprogram(name: "archive_write_disk_set_options", scope: !1, file: !1, line: 460, type: !73, isLocal: false, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!306 = distinct !DISubprogram(name: "archive_write_disk_set_skip_file", scope: !1, file: !1, line: 780, type: !307, isLocal: false, isDefinition: true, scopeLine: 781, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!307 = !DISubroutineType(types: !308)
!308 = !{!22, !23, !51, !51}
!309 = distinct !DISubprogram(name: "archive_write_disk_set_group_lookup", scope: !1, file: !1, line: 1743, type: !310, isLocal: false, isDefinition: true, scopeLine: 1747, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!310 = !DISubroutineType(types: !311)
!311 = !{!22, !23, !163, !176, !180}
!312 = distinct !DISubprogram(name: "archive_write_disk_set_user_lookup", scope: !1, file: !1, line: 1762, type: !310, isLocal: false, isDefinition: true, scopeLine: 1766, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!313 = distinct !DISubprogram(name: "archive_write_disk_gid", scope: !1, file: !1, line: 1781, type: !314, isLocal: false, isDefinition: true, scopeLine: 1782, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !23, !79, !51}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !31, line: 73, baseType: !51)
!317 = distinct !DISubprogram(name: "archive_write_disk_uid", scope: !1, file: !1, line: 1792, type: !314, isLocal: false, isDefinition: true, scopeLine: 1793, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!318 = distinct !DISubprogram(name: "archive_write_disk_new", scope: !1, file: !1, line: 1806, type: !319, isLocal: false, isDefinition: true, scopeLine: 1807, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!319 = !DISubroutineType(types: !320)
!320 = !{!23}
!321 = distinct !DISubprogram(name: "archive_write_disk_vtable", scope: !1, file: !1, line: 429, type: !322, isLocal: true, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!322 = !DISubroutineType(types: !323)
!323 = !{!15}
!324 = distinct !DISubprogram(name: "_archive_write_disk_close", scope: !1, file: !1, line: 2270, type: !20, isLocal: true, isDefinition: true, scopeLine: 2271, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!325 = distinct !DISubprogram(name: "sort_dir_list", scope: !1, file: !1, line: 2367, type: !326, isLocal: true, isDefinition: true, scopeLine: 2368, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!326 = !DISubroutineType(types: !327)
!327 = !{!113, !113}
!328 = distinct !DISubprogram(name: "set_times", scope: !1, file: !1, line: 3217, type: !329, isLocal: true, isDefinition: true, scopeLine: 3223, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!329 = !DISubroutineType(types: !330)
!330 = !{!22, !4, !22, !22, !79, !172, !41, !172, !41, !172, !41, !172, !41}
