; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_add_filter_xz.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option_value = type { i32, i32, i32 }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_internal_s = type opaque
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { {}*, {}*, i32 (%struct.archive*, %struct.archive_entry*)*, {}*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, {}*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !46, subprograms: !333, globals: !360)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_add_filter_xz.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{!3, !7, !12, !19, !33, !39}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!5 = !{!6}
!6 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 138, size: 32, align: 32, elements: !9)
!8 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!9 = !{!10, !11}
!10 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!11 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 58, size: 32, align: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!15 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!16 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!17 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!18 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "LZMA_OK", value: 0)
!22 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!23 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!24 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!25 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!26 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!27 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!28 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!29 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!30 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!31 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!32 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!36 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!37 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!38 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 27, size: 32, align: 32, elements: !41)
!40 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!41 = !{!42, !43, !44, !45}
!42 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!43 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!44 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!45 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!46 = !{!47, !166, !234, !235, !332, !159, !240, !66}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write", file: !49, line: 72, size: 2816, align: 64, elements: !50)
!49 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_write_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!50 = !{!51, !153, !154, !155, !156, !160, !161, !167, !173, !176, !177, !178, !179, !205, !206, !207, !208, !212, !216, !217, !221, !225, !226, !227, !228, !233}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !48, file: !49, line: 73, baseType: !52, size: 1280, align: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !53, line: 89, size: 1280, align: 64, elements: !54)
!53 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!54 = !{!55, !57, !58, !126, !127, !128, !129, !130, !131, !132, !133, !141, !142, !143, !144, !147, !148, !149, !150, !151, !152}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !52, file: !53, line: 96, baseType: !56, size: 32, align: 32)
!56 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !52, file: !53, line: 97, baseType: !56, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !52, file: !53, line: 103, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !53, line: 63, size: 832, align: 64, elements: !61)
!61 = !{!62, !68, !69, !76, !77, !91, !97, !102, !103, !110, !111, !115, !119}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !60, file: !53, line: 64, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !67}
!66 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !60, file: !53, line: 65, baseType: !63, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !60, file: !53, line: 66, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!66, !67, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !75, line: 180, flags: DIFlagFwdDecl)
!75 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !60, file: !53, line: 68, baseType: !63, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !60, file: !53, line: 69, baseType: !78, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !67, !86, !88}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !82, line: 109, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !84, line: 172, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!85 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 62, baseType: !90)
!89 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!90 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !60, file: !53, line: 71, baseType: !92, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!81, !67, !86, !88, !95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !96, line: 40, baseType: !85)
!96 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !60, file: !53, line: 74, baseType: !98, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!66, !67, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !60, file: !53, line: 76, baseType: !70, size: 64, align: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !60, file: !53, line: 78, baseType: !104, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!66, !67, !107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !60, file: !53, line: 81, baseType: !63, size: 64, align: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !60, file: !53, line: 82, baseType: !112, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!95, !67, !66}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !60, file: !53, line: 83, baseType: !116, size: 64, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!66, !67, !66}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !60, file: !53, line: 84, baseType: !120, size: 64, align: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !67, !66}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !52, file: !53, line: 105, baseType: !66, size: 32, align: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !52, file: !53, line: 106, baseType: !123, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !52, file: !53, line: 108, baseType: !66, size: 32, align: 32, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !52, file: !53, line: 109, baseType: !123, size: 64, align: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !52, file: !53, line: 112, baseType: !66, size: 32, align: 32, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !52, file: !53, line: 114, baseType: !66, size: 32, align: 32, offset: 416)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !52, file: !53, line: 115, baseType: !123, size: 64, align: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !52, file: !53, line: 116, baseType: !134, size: 192, align: 64, offset: 512)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !135, line: 58, size: 192, align: 64, elements: !136)
!135 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!136 = !{!137, !139, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !134, file: !135, line: 59, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !134, file: !135, line: 60, baseType: !88, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !134, file: !135, line: 61, baseType: !88, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !52, file: !53, line: 118, baseType: !138, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !52, file: !53, line: 119, baseType: !56, size: 32, align: 32, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !52, file: !53, line: 120, baseType: !56, size: 32, align: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !52, file: !53, line: 121, baseType: !145, size: 64, align: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !135, line: 70, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !52, file: !53, line: 127, baseType: !123, size: 64, align: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !52, file: !53, line: 128, baseType: !95, size: 64, align: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !52, file: !53, line: 129, baseType: !95, size: 64, align: 64, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !52, file: !53, line: 130, baseType: !88, size: 64, align: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !52, file: !53, line: 137, baseType: !125, size: 8, align: 8, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !52, file: !53, line: 138, baseType: !88, size: 64, align: 64, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !48, file: !49, line: 76, baseType: !66, size: 32, align: 32, offset: 1280)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !48, file: !49, line: 77, baseType: !95, size: 64, align: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !48, file: !49, line: 78, baseType: !95, size: 64, align: 64, offset: 1408)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nulls", scope: !48, file: !49, line: 81, baseType: !157, size: 64, align: 64, offset: 1472)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "null_length", scope: !48, file: !49, line: 82, baseType: !88, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "client_opener", scope: !48, file: !49, line: 85, baseType: !162, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !75, line: 241, baseType: !164)
!164 = !DISubroutineType(types: !165)
!165 = !{!66, !67, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "client_writer", scope: !48, file: !49, line: 86, baseType: !168, size: 64, align: 64, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_write_callback", file: !75, line: 237, baseType: !170)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !67, !166, !86, !88}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !75, line: 95, baseType: !81)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "client_closer", scope: !48, file: !49, line: 87, baseType: !174, size: 64, align: 64, offset: 1728)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !75, line: 243, baseType: !164)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !48, file: !49, line: 88, baseType: !166, size: 64, align: 64, offset: 1792)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !48, file: !49, line: 96, baseType: !66, size: 32, align: 32, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !48, file: !49, line: 97, baseType: !66, size: 32, align: 32, offset: 1888)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "filter_first", scope: !48, file: !49, line: 102, baseType: !180, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_write_filter", file: !49, line: 43, size: 768, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !190, !194, !198, !199, !200, !201, !202, !203, !204}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !181, file: !49, line: 44, baseType: !95, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !181, file: !49, line: 45, baseType: !67, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next_filter", scope: !181, file: !49, line: 46, baseType: !180, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !181, file: !49, line: 47, baseType: !187, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!66, !180, !123, !123}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !181, file: !49, line: 49, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!66, !180}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !181, file: !49, line: 50, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !180, !86, !88}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !181, file: !49, line: 51, baseType: !191, size: 64, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !181, file: !49, line: 52, baseType: !191, size: 64, align: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !49, line: 53, baseType: !166, size: 64, align: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !49, line: 54, baseType: !123, size: 64, align: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !181, file: !49, line: 55, baseType: !66, size: 32, align: 32, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_per_block", scope: !181, file: !49, line: 56, baseType: !66, size: 32, align: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_last_block", scope: !181, file: !49, line: 57, baseType: !66, size: 32, align: 32, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filter_last", scope: !48, file: !49, line: 103, baseType: !180, size: 64, align: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "format_data", scope: !48, file: !49, line: 109, baseType: !166, size: 64, align: 64, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "format_name", scope: !48, file: !49, line: 110, baseType: !123, size: 64, align: 64, offset: 2112)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "format_init", scope: !48, file: !49, line: 111, baseType: !209, size: 64, align: 64, offset: 2176)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!66, !47}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "format_options", scope: !48, file: !49, line: 112, baseType: !213, size: 64, align: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!66, !47, !123, !123}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "format_finish_entry", scope: !48, file: !49, line: 114, baseType: !209, size: 64, align: 64, offset: 2304)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "format_write_header", scope: !48, file: !49, line: 115, baseType: !218, size: 64, align: 64, offset: 2368)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!66, !47, !73}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "format_write_data", scope: !48, file: !49, line: 117, baseType: !222, size: 64, align: 64, offset: 2432)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!81, !47, !86, !88}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "format_close", scope: !48, file: !49, line: 119, baseType: !209, size: 64, align: 64, offset: 2496)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "format_free", scope: !48, file: !49, line: 120, baseType: !209, size: 64, align: 64, offset: 2560)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !48, file: !49, line: 126, baseType: !138, size: 64, align: 64, offset: 2624)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase_callback", scope: !48, file: !49, line: 127, baseType: !229, size: 64, align: 64, offset: 2688)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !75, line: 256, baseType: !231)
!231 = !DISubroutineType(types: !232)
!232 = !{!123, !67, !166}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase_client_data", scope: !48, file: !49, line: 128, baseType: !166, size: 64, align: 64, offset: 2752)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "private_data", file: !1, line: 101, size: 2624, align: 64, elements: !237)
!237 = !{!238, !239, !241, !285, !297, !327, !328, !329, !330, !331}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !236, file: !1, line: 102, baseType: !66, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !236, file: !1, line: 103, baseType: !240, size: 32, align: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 51, baseType: !56)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !236, file: !1, line: 104, baseType: !242, size: 1088, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, align: 64, elements: !244)
!244 = !{!245, !249, !250, !252, !254, !255, !256, !270, !274, !275, !276, !277, !278, !279, !280, !281, !282, !284}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !243, file: !4, line: 454, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !96, line: 48, baseType: !159)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !243, file: !4, line: 455, baseType: !88, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !243, file: !4, line: 456, baseType: !251, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !96, line: 55, baseType: !90)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !243, file: !4, line: 458, baseType: !253, size: 64, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !243, file: !4, line: 459, baseType: !88, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !243, file: !4, line: 460, baseType: !251, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !243, file: !4, line: 468, baseType: !257, size: 64, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !259)
!259 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !260)
!260 = !{!261, !265, !269}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !259, file: !4, line: 376, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!166, !166, !88, !88}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !259, file: !4, line: 390, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !166, !166}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !259, file: !4, line: 401, baseType: !166, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !4, line: 471, baseType: !271, size: 64, align: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !4, line: 411, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !243, file: !4, line: 479, baseType: !166, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !243, file: !4, line: 480, baseType: !166, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !243, file: !4, line: 481, baseType: !166, size: 64, align: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !243, file: !4, line: 482, baseType: !166, size: 64, align: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !243, file: !4, line: 483, baseType: !251, size: 64, align: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !243, file: !4, line: 484, baseType: !251, size: 64, align: 64, offset: 832)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !243, file: !4, line: 485, baseType: !88, size: 64, align: 64, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !243, file: !4, line: 486, baseType: !88, size: 64, align: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !243, file: !4, line: 487, baseType: !283, size: 32, align: 32, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !3)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !243, file: !4, line: 488, baseType: !283, size: 32, align: 32, offset: 1056)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lzmafilters", scope: !236, file: !1, line: 105, baseType: !286, size: 256, align: 64, offset: 1152)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 256, align: 64, elements: !295)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !288, line: 65, baseType: !289)
!288 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!289 = !DICompositeType(tag: DW_TAG_structure_type, file: !288, line: 43, size: 128, align: 64, elements: !290)
!290 = !{!291, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !289, file: !288, line: 54, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !293, line: 63, baseType: !251)
!293 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !289, file: !288, line: 63, baseType: !166, size: 64, align: 64, offset: 64)
!295 = !{!296}
!296 = !DISubrange(count: 2)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lzma_opt", scope: !236, file: !1, line: 106, baseType: !298, size: 896, align: 64, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !8, line: 399, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 185, size: 896, align: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !309, !310, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !299, file: !8, line: 217, baseType: !240, size: 32, align: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !299, file: !8, line: 240, baseType: !246, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !299, file: !8, line: 254, baseType: !240, size: 32, align: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !299, file: !8, line: 281, baseType: !240, size: 32, align: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !299, file: !8, line: 293, baseType: !240, size: 32, align: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !299, file: !8, line: 316, baseType: !240, size: 32, align: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !299, file: !8, line: 322, baseType: !308, size: 32, align: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !8, line: 155, baseType: !7)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !299, file: !8, line: 342, baseType: !240, size: 32, align: 32, offset: 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !299, file: !8, line: 345, baseType: !311, size: 32, align: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !8, line: 111, baseType: !12)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !299, file: !8, line: 375, baseType: !240, size: 32, align: 32, offset: 352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !299, file: !8, line: 384, baseType: !240, size: 32, align: 32, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !299, file: !8, line: 385, baseType: !240, size: 32, align: 32, offset: 416)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !299, file: !8, line: 386, baseType: !240, size: 32, align: 32, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !299, file: !8, line: 387, baseType: !240, size: 32, align: 32, offset: 480)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !299, file: !8, line: 388, baseType: !240, size: 32, align: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !299, file: !8, line: 389, baseType: !240, size: 32, align: 32, offset: 544)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !299, file: !8, line: 390, baseType: !240, size: 32, align: 32, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !299, file: !8, line: 391, baseType: !240, size: 32, align: 32, offset: 608)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !299, file: !8, line: 392, baseType: !283, size: 32, align: 32, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !299, file: !8, line: 393, baseType: !283, size: 32, align: 32, offset: 672)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !299, file: !8, line: 394, baseType: !283, size: 32, align: 32, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !299, file: !8, line: 395, baseType: !283, size: 32, align: 32, offset: 736)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !299, file: !8, line: 396, baseType: !166, size: 64, align: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !299, file: !8, line: 397, baseType: !166, size: 64, align: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !236, file: !1, line: 107, baseType: !95, size: 64, align: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !236, file: !1, line: 108, baseType: !234, size: 64, align: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_buffer_size", scope: !236, file: !1, line: 109, baseType: !88, size: 64, align: 64, offset: 2432)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !236, file: !1, line: 110, baseType: !95, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !236, file: !1, line: 112, baseType: !240, size: 32, align: 32, offset: 2560)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !96, line: 135, baseType: !90)
!333 = !{!334, !336, !337, !338, !339, !340, !341, !342, !343, !344, !347, !350, !351, !355, !358, !359}
!334 = distinct !DISubprogram(name: "archive_write_set_compression_lzip", scope: !1, file: !1, line: 52, type: !64, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!335 = !{}
!336 = distinct !DISubprogram(name: "archive_write_set_compression_lzma", scope: !1, file: !1, line: 59, type: !64, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!337 = distinct !DISubprogram(name: "archive_write_set_compression_xz", scope: !1, file: !1, line: 66, type: !64, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!338 = distinct !DISubprogram(name: "archive_write_add_filter_xz", scope: !1, file: !1, line: 167, type: !64, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!339 = distinct !DISubprogram(name: "archive_write_add_filter_lzma", scope: !1, file: !1, line: 187, type: !64, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!340 = distinct !DISubprogram(name: "archive_write_add_filter_lzip", scope: !1, file: !1, line: 204, type: !64, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!341 = distinct !DISubprogram(name: "common_setup", scope: !1, file: !1, line: 144, type: !192, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!342 = distinct !DISubprogram(name: "archive_compressor_xz_open", scope: !1, file: !1, line: 307, type: !192, isLocal: true, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!343 = distinct !DISubprogram(name: "archive_compressor_xz_write", scope: !1, file: !1, line: 420, type: !196, isLocal: true, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!344 = distinct !DISubprogram(name: "drive_compressor", scope: !1, file: !1, line: 488, type: !345, isLocal: true, isDefinition: true, scopeLine: 490, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!345 = !DISubroutineType(types: !346)
!346 = !{!66, !180, !235, !66}
!347 = distinct !DISubprogram(name: "archive_compressor_xz_init_stream", scope: !1, file: !1, line: 221, type: !348, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!348 = !DISubroutineType(types: !349)
!349 = !{!66, !180, !235}
!350 = distinct !DISubprogram(name: "archive_compressor_xz_close", scope: !1, file: !1, line: 445, type: !192, isLocal: true, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!351 = distinct !DISubprogram(name: "archive_le32enc", scope: !352, file: !352, line: 177, type: !353, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!352 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_endian.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!353 = !DISubroutineType(types: !354)
!354 = !{null, !166, !240}
!355 = distinct !DISubprogram(name: "archive_le64enc", scope: !352, file: !352, line: 188, type: !356, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !166, !251}
!358 = distinct !DISubprogram(name: "archive_compressor_xz_free", scope: !1, file: !1, line: 471, type: !192, isLocal: true, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!359 = distinct !DISubprogram(name: "archive_compressor_xz_options", scope: !1, file: !1, line: 379, type: !188, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, variables: !335)
!360 = !{!361, !371}
!361 = !DIGlobalVariable(name: "option_values", scope: !0, file: !1, line: 130, type: !362, isLocal: true, isDefinition: true, variable: [10 x %struct.option_value]* @option_values)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 960, align: 32, elements: !369)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "option_value", file: !1, line: 125, size: 96, align: 32, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !364, file: !1, line: 126, baseType: !240, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !364, file: !1, line: 127, baseType: !240, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !364, file: !1, line: 128, baseType: !311, size: 32, align: 32, offset: 64)
!369 = !{!370}
!370 = !DISubrange(count: 10)
!371 = !DIGlobalVariable(name: "lzma_stream_init_data", scope: !347, file: !1, line: 224, type: !372, isLocal: true, isDefinition: true, variable: %struct.lzma_stream* @archive_compressor_xz_init_stream.lzma_stream_init_data)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!373 = !{i32 2, !"Dwarf Version", i32 4}
!374 = !{i32 2, !"Debug Info Version", i32 3}
!375 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!376 = !DILocalVariable(name: "a", arg: 1, scope: !334, file: !1, line: 52, type: !67)
!377 = !DIExpression()
!378 = !DILocation(line: 52, column: 52, scope: !334)
!379 = !DILocation(line: 54, column: 31, scope: !334)
!380 = !DILocation(line: 54, column: 2, scope: !334)
!381 = !DILocation(line: 55, column: 40, scope: !334)
!382 = !DILocation(line: 55, column: 10, scope: !334)
!383 = !DILocation(line: 55, column: 2, scope: !334)
!384 = !DILocalVariable(name: "_a", arg: 1, scope: !340, file: !1, line: 204, type: !67)
!385 = !DILocation(line: 204, column: 47, scope: !340)
!386 = !DILocalVariable(name: "f", scope: !340, file: !1, line: 206, type: !180)
!387 = !DILocation(line: 206, column: 31, scope: !340)
!388 = !DILocalVariable(name: "r", scope: !340, file: !1, line: 207, type: !66)
!389 = !DILocation(line: 207, column: 6, scope: !340)
!390 = !DILocation(line: 209, column: 2, scope: !340)
!391 = !DILocalVariable(name: "magic_test", scope: !392, file: !1, line: 209, type: !66)
!392 = distinct !DILexicalBlock(scope: !340, file: !1, line: 209, column: 2)
!393 = !DILocation(line: 209, column: 2, scope: !392)
!394 = !DILocation(line: 209, column: 2, scope: !395)
!395 = !DILexicalBlockFile(scope: !392, file: !1, discriminator: 1)
!396 = !DILocation(line: 209, column: 2, scope: !397)
!397 = !DILexicalBlockFile(scope: !398, file: !1, discriminator: 2)
!398 = distinct !DILexicalBlock(scope: !392, file: !1, line: 209, column: 2)
!399 = !DILocation(line: 209, column: 2, scope: !400)
!400 = !DILexicalBlockFile(scope: !392, file: !1, discriminator: 3)
!401 = !DILocation(line: 211, column: 38, scope: !340)
!402 = !DILocation(line: 211, column: 6, scope: !340)
!403 = !DILocation(line: 211, column: 4, scope: !340)
!404 = !DILocation(line: 212, column: 19, scope: !340)
!405 = !DILocation(line: 212, column: 6, scope: !340)
!406 = !DILocation(line: 212, column: 4, scope: !340)
!407 = !DILocation(line: 213, column: 6, scope: !408)
!408 = distinct !DILexicalBlock(scope: !340, file: !1, line: 213, column: 6)
!409 = !DILocation(line: 213, column: 8, scope: !408)
!410 = !DILocation(line: 213, column: 6, scope: !340)
!411 = !DILocation(line: 214, column: 3, scope: !412)
!412 = distinct !DILexicalBlock(scope: !408, file: !1, line: 213, column: 23)
!413 = !DILocation(line: 214, column: 6, scope: !412)
!414 = !DILocation(line: 214, column: 11, scope: !412)
!415 = !DILocation(line: 215, column: 3, scope: !412)
!416 = !DILocation(line: 215, column: 6, scope: !412)
!417 = !DILocation(line: 215, column: 11, scope: !412)
!418 = !DILocation(line: 216, column: 2, scope: !412)
!419 = !DILocation(line: 217, column: 10, scope: !340)
!420 = !DILocation(line: 217, column: 2, scope: !340)
!421 = !DILocation(line: 218, column: 1, scope: !340)
!422 = !DILocalVariable(name: "a", arg: 1, scope: !336, file: !1, line: 59, type: !67)
!423 = !DILocation(line: 59, column: 52, scope: !336)
!424 = !DILocation(line: 61, column: 31, scope: !336)
!425 = !DILocation(line: 61, column: 2, scope: !336)
!426 = !DILocation(line: 62, column: 40, scope: !336)
!427 = !DILocation(line: 62, column: 10, scope: !336)
!428 = !DILocation(line: 62, column: 2, scope: !336)
!429 = !DILocalVariable(name: "_a", arg: 1, scope: !339, file: !1, line: 187, type: !67)
!430 = !DILocation(line: 187, column: 47, scope: !339)
!431 = !DILocalVariable(name: "f", scope: !339, file: !1, line: 189, type: !180)
