; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_extract2.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.archive_read_extract = type { %struct.archive*, void (i8*)*, i8* }
%struct.archive = type { i32, i32, %struct.archive_vtable*, i32, i8*, i32, i8*, i32, i32, i8*, %struct.archive_string, i8*, i32, i32, %struct.archive_string_conv*, i8*, i64, i64, i64, i8, i64 }
%struct.archive_vtable = type { i32 (%struct.archive*)*, i32 (%struct.archive*)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i8*, i64)*, i64 (%struct.archive*, i8*, i64, i64)*, i32 (%struct.archive*, %struct.archive_entry**)*, i32 (%struct.archive*, %struct.archive_entry*)*, i32 (%struct.archive*, i8**, i64*, i64*)*, i32 (%struct.archive*)*, i64 (%struct.archive*, i32)*, i32 (%struct.archive*, i32)*, i8* (%struct.archive*, i32)* }
%struct.archive_entry = type opaque
%struct.archive_string = type { i8*, i64, i64 }
%struct.archive_string_conv = type opaque
%struct.archive_read = type { %struct.archive, %struct.archive_entry*, i32, i64, i64, %struct.archive_read_client, [16 x %struct.archive_read_filter_bidder], %struct.archive_read_filter*, i32, i64, i32, i32, [16 x %struct.archive_format_descriptor], %struct.archive_format_descriptor*, %struct.archive_read_extract*, i32 (%struct.archive_read*)*, %struct.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !291)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_extract2.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!2 = !{}
!3 = !{!4, !5, !116, !25}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_extract", file: !7, line: 151, size: 192, align: 64, elements: !8)
!7 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_read_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!8 = !{!9, !111, !115}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !6, file: !7, line: 152, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive", file: !12, line: 89, size: 1280, align: 64, elements: !13)
!12 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!13 = !{!14, !16, !17, !84, !85, !86, !87, !88, !89, !90, !91, !99, !100, !101, !102, !105, !106, !107, !108, !109, !110}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !11, file: !12, line: 96, baseType: !15, size: 32, align: 32)
!15 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !12, line: 97, baseType: !15, size: 32, align: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !11, file: !12, line: 103, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_vtable", file: !12, line: 63, size: 832, align: 64, elements: !20)
!20 = !{!21, !26, !27, !34, !35, !49, !55, !60, !61, !68, !69, !73, !77}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "archive_close", scope: !19, file: !12, line: 64, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !10}
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "archive_free", scope: !19, file: !12, line: 65, baseType: !22, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_header", scope: !19, file: !12, line: 66, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!25, !10, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_entry", file: !33, line: 180, flags: DIFlagFwdDecl)
!33 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_finish_entry", scope: !19, file: !12, line: 68, baseType: !22, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data", scope: !19, file: !12, line: 69, baseType: !36, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !10, !44, !46}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !40, line: 109, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !42, line: 172, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!43 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 62, baseType: !48)
!47 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "archive_write_data_block", scope: !19, file: !12, line: 71, baseType: !50, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!39, !10, !44, !46, !53}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 40, baseType: !43)
!54 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header", scope: !19, file: !12, line: 74, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!25, !10, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_next_header2", scope: !19, file: !12, line: 76, baseType: !28, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "archive_read_data_block", scope: !19, file: !12, line: 78, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!25, !10, !65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_count", scope: !19, file: !12, line: 81, baseType: !22, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_bytes", scope: !19, file: !12, line: 82, baseType: !70, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!53, !10, !25}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_code", scope: !19, file: !12, line: 83, baseType: !74, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!25, !10, !25}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "archive_filter_name", scope: !19, file: !12, line: 84, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !10, !25}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format", scope: !11, file: !12, line: 105, baseType: !25, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "archive_format_name", scope: !11, file: !12, line: 106, baseType: !81, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compression_code", scope: !11, file: !12, line: 108, baseType: !25, size: 32, align: 32, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "compression_name", scope: !11, file: !12, line: 109, baseType: !81, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "file_count", scope: !11, file: !12, line: 112, baseType: !25, size: 32, align: 32, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "archive_error_number", scope: !11, file: !12, line: 114, baseType: !25, size: 32, align: 32, offset: 416)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !11, file: !12, line: 115, baseType: !81, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "error_string", scope: !11, file: !12, line: 116, baseType: !92, size: 192, align: 64, offset: 512)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string", file: !93, line: 58, size: 192, align: 64, elements: !94)
!93 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive/archive_string.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibarchive/libarchive")
!94 = !{!95, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !92, file: !93, line: 59, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !92, file: !93, line: 60, baseType: !46, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !92, file: !93, line: 61, baseType: !46, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "current_code", scope: !11, file: !12, line: 118, baseType: !96, size: 64, align: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_codepage", scope: !11, file: !12, line: 119, baseType: !15, size: 32, align: 32, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "current_oemcp", scope: !11, file: !12, line: 120, baseType: !15, size: 32, align: 32, offset: 800)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sconv", scope: !11, file: !12, line: 121, baseType: !103, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_string_conv", file: !93, line: 70, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_block", scope: !11, file: !12, line: 127, baseType: !81, size: 64, align: 64, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_offset", scope: !11, file: !12, line: 128, baseType: !53, size: 64, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_output_offset", scope: !11, file: !12, line: 129, baseType: !53, size: 64, align: 64, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_remaining", scope: !11, file: !12, line: 130, baseType: !46, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_is_posix_read", scope: !11, file: !12, line: 137, baseType: !83, size: 8, align: 8, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_requested", scope: !11, file: !12, line: 138, baseType: !46, size: 64, align: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress", scope: !6, file: !7, line: 155, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !4}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "extract_progress_user_data", scope: !6, file: !7, line: 156, baseType: !4, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read", file: !7, line: 159, size: 20288, align: 64, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !167, !231, !232, !233, !234, !235, !236, !269, !271, !272, !273}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !117, file: !7, line: 160, baseType: !11, size: 1280, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !117, file: !7, line: 162, baseType: !31, size: 64, align: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_set", scope: !117, file: !7, line: 165, baseType: !25, size: 32, align: 32, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_dev", scope: !117, file: !7, line: 166, baseType: !53, size: 64, align: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "skip_file_ino", scope: !117, file: !7, line: 167, baseType: !53, size: 64, align: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !117, file: !7, line: 170, baseType: !125, size: 576, align: 64, offset: 1536)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_client", file: !7, line: 134, size: 576, align: 64, elements: !126)
!126 = !{!127, !132, !138, !144, !149, !152, !157, !158, !159, !160}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "opener", scope: !125, file: !7, line: 135, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_open_callback", file: !33, line: 241, baseType: !130)
!130 = !DISubroutineType(types: !131)
!131 = !{!25, !10, !4}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !125, file: !7, line: 136, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_read_callback", file: !33, line: 218, baseType: !135)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !10, !4, !65}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_ssize_t", file: !33, line: 95, baseType: !39)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "skipper", scope: !125, file: !7, line: 137, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_skip_callback", file: !33, line: 226, baseType: !141)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !10, !4, !143}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "la_int64_t", file: !33, line: 73, baseType: !53)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !125, file: !7, line: 138, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_seek_callback", file: !33, line: 233, baseType: !147)
!147 = !DISubroutineType(types: !148)
!148 = !{!143, !10, !4, !143, !25}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "closer", scope: !125, file: !7, line: 139, baseType: !150, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_close_callback", file: !33, line: 243, baseType: !130)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "switcher", scope: !125, file: !7, line: 140, baseType: !153, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_switch_callback", file: !33, line: 249, baseType: !155)
!155 = !DISubroutineType(types: !156)
!156 = !{!25, !10, !4, !4}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !125, file: !7, line: 141, baseType: !15, size: 32, align: 32, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !125, file: !7, line: 142, baseType: !15, size: 32, align: 32, offset: 416)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !125, file: !7, line: 143, baseType: !53, size: 64, align: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !125, file: !7, line: 144, baseType: !161, size: 64, align: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_data_node", file: !7, line: 129, size: 192, align: 64, elements: !163)
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "begin_position", scope: !162, file: !7, line: 130, baseType: !53, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !162, file: !7, line: 131, baseType: !53, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !7, line: 132, baseType: !4, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bidders", scope: !117, file: !7, line: 173, baseType: !168, size: 6144, align: 64, offset: 2112)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 6144, align: 64, elements: !229)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter_bidder", file: !7, line: 60, size: 384, align: 64, elements: !170)
!170 = !{!171, !172, !173, !220, !221, !225}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !7, line: 62, baseType: !4, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !7, line: 64, baseType: !81, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !169, file: !7, line: 66, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!25, !177, !178}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_filter", file: !7, line: 82, size: 1408, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !189, !193, !197, !201, !202, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !179, file: !7, line: 83, baseType: !53, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bidder", scope: !179, file: !7, line: 86, baseType: !177, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !179, file: !7, line: 87, baseType: !178, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !179, file: !7, line: 88, baseType: !116, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !179, file: !7, line: 90, baseType: !186, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!25, !178}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !179, file: !7, line: 92, baseType: !190, size: 64, align: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!39, !178, !65}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !179, file: !7, line: 94, baseType: !194, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!53, !178, !53}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !179, file: !7, line: 96, baseType: !198, size: 64, align: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!53, !178, !53, !25}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !179, file: !7, line: 98, baseType: !186, size: 64, align: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sswitch", scope: !179, file: !7, line: 100, baseType: !203, size: 64, align: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!25, !178, !15}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !7, line: 102, baseType: !4, size: 64, align: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !7, line: 104, baseType: !81, size: 64, align: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !179, file: !7, line: 105, baseType: !25, size: 32, align: 32, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !179, file: !7, line: 108, baseType: !96, size: 64, align: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !179, file: !7, line: 109, baseType: !46, size: 64, align: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !7, line: 110, baseType: !96, size: 64, align: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !179, file: !7, line: 111, baseType: !46, size: 64, align: 64, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "client_buff", scope: !179, file: !7, line: 112, baseType: !44, size: 64, align: 64, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "client_total", scope: !179, file: !7, line: 113, baseType: !46, size: 64, align: 64, offset: 1152)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "client_next", scope: !179, file: !7, line: 114, baseType: !81, size: 64, align: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "client_avail", scope: !179, file: !7, line: 115, baseType: !46, size: 64, align: 64, offset: 1280)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_file", scope: !179, file: !7, line: 116, baseType: !83, size: 8, align: 8, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !179, file: !7, line: 117, baseType: !83, size: 8, align: 8, offset: 1352)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !179, file: !7, line: 118, baseType: !83, size: 8, align: 8, offset: 1360)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !169, file: !7, line: 69, baseType: !186, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !169, file: !7, line: 71, baseType: !222, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!25, !177, !81, !81}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !169, file: !7, line: 74, baseType: !226, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!25, !177}
!229 = !{!230}
!230 = !DISubrange(count: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !117, file: !7, line: 176, baseType: !178, size: 64, align: 64, offset: 8256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_filter_bidding", scope: !117, file: !7, line: 179, baseType: !25, size: 32, align: 32, offset: 8320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "header_position", scope: !117, file: !7, line: 182, baseType: !53, size: 64, align: 64, offset: 8384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data_start_node", scope: !117, file: !7, line: 185, baseType: !15, size: 32, align: 32, offset: 8448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data_end_node", scope: !117, file: !7, line: 186, baseType: !15, size: 32, align: 32, offset: 8480)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !117, file: !7, line: 209, baseType: !237, size: 11264, align: 64, offset: 8512)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 11264, align: 64, elements: !229)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_format_descriptor", file: !7, line: 196, size: 704, align: 64, elements: !239)
!239 = !{!240, !241, !242, !246, !250, !254, !258, !262, !266, !267, !268}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !7, line: 197, baseType: !4, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !7, line: 198, baseType: !81, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bid", scope: !238, file: !7, line: 199, baseType: !243, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!25, !116, !25}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !238, file: !7, line: 200, baseType: !247, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!25, !116, !81, !81}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !238, file: !7, line: 202, baseType: !251, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!25, !116, !31}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "read_data", scope: !238, file: !7, line: 203, baseType: !255, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!25, !116, !65, !66, !67}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_skip", scope: !238, file: !7, line: 204, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!25, !116}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "seek_data", scope: !238, file: !7, line: 205, baseType: !263, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!53, !116, !53, !25}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !238, file: !7, line: 206, baseType: !259, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "format_capabilties", scope: !238, file: !7, line: 207, baseType: !259, size: 64, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "has_encrypted_entries", scope: !238, file: !7, line: 208, baseType: !259, size: 64, align: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !117, file: !7, line: 210, baseType: !270, size: 64, align: 64, offset: 19776)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !117, file: !7, line: 215, baseType: !5, size: 64, align: 64, offset: 19840)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_archive_extract", scope: !117, file: !7, line: 216, baseType: !259, size: 64, align: 64, offset: 19904)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "passphrases", scope: !117, file: !7, line: 227, baseType: !274, size: 320, align: 64, offset: 19968)
!274 = !DICompositeType(tag: DW_TAG_structure_type, scope: !117, file: !7, line: 221, size: 320, align: 64, elements: !275)
!275 = !{!276, !282, !284, !285, !290}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !274, file: !7, line: 222, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "archive_read_passphrase", file: !7, line: 146, size: 128, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "passphrase", scope: !278, file: !7, line: 147, baseType: !96, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !7, line: 148, baseType: !277, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !274, file: !7, line: 223, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !274, file: !7, line: 224, baseType: !25, size: 32, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !274, file: !7, line: 225, baseType: !286, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "archive_passphrase_callback", file: !33, line: 256, baseType: !288)
!288 = !DISubroutineType(types: !289)
!289 = !{!81, !10, !4}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !274, file: !7, line: 226, baseType: !4, size: 64, align: 64, offset: 256)
!291 = !{!292, !295, !298, !301, !302}
!292 = distinct !DISubprogram(name: "__archive_read_get_extract", scope: !1, file: !1, line: 52, type: !293, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!293 = !DISubroutineType(types: !294)
!294 = !{!5, !116}
!295 = distinct !DISubprogram(name: "archive_read_extract2", scope: !1, file: !1, line: 82, type: !296, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!296 = !DISubroutineType(types: !297)
!297 = !{!25, !10, !31, !10}
!298 = distinct !DISubprogram(name: "archive_read_extract_set_progress_callback", scope: !1, file: !1, line: 114, type: !299, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !10, !112, !4}
!301 = distinct !DISubprogram(name: "archive_read_extract_cleanup", scope: !1, file: !1, line: 69, type: !260, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!302 = distinct !DISubprogram(name: "copy_data", scope: !1, file: !1, line: 126, type: !303, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!303 = !DISubroutineType(types: !304)
!304 = !{!25, !10, !10}
!305 = !{i32 2, !"Dwarf Version", i32 4}
!306 = !{i32 2, !"Debug Info Version", i32 3}
!307 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!308 = !DILocalVariable(name: "a", arg: 1, scope: !292, file: !1, line: 52, type: !116)
!309 = !DIExpression()
!310 = !DILocation(line: 52, column: 49, scope: !292)
!311 = !DILocation(line: 54, column: 6, scope: !312)
!312 = distinct !DILexicalBlock(scope: !292, file: !1, line: 54, column: 6)
!313 = !DILocation(line: 54, column: 9, scope: !312)
!314 = !DILocation(line: 54, column: 17, scope: !312)
!315 = !DILocation(line: 54, column: 6, scope: !292)
!316 = !DILocation(line: 55, column: 47, scope: !317)
!317 = distinct !DILexicalBlock(scope: !312, file: !1, line: 54, column: 26)
!318 = !DILocation(line: 55, column: 16, scope: !317)
!319 = !DILocation(line: 55, column: 3, scope: !317)
!320 = !DILocation(line: 55, column: 6, scope: !317)
!321 = !DILocation(line: 55, column: 14, scope: !317)
!322 = !DILocation(line: 56, column: 7, scope: !323)
!323 = distinct !DILexicalBlock(scope: !317, file: !1, line: 56, column: 7)
!324 = !DILocation(line: 56, column: 10, scope: !323)
!325 = !DILocation(line: 56, column: 18, scope: !323)
!326 = !DILocation(line: 56, column: 7, scope: !317)
!327 = !DILocation(line: 57, column: 23, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !1, line: 56, column: 27)
!329 = !DILocation(line: 57, column: 26, scope: !328)
!330 = !DILocation(line: 57, column: 4, scope: !328)
!331 = !DILocation(line: 58, column: 4, scope: !328)
!332 = !DILocation(line: 60, column: 3, scope: !317)
!333 = !DILocation(line: 60, column: 6, scope: !317)
!334 = !DILocation(line: 60, column: 30, scope: !317)
!335 = !DILocation(line: 61, column: 2, scope: !317)
!336 = !DILocation(line: 62, column: 10, scope: !292)
!337 = !DILocation(line: 62, column: 13, scope: !292)
!338 = !DILocation(line: 62, column: 2, scope: !292)
!339 = !DILocation(line: 63, column: 1, scope: !292)
!340 = !DILocalVariable(name: "a", arg: 1, scope: !301, file: !1, line: 69, type: !116)
!341 = !DILocation(line: 69, column: 51, scope: !301)
!342 = !DILocalVariable(name: "ret", scope: !301, file: !1, line: 71, type: !25)
!343 = !DILocation(line: 71, column: 6, scope: !301)
!344 = !DILocation(line: 73, column: 6, scope: !345)
!345 = distinct !DILexicalBlock(scope: !301, file: !1, line: 73, column: 6)
!346 = !DILocation(line: 73, column: 9, scope: !345)
!347 = !DILocation(line: 73, column: 18, scope: !345)
