; ModuleID = '/data/download/cmake/cmake-master/Source/cm_get_date.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LEXICON = type { i64, i8*, i32, i64 }
%struct.token = type { i32, i64 }
%struct.gdstate = type { %struct.token*, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i32, i64, i64, i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !40, subprograms: !50, globals: !128)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Source/cm_get_date.c", directory: "/data/download/cmake/cmake-master/Source")
!2 = !{!3, !9, !24, !36}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DSTMODE", file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Source/../Utilities/cmlibarchive/libarchive/archive_getdate.c", directory: "/data/download/cmake/cmake-master/Source")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DSTon", value: 0)
!7 = !DIEnumerator(name: "DSToff", value: 1)
!8 = !DIEnumerator(name: "DSTmaybe", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 46, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "/usr/include/ctype.h", directory: "/data/download/cmake/cmake-master/Source")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "_ISupper", value: 256)
!13 = !DIEnumerator(name: "_ISlower", value: 512)
!14 = !DIEnumerator(name: "_ISalpha", value: 1024)
!15 = !DIEnumerator(name: "_ISdigit", value: 2048)
!16 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!17 = !DIEnumerator(name: "_ISspace", value: 8192)
!18 = !DIEnumerator(name: "_ISprint", value: 16384)
!19 = !DIEnumerator(name: "_ISgraph", value: 32768)
!20 = !DIEnumerator(name: "_ISblank", value: 1)
!21 = !DIEnumerator(name: "_IScntrl", value: 2)
!22 = !DIEnumerator(name: "_ISpunct", value: 4)
!23 = !DIEnumerator(name: "_ISalnum", value: 8)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 55, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!26 = !DIEnumerator(name: "tAGO", value: 260)
!27 = !DIEnumerator(name: "tDAY", value: 261)
!28 = !DIEnumerator(name: "tDAYZONE", value: 262)
!29 = !DIEnumerator(name: "tAMPM", value: 263)
!30 = !DIEnumerator(name: "tMONTH", value: 264)
!31 = !DIEnumerator(name: "tMONTH_UNIT", value: 265)
!32 = !DIEnumerator(name: "tSEC_UNIT", value: 266)
!33 = !DIEnumerator(name: "tUNUMBER", value: 267)
!34 = !DIEnumerator(name: "tZONE", value: 268)
!35 = !DIEnumerator(name: "tDST", value: 269)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 53, size: 32, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIEnumerator(name: "tAM", value: 0)
!39 = !DIEnumerator(name: "tPM", value: 1)
!40 = !{!41, !42, !43, !44, !45, !46}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !47, line: 75, baseType: !48)
!47 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Source")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !49, line: 139, baseType: !42)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Source")
!50 = !{!51, !58, !75, !80, !111, !112, !113, !114, !115, !116, !119, !122, !125}
!51 = distinct !DISubprogram(name: "cm_get_date", scope: !4, file: !4, line: 897, type: !52, isLocal: false, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!52 = !DISubroutineType(types: !53)
!53 = !{!46, !46, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !{}
!58 = distinct !DISubprogram(name: "difftm", scope: !4, file: !4, line: 871, type: !59, isLocal: true, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!59 = !DISubroutineType(types: !60)
!60 = !{!42, !61, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !47, line: 133, size: 448, align: 64, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !62, file: !47, line: 135, baseType: !43, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !62, file: !47, line: 136, baseType: !43, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !62, file: !47, line: 137, baseType: !43, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !62, file: !47, line: 138, baseType: !43, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !62, file: !47, line: 139, baseType: !43, size: 32, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !62, file: !47, line: 140, baseType: !43, size: 32, align: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !62, file: !47, line: 141, baseType: !43, size: 32, align: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !62, file: !47, line: 142, baseType: !43, size: 32, align: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !62, file: !47, line: 143, baseType: !43, size: 32, align: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !62, file: !47, line: 146, baseType: !42, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !62, file: !47, line: 147, baseType: !54, size: 64, align: 64, offset: 384)
!75 = distinct !DISubprogram(name: "nexttoken", scope: !4, file: !4, line: 785, type: !76, isLocal: true, isDefinition: true, scopeLine: 786, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!76 = !DISubroutineType(types: !77)
!77 = !{!43, !78, !79}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!80 = distinct !DISubprogram(name: "phrase", scope: !4, file: !4, line: 452, type: !81, isLocal: true, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!81 = !DISubroutineType(types: !82)
!82 = !{!43, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "gdstate", file: !4, line: 62, size: 1088, align: 64, elements: !85)
!85 = !{!86, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tokenp", scope: !84, file: !4, line: 63, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "token", file: !4, line: 57, size: 128, align: 64, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !88, file: !4, line: 57, baseType: !43, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !88, file: !4, line: 57, baseType: !46, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "HaveYear", scope: !84, file: !4, line: 67, baseType: !43, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "HaveMonth", scope: !84, file: !4, line: 68, baseType: !43, size: 32, align: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "HaveDay", scope: !84, file: !4, line: 69, baseType: !43, size: 32, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "HaveWeekDay", scope: !84, file: !4, line: 70, baseType: !43, size: 32, align: 32, offset: 160)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "HaveTime", scope: !84, file: !4, line: 71, baseType: !43, size: 32, align: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "HaveZone", scope: !84, file: !4, line: 72, baseType: !43, size: 32, align: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "HaveRel", scope: !84, file: !4, line: 73, baseType: !43, size: 32, align: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Timezone", scope: !84, file: !4, line: 75, baseType: !46, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !84, file: !4, line: 76, baseType: !46, size: 64, align: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !84, file: !4, line: 77, baseType: !46, size: 64, align: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Minutes", scope: !84, file: !4, line: 78, baseType: !46, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !84, file: !4, line: 79, baseType: !46, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", scope: !84, file: !4, line: 80, baseType: !46, size: 64, align: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !84, file: !4, line: 81, baseType: !46, size: 64, align: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "DSTmode", scope: !84, file: !4, line: 83, baseType: !3, size: 32, align: 32, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "DayOrdinal", scope: !84, file: !4, line: 85, baseType: !46, size: 64, align: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "DayNumber", scope: !84, file: !4, line: 86, baseType: !46, size: 64, align: 64, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "RelMonth", scope: !84, file: !4, line: 89, baseType: !46, size: 64, align: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "RelSeconds", scope: !84, file: !4, line: 90, baseType: !46, size: 64, align: 64, offset: 1024)
!111 = distinct !DISubprogram(name: "timephrase", scope: !4, file: !4, line: 104, type: !81, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!112 = distinct !DISubprogram(name: "zonephrase", scope: !4, file: !4, line: 174, type: !81, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!113 = distinct !DISubprogram(name: "datephrase", scope: !4, file: !4, line: 207, type: !81, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!114 = distinct !DISubprogram(name: "dayphrase", scope: !4, file: !4, line: 423, type: !81, isLocal: true, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!115 = distinct !DISubprogram(name: "relunitphrase", scope: !4, file: !4, line: 348, type: !81, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!116 = distinct !DISubprogram(name: "Convert", scope: !4, file: !4, line: 690, type: !117, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!117 = !DISubroutineType(types: !118)
!118 = !{!46, !46, !46, !46, !46, !46, !46, !46, !3}
!119 = distinct !DISubprogram(name: "RelativeMonth", scope: !4, file: !4, line: 763, type: !120, isLocal: true, isDefinition: true, scopeLine: 764, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!120 = !DISubroutineType(types: !121)
!121 = !{!46, !46, !46, !46}
!122 = distinct !DISubprogram(name: "DSTcorrect", scope: !4, file: !4, line: 733, type: !123, isLocal: true, isDefinition: true, scopeLine: 734, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!123 = !DISubroutineType(types: !124)
!124 = !{!46, !46, !46}
!125 = distinct !DISubprogram(name: "RelativeDate", scope: !4, file: !4, line: 745, type: !126, isLocal: true, isDefinition: true, scopeLine: 747, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
!126 = !DISubroutineType(types: !127)
!127 = !{!46, !46, !46, !43, !46, !46}
!128 = !{!129, !143}
!129 = !DIGlobalVariable(name: "TimeWords", scope: !0, file: !4, line: 523, type: !130, isLocal: true, isDefinition: true, variable: [137 x %struct.LEXICON]* @TimeWords)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 35072, align: 64, elements: !141)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "LEXICON", file: !4, line: 518, size: 256, align: 64, elements: !133)
!133 = !{!134, !138, !139, !140}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !132, file: !4, line: 519, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 62, baseType: !137)
!136 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Source")
!137 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !132, file: !4, line: 520, baseType: !54, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !4, line: 521, baseType: !43, size: 32, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !132, file: !4, line: 522, baseType: !46, size: 64, align: 64, offset: 192)
!141 = !{!142}
!142 = !DISubrange(count: 137)
!143 = !DIGlobalVariable(name: "DaysInMonth", scope: !116, file: !4, line: 694, type: !144, isLocal: true, isDefinition: true, variable: [12 x i32]* @Convert.DaysInMonth)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 384, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 12)
!147 = !{i32 2, !"Dwarf Version", i32 4}
!148 = !{i32 2, !"Debug Info Version", i32 3}
!149 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!150 = !DILocalVariable(name: "now", arg: 1, scope: !51, file: !4, line: 897, type: !46)
!151 = !DIExpression()
!152 = !DILocation(line: 897, column: 27, scope: !51)
!153 = !DILocalVariable(name: "p", arg: 2, scope: !51, file: !4, line: 897, type: !54)
!154 = !DILocation(line: 897, column: 44, scope: !51)
!155 = !DILocalVariable(name: "tokens", scope: !51, file: !4, line: 899, type: !156)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32768, align: 64, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 256)
!159 = !DILocation(line: 899, column: 15, scope: !51)
!160 = !DILocalVariable(name: "_gds", scope: !51, file: !4, line: 900, type: !84)
!161 = !DILocation(line: 900, column: 17, scope: !51)
!162 = !DILocalVariable(name: "lasttoken", scope: !51, file: !4, line: 901, type: !87)
!163 = !DILocation(line: 901, column: 16, scope: !51)
!164 = !DILocalVariable(name: "gds", scope: !51, file: !4, line: 902, type: !83)
!165 = !DILocation(line: 902, column: 18, scope: !51)
!166 = !DILocalVariable(name: "local", scope: !51, file: !4, line: 903, type: !62)
!167 = !DILocation(line: 903, column: 12, scope: !51)
!168 = !DILocalVariable(name: "tm", scope: !51, file: !4, line: 903, type: !61)
!169 = !DILocation(line: 903, column: 20, scope: !51)
!170 = !DILocalVariable(name: "gmt", scope: !51, file: !4, line: 904, type: !62)
!171 = !DILocation(line: 904, column: 12, scope: !51)
!172 = !DILocalVariable(name: "gmt_ptr", scope: !51, file: !4, line: 904, type: !61)
!173 = !DILocation(line: 904, column: 18, scope: !51)
!174 = !DILocalVariable(name: "Start", scope: !51, file: !4, line: 905, type: !46)
!175 = !DILocation(line: 905, column: 10, scope: !51)
!176 = !DILocalVariable(name: "tod", scope: !51, file: !4, line: 906, type: !46)
!177 = !DILocation(line: 906, column: 10, scope: !51)
!178 = !DILocalVariable(name: "tzone", scope: !51, file: !4, line: 907, type: !42)
!179 = !DILocation(line: 907, column: 8, scope: !51)
!180 = !DILocation(line: 910, column: 2, scope: !51)
!181 = !DILocation(line: 912, column: 2, scope: !51)
!182 = !DILocation(line: 913, column: 6, scope: !51)
!183 = !DILocation(line: 916, column: 2, scope: !51)
!184 = !DILocation(line: 917, column: 7, scope: !51)
!185 = !DILocation(line: 917, column: 5, scope: !51)
!186 = !DILocation(line: 918, column: 6, scope: !187)
!187 = distinct !DILexicalBlock(scope: !51, file: !4, line: 918, column: 6)
!188 = !DILocation(line: 918, column: 9, scope: !187)
!189 = !DILocation(line: 918, column: 6, scope: !51)
!190 = !DILocation(line: 919, column: 3, scope: !187)
!191 = !DILocation(line: 920, column: 11, scope: !51)
!192 = !DILocation(line: 920, column: 10, scope: !51)
!193 = !DILocation(line: 924, column: 2, scope: !51)
!194 = !DILocation(line: 925, column: 12, scope: !51)
!195 = !DILocation(line: 925, column: 10, scope: !51)
!196 = !DILocation(line: 926, column: 6, scope: !197)
!197 = distinct !DILexicalBlock(scope: !51, file: !4, line: 926, column: 6)
!198 = !DILocation(line: 926, column: 14, scope: !197)
!199 = !DILocation(line: 926, column: 6, scope: !51)
!200 = !DILocation(line: 928, column: 10, scope: !201)
!201 = distinct !DILexicalBlock(scope: !197, file: !4, line: 926, column: 23)
!202 = !DILocation(line: 928, column: 9, scope: !201)
!203 = !DILocation(line: 929, column: 2, scope: !201)
!204 = !DILocation(line: 930, column: 6, scope: !205)
