diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/build/config_vars.mk /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/build/config_vars.mk
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/build/config_vars.mk	2017-09-25 18:58:22.887624127 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/build/config_vars.mk	2017-09-25 18:58:53.895622990 +0800
@@ -55,16 +55,16 @@
 BUILTIN_LIBS = modules/aaa/mod_access.la modules/aaa/mod_auth.la modules/filters/mod_include.la modules/loggers/mod_log_config.la modules/metadata/mod_env.la modules/metadata/mod_setenvif.la modules/http/mod_http.la modules/http/mod_mime.la modules/generators/mod_status.la modules/generators/mod_autoindex.la modules/generators/mod_asis.la modules/generators/mod_cgi.la modules/mappers/mod_negotiation.la modules/mappers/mod_dir.la modules/mappers/mod_imap.la modules/mappers/mod_actions.la modules/mappers/mod_userdir.la modules/mappers/mod_alias.la modules/mappers/mod_so.la
 SHLIBPATH_VAR = LD_LIBRARY_PATH
 OS_SPECIFIC_VARS =
 PRE_SHARED_CMDS = echo ""
 POST_SHARED_CMDS = echo ""
 shared_build =

--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/os2/Makefile.in	2003-02-26 18:38:09.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/os2/Makefile.in	2003-08-29 21:45:02.000000000 +0800
@@ -14,13 +14,14 @@
 	maperrorcode.lo \
 	fullrw.lo \
 	filepath.lo \
 	filepath_util.lo \
 	filesys.lo \
 	mktemp.lo \
-	copy.lo
+	copy.lo \
+	tempdir.lo
 
 # bring in rules.mk for standard functionality
 @INCLUDE_RULES@
 
 INCDIR=../../include
 OSDIR=$(INCDIR)/arch/@OSDIR@
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/os2/pipe.c /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/os2/pipe.c
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/os2/pipe.c	2003-01-07 08:52:51.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/os2/pipe.c	2003-10-25 00:35:15.000000000 +0800
@@ -181,20 +181,35 @@
     }
     return APR_EINVAL;
 }
 
 
 
-APR_DECLARE(apr_status_t) apr_os_pipe_put(apr_file_t **file,
-                                          apr_os_file_t *thefile,
-                                          apr_pool_t *pool)
+APR_DECLARE(apr_status_t) apr_os_pipe_put_ex(apr_file_t **file,
+                                             apr_os_file_t *thefile,
+                                             int register_cleanup,
+                                             apr_pool_t *pool)
 {
     (*file) = apr_pcalloc(pool, sizeof(apr_file_t));
     (*file)->pool = pool;
     (*file)->isopen = TRUE;
     (*file)->pipe = 1;
     (*file)->blocking = BLK_UNKNOWN; /* app needs to make a timeout call */
     (*file)->timeout = -1;
     (*file)->filedes = *thefile;
 
+    if (register_cleanup) {
+        apr_pool_cleanup_register(pool, *file, apr_file_cleanup,
+                                  apr_pool_cleanup_null);
+    }
+
     return APR_SUCCESS;
 }
+
+
+
+APR_DECLARE(apr_status_t) apr_os_pipe_put(apr_file_t **file,
+                                          apr_os_file_t *thefile,
+                                          apr_pool_t *pool)
+{
+    return apr_os_pipe_put_ex(file, thefile, 0, pool);
+}
Only in /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/os2: tempdir.c
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.c.ll	2017-09-25 16:44:22.652875210 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.c.ll	2017-09-25 16:45:01.596873783 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_pool_t = type opaque
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_thread_mutex_t = type opaque
@@ -263,37 +263,37 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!71, !72}
 !llvm.ident = !{!73}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !56)
-!1 = !DIFile(filename: "copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !2 = !{!3, !44}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 131, size: 32, align: 32, elements: !40)
-!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !5 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !4, line: 122, size: 896, align: 64, elements: !6)
 !6 = !{!7, !12, !14, !17, !20, !21, !22, !27, !28, !29, !30, !31, !32, !34, !35, !36}
 !7 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !5, file: !4, line: 123, baseType: !8, size: 64, align: 64)
 !8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
 !9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 92, baseType: !11)
-!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 92, flags: DIFlagFwdDecl)
 !12 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !5, file: !4, line: 124, baseType: !13, size: 32, align: 32, offset: 64)
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !5, file: !4, line: 125, baseType: !15, size: 64, align: 64, offset: 128)
 !15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
 !16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !4, line: 126, baseType: !18, size: 32, align: 32, offset: 192)
-!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 297, baseType: !13)
-!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 299, baseType: !13)
+!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !20 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !5, file: !4, line: 127, baseType: !13, size: 32, align: 32, offset: 224)
 !21 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !5, file: !4, line: 128, baseType: !13, size: 32, align: 32, offset: 256)
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !5, file: !4, line: 129, baseType: !23, size: 64, align: 64, offset: 320)
 !23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 94, baseType: !25)
-!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
-!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 300, baseType: !26)
+!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
+!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 302, baseType: !26)
 !26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !5, file: !4, line: 130, baseType: !13, size: 32, align: 32, offset: 384)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !5, file: !4, line: 131, baseType: !3, size: 32, align: 32, offset: 416)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !5, file: !4, line: 132, baseType: !13, size: 32, align: 32, offset: 448)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !4, line: 135, baseType: !15, size: 64, align: 64, offset: 512)
 !31 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !5, file: !4, line: 136, baseType: !13, size: 32, align: 32, offset: 576)
@@ -301,36 +301,36 @@
 !33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !5, file: !4, line: 138, baseType: !13, size: 32, align: 32, offset: 704)
 !35 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !5, file: !4, line: 139, baseType: !33, size: 64, align: 64, offset: 768)
 !36 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !5, file: !4, line: 141, baseType: !37, size: 64, align: 64, offset: 832)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !39, line: 79, flags: DIFlagFwdDecl)
-!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !40 = !{!41, !42, !43}
 !41 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !42 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !43 = !DIEnumerator(name: "BLK_ON", value: 2)
 !44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 100, size: 32, align: 32, elements: !46)
-!45 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!45 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55}
 !47 = !DIEnumerator(name: "APR_NOFILE", value: 0)
 !48 = !DIEnumerator(name: "APR_REG", value: 1)
 !49 = !DIEnumerator(name: "APR_DIR", value: 2)
 !50 = !DIEnumerator(name: "APR_CHR", value: 3)
 !51 = !DIEnumerator(name: "APR_BLK", value: 4)
 !52 = !DIEnumerator(name: "APR_PIPE", value: 5)
 !53 = !DIEnumerator(name: "APR_LNK", value: 6)
 !54 = !DIEnumerator(name: "APR_SOCK", value: 7)
 !55 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
 !56 = !{!57, !67, !68}
 !57 = distinct !DISubprogram(name: "apr_file_copy", scope: !58, file: !58, line: 130, type: !59, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
-!58 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!58 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !59 = !DISubroutineType(types: !60)
 !60 = !{!61, !63, !63, !65, !8}
 !61 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !62, line: 82, baseType: !13)
-!62 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!62 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
 !64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
 !65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !45, line: 144, baseType: !18)
 !66 = !{}
 !67 = distinct !DISubprogram(name: "apr_file_append", scope: !58, file: !58, line: 141, type: !59, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
 !68 = distinct !DISubprogram(name: "apr_file_transfer_contents", scope: !58, file: !58, line: 58, type: !69, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
@@ -363,14 +363,14 @@
 !95 = !DILocalVariable(name: "to_perms", arg: 4, scope: !68, file: !58, line: 61, type: !65)
 !96 = !DILocation(line: 61, column: 64, scope: !68)
 !97 = !DILocalVariable(name: "pool", arg: 5, scope: !68, file: !58, line: 62, type: !8)
 !98 = !DILocation(line: 62, column: 60, scope: !68)
 !99 = !DILocalVariable(name: "s", scope: !68, file: !58, line: 64, type: !100)
 !100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
-!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !102, line: 144, baseType: !5)
-!102 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !102, line: 147, baseType: !5)
+!102 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !103 = !DILocation(line: 64, column: 17, scope: !68)
 !104 = !DILocalVariable(name: "d", scope: !68, file: !58, line: 64, type: !100)
 !105 = !DILocation(line: 64, column: 28, scope: !68)
 !106 = !DILocalVariable(name: "status", scope: !68, file: !58, line: 65, type: !61)
 !107 = !DILocation(line: 65, column: 18, scope: !68)
 !108 = !DILocalVariable(name: "finfo", scope: !68, file: !58, line: 66, type: !109)
@@ -381,17 +381,17 @@
 !113 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !110, file: !45, line: 204, baseType: !18, size: 32, align: 32, offset: 64)
 !114 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !110, file: !45, line: 206, baseType: !65, size: 32, align: 32, offset: 96)
 !115 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !110, file: !45, line: 211, baseType: !116, size: 32, align: 32, offset: 128)
 !116 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !45, line: 110, baseType: !44)
 !117 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !110, file: !45, line: 213, baseType: !118, size: 32, align: 32, offset: 160)
 !118 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !119, line: 83, baseType: !120)
-!119 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!119 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !121, line: 80, baseType: !122)
-!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !123, line: 125, baseType: !124)
-!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !124 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
 !125 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !110, file: !45, line: 215, baseType: !126, size: 32, align: 32, offset: 192)
 !126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !119, line: 92, baseType: !127)
 !127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !121, line: 65, baseType: !128)
 !128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !123, line: 126, baseType: !124)
 !129 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !110, file: !45, line: 217, baseType: !130, size: 64, align: 64, offset: 256)
@@ -401,13 +401,13 @@
 !133 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !110, file: !45, line: 219, baseType: !134, size: 64, align: 64, offset: 320)
 !134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !45, line: 160, baseType: !135)
 !135 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !121, line: 60, baseType: !136)
 !136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !123, line: 124, baseType: !33)
 !137 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !110, file: !45, line: 221, baseType: !18, size: 32, align: 32, offset: 384)
 !138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !45, line: 223, baseType: !139, size: 64, align: 64, offset: 448)
-!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !19, line: 305, baseType: !140)
+!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !19, line: 307, baseType: !140)
 !140 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !121, line: 86, baseType: !141)
 !141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !123, line: 131, baseType: !26)
 !142 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !110, file: !45, line: 225, baseType: !139, size: 64, align: 64, offset: 512)
 !143 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !110, file: !45, line: 227, baseType: !144, size: 64, align: 64, offset: 576)
 !144 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !24, line: 84, baseType: !25)
 !145 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !110, file: !45, line: 229, baseType: !144, size: 64, align: 64, offset: 640)
@@ -473,15 +473,15 @@
 !205 = distinct !DILexicalBlock(scope: !68, file: !58, line: 94, column: 15)
 !206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 65536, align: 8, elements: !207)
 !207 = !{!208}
 !208 = !DISubrange(count: 8192)
 !209 = !DILocation(line: 95, column: 14, scope: !205)
 !210 = !DILocalVariable(name: "bytes_this_time", scope: !205, file: !58, line: 96, type: !211)
-!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !19, line: 303, baseType: !212)
+!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !19, line: 305, baseType: !212)
 !212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !213, line: 62, baseType: !33)
-!213 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!213 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !214 = !DILocation(line: 96, column: 20, scope: !205)
 !215 = !DILocalVariable(name: "read_err", scope: !205, file: !58, line: 97, type: !61)
 !216 = !DILocation(line: 97, column: 22, scope: !205)
 !217 = !DILocalVariable(name: "write_err", scope: !205, file: !58, line: 98, type: !61)
 !218 = !DILocation(line: 98, column: 22, scope: !205)
 !219 = !DILocation(line: 101, column: 34, scope: !205)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/copy.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/copy.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.c.ll	2017-09-25 16:44:23.036875196 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.c.ll	2017-09-25 16:45:01.956873769 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_dir_t = type { %struct.apr_pool_t*, i8*, %struct.__dirstream*, %struct.dirent* }
 %struct.__dirstream = type opaque
 %struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
@@ -926,49 +926,49 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!175, !176}
 !llvm.ident = !{!177}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !56, subprograms: !87)
-!1 = !DIFile(filename: "dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !2 = !{!3, !15}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 100, size: 32, align: 32, elements: !5)
-!4 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
 !6 = !DIEnumerator(name: "APR_NOFILE", value: 0)
 !7 = !DIEnumerator(name: "APR_REG", value: 1)
 !8 = !DIEnumerator(name: "APR_DIR", value: 2)
 !9 = !DIEnumerator(name: "APR_CHR", value: 3)
 !10 = !DIEnumerator(name: "APR_BLK", value: 4)
 !11 = !DIEnumerator(name: "APR_PIPE", value: 5)
 !12 = !DIEnumerator(name: "APR_LNK", value: 6)
 !13 = !DIEnumerator(name: "APR_SOCK", value: 7)
 !14 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
 !15 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !17, file: !16, line: 131, size: 32, align: 32, elements: !52)
-!16 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!16 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !17 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !16, line: 122, size: 896, align: 64, elements: !18)
 !18 = !{!19, !24, !26, !29, !32, !33, !34, !39, !40, !41, !42, !43, !44, !46, !47, !48}
 !19 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !17, file: !16, line: 123, baseType: !20, size: 64, align: 64)
 !20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
 !21 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !22, line: 92, baseType: !23)
-!22 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!22 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !23 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !22, line: 92, flags: DIFlagFwdDecl)
 !24 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !17, file: !16, line: 124, baseType: !25, size: 32, align: 32, offset: 64)
 !25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !26 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !17, file: !16, line: 125, baseType: !27, size: 64, align: 64, offset: 128)
 !27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
 !28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !16, line: 126, baseType: !30, size: 32, align: 32, offset: 192)
-!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !31, line: 297, baseType: !25)
-!31 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !31, line: 299, baseType: !25)
+!31 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !32 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !17, file: !16, line: 127, baseType: !25, size: 32, align: 32, offset: 224)
 !33 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !17, file: !16, line: 128, baseType: !25, size: 32, align: 32, offset: 256)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !17, file: !16, line: 129, baseType: !35, size: 64, align: 64, offset: 320)
 !35 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !36, line: 94, baseType: !37)
-!36 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
-!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !31, line: 300, baseType: !38)
+!36 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
+!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !31, line: 302, baseType: !38)
 !38 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !39 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !17, file: !16, line: 130, baseType: !25, size: 32, align: 32, offset: 384)
 !40 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !17, file: !16, line: 131, baseType: !15, size: 32, align: 32, offset: 416)
 !41 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !17, file: !16, line: 132, baseType: !25, size: 32, align: 32, offset: 448)
 !42 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !17, file: !16, line: 135, baseType: !27, size: 64, align: 64, offset: 512)
 !43 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !17, file: !16, line: 136, baseType: !25, size: 32, align: 32, offset: 576)
@@ -976,13 +976,13 @@
 !45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !46 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !17, file: !16, line: 138, baseType: !25, size: 32, align: 32, offset: 704)
 !47 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !17, file: !16, line: 139, baseType: !45, size: 64, align: 64, offset: 768)
 !48 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !17, file: !16, line: 141, baseType: !49, size: 64, align: 64, offset: 832)
 !49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
 !50 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !51, line: 79, flags: DIFlagFwdDecl)
-!51 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!51 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !52 = !{!53, !54, !55}
 !53 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !54 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !55 = !DIEnumerator(name: "BLK_ON", value: 2)
 !56 = !{!57, !86}
 !57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
@@ -991,22 +991,22 @@
 !60 = !{!61, !62, !63, !68}
 !61 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !59, file: !16, line: 146, baseType: !20, size: 64, align: 64)
 !62 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !59, file: !16, line: 147, baseType: !27, size: 64, align: 64, offset: 64)
 !63 = !DIDerivedType(tag: DW_TAG_member, name: "dirstruct", scope: !59, file: !16, line: 148, baseType: !64, size: 64, align: 64, offset: 128)
 !64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
 !65 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !66, line: 127, baseType: !67)
-!66 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!66 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !66, line: 127, flags: DIFlagFwdDecl)
 !68 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !59, file: !16, line: 149, baseType: !69, size: 64, align: 64, offset: 192)
 !69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
 !70 = !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !71, line: 22, size: 2240, align: 64, elements: !72)
-!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !72 = !{!73, !76, !78, !80, !82}
 !73 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !70, file: !71, line: 25, baseType: !74, size: 64, align: 64)
 !74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !75, line: 127, baseType: !45)
-!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !76 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !70, file: !71, line: 26, baseType: !77, size: 64, align: 64, offset: 64)
 !77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 131, baseType: !38)
 !78 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !70, file: !71, line: 31, baseType: !79, size: 16, align: 16, offset: 128)
 !79 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
 !80 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !70, file: !71, line: 32, baseType: !81, size: 8, align: 8, offset: 144)
 !81 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
@@ -1014,17 +1014,17 @@
 !83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, align: 8, elements: !84)
 !84 = !{!85}
 !85 = !DISubrange(count: 256)
 !86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
 !87 = !{!88, !98, !101, !145, !146, !149, !150, !153, !160, !163, !166, !169, !172}
 !88 = distinct !DISubprogram(name: "apr_dir_open", scope: !89, file: !89, line: 109, type: !90, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
-!89 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!89 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !90 = !DISubroutineType(types: !91)
 !91 = !{!92, !94, !95, !20}
 !92 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !93, line: 82, baseType: !25)
-!93 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!93 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
 !95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
 !96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
 !97 = !{}
 !98 = distinct !DISubprogram(name: "apr_dir_close", scope: !89, file: !89, line: 138, type: !99, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !99 = !DISubroutineType(types: !100)
@@ -1041,15 +1041,15 @@
 !110 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !106, file: !4, line: 206, baseType: !111, size: 32, align: 32, offset: 96)
 !111 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !4, line: 144, baseType: !30)
 !112 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !106, file: !4, line: 211, baseType: !113, size: 32, align: 32, offset: 128)
 !113 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !4, line: 110, baseType: !3)
 !114 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !106, file: !4, line: 213, baseType: !115, size: 32, align: 32, offset: 160)
 !115 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !116, line: 83, baseType: !117)
-!116 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!116 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !118, line: 80, baseType: !119)
-!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !75, line: 125, baseType: !120)
 !120 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
 !121 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !106, file: !4, line: 215, baseType: !122, size: 32, align: 32, offset: 192)
 !122 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !116, line: 92, baseType: !123)
 !123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !118, line: 65, baseType: !124)
 !124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !75, line: 126, baseType: !120)
@@ -1059,13 +1059,13 @@
 !128 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !106, file: !4, line: 219, baseType: !129, size: 64, align: 64, offset: 320)
 !129 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !4, line: 160, baseType: !130)
 !130 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !118, line: 60, baseType: !131)
 !131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !75, line: 124, baseType: !45)
 !132 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !106, file: !4, line: 221, baseType: !30, size: 32, align: 32, offset: 384)
 !133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !4, line: 223, baseType: !134, size: 64, align: 64, offset: 448)
-!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !31, line: 305, baseType: !135)
+!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !31, line: 307, baseType: !135)
 !135 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !118, line: 86, baseType: !77)
 !136 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !106, file: !4, line: 225, baseType: !134, size: 64, align: 64, offset: 512)
 !137 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !106, file: !4, line: 227, baseType: !138, size: 64, align: 64, offset: 576)
 !138 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !36, line: 84, baseType: !37)
 !139 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !106, file: !4, line: 229, baseType: !138, size: 64, align: 64, offset: 640)
 !140 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !106, file: !4, line: 231, baseType: !138, size: 64, align: 64, offset: 704)
@@ -1084,13 +1084,13 @@
 !153 = distinct !DISubprogram(name: "apr_os_dir_get", scope: !89, file: !89, line: 336, type: !154, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !154 = !DISubroutineType(types: !155)
 !155 = !{!92, !156, !57}
 !156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
 !157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
 !158 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_os_dir_t", file: !159, line: 181, baseType: !65)
-!159 = !DIFile(filename: "../../include/apr_portable.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!159 = !DIFile(filename: "../../include/apr_portable.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !160 = distinct !DISubprogram(name: "apr_os_dir_put", scope: !89, file: !89, line: 345, type: !161, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !161 = !DISubroutineType(types: !162)
 !162 = !{!92, !94, !157, !20}
 !163 = distinct !DISubprogram(name: "dir_cleanup", scope: !89, file: !89, line: 65, type: !164, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !164 = !DISubroutineType(types: !165)
 !165 = !{!92, !86}
@@ -1111,15 +1111,15 @@
 !180 = !DILocation(line: 109, column: 39, scope: !88)
 !181 = !DILocalVariable(name: "dirname", arg: 2, scope: !88, file: !89, line: 109, type: !95)
 !182 = !DILocation(line: 109, column: 56, scope: !88)
 !183 = !DILocalVariable(name: "pool", arg: 3, scope: !88, file: !89, line: 110, type: !20)
 !184 = !DILocation(line: 110, column: 39, scope: !88)
 !185 = !DILocalVariable(name: "dirent_size", scope: !88, file: !89, line: 117, type: !186)
-!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !31, line: 303, baseType: !187)
+!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !31, line: 305, baseType: !187)
 !187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 62, baseType: !45)
-!188 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!188 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !189 = !DILocation(line: 117, column: 16, scope: !88)
 !190 = !DILocation(line: 121, column: 38, scope: !88)
 !191 = !DILocation(line: 121, column: 27, scope: !88)
 !192 = !DILocation(line: 121, column: 14, scope: !88)
 !193 = !DILocation(line: 121, column: 7, scope: !88)
 !194 = !DILocation(line: 121, column: 12, scope: !88)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/dir.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/dir.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.c.ll	2017-09-25 16:44:23.292875186 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.c.ll	2017-09-25 16:45:02.212873760 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_pool_t = type opaque
 %struct.apr_thread_mutex_t = type opaque
@@ -336,37 +336,37 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!85, !86}
 !llvm.ident = !{!87}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !44)
-!1 = !DIFile(filename: "fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !2 = !{!3}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 131, size: 32, align: 32, elements: !40)
-!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !5 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !4, line: 122, size: 896, align: 64, elements: !6)
 !6 = !{!7, !12, !14, !17, !20, !21, !22, !27, !28, !29, !30, !31, !32, !34, !35, !36}
 !7 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !5, file: !4, line: 123, baseType: !8, size: 64, align: 64)
 !8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
 !9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 92, baseType: !11)
-!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 92, flags: DIFlagFwdDecl)
 !12 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !5, file: !4, line: 124, baseType: !13, size: 32, align: 32, offset: 64)
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !5, file: !4, line: 125, baseType: !15, size: 64, align: 64, offset: 128)
 !15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
 !16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !4, line: 126, baseType: !18, size: 32, align: 32, offset: 192)
-!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 297, baseType: !13)
-!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 299, baseType: !13)
+!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !20 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !5, file: !4, line: 127, baseType: !13, size: 32, align: 32, offset: 224)
 !21 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !5, file: !4, line: 128, baseType: !13, size: 32, align: 32, offset: 256)
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !5, file: !4, line: 129, baseType: !23, size: 64, align: 64, offset: 320)
 !23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 94, baseType: !25)
-!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
-!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 300, baseType: !26)
+!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
+!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 302, baseType: !26)
 !26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !5, file: !4, line: 130, baseType: !13, size: 32, align: 32, offset: 384)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !5, file: !4, line: 131, baseType: !3, size: 32, align: 32, offset: 416)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !5, file: !4, line: 132, baseType: !13, size: 32, align: 32, offset: 448)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !4, line: 135, baseType: !15, size: 64, align: 64, offset: 512)
 !31 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !5, file: !4, line: 136, baseType: !13, size: 32, align: 32, offset: 576)
@@ -374,44 +374,44 @@
 !33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !5, file: !4, line: 138, baseType: !13, size: 32, align: 32, offset: 704)
 !35 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !5, file: !4, line: 139, baseType: !33, size: 64, align: 64, offset: 768)
 !36 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !5, file: !4, line: 141, baseType: !37, size: 64, align: 64, offset: 832)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !39, line: 79, flags: DIFlagFwdDecl)
-!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !40 = !{!41, !42, !43}
 !41 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !42 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !43 = !DIEnumerator(name: "BLK_ON", value: 2)
 !44 = !{!45, !58, !61, !71, !74, !79}
 !45 = distinct !DISubprogram(name: "apr_file_name_get", scope: !46, file: !46, line: 60, type: !47, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
-!46 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!46 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !47 = !DISubroutineType(types: !48)
 !48 = !{!49, !51, !54}
 !49 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !50, line: 82, baseType: !13)
-!50 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!50 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
 !52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
 !53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
 !54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
-!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !56, line: 144, baseType: !5)
-!56 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !56, line: 147, baseType: !5)
+!56 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !57 = !{}
 !58 = distinct !DISubprogram(name: "apr_file_flags_get", scope: !46, file: !46, line: 67, type: !59, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !59 = !DISubroutineType(types: !60)
 !60 = !{!18, !54}
 !61 = distinct !DISubprogram(name: "apr_unix_perms2mode", scope: !46, file: !46, line: 73, type: !62, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !62 = !DISubroutineType(types: !63)
 !63 = !{!64, !69}
 !64 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !65, line: 70, baseType: !66)
-!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !67, line: 129, baseType: !68)
-!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !68 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
 !69 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !70, line: 144, baseType: !18)
-!70 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!70 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !71 = distinct !DISubprogram(name: "apr_unix_mode2perms", scope: !46, file: !46, line: 101, type: !72, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !72 = !DISubroutineType(types: !73)
 !73 = !{!69, !64}
 !74 = distinct !DISubprogram(name: "apr_file_data_get", scope: !46, file: !46, line: 130, type: !75, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !75 = !DISubroutineType(types: !76)
 !76 = !{!49, !77, !52, !54}
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/fileacc.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/fileacc.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.c.ll	2017-09-25 16:44:23.648875173 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.c.ll	2017-09-25 16:45:02.544873748 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_thread_mutex_t = type opaque
 %struct.apr_pool_t = type opaque
@@ -447,37 +447,37 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!65, !66}
 !llvm.ident = !{!67}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !44, subprograms: !49)
-!1 = !DIFile(filename: "filedup.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "filedup.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !2 = !{!3}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 131, size: 32, align: 32, elements: !40)
-!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !5 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !4, line: 122, size: 896, align: 64, elements: !6)
 !6 = !{!7, !12, !14, !17, !20, !21, !22, !27, !28, !29, !30, !31, !32, !34, !35, !36}
 !7 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !5, file: !4, line: 123, baseType: !8, size: 64, align: 64)
 !8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
 !9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 92, baseType: !11)
-!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 92, flags: DIFlagFwdDecl)
 !12 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !5, file: !4, line: 124, baseType: !13, size: 32, align: 32, offset: 64)
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !5, file: !4, line: 125, baseType: !15, size: 64, align: 64, offset: 128)
 !15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
 !16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !4, line: 126, baseType: !18, size: 32, align: 32, offset: 192)
-!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 297, baseType: !13)
-!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 299, baseType: !13)
+!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !20 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !5, file: !4, line: 127, baseType: !13, size: 32, align: 32, offset: 224)
 !21 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !5, file: !4, line: 128, baseType: !13, size: 32, align: 32, offset: 256)
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !5, file: !4, line: 129, baseType: !23, size: 64, align: 64, offset: 320)
 !23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 94, baseType: !25)
-!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
-!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 300, baseType: !26)
+!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
+!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 302, baseType: !26)
 !26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !5, file: !4, line: 130, baseType: !13, size: 32, align: 32, offset: 384)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !5, file: !4, line: 131, baseType: !3, size: 32, align: 32, offset: 416)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !5, file: !4, line: 132, baseType: !13, size: 32, align: 32, offset: 448)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !4, line: 135, baseType: !15, size: 64, align: 64, offset: 512)
 !31 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !5, file: !4, line: 136, baseType: !13, size: 32, align: 32, offset: 576)
@@ -485,29 +485,29 @@
 !33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !5, file: !4, line: 138, baseType: !13, size: 32, align: 32, offset: 704)
 !35 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !5, file: !4, line: 139, baseType: !33, size: 64, align: 64, offset: 768)
 !36 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !5, file: !4, line: 141, baseType: !37, size: 64, align: 64, offset: 832)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !39, line: 79, flags: DIFlagFwdDecl)
-!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !40 = !{!41, !42, !43}
 !41 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !42 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !43 = !DIEnumerator(name: "BLK_ON", value: 2)
 !44 = !{!45, !48}
 !45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
-!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !47, line: 144, baseType: !5)
-!47 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !47, line: 147, baseType: !5)
+!47 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
 !49 = !{!50, !58, !61, !62}
 !50 = distinct !DISubprogram(name: "apr_file_dup", scope: !51, file: !51, line: 137, type: !52, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
-!51 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!51 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !52 = !DISubroutineType(types: !53)
 !53 = !{!54, !56, !45, !8}
 !54 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !55, line: 82, baseType: !13)
-!55 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!55 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
 !57 = !{}
 !58 = distinct !DISubprogram(name: "apr_file_dup2", scope: !51, file: !51, line: 143, type: !59, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !59 = !DISubroutineType(types: !60)
 !60 = !{!54, !45, !45, !8}
 !61 = distinct !DISubprogram(name: "apr_file_setaside", scope: !51, file: !51, line: 149, type: !52, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filedup.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filedup.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.c.ll	2017-09-25 16:44:23.932875163 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.c.ll	2017-09-25 16:45:02.820873738 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_pool_t = type opaque
 %struct.apr_array_header_t = type { %struct.apr_pool_t*, i32, i32, i32, i8* }
 
@@ -848,31 +848,31 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!54, !55}
 !llvm.ident = !{!56}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6)
-!1 = !DIFile(filename: "filepath.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "filepath.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !2 = !{}
 !3 = !{!4}
 !4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
 !5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !6 = !{!7, !21, !26, !30, !33, !47, !50}
 !7 = distinct !DISubprogram(name: "apr_filepath_get", scope: !8, file: !8, line: 75, type: !9, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
-!8 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!8 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !9 = !DISubroutineType(types: !10)
 !10 = !{!11, !14, !15, !17}
 !11 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !12, line: 82, baseType: !13)
-!12 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!12 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
-!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !16, line: 297, baseType: !13)
-!16 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !16, line: 299, baseType: !13)
+!16 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
 !18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !19, line: 92, baseType: !20)
-!19 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!19 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !20 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !19, line: 92, flags: DIFlagFwdDecl)
 !21 = distinct !DISubprogram(name: "apr_filepath_set", scope: !8, file: !8, line: 94, type: !22, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
 !22 = !DISubroutineType(types: !23)
 !23 = !{!11, !24, !17}
 !24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
 !25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
@@ -886,13 +886,13 @@
 !33 = distinct !DISubprogram(name: "apr_filepath_list_split", scope: !8, file: !8, line: 329, type: !34, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
 !34 = !DISubroutineType(types: !35)
 !35 = !{!11, !36, !24, !17}
 !36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !39, line: 87, baseType: !40)
-!39 = !DIFile(filename: "../../include/apr_tables.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_tables.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !40 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !39, line: 90, size: 256, align: 64, elements: !41)
 !41 = !{!42, !43, !44, !45, !46}
 !42 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !40, file: !39, line: 92, baseType: !17, size: 64, align: 64)
 !43 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !40, file: !39, line: 94, baseType: !13, size: 32, align: 32, offset: 64)
 !44 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !40, file: !39, line: 96, baseType: !13, size: 32, align: 32, offset: 96)
 !45 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !40, file: !39, line: 98, baseType: !13, size: 32, align: 32, offset: 128)
@@ -994,15 +994,15 @@
 !141 = !DILocation(line: 122, column: 58, scope: !30)
 !142 = !DILocalVariable(name: "p", arg: 5, scope: !30, file: !8, line: 123, type: !17)
 !143 = !DILocation(line: 123, column: 58, scope: !30)
 !144 = !DILocalVariable(name: "path", scope: !30, file: !8, line: 125, type: !4)
 !145 = !DILocation(line: 125, column: 11, scope: !30)
 !146 = !DILocalVariable(name: "rootlen", scope: !30, file: !8, line: 126, type: !147)
-!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !16, line: 303, baseType: !148)
+!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !16, line: 305, baseType: !148)
 !148 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !149, line: 62, baseType: !150)
-!149 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!149 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !150 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !151 = !DILocation(line: 126, column: 16, scope: !30)
 !152 = !DILocalVariable(name: "maxlen", scope: !30, file: !8, line: 127, type: !147)
 !153 = !DILocation(line: 127, column: 16, scope: !30)
 !154 = !DILocalVariable(name: "keptlen", scope: !30, file: !8, line: 128, type: !147)
 !155 = !DILocation(line: 128, column: 16, scope: !30)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.c.ll	2017-09-25 16:44:24.068875158 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.c.ll	2017-09-25 16:45:02.952873733 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_array_header_t = type { %struct.apr_pool_t*, i32, i32, i32, i8* }
 %struct.apr_pool_t = type opaque
 
@@ -327,37 +327,37 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!36, !37}
 !llvm.ident = !{!38}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8)
-!1 = !DIFile(filename: "filepath_util.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "filepath_util.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !2 = !{}
 !3 = !{!4, !5}
 !4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
 !5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
 !6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
 !7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !8 = !{!9, !33}
 !9 = distinct !DISubprogram(name: "apr_filepath_list_split_impl", scope: !10, file: !10, line: 67, type: !11, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
-!10 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!10 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !11 = !DISubroutineType(types: !12)
 !12 = !{!13, !16, !31, !7, !23}
 !13 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !14, line: 82, baseType: !15)
-!14 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!14 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
 !17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
 !18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_array_header_t", file: !19, line: 87, baseType: !20)
-!19 = !DIFile(filename: "../../include/apr_tables.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!19 = !DIFile(filename: "../../include/apr_tables.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !20 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_array_header_t", file: !19, line: 90, size: 256, align: 64, elements: !21)
 !21 = !{!22, !27, !28, !29, !30}
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !20, file: !19, line: 92, baseType: !23, size: 64, align: 64)
 !23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
 !24 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !25, line: 92, baseType: !26)
-!25 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!25 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !26 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !25, line: 92, flags: DIFlagFwdDecl)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !20, file: !19, line: 94, baseType: !15, size: 32, align: 32, offset: 64)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !20, file: !19, line: 96, baseType: !15, size: 32, align: 32, offset: 96)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !20, file: !19, line: 98, baseType: !15, size: 32, align: 32, offset: 128)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !20, file: !19, line: 100, baseType: !6, size: 64, align: 64, offset: 192)
 !31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
@@ -459,16 +459,16 @@
 !127 = !DILocation(line: 105, column: 63, scope: !33)
 !128 = !DILocalVariable(name: "separator", arg: 3, scope: !33, file: !10, line: 106, type: !7)
 !129 = !DILocation(line: 106, column: 48, scope: !33)
 !130 = !DILocalVariable(name: "p", arg: 4, scope: !33, file: !10, line: 107, type: !23)
 !131 = !DILocation(line: 107, column: 55, scope: !33)
 !132 = !DILocalVariable(name: "path_size", scope: !33, file: !10, line: 109, type: !133)
-!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !134, line: 303, baseType: !135)
-!134 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !134, line: 305, baseType: !135)
+!134 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 62, baseType: !137)
-!136 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix")
+!136 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix")
 !137 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !138 = !DILocation(line: 109, column: 16, scope: !33)
 !139 = !DILocalVariable(name: "path", scope: !33, file: !10, line: 110, type: !6)
 !140 = !DILocation(line: 110, column: 11, scope: !33)
 !141 = !DILocalVariable(name: "i", scope: !33, file: !10, line: 111, type: !15)
 !142 = !DILocation(line: 111, column: 9, scope: !33)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filepath_util.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filepath_util.o differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filestat.c /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filestat.c
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filestat.c	2003-05-24 18:30:39.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filestat.c	2003-07-09 00:03:37.000000000 +0800
@@ -210,12 +210,57 @@
         }
     }
 
     return apr_file_perms_set(fname, finfo.protection);
 }
 
+
+APR_DECLARE(apr_status_t) apr_file_mtime_set(const char *fname,
+                                              apr_time_t mtime,
+                                              apr_pool_t *pool)
+{
+    apr_status_t status;
+    apr_finfo_t finfo;
+
+    status = apr_stat(&finfo, fname, APR_FINFO_ATIME, pool);
+    if (!APR_STATUS_IS_SUCCESS(status)) {
+        return status;
+    }
+
+#ifdef HAVE_UTIMES
+    {
+      struct timeval tvp[2];
+    
+      tvp[0].tv_sec = apr_time_sec(finfo.atime);
+      tvp[0].tv_usec = apr_time_usec(finfo.atime);
+      tvp[1].tv_sec = apr_time_sec(mtime);
+      tvp[1].tv_usec = apr_time_usec(mtime);
+      
+      if (utimes(fname, tvp) == -1) {
+        return errno;
+      }
+    }
+#elif defined(HAVE_UTIME)
+    {
+      struct utimbuf buf;
+      
+      buf.actime = (time_t) (finfo.atime / APR_USEC_PER_SEC);
+      buf.modtime = (time_t) (mtime / APR_USEC_PER_SEC);
+      
+      if (utime(fname, &buf) == -1) {
+        return errno;
+      }
+    }
+#else
+    return APR_ENOTIMPL;
+#endif
+
+    return APR_SUCCESS;
+}
+
+
 APR_DECLARE(apr_status_t) apr_stat(apr_finfo_t *finfo, 
                                    const char *fname, 
                                    apr_int32_t wanted, apr_pool_t *pool)
 {
     struct stat info;
     int srv;
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filestat.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filestat.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filestat.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filestat.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filestat.c.ll	2017-09-25 16:44:24.344875148 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filestat.c.ll	2017-09-25 16:45:03.220873723 +0800
@@ -1,198 +1,199 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.47/srclib/apr/file_io/unix/filestat.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.48/srclib/apr/file_io/unix/filestat.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_finfo_t = type { %struct.apr_pool_t*, i32, i32, i32, i32, i32, i64, i64, i32, i64, i64, i64, i64, i64, i8*, i8*, %struct.apr_file_t* }
 %struct.apr_pool_t = type opaque
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_thread_mutex_t = type opaque
 %struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
 %struct.timespec = type { i64, i64 }
+%struct.timeval = type { i64, i64 }
 
 ; Function Attrs: nounwind uwtable
 define i32 @apr_file_info_get(%struct.apr_finfo_t* %finfo, i32 %wanted, %struct.apr_file_t* %thefile) #0 !dbg !57 {
 entry:
   %retval = alloca i32, align 4
   %finfo.addr = alloca %struct.apr_finfo_t*, align 8
   %wanted.addr = alloca i32, align 4
   %thefile.addr = alloca %struct.apr_file_t*, align 8
   %info = alloca %struct.stat, align 8
   %rv = alloca i32, align 4
   store %struct.apr_finfo_t* %finfo, %struct.apr_finfo_t** %finfo.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_finfo_t** %finfo.addr, metadata !168, metadata !169), !dbg !170
+  call void @llvm.dbg.declare(metadata %struct.apr_finfo_t** %finfo.addr, metadata !171, metadata !172), !dbg !173
   store i32 %wanted, i32* %wanted.addr, align 4
-  call void @llvm.dbg.declare(metadata i32* %wanted.addr, metadata !171, metadata !169), !dbg !172
+  call void @llvm.dbg.declare(metadata i32* %wanted.addr, metadata !174, metadata !172), !dbg !175
   store %struct.apr_file_t* %thefile, %struct.apr_file_t** %thefile.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %thefile.addr, metadata !173, metadata !169), !dbg !174
-  call void @llvm.dbg.declare(metadata %struct.stat* %info, metadata !175, metadata !169), !dbg !176
-  %0 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !177
-  %buffered = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %0, i32 0, i32 7, !dbg !179
-  %1 = load i32, i32* %buffered, align 8, !dbg !179
-  %tobool = icmp ne i32 %1, 0, !dbg !177
-  br i1 %tobool, label %if.then, label %if.end2, !dbg !180
+  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %thefile.addr, metadata !176, metadata !172), !dbg !177
+  call void @llvm.dbg.declare(metadata %struct.stat* %info, metadata !178, metadata !172), !dbg !179
+  %0 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !180
+  %buffered = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %0, i32 0, i32 7, !dbg !182
+  %1 = load i32, i32* %buffered, align 8, !dbg !182
+  %tobool = icmp ne i32 %1, 0, !dbg !180
+  br i1 %tobool, label %if.then, label %if.end2, !dbg !183
 
 if.then:                                          ; preds = %entry
-  call void @llvm.dbg.declare(metadata i32* %rv, metadata !181, metadata !169), !dbg !183
-  %2 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !184
-  %call = call i32 @apr_file_flush(%struct.apr_file_t* %2), !dbg !185
-  store i32 %call, i32* %rv, align 4, !dbg !183
-  %3 = load i32, i32* %rv, align 4, !dbg !186
-  %cmp = icmp ne i32 %3, 0, !dbg !188
-  br i1 %cmp, label %if.then1, label %if.end, !dbg !189
+  call void @llvm.dbg.declare(metadata i32* %rv, metadata !184, metadata !172), !dbg !186
+  %2 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !187
+  %call = call i32 @apr_file_flush(%struct.apr_file_t* %2), !dbg !188
+  store i32 %call, i32* %rv, align 4, !dbg !186
+  %3 = load i32, i32* %rv, align 4, !dbg !189
+  %cmp = icmp ne i32 %3, 0, !dbg !191
+  br i1 %cmp, label %if.then1, label %if.end, !dbg !192
 
 if.then1:                                         ; preds = %if.then
-  %4 = load i32, i32* %rv, align 4, !dbg !190
-  store i32 %4, i32* %retval, align 4, !dbg !191
-  br label %return, !dbg !191
+  %4 = load i32, i32* %rv, align 4, !dbg !193
+  store i32 %4, i32* %retval, align 4, !dbg !194
+  br label %return, !dbg !194
 
 if.end:                                           ; preds = %if.then
-  br label %if.end2, !dbg !192
+  br label %if.end2, !dbg !195
 
 if.end2:                                          ; preds = %if.end, %entry
-  %5 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !193
-  %filedes = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %5, i32 0, i32 1, !dbg !195
-  %6 = load i32, i32* %filedes, align 8, !dbg !195
-  %call3 = call i32 @fstat(i32 %6, %struct.stat* %info) #5, !dbg !196
-  %cmp4 = icmp eq i32 %call3, 0, !dbg !197
-  br i1 %cmp4, label %if.then5, label %if.else, !dbg !198
+  %5 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !196
+  %filedes = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %5, i32 0, i32 1, !dbg !198
+  %6 = load i32, i32* %filedes, align 8, !dbg !198
+  %call3 = call i32 @fstat(i32 %6, %struct.stat* %info) #5, !dbg !199
+  %cmp4 = icmp eq i32 %call3, 0, !dbg !200
+  br i1 %cmp4, label %if.then5, label %if.else, !dbg !201
 
 if.then5:                                         ; preds = %if.end2
-  %7 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !199
-  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %7, i32 0, i32 0, !dbg !201
-  %8 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !201
-  %9 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !202
-  %pool6 = getelementptr inbounds %struct.apr_finfo_t, %struct.apr_finfo_t* %9, i32 0, i32 0, !dbg !203
-  store %struct.apr_pool_t* %8, %struct.apr_pool_t** %pool6, align 8, !dbg !204
-  %10 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !205
-  %fname = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %10, i32 0, i32 2, !dbg !206
-  %11 = load i8*, i8** %fname, align 8, !dbg !206
-  %12 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !207
-  %fname7 = getelementptr inbounds %struct.apr_finfo_t, %struct.apr_finfo_t* %12, i32 0, i32 14, !dbg !208
-  store i8* %11, i8** %fname7, align 8, !dbg !209
-  %13 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !210
-  %14 = load i32, i32* %wanted.addr, align 4, !dbg !211
-  call void @fill_out_finfo(%struct.apr_finfo_t* %13, %struct.stat* %info, i32 %14), !dbg !212
-  %15 = load i32, i32* %wanted.addr, align 4, !dbg !213
-  %16 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !214
-  %valid = getelementptr inbounds %struct.apr_finfo_t, %struct.apr_finfo_t* %16, i32 0, i32 1, !dbg !215
-  %17 = load i32, i32* %valid, align 8, !dbg !215
-  %neg = xor i32 %17, -1, !dbg !216
-  %and = and i32 %15, %neg, !dbg !217
-  %tobool8 = icmp ne i32 %and, 0, !dbg !218
-  %cond = select i1 %tobool8, i32 70008, i32 0, !dbg !218
-  store i32 %cond, i32* %retval, align 4, !dbg !219
-  br label %return, !dbg !219
+  %7 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !202
+  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %7, i32 0, i32 0, !dbg !204
+  %8 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !204
+  %9 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !205
+  %pool6 = getelementptr inbounds %struct.apr_finfo_t, %struct.apr_finfo_t* %9, i32 0, i32 0, !dbg !206
+  store %struct.apr_pool_t* %8, %struct.apr_pool_t** %pool6, align 8, !dbg !207
+  %10 = load %struct.apr_file_t*, %struct.apr_file_t** %thefile.addr, align 8, !dbg !208
+  %fname = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %10, i32 0, i32 2, !dbg !209
+  %11 = load i8*, i8** %fname, align 8, !dbg !209
+  %12 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !210
+  %fname7 = getelementptr inbounds %struct.apr_finfo_t, %struct.apr_finfo_t* %12, i32 0, i32 14, !dbg !211
+  store i8* %11, i8** %fname7, align 8, !dbg !212
+  %13 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !213
+  %14 = load i32, i32* %wanted.addr, align 4, !dbg !214
+  call void @fill_out_finfo(%struct.apr_finfo_t* %13, %struct.stat* %info, i32 %14), !dbg !215
+  %15 = load i32, i32* %wanted.addr, align 4, !dbg !216
+  %16 = load %struct.apr_finfo_t*, %struct.apr_finfo_t** %finfo.addr, align 8, !dbg !217
+  %valid = getelementptr inbounds %struct.apr_finfo_t, %struct.apr_finfo_t* %16, i32 0, i32 1, !dbg !218
+  %17 = load i32, i32* %valid, align 8, !dbg !218
+  %neg = xor i32 %17, -1, !dbg !219
+  %and = and i32 %15, %neg, !dbg !220
+  %tobool8 = icmp ne i32 %and, 0, !dbg !221
+  %cond = select i1 %tobool8, i32 70008, i32 0, !dbg !221
+  store i32 %cond, i32* %retval, align 4, !dbg !222
+  br label %return, !dbg !222
 
 if.else:                                          ; preds = %if.end2
-  %call9 = call i32* @__errno_location() #1, !dbg !220
-  %18 = load i32, i32* %call9, align 4, !dbg !220
-  store i32 %18, i32* %retval, align 4, !dbg !222
-  br label %return, !dbg !222
+  %call9 = call i32* @__errno_location() #1, !dbg !223
+  %18 = load i32, i32* %call9, align 4, !dbg !223
+  store i32 %18, i32* %retval, align 4, !dbg !225
+  br label %return, !dbg !225
 
 return:                                           ; preds = %if.else, %if.then5, %if.then1
-  %19 = load i32, i32* %retval, align 4, !dbg !223
-  ret i32 %19, !dbg !223
+  %19 = load i32, i32* %retval, align 4, !dbg !226
+  ret i32 %19, !dbg !226
 }
 
 ; Function Attrs: nounwind readnone
 declare void @llvm.dbg.declare(metadata, metadata, metadata) #1
 
 declare i32 @apr_file_flush(%struct.apr_file_t*) #2
 
 ; Function Attrs: nounwind
 declare i32 @fstat(i32, %struct.stat*) #3
 
 ; Function Attrs: nounwind uwtable
-define internal void @fill_out_finfo(%struct.apr_finfo_t* %finfo, %struct.stat* %info, i32 %wanted) #0 !dbg !125 {
+define internal void @fill_out_finfo(%struct.apr_finfo_t* %finfo, %struct.stat* %info, i32 %wanted) #0 !dbg !128 {
 entry:
   %finfo.addr = alloca %struct.apr_finfo_t*, align 8
   %info.addr = alloca %struct.stat*, align 8
   %wanted.addr = alloca i32, align 4
   store %struct.apr_finfo_t* %finfo, %struct.apr_finfo_t** %finfo.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_finfo_t** %finfo.addr, metadata !224, metadata !169), !dbg !225
+  call void @llvm.dbg.declare(metadata %struct.apr_finfo_t** %finfo.addr, metadata !227, metadata !172), !dbg !228
   store %struct.stat* %info, %struct.stat** %info.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.stat** %info.addr, metadata !226, metadata !169), !dbg !227
+  call void @llvm.dbg.declare(metadata %struct.stat** %info.addr, metadata !229, metadata !172), !dbg !230
   store i32 %wanted, i32* %wanted.addr, align 4
-  call void @llvm.dbg.declare(metadata i32* %wanted.addr, metadata !228, metadata !169), !dbg !229
