diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/Apache.dsp /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/Apache.dsp
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/Apache.dsp	2002-08-29 02:23:05.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/Apache.dsp	2003-03-11 09:07:59.000000000 +0800
@@ -39,21 +39,21 @@
 # PROP Use_Debug_Libraries 0
 # PROP Output_Dir "Release"
 # PROP Intermediate_Dir "Release"
 # PROP Ignore_Export_Lib 0
 # PROP Target_Dir ""
 # ADD BASE CPP /nologo /MD /W3 /O2 /D "WIN32" /D "NDEBUG" /D "_CONSOLE" /D "SHARED_MODULE" /FD /c
-# ADD CPP /nologo /MD /W3 /O2 /I "./include" /I "./srclib/apr/include" /I "./srclib/apr-util/include" /D "NDEBUG" /D "WIN32" /D "_CONSOLE" /Fd"Release\Apache" /FD /c
+# ADD CPP /nologo /MD /W3 /Zi /O2 /I "./include" /I "./srclib/apr/include" /I "./srclib/apr-util/include" /D "NDEBUG" /D "WIN32" /D "_CONSOLE" /Fd"Release\Apache" /FD /c
 # ADD BASE RSC /l 0x409 /d "NDEBUG"
 # ADD RSC /l 0x409 /d "NDEBUG"
 BSC32=bscmake.exe
 # ADD BASE BSC32 /nologo
 # ADD BSC32 /nologo
 LINK32=link.exe
-# ADD BASE LINK32 kernel32.lib user32.lib advapi32.lib ws2_32.lib mswsock.lib /nologo /subsystem:console /map /machine:I386
-# ADD LINK32 kernel32.lib user32.lib advapi32.lib ws2_32.lib mswsock.lib /nologo /stack:0x40000 /subsystem:console /map /machine:I386

 # bring in rules.mk for standard functionality
 @INCLUDE_RULES@
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/os2/open.c /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/os2/open.c
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/os2/open.c	2003-01-07 08:52:51.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/os2/open.c	2003-03-02 11:11:22.000000000 +0800
@@ -73,13 +73,12 @@
     int oflags = 0;
     int mflags = OPEN_FLAGS_FAIL_ON_ERROR|OPEN_SHARE_DENYNONE;
     int rv;
     ULONG action;
     apr_file_t *dafile = (apr_file_t *)apr_palloc(pool, sizeof(apr_file_t));
 
-    *new = dafile;
     dafile->pool = pool;
     dafile->isopen = FALSE;
     dafile->eof_hit = FALSE;
     dafile->buffer = NULL;
     dafile->flags = flag;
     dafile->blocking = BLK_ON;
@@ -145,12 +144,14 @@
     dafile->direction = 0;
     dafile->pipe = FALSE;
 
     if (!(flag & APR_FILE_NOCLEANUP)) { 
         apr_pool_cleanup_register(dafile->pool, dafile, apr_file_cleanup, apr_file_cleanup);
     }
+
+    *new = dafile;
     return APR_SUCCESS;
 }
 
 
 
 APR_DECLARE(apr_status_t) apr_file_close(apr_file_t *file)
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/os2/readwrite.c /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/os2/readwrite.c
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/os2/readwrite.c	2003-01-07 08:52:51.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/os2/readwrite.c	2003-03-05 06:19:38.000000000 +0800
@@ -340,15 +340,13 @@
 
         if (readlen != 1) {
             rv = APR_EOF;
             break;
         }
         
-        if (str[i] == '\r' || str[i] == '\x1A')
-            i--;
-        else if (str[i] == '\n') {
+        if (str[i] == '\n') {
             i++;
             break;
         }
     }
     str[i] = 0;
     return rv;
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.c.ll	2017-09-25 16:42:38.104879042 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.c.ll	2017-09-25 16:43:11.256877827 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_pool_t = type opaque
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_thread_mutex_t = type opaque
@@ -263,37 +263,37 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!71, !72}
 !llvm.ident = !{!73}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !56)
-!1 = !DIFile(filename: "copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !2 = !{!3, !44}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 131, size: 32, align: 32, elements: !40)
-!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !5 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !4, line: 122, size: 896, align: 64, elements: !6)
 !6 = !{!7, !12, !14, !17, !20, !21, !22, !27, !28, !29, !30, !31, !32, !34, !35, !36}
 !7 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !5, file: !4, line: 123, baseType: !8, size: 64, align: 64)
 !8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
-!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 91, baseType: !11)
-!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
-!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 91, flags: DIFlagFwdDecl)
+!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 92, baseType: !11)
+!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
+!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 92, flags: DIFlagFwdDecl)
 !12 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !5, file: !4, line: 124, baseType: !13, size: 32, align: 32, offset: 64)
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !5, file: !4, line: 125, baseType: !15, size: 64, align: 64, offset: 128)
 !15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
 !16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !4, line: 126, baseType: !18, size: 32, align: 32, offset: 192)
-!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 189, baseType: !13)
-!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 299, baseType: !13)
+!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !20 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !5, file: !4, line: 127, baseType: !13, size: 32, align: 32, offset: 224)
 !21 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !5, file: !4, line: 128, baseType: !13, size: 32, align: 32, offset: 256)
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !5, file: !4, line: 129, baseType: !23, size: 64, align: 64, offset: 320)
-!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 91, baseType: !25)
-!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
-!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 192, baseType: !26)
+!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 94, baseType: !25)
+!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
+!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 302, baseType: !26)
 !26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !5, file: !4, line: 130, baseType: !13, size: 32, align: 32, offset: 384)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !5, file: !4, line: 131, baseType: !3, size: 32, align: 32, offset: 416)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !5, file: !4, line: 132, baseType: !13, size: 32, align: 32, offset: 448)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !4, line: 135, baseType: !15, size: 64, align: 64, offset: 512)
 !31 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !5, file: !4, line: 136, baseType: !13, size: 32, align: 32, offset: 576)
@@ -301,39 +301,39 @@
 !33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !5, file: !4, line: 138, baseType: !13, size: 32, align: 32, offset: 704)
 !35 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !5, file: !4, line: 139, baseType: !33, size: 64, align: 64, offset: 768)
 !36 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !5, file: !4, line: 141, baseType: !37, size: 64, align: 64, offset: 832)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !39, line: 79, flags: DIFlagFwdDecl)
-!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !40 = !{!41, !42, !43}
 !41 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !42 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !43 = !DIEnumerator(name: "BLK_ON", value: 2)
-!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 97, size: 32, align: 32, elements: !46)
-!45 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 100, size: 32, align: 32, elements: !46)
+!45 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55}
 !47 = !DIEnumerator(name: "APR_NOFILE", value: 0)
 !48 = !DIEnumerator(name: "APR_REG", value: 1)
 !49 = !DIEnumerator(name: "APR_DIR", value: 2)
 !50 = !DIEnumerator(name: "APR_CHR", value: 3)
 !51 = !DIEnumerator(name: "APR_BLK", value: 4)
 !52 = !DIEnumerator(name: "APR_PIPE", value: 5)
 !53 = !DIEnumerator(name: "APR_LNK", value: 6)
 !54 = !DIEnumerator(name: "APR_SOCK", value: 7)
 !55 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
 !56 = !{!57, !67, !68}
 !57 = distinct !DISubprogram(name: "apr_file_copy", scope: !58, file: !58, line: 130, type: !59, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
-!58 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!58 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !59 = !DISubroutineType(types: !60)
 !60 = !{!61, !63, !63, !65, !8}
-!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !62, line: 81, baseType: !13)
-!62 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !62, line: 82, baseType: !13)
+!62 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
 !64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
-!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !45, line: 143, baseType: !18)
+!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !45, line: 144, baseType: !18)
 !66 = !{}
 !67 = distinct !DISubprogram(name: "apr_file_append", scope: !58, file: !58, line: 141, type: !59, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
 !68 = distinct !DISubprogram(name: "apr_file_transfer_contents", scope: !58, file: !58, line: 58, type: !69, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
 !69 = !DISubroutineType(types: !70)
 !70 = !{!61, !63, !63, !18, !65, !8}
 !71 = !{i32 2, !"Dwarf Version", i32 4}
@@ -363,14 +363,14 @@
 !95 = !DILocalVariable(name: "to_perms", arg: 4, scope: !68, file: !58, line: 61, type: !65)
 !96 = !DILocation(line: 61, column: 64, scope: !68)
 !97 = !DILocalVariable(name: "pool", arg: 5, scope: !68, file: !58, line: 62, type: !8)
 !98 = !DILocation(line: 62, column: 60, scope: !68)
 !99 = !DILocalVariable(name: "s", scope: !68, file: !58, line: 64, type: !100)
 !100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
-!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !102, line: 144, baseType: !5)
-!102 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !102, line: 143, baseType: !5)
+!102 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !103 = !DILocation(line: 64, column: 17, scope: !68)
 !104 = !DILocalVariable(name: "d", scope: !68, file: !58, line: 64, type: !100)
 !105 = !DILocation(line: 64, column: 28, scope: !68)
 !106 = !DILocalVariable(name: "status", scope: !68, file: !58, line: 65, type: !61)
 !107 = !DILocation(line: 65, column: 18, scope: !68)
 !108 = !DILocalVariable(name: "finfo", scope: !68, file: !58, line: 66, type: !109)
@@ -378,41 +378,41 @@
 !110 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !45, line: 199, size: 960, align: 64, elements: !111)
 !111 = !{!112, !113, !114, !115, !117, !125, !129, !133, !137, !138, !142, !143, !145, !146, !147, !148, !149}
 !112 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !110, file: !45, line: 201, baseType: !8, size: 64, align: 64)
 !113 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !110, file: !45, line: 204, baseType: !18, size: 32, align: 32, offset: 64)
 !114 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !110, file: !45, line: 206, baseType: !65, size: 32, align: 32, offset: 96)
 !115 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !110, file: !45, line: 211, baseType: !116, size: 32, align: 32, offset: 128)
-!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !45, line: 107, baseType: !44)
+!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !45, line: 110, baseType: !44)
 !117 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !110, file: !45, line: 213, baseType: !118, size: 32, align: 32, offset: 160)
-!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !119, line: 82, baseType: !120)
-!119 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !119, line: 83, baseType: !120)
+!119 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !121, line: 80, baseType: !122)
-!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !123, line: 125, baseType: !124)
-!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !124 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
 !125 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !110, file: !45, line: 215, baseType: !126, size: 32, align: 32, offset: 192)
-!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !119, line: 91, baseType: !127)
+!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !119, line: 92, baseType: !127)
 !127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !121, line: 65, baseType: !128)
 !128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !123, line: 126, baseType: !124)
 !129 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !110, file: !45, line: 217, baseType: !130, size: 64, align: 64, offset: 256)
 !130 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !45, line: 156, baseType: !131)
 !131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !121, line: 48, baseType: !132)
 !132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !123, line: 127, baseType: !33)
 !133 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !110, file: !45, line: 219, baseType: !134, size: 64, align: 64, offset: 320)
 !134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !45, line: 160, baseType: !135)
 !135 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !121, line: 60, baseType: !136)
 !136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !123, line: 124, baseType: !33)
 !137 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !110, file: !45, line: 221, baseType: !18, size: 32, align: 32, offset: 384)
 !138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !45, line: 223, baseType: !139, size: 64, align: 64, offset: 448)
-!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !19, line: 197, baseType: !140)
+!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !19, line: 307, baseType: !140)
 !140 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !121, line: 86, baseType: !141)
 !141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !123, line: 131, baseType: !26)
 !142 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !110, file: !45, line: 225, baseType: !139, size: 64, align: 64, offset: 512)
 !143 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !110, file: !45, line: 227, baseType: !144, size: 64, align: 64, offset: 576)
-!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !24, line: 81, baseType: !25)
+!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !24, line: 84, baseType: !25)
 !145 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !110, file: !45, line: 229, baseType: !144, size: 64, align: 64, offset: 640)
 !146 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !110, file: !45, line: 231, baseType: !144, size: 64, align: 64, offset: 704)
 !147 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !110, file: !45, line: 233, baseType: !63, size: 64, align: 64, offset: 768)
 !148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !45, line: 235, baseType: !63, size: 64, align: 64, offset: 832)
 !149 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !110, file: !45, line: 237, baseType: !150, size: 64, align: 64, offset: 896)
 !150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
@@ -473,15 +473,15 @@
 !205 = distinct !DILexicalBlock(scope: !68, file: !58, line: 94, column: 15)
 !206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 65536, align: 8, elements: !207)
 !207 = !{!208}
 !208 = !DISubrange(count: 8192)
 !209 = !DILocation(line: 95, column: 14, scope: !205)
 !210 = !DILocalVariable(name: "bytes_this_time", scope: !205, file: !58, line: 96, type: !211)
-!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !19, line: 195, baseType: !212)
+!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !19, line: 305, baseType: !212)
 !212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !213, line: 62, baseType: !33)
-!213 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!213 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !214 = !DILocation(line: 96, column: 20, scope: !205)
 !215 = !DILocalVariable(name: "read_err", scope: !205, file: !58, line: 97, type: !61)
 !216 = !DILocation(line: 97, column: 22, scope: !205)
 !217 = !DILocalVariable(name: "write_err", scope: !205, file: !58, line: 98, type: !61)
 !218 = !DILocation(line: 98, column: 22, scope: !205)
 !219 = !DILocation(line: 101, column: 34, scope: !205)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/copy.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/copy.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.c.ll	2017-09-25 16:42:38.484879028 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.c.ll	2017-09-25 16:43:11.612877813 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_dir_t = type { %struct.apr_pool_t*, i8*, %struct.__dirstream*, %struct.dirent* }
 %struct.__dirstream = type opaque
 %struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
@@ -926,49 +926,49 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!175, !176}
 !llvm.ident = !{!177}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !56, subprograms: !87)
-!1 = !DIFile(filename: "dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !2 = !{!3, !15}
-!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 97, size: 32, align: 32, elements: !5)
-!4 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 100, size: 32, align: 32, elements: !5)
+!4 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
 !6 = !DIEnumerator(name: "APR_NOFILE", value: 0)
 !7 = !DIEnumerator(name: "APR_REG", value: 1)
 !8 = !DIEnumerator(name: "APR_DIR", value: 2)
 !9 = !DIEnumerator(name: "APR_CHR", value: 3)
 !10 = !DIEnumerator(name: "APR_BLK", value: 4)
 !11 = !DIEnumerator(name: "APR_PIPE", value: 5)
 !12 = !DIEnumerator(name: "APR_LNK", value: 6)
 !13 = !DIEnumerator(name: "APR_SOCK", value: 7)
 !14 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
 !15 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !17, file: !16, line: 131, size: 32, align: 32, elements: !52)
-!16 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!16 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !17 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !16, line: 122, size: 896, align: 64, elements: !18)
 !18 = !{!19, !24, !26, !29, !32, !33, !34, !39, !40, !41, !42, !43, !44, !46, !47, !48}
 !19 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !17, file: !16, line: 123, baseType: !20, size: 64, align: 64)
 !20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
-!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !22, line: 91, baseType: !23)
-!22 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
-!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !22, line: 91, flags: DIFlagFwdDecl)
+!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !22, line: 92, baseType: !23)
+!22 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
+!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !22, line: 92, flags: DIFlagFwdDecl)
 !24 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !17, file: !16, line: 124, baseType: !25, size: 32, align: 32, offset: 64)
 !25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !26 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !17, file: !16, line: 125, baseType: !27, size: 64, align: 64, offset: 128)
 !27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
 !28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !16, line: 126, baseType: !30, size: 32, align: 32, offset: 192)
-!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !31, line: 189, baseType: !25)
-!31 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !31, line: 299, baseType: !25)
+!31 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !32 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !17, file: !16, line: 127, baseType: !25, size: 32, align: 32, offset: 224)
 !33 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !17, file: !16, line: 128, baseType: !25, size: 32, align: 32, offset: 256)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !17, file: !16, line: 129, baseType: !35, size: 64, align: 64, offset: 320)
-!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !36, line: 91, baseType: !37)
-!36 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
-!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !31, line: 192, baseType: !38)
+!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !36, line: 94, baseType: !37)
+!36 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
+!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !31, line: 302, baseType: !38)
 !38 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !39 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !17, file: !16, line: 130, baseType: !25, size: 32, align: 32, offset: 384)
 !40 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !17, file: !16, line: 131, baseType: !15, size: 32, align: 32, offset: 416)
 !41 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !17, file: !16, line: 132, baseType: !25, size: 32, align: 32, offset: 448)
 !42 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !17, file: !16, line: 135, baseType: !27, size: 64, align: 64, offset: 512)
 !43 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !17, file: !16, line: 136, baseType: !25, size: 32, align: 32, offset: 576)
@@ -976,37 +976,37 @@
 !45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !46 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !17, file: !16, line: 138, baseType: !25, size: 32, align: 32, offset: 704)
 !47 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !17, file: !16, line: 139, baseType: !45, size: 64, align: 64, offset: 768)
 !48 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !17, file: !16, line: 141, baseType: !49, size: 64, align: 64, offset: 832)
 !49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
 !50 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !51, line: 79, flags: DIFlagFwdDecl)
-!51 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!51 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !52 = !{!53, !54, !55}
 !53 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !54 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !55 = !DIEnumerator(name: "BLK_ON", value: 2)
 !56 = !{!57, !86}
 !57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
-!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dir_t", file: !4, line: 138, baseType: !59)
+!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dir_t", file: !4, line: 140, baseType: !59)
 !59 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_dir_t", file: !16, line: 145, size: 256, align: 64, elements: !60)
 !60 = !{!61, !62, !63, !68}
 !61 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !59, file: !16, line: 146, baseType: !20, size: 64, align: 64)
 !62 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !59, file: !16, line: 147, baseType: !27, size: 64, align: 64, offset: 64)
 !63 = !DIDerivedType(tag: DW_TAG_member, name: "dirstruct", scope: !59, file: !16, line: 148, baseType: !64, size: 64, align: 64, offset: 128)
 !64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
 !65 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !66, line: 127, baseType: !67)
-!66 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!66 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !66, line: 127, flags: DIFlagFwdDecl)
 !68 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !59, file: !16, line: 149, baseType: !69, size: 64, align: 64, offset: 192)
 !69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
 !70 = !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !71, line: 22, size: 2240, align: 64, elements: !72)
-!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !72 = !{!73, !76, !78, !80, !82}
 !73 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !70, file: !71, line: 25, baseType: !74, size: 64, align: 64)
 !74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !75, line: 127, baseType: !45)
-!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !76 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !70, file: !71, line: 26, baseType: !77, size: 64, align: 64, offset: 64)
 !77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 131, baseType: !38)
 !78 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !70, file: !71, line: 31, baseType: !79, size: 16, align: 16, offset: 128)
 !79 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
 !80 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !70, file: !71, line: 32, baseType: !81, size: 8, align: 8, offset: 144)
 !81 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
@@ -1014,17 +1014,17 @@
 !83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, align: 8, elements: !84)
 !84 = !{!85}
 !85 = !DISubrange(count: 256)
 !86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
 !87 = !{!88, !98, !101, !145, !146, !149, !150, !153, !160, !163, !166, !169, !172}
 !88 = distinct !DISubprogram(name: "apr_dir_open", scope: !89, file: !89, line: 109, type: !90, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
-!89 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!89 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !90 = !DISubroutineType(types: !91)
 !91 = !{!92, !94, !95, !20}
-!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !93, line: 81, baseType: !25)
-!93 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !93, line: 82, baseType: !25)
+!93 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
 !95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
 !96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
 !97 = !{}
 !98 = distinct !DISubprogram(name: "apr_dir_close", scope: !89, file: !89, line: 138, type: !99, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !99 = !DISubroutineType(types: !100)
@@ -1036,40 +1036,40 @@
 !105 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !4, line: 168, baseType: !106)
 !106 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !4, line: 199, size: 960, align: 64, elements: !107)
 !107 = !{!108, !109, !110, !112, !114, !121, !125, !128, !132, !133, !136, !137, !139, !140, !141, !142, !143}
 !108 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !106, file: !4, line: 201, baseType: !20, size: 64, align: 64)
 !109 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !106, file: !4, line: 204, baseType: !30, size: 32, align: 32, offset: 64)
 !110 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !106, file: !4, line: 206, baseType: !111, size: 32, align: 32, offset: 96)
-!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !4, line: 143, baseType: !30)
+!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !4, line: 144, baseType: !30)
 !112 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !106, file: !4, line: 211, baseType: !113, size: 32, align: 32, offset: 128)
-!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !4, line: 107, baseType: !3)
+!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !4, line: 110, baseType: !3)
 !114 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !106, file: !4, line: 213, baseType: !115, size: 32, align: 32, offset: 160)
-!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !116, line: 82, baseType: !117)
-!116 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !116, line: 83, baseType: !117)
+!116 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !118, line: 80, baseType: !119)
-!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !75, line: 125, baseType: !120)
 !120 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
 !121 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !106, file: !4, line: 215, baseType: !122, size: 32, align: 32, offset: 192)
-!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !116, line: 91, baseType: !123)
+!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !116, line: 92, baseType: !123)
 !123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !118, line: 65, baseType: !124)
 !124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !75, line: 126, baseType: !120)
 !125 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !106, file: !4, line: 217, baseType: !126, size: 64, align: 64, offset: 256)
 !126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !4, line: 156, baseType: !127)
 !127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !118, line: 48, baseType: !74)
 !128 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !106, file: !4, line: 219, baseType: !129, size: 64, align: 64, offset: 320)
 !129 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !4, line: 160, baseType: !130)
 !130 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !118, line: 60, baseType: !131)
 !131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !75, line: 124, baseType: !45)
 !132 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !106, file: !4, line: 221, baseType: !30, size: 32, align: 32, offset: 384)
 !133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !4, line: 223, baseType: !134, size: 64, align: 64, offset: 448)
-!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !31, line: 197, baseType: !135)
+!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !31, line: 307, baseType: !135)
 !135 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !118, line: 86, baseType: !77)
 !136 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !106, file: !4, line: 225, baseType: !134, size: 64, align: 64, offset: 512)
 !137 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !106, file: !4, line: 227, baseType: !138, size: 64, align: 64, offset: 576)
-!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !36, line: 81, baseType: !37)
+!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !36, line: 84, baseType: !37)
 !139 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !106, file: !4, line: 229, baseType: !138, size: 64, align: 64, offset: 640)
 !140 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !106, file: !4, line: 231, baseType: !138, size: 64, align: 64, offset: 704)
 !141 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !106, file: !4, line: 233, baseType: !95, size: 64, align: 64, offset: 768)
 !142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !4, line: 235, baseType: !95, size: 64, align: 64, offset: 832)
 !143 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !106, file: !4, line: 237, baseType: !144, size: 64, align: 64, offset: 896)
 !144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
@@ -1083,14 +1083,14 @@
 !152 = !{!92, !95, !20}
 !153 = distinct !DISubprogram(name: "apr_os_dir_get", scope: !89, file: !89, line: 336, type: !154, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !154 = !DISubroutineType(types: !155)
 !155 = !{!92, !156, !57}
 !156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
 !157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
-!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_os_dir_t", file: !159, line: 180, baseType: !65)
-!159 = !DIFile(filename: "../../include/apr_portable.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_os_dir_t", file: !159, line: 181, baseType: !65)
+!159 = !DIFile(filename: "../../include/apr_portable.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !160 = distinct !DISubprogram(name: "apr_os_dir_put", scope: !89, file: !89, line: 345, type: !161, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !161 = !DISubroutineType(types: !162)
 !162 = !{!92, !94, !157, !20}
 !163 = distinct !DISubprogram(name: "dir_cleanup", scope: !89, file: !89, line: 65, type: !164, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !164 = !DISubroutineType(types: !165)
 !165 = !{!92, !86}
@@ -1111,15 +1111,15 @@
 !180 = !DILocation(line: 109, column: 39, scope: !88)
 !181 = !DILocalVariable(name: "dirname", arg: 2, scope: !88, file: !89, line: 109, type: !95)
 !182 = !DILocation(line: 109, column: 56, scope: !88)
 !183 = !DILocalVariable(name: "pool", arg: 3, scope: !88, file: !89, line: 110, type: !20)
 !184 = !DILocation(line: 110, column: 39, scope: !88)
 !185 = !DILocalVariable(name: "dirent_size", scope: !88, file: !89, line: 117, type: !186)
-!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !31, line: 195, baseType: !187)
+!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !31, line: 305, baseType: !187)
 !187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 62, baseType: !45)
-!188 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!188 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !189 = !DILocation(line: 117, column: 16, scope: !88)
 !190 = !DILocation(line: 121, column: 38, scope: !88)
 !191 = !DILocation(line: 121, column: 27, scope: !88)
 !192 = !DILocation(line: 121, column: 14, scope: !88)
 !193 = !DILocation(line: 121, column: 7, scope: !88)
 !194 = !DILocation(line: 121, column: 12, scope: !88)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/dir.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/dir.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.c.ll	2017-09-25 16:42:38.740879018 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.c.ll	2017-09-25 16:43:11.856877805 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_pool_t = type opaque
 %struct.apr_thread_mutex_t = type opaque
@@ -336,37 +336,37 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!85, !86}
 !llvm.ident = !{!87}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !44)
-!1 = !DIFile(filename: "fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !2 = !{!3}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 131, size: 32, align: 32, elements: !40)
-!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !5 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !4, line: 122, size: 896, align: 64, elements: !6)
 !6 = !{!7, !12, !14, !17, !20, !21, !22, !27, !28, !29, !30, !31, !32, !34, !35, !36}
 !7 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !5, file: !4, line: 123, baseType: !8, size: 64, align: 64)
 !8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
-!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 91, baseType: !11)
-!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
-!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 91, flags: DIFlagFwdDecl)
+!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 92, baseType: !11)
+!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
+!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 92, flags: DIFlagFwdDecl)
 !12 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !5, file: !4, line: 124, baseType: !13, size: 32, align: 32, offset: 64)
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !5, file: !4, line: 125, baseType: !15, size: 64, align: 64, offset: 128)
 !15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
 !16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !4, line: 126, baseType: !18, size: 32, align: 32, offset: 192)
-!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 189, baseType: !13)
-!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 299, baseType: !13)
+!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !20 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !5, file: !4, line: 127, baseType: !13, size: 32, align: 32, offset: 224)
 !21 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !5, file: !4, line: 128, baseType: !13, size: 32, align: 32, offset: 256)
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !5, file: !4, line: 129, baseType: !23, size: 64, align: 64, offset: 320)
-!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 91, baseType: !25)
-!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
-!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 192, baseType: !26)
+!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 94, baseType: !25)
+!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
+!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 302, baseType: !26)
 !26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !5, file: !4, line: 130, baseType: !13, size: 32, align: 32, offset: 384)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !5, file: !4, line: 131, baseType: !3, size: 32, align: 32, offset: 416)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !5, file: !4, line: 132, baseType: !13, size: 32, align: 32, offset: 448)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !4, line: 135, baseType: !15, size: 64, align: 64, offset: 512)
 !31 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !5, file: !4, line: 136, baseType: !13, size: 32, align: 32, offset: 576)
@@ -374,44 +374,44 @@
 !33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !5, file: !4, line: 138, baseType: !13, size: 32, align: 32, offset: 704)
 !35 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !5, file: !4, line: 139, baseType: !33, size: 64, align: 64, offset: 768)
 !36 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !5, file: !4, line: 141, baseType: !37, size: 64, align: 64, offset: 832)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !39, line: 79, flags: DIFlagFwdDecl)
-!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !40 = !{!41, !42, !43}
 !41 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !42 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !43 = !DIEnumerator(name: "BLK_ON", value: 2)
 !44 = !{!45, !58, !61, !71, !74, !79}
 !45 = distinct !DISubprogram(name: "apr_file_name_get", scope: !46, file: !46, line: 60, type: !47, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
-!46 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!46 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !47 = !DISubroutineType(types: !48)
 !48 = !{!49, !51, !54}
-!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !50, line: 81, baseType: !13)
-!50 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !50, line: 82, baseType: !13)
+!50 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
 !52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
 !53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
 !54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
-!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !56, line: 144, baseType: !5)
-!56 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !56, line: 143, baseType: !5)
+!56 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !57 = !{}
 !58 = distinct !DISubprogram(name: "apr_file_flags_get", scope: !46, file: !46, line: 67, type: !59, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !59 = !DISubroutineType(types: !60)
 !60 = !{!18, !54}
 !61 = distinct !DISubprogram(name: "apr_unix_perms2mode", scope: !46, file: !46, line: 73, type: !62, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !62 = !DISubroutineType(types: !63)
 !63 = !{!64, !69}
 !64 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !65, line: 70, baseType: !66)
-!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !67, line: 129, baseType: !68)
-!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !68 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
-!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !70, line: 143, baseType: !18)
-!70 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix")
+!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !70, line: 144, baseType: !18)
+!70 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix")
 !71 = distinct !DISubprogram(name: "apr_unix_mode2perms", scope: !46, file: !46, line: 101, type: !72, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !72 = !DISubroutineType(types: !73)
 !73 = !{!69, !64}
 !74 = distinct !DISubprogram(name: "apr_file_data_get", scope: !46, file: !46, line: 130, type: !75, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, variables: !57)
 !75 = !DISubroutineType(types: !76)
 !76 = !{!49, !77, !52, !54}
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/fileacc.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/fileacc.o differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/filedup.c /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/filedup.c
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/filedup.c	2003-01-07 08:52:53.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/filedup.c	2003-03-22 10:33:50.000000000 +0800
@@ -61,34 +61,31 @@
 static apr_status_t _file_dup(apr_file_t **new_file, 
                               apr_file_t *old_file, apr_pool_t *p,
                               int which_dup)
 {
     int rv;
     
-    if ((*new_file) == NULL) {
-        if (which_dup == 1) {
-            (*new_file) = (apr_file_t *)apr_pcalloc(p, sizeof(apr_file_t));
-            if ((*new_file) == NULL) {
-                return APR_ENOMEM;
-            }
-            (*new_file)->pool = p;
-        } else {
+    if (which_dup == 2) {
+        if ((*new_file) == NULL) {
             /* We can't dup2 unless we have a valid new_file */
             return APR_EINVAL;
         }
-    }
-
-    if (which_dup == 2) {
         rv = dup2(old_file->filedes, (*new_file)->filedes);
     } else {
-        rv = ((*new_file)->filedes = dup(old_file->filedes)); 
+        rv = dup(old_file->filedes);
     }
 
     if (rv == -1)
         return errno;
     
+    if (which_dup == 1) {
+        (*new_file) = (apr_file_t *)apr_pcalloc(p, sizeof(apr_file_t));
+        (*new_file)->pool = p;
+        (*new_file)->filedes = rv;
+    }
+
     (*new_file)->fname = apr_pstrdup(p, old_file->fname);
     (*new_file)->buffered = old_file->buffered;
 
     /* If the existing socket in a dup2 is already buffered, we
      * have an existing and valid (hopefully) mutex, so we don't
      * want to create it again as we could leak!
@@ -109,46 +106,47 @@
     /* this is the way dup() works */
     (*new_file)->blocking = old_file->blocking; 
 
     /* make sure unget behavior is consistent */
     (*new_file)->ungetchar = old_file->ungetchar;
 
-    /* apr_file_dup() clears the inherit attribute, user must call 
-     * apr_file_inherit_set() again on the dupped handle, as necessary.
+    /* apr_file_dup2() retains the original cleanup, reflecting 
+     * the existing inherit and nocleanup flags.  This means, 
+     * that apr_file_dup2() cannot be called against an apr_file_t
+     * already closed with apr_file_close, because the expected
+     * cleanup was already killed.
+     */
+    if (which_dup == 2) {
+        return APR_SUCCESS;
+    }
+
+    /* apr_file_dup() retains all old_file flags with the exceptions
+     * of APR_INHERIT and APR_FILE_NOCLEANUP.
+     * The user must call apr_file_inherit_set() on the dupped 
+     * apr_file_t when desired.
      */
-    (*new_file)->flags = old_file->flags & ~APR_INHERIT;
+    (*new_file)->flags = old_file->flags
+                       & ~(APR_INHERIT | APR_FILE_NOCLEANUP);
+
+    apr_pool_cleanup_register((*new_file)->pool, (void *)(*new_file),
+                              apr_unix_file_cleanup, 
+                              apr_unix_file_cleanup);
 
     return APR_SUCCESS;
 }
 
 APR_DECLARE(apr_status_t) apr_file_dup(apr_file_t **new_file,
                                        apr_file_t *old_file, apr_pool_t *p)
 {
-    apr_status_t rv;
-
-    rv = _file_dup(new_file, old_file, p, 1);
-    if (rv != APR_SUCCESS)
-        return rv;
-
-    /* we do this here as we don't want to double register an existing 
-     * apr_file_t for cleanup
-     */
-    apr_pool_cleanup_register((*new_file)->pool, (void *)(*new_file),
-                              apr_unix_file_cleanup, apr_unix_file_cleanup);
-    return rv;
-
+    return _file_dup(new_file, old_file, p, 1);
 }
 
 APR_DECLARE(apr_status_t) apr_file_dup2(apr_file_t *new_file,
                                         apr_file_t *old_file, apr_pool_t *p)
 {
-#ifdef NETWARE
-    return _file_dup(&new_file, old_file, p, 1);
-#else
     return _file_dup(&new_file, old_file, p, 2);
-#endif
 }
 
 APR_DECLARE(apr_status_t) apr_file_setaside(apr_file_t **new_file,
                                             apr_file_t *old_file,
                                             apr_pool_t *p)
 {
@@ -174,13 +172,15 @@
     if (old_file->fname) {
         (*new_file)->fname = apr_pstrdup(p, old_file->fname);
     }
     if (!(old_file->flags & APR_FILE_NOCLEANUP)) {
         apr_pool_cleanup_register(p, (void *)(*new_file), 
                                   apr_unix_file_cleanup,
-                                  apr_unix_file_cleanup);
+                                  ((*new_file)->flags & APR_INHERIT)
+                                     ? apr_pool_cleanup_null
+                                     : apr_unix_file_cleanup);
     }
 
     old_file->filedes = -1;
     apr_pool_cleanup_kill(old_file->pool, (void *)old_file,
                           apr_unix_file_cleanup);
     return APR_SUCCESS;
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/filedup.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/filedup.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/filedup.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/filedup.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/filedup.c.ll	2017-09-25 16:42:39.092879005 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/filedup.c.ll	2017-09-25 16:43:12.184877793 +0800
@@ -1,59 +1,31 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.44/srclib/apr/file_io/unix/filedup.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.45/srclib/apr/file_io/unix/filedup.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_thread_mutex_t = type opaque
 %struct.apr_pool_t = type opaque
 
 ; Function Attrs: nounwind uwtable
 define i32 @apr_file_dup(%struct.apr_file_t** %new_file, %struct.apr_file_t* %old_file, %struct.apr_pool_t* %p) #0 !dbg !50 {
 entry:
-  %retval = alloca i32, align 4
   %new_file.addr = alloca %struct.apr_file_t**, align 8
   %old_file.addr = alloca %struct.apr_file_t*, align 8
   %p.addr = alloca %struct.apr_pool_t*, align 8
-  %rv = alloca i32, align 4
   store %struct.apr_file_t** %new_file, %struct.apr_file_t*** %new_file.addr, align 8
   call void @llvm.dbg.declare(metadata %struct.apr_file_t*** %new_file.addr, metadata !68, metadata !69), !dbg !70
   store %struct.apr_file_t* %old_file, %struct.apr_file_t** %old_file.addr, align 8
   call void @llvm.dbg.declare(metadata %struct.apr_file_t** %old_file.addr, metadata !71, metadata !69), !dbg !72
   store %struct.apr_pool_t* %p, %struct.apr_pool_t** %p.addr, align 8
   call void @llvm.dbg.declare(metadata %struct.apr_pool_t** %p.addr, metadata !73, metadata !69), !dbg !74
-  call void @llvm.dbg.declare(metadata i32* %rv, metadata !75, metadata !69), !dbg !76
-  %0 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !77
-  %1 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !78
-  %2 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !79
-  %call = call i32 @_file_dup(%struct.apr_file_t** %0, %struct.apr_file_t* %1, %struct.apr_pool_t* %2, i32 1), !dbg !80
-  store i32 %call, i32* %rv, align 4, !dbg !81
-  %3 = load i32, i32* %rv, align 4, !dbg !82
-  %cmp = icmp ne i32 %3, 0, !dbg !84
-  br i1 %cmp, label %if.then, label %if.end, !dbg !85
-
-if.then:                                          ; preds = %entry
-  %4 = load i32, i32* %rv, align 4, !dbg !86
-  store i32 %4, i32* %retval, align 4, !dbg !87
-  br label %return, !dbg !87
-
-if.end:                                           ; preds = %entry
-  %5 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !88
-  %6 = load %struct.apr_file_t*, %struct.apr_file_t** %5, align 8, !dbg !89
-  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %6, i32 0, i32 0, !dbg !90
-  %7 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !90
-  %8 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !91
-  %9 = load %struct.apr_file_t*, %struct.apr_file_t** %8, align 8, !dbg !92
-  %10 = bitcast %struct.apr_file_t* %9 to i8*, !dbg !93
-  call void @apr_pool_cleanup_register(%struct.apr_pool_t* %7, i8* %10, i32 (i8*)* @apr_unix_file_cleanup, i32 (i8*)* @apr_unix_file_cleanup), !dbg !94
-  %11 = load i32, i32* %rv, align 4, !dbg !95
-  store i32 %11, i32* %retval, align 4, !dbg !96
-  br label %return, !dbg !96
-
-return:                                           ; preds = %if.end, %if.then
-  %12 = load i32, i32* %retval, align 4, !dbg !97
-  ret i32 %12, !dbg !97
+  %0 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !75
+  %1 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !76
+  %2 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !77
+  %call = call i32 @_file_dup(%struct.apr_file_t** %0, %struct.apr_file_t* %1, %struct.apr_pool_t* %2, i32 1), !dbg !78
+  ret i32 %call, !dbg !79
 }
 
 ; Function Attrs: nounwind readnone
 declare void @llvm.dbg.declare(metadata, metadata, metadata) #1
 
 ; Function Attrs: nounwind uwtable
@@ -63,370 +35,378 @@
   %new_file.addr = alloca %struct.apr_file_t**, align 8
   %old_file.addr = alloca %struct.apr_file_t*, align 8
   %p.addr = alloca %struct.apr_pool_t*, align 8
   %which_dup.addr = alloca i32, align 4
   %rv = alloca i32, align 4
   store %struct.apr_file_t** %new_file, %struct.apr_file_t*** %new_file.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_file_t*** %new_file.addr, metadata !98, metadata !69), !dbg !99
+  call void @llvm.dbg.declare(metadata %struct.apr_file_t*** %new_file.addr, metadata !80, metadata !69), !dbg !81
   store %struct.apr_file_t* %old_file, %struct.apr_file_t** %old_file.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %old_file.addr, metadata !100, metadata !69), !dbg !101
+  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %old_file.addr, metadata !82, metadata !69), !dbg !83
   store %struct.apr_pool_t* %p, %struct.apr_pool_t** %p.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_pool_t** %p.addr, metadata !102, metadata !69), !dbg !103
+  call void @llvm.dbg.declare(metadata %struct.apr_pool_t** %p.addr, metadata !84, metadata !69), !dbg !85
   store i32 %which_dup, i32* %which_dup.addr, align 4
-  call void @llvm.dbg.declare(metadata i32* %which_dup.addr, metadata !104, metadata !69), !dbg !105
-  call void @llvm.dbg.declare(metadata i32* %rv, metadata !106, metadata !69), !dbg !107
-  %0 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !108
-  %1 = load %struct.apr_file_t*, %struct.apr_file_t** %0, align 8, !dbg !110
-  %cmp = icmp eq %struct.apr_file_t* %1, null, !dbg !111
-  br i1 %cmp, label %if.then, label %if.end6, !dbg !112
+  call void @llvm.dbg.declare(metadata i32* %which_dup.addr, metadata !86, metadata !69), !dbg !87
+  call void @llvm.dbg.declare(metadata i32* %rv, metadata !88, metadata !69), !dbg !89
+  %0 = load i32, i32* %which_dup.addr, align 4, !dbg !90
+  %cmp = icmp eq i32 %0, 2, !dbg !92
+  br i1 %cmp, label %if.then, label %if.else, !dbg !93
 
 if.then:                                          ; preds = %entry
-  %2 = load i32, i32* %which_dup.addr, align 4, !dbg !113
-  %cmp1 = icmp eq i32 %2, 1, !dbg !116
-  br i1 %cmp1, label %if.then2, label %if.else, !dbg !117
+  %1 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !94
+  %2 = load %struct.apr_file_t*, %struct.apr_file_t** %1, align 8, !dbg !97
+  %cmp1 = icmp eq %struct.apr_file_t* %2, null, !dbg !98
+  br i1 %cmp1, label %if.then2, label %if.end, !dbg !99
 
 if.then2:                                         ; preds = %if.then
-  %3 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !118
-  %call = call i8* @apr_palloc(%struct.apr_pool_t* %3, i64 112), !dbg !118
-  call void @llvm.memset.p0i8.i64(i8* %call, i8 0, i64 112, i32 1, i1 false), !dbg !120
-  %4 = bitcast i8* %call to %struct.apr_file_t*, !dbg !122
-  %5 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !123
-  store %struct.apr_file_t* %4, %struct.apr_file_t** %5, align 8, !dbg !124
-  %6 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !125
-  %7 = load %struct.apr_file_t*, %struct.apr_file_t** %6, align 8, !dbg !127
-  %cmp3 = icmp eq %struct.apr_file_t* %7, null, !dbg !128
-  br i1 %cmp3, label %if.then4, label %if.end, !dbg !129
-
-if.then4:                                         ; preds = %if.then2
-  store i32 12, i32* %retval, align 4, !dbg !130
-  br label %return, !dbg !130
-
-if.end:                                           ; preds = %if.then2
-  %8 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !132
-  %9 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !133
-  %10 = load %struct.apr_file_t*, %struct.apr_file_t** %9, align 8, !dbg !134
-  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %10, i32 0, i32 0, !dbg !135
-  store %struct.apr_pool_t* %8, %struct.apr_pool_t** %pool, align 8, !dbg !136
-  br label %if.end5, !dbg !137
-
-if.else:                                          ; preds = %if.then
-  store i32 22, i32* %retval, align 4, !dbg !138
-  br label %return, !dbg !138
+  store i32 22, i32* %retval, align 4, !dbg !100
+  br label %return, !dbg !100
 
-if.end5:                                          ; preds = %if.end
-  br label %if.end6, !dbg !140
-
-if.end6:                                          ; preds = %if.end5, %entry
-  %11 = load i32, i32* %which_dup.addr, align 4, !dbg !141
-  %cmp7 = icmp eq i32 %11, 2, !dbg !143
-  br i1 %cmp7, label %if.then8, label %if.else11, !dbg !144
+if.end:                                           ; preds = %if.then
+  %3 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !102
+  %filedes = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %3, i32 0, i32 1, !dbg !103
+  %4 = load i32, i32* %filedes, align 8, !dbg !103
+  %5 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !104
+  %6 = load %struct.apr_file_t*, %struct.apr_file_t** %5, align 8, !dbg !105
+  %filedes3 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %6, i32 0, i32 1, !dbg !106
+  %7 = load i32, i32* %filedes3, align 8, !dbg !106
+  %call = call i32 @dup2(i32 %4, i32 %7) #6, !dbg !107
+  store i32 %call, i32* %rv, align 4, !dbg !108
+  br label %if.end6, !dbg !109
+
+if.else:                                          ; preds = %entry
+  %8 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !110
+  %filedes4 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %8, i32 0, i32 1, !dbg !112
+  %9 = load i32, i32* %filedes4, align 8, !dbg !112
+  %call5 = call i32 @dup(i32 %9) #6, !dbg !113
+  store i32 %call5, i32* %rv, align 4, !dbg !114
+  br label %if.end6
+
+if.end6:                                          ; preds = %if.else, %if.end
+  %10 = load i32, i32* %rv, align 4, !dbg !115
+  %cmp7 = icmp eq i32 %10, -1, !dbg !117
+  br i1 %cmp7, label %if.then8, label %if.end10, !dbg !118
 
 if.then8:                                         ; preds = %if.end6
-  %12 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !145
-  %filedes = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %12, i32 0, i32 1, !dbg !147
-  %13 = load i32, i32* %filedes, align 8, !dbg !147
-  %14 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !148
-  %15 = load %struct.apr_file_t*, %struct.apr_file_t** %14, align 8, !dbg !149
-  %filedes9 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %15, i32 0, i32 1, !dbg !150
-  %16 = load i32, i32* %filedes9, align 8, !dbg !150
-  %call10 = call i32 @dup2(i32 %13, i32 %16) #6, !dbg !151
-  store i32 %call10, i32* %rv, align 4, !dbg !152
-  br label %if.end15, !dbg !153
-
-if.else11:                                        ; preds = %if.end6
-  %17 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !154
-  %filedes12 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %17, i32 0, i32 1, !dbg !156
-  %18 = load i32, i32* %filedes12, align 8, !dbg !156
-  %call13 = call i32 @dup(i32 %18) #6, !dbg !157
-  %19 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !158
-  %20 = load %struct.apr_file_t*, %struct.apr_file_t** %19, align 8, !dbg !159
-  %filedes14 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %20, i32 0, i32 1, !dbg !160
-  store i32 %call13, i32* %filedes14, align 8, !dbg !161
-  store i32 %call13, i32* %rv, align 4, !dbg !162
-  br label %if.end15
-
-if.end15:                                         ; preds = %if.else11, %if.then8
-  %21 = load i32, i32* %rv, align 4, !dbg !163
-  %cmp16 = icmp eq i32 %21, -1, !dbg !165
-  br i1 %cmp16, label %if.then17, label %if.end19, !dbg !166
-
-if.then17:                                        ; preds = %if.end15
-  %call18 = call i32* @__errno_location() #1, !dbg !167
-  %22 = load i32, i32* %call18, align 4, !dbg !167
-  store i32 %22, i32* %retval, align 4, !dbg !168
-  br label %return, !dbg !168
-
-if.end19:                                         ; preds = %if.end15
-  %23 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !169
-  %24 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !170
-  %fname = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %24, i32 0, i32 2, !dbg !171
-  %25 = load i8*, i8** %fname, align 8, !dbg !171
-  %call20 = call i8* @apr_pstrdup(%struct.apr_pool_t* %23, i8* %25), !dbg !172
-  %26 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !173
-  %27 = load %struct.apr_file_t*, %struct.apr_file_t** %26, align 8, !dbg !174
-  %fname21 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %27, i32 0, i32 2, !dbg !175
-  store i8* %call20, i8** %fname21, align 8, !dbg !176
-  %28 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !177
-  %buffered = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %28, i32 0, i32 7, !dbg !178
-  %29 = load i32, i32* %buffered, align 8, !dbg !178
-  %30 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !179
-  %31 = load %struct.apr_file_t*, %struct.apr_file_t** %30, align 8, !dbg !180
-  %buffered22 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %31, i32 0, i32 7, !dbg !181
-  store i32 %29, i32* %buffered22, align 8, !dbg !182
-  %32 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !183
-  %33 = load %struct.apr_file_t*, %struct.apr_file_t** %32, align 8, !dbg !185
-  %buffered23 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %33, i32 0, i32 7, !dbg !186
-  %34 = load i32, i32* %buffered23, align 8, !dbg !186
-  %tobool = icmp ne i32 %34, 0, !dbg !187
-  br i1 %tobool, label %land.lhs.true, label %if.end31, !dbg !188
-
-land.lhs.true:                                    ; preds = %if.end19
-  %35 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !189
-  %36 = load %struct.apr_file_t*, %struct.apr_file_t** %35, align 8, !dbg !191
-  %thlock = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %36, i32 0, i32 15, !dbg !192
-  %37 = load %struct.apr_thread_mutex_t*, %struct.apr_thread_mutex_t** %thlock, align 8, !dbg !192
-  %tobool24 = icmp ne %struct.apr_thread_mutex_t* %37, null, !dbg !193
-  br i1 %tobool24, label %if.end31, label %land.lhs.true25, !dbg !194
-
-land.lhs.true25:                                  ; preds = %land.lhs.true
-  %38 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !195
-  %thlock26 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %38, i32 0, i32 15, !dbg !197
-  %39 = load %struct.apr_thread_mutex_t*, %struct.apr_thread_mutex_t** %thlock26, align 8, !dbg !197
-  %tobool27 = icmp ne %struct.apr_thread_mutex_t* %39, null, !dbg !195
-  br i1 %tobool27, label %if.then28, label %if.end31, !dbg !198
-
-if.then28:                                        ; preds = %land.lhs.true25
-  %40 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !199
-  %41 = load %struct.apr_file_t*, %struct.apr_file_t** %40, align 8, !dbg !201
-  %thlock29 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %41, i32 0, i32 15, !dbg !202
-  %42 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !203
-  %call30 = call i32 @apr_thread_mutex_create(%struct.apr_thread_mutex_t** %thlock29, i32 0, %struct.apr_pool_t* %42), !dbg !204
-  br label %if.end31, !dbg !205
-
-if.end31:                                         ; preds = %if.then28, %land.lhs.true25, %land.lhs.true, %if.end19
-  %43 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !206
-  %44 = load %struct.apr_file_t*, %struct.apr_file_t** %43, align 8, !dbg !208
-  %buffered32 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %44, i32 0, i32 7, !dbg !209
-  %45 = load i32, i32* %buffered32, align 8, !dbg !209
-  %tobool33 = icmp ne i32 %45, 0, !dbg !210
-  br i1 %tobool33, label %land.lhs.true34, label %if.end39, !dbg !211
-
-land.lhs.true34:                                  ; preds = %if.end31
-  %46 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !212
-  %47 = load %struct.apr_file_t*, %struct.apr_file_t** %46, align 8, !dbg !214
-  %buffer = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %47, i32 0, i32 10, !dbg !215
-  %48 = load i8*, i8** %buffer, align 8, !dbg !215
-  %tobool35 = icmp ne i8* %48, null, !dbg !216
-  br i1 %tobool35, label %if.end39, label %if.then36, !dbg !217
-
-if.then36:                                        ; preds = %land.lhs.true34
-  %49 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !218
-  %call37 = call i8* @apr_palloc(%struct.apr_pool_t* %49, i64 4096), !dbg !220
-  %50 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !221
-  %51 = load %struct.apr_file_t*, %struct.apr_file_t** %50, align 8, !dbg !222
-  %buffer38 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %51, i32 0, i32 10, !dbg !223
-  store i8* %call37, i8** %buffer38, align 8, !dbg !224
-  br label %if.end39, !dbg !225
-
-if.end39:                                         ; preds = %if.then36, %land.lhs.true34, %if.end31
-  %52 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !226
-  %blocking = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %52, i32 0, i32 8, !dbg !227
-  %53 = load i32, i32* %blocking, align 4, !dbg !227
-  %54 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !228
-  %55 = load %struct.apr_file_t*, %struct.apr_file_t** %54, align 8, !dbg !229
-  %blocking40 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %55, i32 0, i32 8, !dbg !230
-  store i32 %53, i32* %blocking40, align 4, !dbg !231
-  %56 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !232
-  %ungetchar = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %56, i32 0, i32 9, !dbg !233
-  %57 = load i32, i32* %ungetchar, align 8, !dbg !233
-  %58 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !234
-  %59 = load %struct.apr_file_t*, %struct.apr_file_t** %58, align 8, !dbg !235
-  %ungetchar41 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %59, i32 0, i32 9, !dbg !236
-  store i32 %57, i32* %ungetchar41, align 8, !dbg !237
-  %60 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !238
-  %flags = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %60, i32 0, i32 3, !dbg !239
-  %61 = load i32, i32* %flags, align 8, !dbg !239
-  %and = and i32 %61, -16777217, !dbg !240
-  %62 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !241
-  %63 = load %struct.apr_file_t*, %struct.apr_file_t** %62, align 8, !dbg !242
-  %flags42 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %63, i32 0, i32 3, !dbg !243
-  store i32 %and, i32* %flags42, align 8, !dbg !244
-  store i32 0, i32* %retval, align 4, !dbg !245
-  br label %return, !dbg !245
-
-return:                                           ; preds = %if.end39, %if.then17, %if.else, %if.then4
-  %64 = load i32, i32* %retval, align 4, !dbg !246
-  ret i32 %64, !dbg !246
+  %call9 = call i32* @__errno_location() #1, !dbg !119
+  %11 = load i32, i32* %call9, align 4, !dbg !119
+  store i32 %11, i32* %retval, align 4, !dbg !120
+  br label %return, !dbg !120
+
+if.end10:                                         ; preds = %if.end6
+  %12 = load i32, i32* %which_dup.addr, align 4, !dbg !121
+  %cmp11 = icmp eq i32 %12, 1, !dbg !123
+  br i1 %cmp11, label %if.then12, label %if.end15, !dbg !124
+
+if.then12:                                        ; preds = %if.end10
+  %13 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !125
+  %call13 = call i8* @apr_palloc(%struct.apr_pool_t* %13, i64 112), !dbg !125
+  call void @llvm.memset.p0i8.i64(i8* %call13, i8 0, i64 112, i32 1, i1 false), !dbg !127
+  %14 = bitcast i8* %call13 to %struct.apr_file_t*, !dbg !129
+  %15 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !130
+  store %struct.apr_file_t* %14, %struct.apr_file_t** %15, align 8, !dbg !131
+  %16 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !132
+  %17 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !133
+  %18 = load %struct.apr_file_t*, %struct.apr_file_t** %17, align 8, !dbg !134
+  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %18, i32 0, i32 0, !dbg !135
+  store %struct.apr_pool_t* %16, %struct.apr_pool_t** %pool, align 8, !dbg !136
+  %19 = load i32, i32* %rv, align 4, !dbg !137
+  %20 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !138
+  %21 = load %struct.apr_file_t*, %struct.apr_file_t** %20, align 8, !dbg !139
+  %filedes14 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %21, i32 0, i32 1, !dbg !140
+  store i32 %19, i32* %filedes14, align 8, !dbg !141
+  br label %if.end15, !dbg !142
+
+if.end15:                                         ; preds = %if.then12, %if.end10
+  %22 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !143
+  %23 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !144
+  %fname = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %23, i32 0, i32 2, !dbg !145
+  %24 = load i8*, i8** %fname, align 8, !dbg !145
+  %call16 = call i8* @apr_pstrdup(%struct.apr_pool_t* %22, i8* %24), !dbg !146
+  %25 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !147
+  %26 = load %struct.apr_file_t*, %struct.apr_file_t** %25, align 8, !dbg !148
+  %fname17 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %26, i32 0, i32 2, !dbg !149
+  store i8* %call16, i8** %fname17, align 8, !dbg !150
+  %27 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !151
+  %buffered = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %27, i32 0, i32 7, !dbg !152
+  %28 = load i32, i32* %buffered, align 8, !dbg !152
+  %29 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !153
+  %30 = load %struct.apr_file_t*, %struct.apr_file_t** %29, align 8, !dbg !154
+  %buffered18 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %30, i32 0, i32 7, !dbg !155
+  store i32 %28, i32* %buffered18, align 8, !dbg !156
+  %31 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !157
+  %32 = load %struct.apr_file_t*, %struct.apr_file_t** %31, align 8, !dbg !159
+  %buffered19 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %32, i32 0, i32 7, !dbg !160
+  %33 = load i32, i32* %buffered19, align 8, !dbg !160
+  %tobool = icmp ne i32 %33, 0, !dbg !161
+  br i1 %tobool, label %land.lhs.true, label %if.end27, !dbg !162
+
+land.lhs.true:                                    ; preds = %if.end15
+  %34 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !163
+  %35 = load %struct.apr_file_t*, %struct.apr_file_t** %34, align 8, !dbg !165
+  %thlock = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %35, i32 0, i32 15, !dbg !166
+  %36 = load %struct.apr_thread_mutex_t*, %struct.apr_thread_mutex_t** %thlock, align 8, !dbg !166
+  %tobool20 = icmp ne %struct.apr_thread_mutex_t* %36, null, !dbg !167
+  br i1 %tobool20, label %if.end27, label %land.lhs.true21, !dbg !168
+
+land.lhs.true21:                                  ; preds = %land.lhs.true
+  %37 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !169
+  %thlock22 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %37, i32 0, i32 15, !dbg !171
+  %38 = load %struct.apr_thread_mutex_t*, %struct.apr_thread_mutex_t** %thlock22, align 8, !dbg !171
+  %tobool23 = icmp ne %struct.apr_thread_mutex_t* %38, null, !dbg !169
+  br i1 %tobool23, label %if.then24, label %if.end27, !dbg !172
+
+if.then24:                                        ; preds = %land.lhs.true21
+  %39 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !173
+  %40 = load %struct.apr_file_t*, %struct.apr_file_t** %39, align 8, !dbg !175
+  %thlock25 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %40, i32 0, i32 15, !dbg !176
+  %41 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !177
+  %call26 = call i32 @apr_thread_mutex_create(%struct.apr_thread_mutex_t** %thlock25, i32 0, %struct.apr_pool_t* %41), !dbg !178
+  br label %if.end27, !dbg !179
+
+if.end27:                                         ; preds = %if.then24, %land.lhs.true21, %land.lhs.true, %if.end15
+  %42 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !180
+  %43 = load %struct.apr_file_t*, %struct.apr_file_t** %42, align 8, !dbg !182
+  %buffered28 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %43, i32 0, i32 7, !dbg !183
+  %44 = load i32, i32* %buffered28, align 8, !dbg !183
+  %tobool29 = icmp ne i32 %44, 0, !dbg !184
+  br i1 %tobool29, label %land.lhs.true30, label %if.end35, !dbg !185
+
+land.lhs.true30:                                  ; preds = %if.end27
+  %45 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !186
+  %46 = load %struct.apr_file_t*, %struct.apr_file_t** %45, align 8, !dbg !188
+  %buffer = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %46, i32 0, i32 10, !dbg !189
+  %47 = load i8*, i8** %buffer, align 8, !dbg !189
+  %tobool31 = icmp ne i8* %47, null, !dbg !190
+  br i1 %tobool31, label %if.end35, label %if.then32, !dbg !191
+
+if.then32:                                        ; preds = %land.lhs.true30
+  %48 = load %struct.apr_pool_t*, %struct.apr_pool_t** %p.addr, align 8, !dbg !192
+  %call33 = call i8* @apr_palloc(%struct.apr_pool_t* %48, i64 4096), !dbg !194
+  %49 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !195
+  %50 = load %struct.apr_file_t*, %struct.apr_file_t** %49, align 8, !dbg !196
+  %buffer34 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %50, i32 0, i32 10, !dbg !197
+  store i8* %call33, i8** %buffer34, align 8, !dbg !198
+  br label %if.end35, !dbg !199
+
+if.end35:                                         ; preds = %if.then32, %land.lhs.true30, %if.end27
+  %51 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !200
+  %blocking = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %51, i32 0, i32 8, !dbg !201
+  %52 = load i32, i32* %blocking, align 4, !dbg !201
+  %53 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !202
+  %54 = load %struct.apr_file_t*, %struct.apr_file_t** %53, align 8, !dbg !203
+  %blocking36 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %54, i32 0, i32 8, !dbg !204
+  store i32 %52, i32* %blocking36, align 4, !dbg !205
+  %55 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !206
+  %ungetchar = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %55, i32 0, i32 9, !dbg !207
+  %56 = load i32, i32* %ungetchar, align 8, !dbg !207
+  %57 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !208
+  %58 = load %struct.apr_file_t*, %struct.apr_file_t** %57, align 8, !dbg !209
+  %ungetchar37 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %58, i32 0, i32 9, !dbg !210
+  store i32 %56, i32* %ungetchar37, align 8, !dbg !211
+  %59 = load i32, i32* %which_dup.addr, align 4, !dbg !212
+  %cmp38 = icmp eq i32 %59, 2, !dbg !214
+  br i1 %cmp38, label %if.then39, label %if.end40, !dbg !215
+
+if.then39:                                        ; preds = %if.end35
+  store i32 0, i32* %retval, align 4, !dbg !216
+  br label %return, !dbg !216
+
+if.end40:                                         ; preds = %if.end35
+  %60 = load %struct.apr_file_t*, %struct.apr_file_t** %old_file.addr, align 8, !dbg !218
+  %flags = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %60, i32 0, i32 3, !dbg !219
+  %61 = load i32, i32* %flags, align 8, !dbg !219
+  %and = and i32 %61, -16779265, !dbg !220
+  %62 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !221
+  %63 = load %struct.apr_file_t*, %struct.apr_file_t** %62, align 8, !dbg !222
+  %flags41 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %63, i32 0, i32 3, !dbg !223
+  store i32 %and, i32* %flags41, align 8, !dbg !224
+  %64 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !225
+  %65 = load %struct.apr_file_t*, %struct.apr_file_t** %64, align 8, !dbg !226
+  %pool42 = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %65, i32 0, i32 0, !dbg !227
+  %66 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool42, align 8, !dbg !227
+  %67 = load %struct.apr_file_t**, %struct.apr_file_t*** %new_file.addr, align 8, !dbg !228
+  %68 = load %struct.apr_file_t*, %struct.apr_file_t** %67, align 8, !dbg !229
+  %69 = bitcast %struct.apr_file_t* %68 to i8*, !dbg !230
+  call void @apr_pool_cleanup_register(%struct.apr_pool_t* %66, i8* %69, i32 (i8*)* @apr_unix_file_cleanup, i32 (i8*)* @apr_unix_file_cleanup), !dbg !231
+  store i32 0, i32* %retval, align 4, !dbg !232
+  br label %return, !dbg !232
+
+return:                                           ; preds = %if.end40, %if.then39, %if.then8, %if.then2
+  %70 = load i32, i32* %retval, align 4, !dbg !233
+  ret i32 %70, !dbg !233
 }
 
-declare void @apr_pool_cleanup_register(%struct.apr_pool_t*, i8*, i32 (i8*)*, i32 (i8*)*) #2
-
-declare i32 @apr_unix_file_cleanup(i8*) #2
-
 ; Function Attrs: nounwind uwtable
 define i32 @apr_file_dup2(%struct.apr_file_t* %new_file, %struct.apr_file_t* %old_file, %struct.apr_pool_t* %p) #0 !dbg !58 {
 entry:
   %new_file.addr = alloca %struct.apr_file_t*, align 8
   %old_file.addr = alloca %struct.apr_file_t*, align 8
   %p.addr = alloca %struct.apr_pool_t*, align 8
   store %struct.apr_file_t* %new_file, %struct.apr_file_t** %new_file.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %new_file.addr, metadata !247, metadata !69), !dbg !248
