diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/Apache.dsw /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/Apache.dsw
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/Apache.dsw	2003-05-17 02:49:32.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/Apache.dsw	2004-04-20 02:53:02.000000000 +0800
@@ -141,12 +141,15 @@
     Project_Dep_Name mod_logio
     End Project Dependency
     Begin Project Dependency
     Project_Dep_Name mod_log_config
     End Project Dependency
     Begin Project Dependency
+    Project_Dep_Name mod_log_forensic
+    End Project Dependency
+    Begin Project Dependency
     Project_Dep_Name mod_mem_cache
     End Project Dependency
     Begin Project Dependency
     Project_Dep_Name mod_mime
     End Project Dependency
     Begin Project Dependency
@@ -1177,12 +1180,33 @@
 
 Package=<5>
 {{{
 }}}
 
 Package=<4>
+{{{
+    Begin Project Dependency
+    Project_Dep_Name libapr
+    End Project Dependency
+    Begin Project Dependency
+    Project_Dep_Name libaprutil
+    End Project Dependency
+    Begin Project Dependency
+    Project_Dep_Name libhttpd
+    End Project Dependency
+}}}
+
+###############################################################################
+
+Project: "mod_log_forensic"=".\modules\loggers\mod_log_forensic.dsp" - Package Owner=<4>
+
+Package=<5>
+{{{
+}}}
+

-  store %struct.apr_file_t* null, %struct.apr_file_t** %s, align 8, !dbg !103
   call void @llvm.dbg.declare(metadata %struct.apr_file_t** %d, metadata !104, metadata !75), !dbg !105
-  store %struct.apr_file_t* null, %struct.apr_file_t** %d, align 8, !dbg !105
   call void @llvm.dbg.declare(metadata i32* %status, metadata !106, metadata !75), !dbg !107
-  call void @llvm.dbg.declare(metadata %struct.apr_finfo_t* %finfo, metadata !108, metadata !75), !dbg !151
-  call void @llvm.dbg.declare(metadata i32* %perms, metadata !152, metadata !75), !dbg !153
-  %0 = load i8*, i8** %from_path.addr, align 8, !dbg !154
-  %1 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool.addr, align 8, !dbg !155
-  %call = call i32 @apr_file_open(%struct.apr_file_t** %s, i8* %0, i32 1, i32 4095, %struct.apr_pool_t* %1), !dbg !156
-  store i32 %call, i32* %status, align 4, !dbg !157
-  %2 = load i32, i32* %status, align 4, !dbg !158
-  %tobool = icmp ne i32 %2, 0, !dbg !158
-  br i1 %tobool, label %if.then, label %if.end, !dbg !160
+  call void @llvm.dbg.declare(metadata i32* %perms, metadata !108, metadata !75), !dbg !109
+  %0 = load i8*, i8** %from_path.addr, align 8, !dbg !110
+  %1 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool.addr, align 8, !dbg !111
+  %call = call i32 @apr_file_open(%struct.apr_file_t** %s, i8* %0, i32 16385, i32 4095, %struct.apr_pool_t* %1), !dbg !112
+  store i32 %call, i32* %status, align 4, !dbg !113
+  %2 = load i32, i32* %status, align 4, !dbg !114
+  %tobool = icmp ne i32 %2, 0, !dbg !114
+  br i1 %tobool, label %if.then, label %if.end, !dbg !116
 
 if.then:                                          ; preds = %entry
-  %3 = load i32, i32* %status, align 4, !dbg !161
-  store i32 %3, i32* %retval, align 4, !dbg !162
-  br label %return, !dbg !162
+  %3 = load i32, i32* %status, align 4, !dbg !117
+  store i32 %3, i32* %retval, align 4, !dbg !118
+  br label %return, !dbg !118
 
 if.end:                                           ; preds = %entry
-  %4 = load i32, i32* %to_perms.addr, align 4, !dbg !163
-  %cmp = icmp eq i32 %4, 4096, !dbg !165
-  br i1 %cmp, label %if.then1, label %if.else, !dbg !166
+  %4 = load i32, i32* %to_perms.addr, align 4, !dbg !119
+  %cmp = icmp eq i32 %4, 4096, !dbg !121
+  br i1 %cmp, label %if.then1, label %if.else, !dbg !122
 
 if.then1:                                         ; preds = %if.end
-  %5 = load %struct.apr_file_t*, %struct.apr_file_t** %s, align 8, !dbg !167
+  call void @llvm.dbg.declare(metadata %struct.apr_finfo_t* %finfo, metadata !123, metadata !75), !dbg !167
+  %5 = load %struct.apr_file_t*, %struct.apr_file_t** %s, align 8, !dbg !168
   %call2 = call i32 @apr_file_info_get(%struct.apr_finfo_t* %finfo, i32 7340032, %struct.apr_file_t* %5), !dbg !169
   store i32 %call2, i32* %status, align 4, !dbg !170
   %6 = load i32, i32* %status, align 4, !dbg !171
   %cmp3 = icmp ne i32 %6, 0, !dbg !173
   br i1 %cmp3, label %land.lhs.true, label %if.end7, !dbg !174
 
@@ -240,13 +238,13 @@
   store %struct.apr_pool_t* %pool, %struct.apr_pool_t** %pool.addr, align 8
   call void @llvm.dbg.declare(metadata %struct.apr_pool_t** %pool.addr, metadata !281, metadata !75), !dbg !282
   %0 = load i8*, i8** %from_path.addr, align 8, !dbg !283
   %1 = load i8*, i8** %to_path.addr, align 8, !dbg !284
   %2 = load i32, i32* %perms.addr, align 4, !dbg !285
   %3 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool.addr, align 8, !dbg !286
-  %call = call i32 @apr_file_transfer_contents(i8* %0, i8* %1, i32 14, i32 %2, %struct.apr_pool_t* %3), !dbg !287
+  %call = call i32 @apr_file_transfer_contents(i8* %0, i8* %1, i32 16398, i32 %2, %struct.apr_pool_t* %3), !dbg !287
   ret i32 %call, !dbg !288
 }
 
 declare i32 @apr_file_open(%struct.apr_file_t**, i8*, i32, i32, %struct.apr_pool_t*) #2
 
 declare i32 @apr_file_info_get(%struct.apr_finfo_t*, i32, %struct.apr_file_t*) #2
@@ -263,36 +261,36 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!71, !72}
 !llvm.ident = !{!73}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !56)
-!1 = !DIFile(filename: "copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !2 = !{!3, !44}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 92, size: 32, align: 32, elements: !40)
-!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !5 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !4, line: 83, size: 896, align: 64, elements: !6)
 !6 = !{!7, !12, !14, !17, !20, !21, !22, !27, !28, !29, !30, !31, !32, !34, !35, !36}
 !7 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !5, file: !4, line: 84, baseType: !8, size: 64, align: 64)
 !8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
 !9 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !10, line: 53, baseType: !11)
-!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!10 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !11 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !10, line: 53, flags: DIFlagFwdDecl)
 !12 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !5, file: !4, line: 85, baseType: !13, size: 32, align: 32, offset: 64)
 !13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !14 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !5, file: !4, line: 86, baseType: !15, size: 64, align: 64, offset: 128)
 !15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
 !16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !17 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !5, file: !4, line: 87, baseType: !18, size: 32, align: 32, offset: 192)
 !18 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !19, line: 260, baseType: !13)
-!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!19 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !20 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !5, file: !4, line: 88, baseType: !13, size: 32, align: 32, offset: 224)
 !21 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !5, file: !4, line: 89, baseType: !13, size: 32, align: 32, offset: 256)
 !22 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !5, file: !4, line: 90, baseType: !23, size: 64, align: 64, offset: 320)
 !23 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !24, line: 55, baseType: !25)
-!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!24 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !25 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !19, line: 263, baseType: !26)
 !26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !27 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !5, file: !4, line: 91, baseType: !13, size: 32, align: 32, offset: 384)
 !28 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !5, file: !4, line: 92, baseType: !3, size: 32, align: 32, offset: 416)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !5, file: !4, line: 93, baseType: !13, size: 32, align: 32, offset: 448)
 !30 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !5, file: !4, line: 96, baseType: !15, size: 64, align: 64, offset: 512)
@@ -301,256 +299,256 @@
 !33 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !5, file: !4, line: 99, baseType: !13, size: 32, align: 32, offset: 704)
 !35 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !5, file: !4, line: 100, baseType: !33, size: 64, align: 64, offset: 768)
 !36 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !5, file: !4, line: 102, baseType: !37, size: 64, align: 64, offset: 832)
 !37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
 !38 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !39, line: 40, flags: DIFlagFwdDecl)
-!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!39 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !40 = !{!41, !42, !43}
 !41 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !42 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !43 = !DIEnumerator(name: "BLK_ON", value: 2)
 !44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 61, size: 32, align: 32, elements: !46)
-!45 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!45 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55}
 !47 = !DIEnumerator(name: "APR_NOFILE", value: 0)
 !48 = !DIEnumerator(name: "APR_REG", value: 1)
 !49 = !DIEnumerator(name: "APR_DIR", value: 2)
 !50 = !DIEnumerator(name: "APR_CHR", value: 3)
 !51 = !DIEnumerator(name: "APR_BLK", value: 4)
 !52 = !DIEnumerator(name: "APR_PIPE", value: 5)
 !53 = !DIEnumerator(name: "APR_LNK", value: 6)
 !54 = !DIEnumerator(name: "APR_SOCK", value: 7)
 !55 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
 !56 = !{!57, !67, !68}
-!57 = distinct !DISubprogram(name: "apr_file_copy", scope: !58, file: !58, line: 91, type: !59, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
-!58 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!57 = distinct !DISubprogram(name: "apr_file_copy", scope: !58, file: !58, line: 102, type: !59, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
+!58 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/copy.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !59 = !DISubroutineType(types: !60)
 !60 = !{!61, !63, !63, !65, !8}
 !61 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !62, line: 43, baseType: !13)
-!62 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!62 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
 !64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
-!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !45, line: 105, baseType: !18)
+!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !45, line: 108, baseType: !18)
 !66 = !{}
-!67 = distinct !DISubprogram(name: "apr_file_append", scope: !58, file: !58, line: 102, type: !59, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
+!67 = distinct !DISubprogram(name: "apr_file_append", scope: !58, file: !58, line: 114, type: !59, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
 !68 = distinct !DISubprogram(name: "apr_file_transfer_contents", scope: !58, file: !58, line: 19, type: !69, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, variables: !66)
 !69 = !DISubroutineType(types: !70)
 !70 = !{!61, !63, !63, !18, !65, !8}
 !71 = !{i32 2, !"Dwarf Version", i32 4}
 !72 = !{i32 2, !"Debug Info Version", i32 3}
 !73 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
-!74 = !DILocalVariable(name: "from_path", arg: 1, scope: !57, file: !58, line: 91, type: !63)
+!74 = !DILocalVariable(name: "from_path", arg: 1, scope: !57, file: !58, line: 102, type: !63)
 !75 = !DIExpression()
-!76 = !DILocation(line: 91, column: 53, scope: !57)
-!77 = !DILocalVariable(name: "to_path", arg: 2, scope: !57, file: !58, line: 92, type: !63)
-!78 = !DILocation(line: 92, column: 53, scope: !57)
-!79 = !DILocalVariable(name: "perms", arg: 3, scope: !57, file: !58, line: 93, type: !65)
-!80 = !DILocation(line: 93, column: 57, scope: !57)
-!81 = !DILocalVariable(name: "pool", arg: 4, scope: !57, file: !58, line: 94, type: !8)
-!82 = !DILocation(line: 94, column: 53, scope: !57)
-!83 = !DILocation(line: 96, column: 39, scope: !57)
-!84 = !DILocation(line: 96, column: 50, scope: !57)
-!85 = !DILocation(line: 98, column: 39, scope: !57)
-!86 = !DILocation(line: 99, column: 39, scope: !57)
-!87 = !DILocation(line: 96, column: 12, scope: !57)
-!88 = !DILocation(line: 96, column: 5, scope: !57)
+!76 = !DILocation(line: 102, column: 53, scope: !57)
+!77 = !DILocalVariable(name: "to_path", arg: 2, scope: !57, file: !58, line: 103, type: !63)
+!78 = !DILocation(line: 103, column: 53, scope: !57)
+!79 = !DILocalVariable(name: "perms", arg: 3, scope: !57, file: !58, line: 104, type: !65)
+!80 = !DILocation(line: 104, column: 57, scope: !57)
+!81 = !DILocalVariable(name: "pool", arg: 4, scope: !57, file: !58, line: 105, type: !8)
+!82 = !DILocation(line: 105, column: 53, scope: !57)
+!83 = !DILocation(line: 107, column: 39, scope: !57)
+!84 = !DILocation(line: 107, column: 50, scope: !57)
+!85 = !DILocation(line: 110, column: 39, scope: !57)
+!86 = !DILocation(line: 111, column: 39, scope: !57)
+!87 = !DILocation(line: 107, column: 12, scope: !57)
+!88 = !DILocation(line: 107, column: 5, scope: !57)
 !89 = !DILocalVariable(name: "from_path", arg: 1, scope: !68, file: !58, line: 19, type: !63)
 !90 = !DILocation(line: 19, column: 60, scope: !68)
 !91 = !DILocalVariable(name: "to_path", arg: 2, scope: !68, file: !58, line: 20, type: !63)
 !92 = !DILocation(line: 20, column: 60, scope: !68)
 !93 = !DILocalVariable(name: "flags", arg: 3, scope: !68, file: !58, line: 21, type: !18)
 !94 = !DILocation(line: 21, column: 60, scope: !68)
 !95 = !DILocalVariable(name: "to_perms", arg: 4, scope: !68, file: !58, line: 22, type: !65)
 !96 = !DILocation(line: 22, column: 64, scope: !68)
 !97 = !DILocalVariable(name: "pool", arg: 5, scope: !68, file: !58, line: 23, type: !8)
 !98 = !DILocation(line: 23, column: 60, scope: !68)
 !99 = !DILocalVariable(name: "s", scope: !68, file: !58, line: 25, type: !100)
 !100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
-!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !102, line: 108, baseType: !5)
-!102 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_file_t", file: !102, line: 122, baseType: !5)
+!102 = !DIFile(filename: "../../include/apr_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !103 = !DILocation(line: 25, column: 17, scope: !68)
 !104 = !DILocalVariable(name: "d", scope: !68, file: !58, line: 25, type: !100)
-!105 = !DILocation(line: 25, column: 28, scope: !68)
+!105 = !DILocation(line: 25, column: 21, scope: !68)
 !106 = !DILocalVariable(name: "status", scope: !68, file: !58, line: 26, type: !61)
 !107 = !DILocation(line: 26, column: 18, scope: !68)
-!108 = !DILocalVariable(name: "finfo", scope: !68, file: !58, line: 27, type: !109)
-!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !45, line: 129, baseType: !110)
-!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !45, line: 160, size: 960, align: 64, elements: !111)
-!111 = !{!112, !113, !114, !115, !117, !125, !129, !133, !137, !138, !142, !143, !145, !146, !147, !148, !149}
-!112 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !110, file: !45, line: 162, baseType: !8, size: 64, align: 64)
-!113 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !110, file: !45, line: 165, baseType: !18, size: 32, align: 32, offset: 64)
-!114 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !110, file: !45, line: 167, baseType: !65, size: 32, align: 32, offset: 96)
-!115 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !110, file: !45, line: 172, baseType: !116, size: 32, align: 32, offset: 128)
-!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !45, line: 71, baseType: !44)
-!117 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !110, file: !45, line: 174, baseType: !118, size: 32, align: 32, offset: 160)
-!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !119, line: 44, baseType: !120)
-!119 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
-!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !121, line: 80, baseType: !122)
-!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
-!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !123, line: 125, baseType: !124)
-!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
-!124 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
-!125 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !110, file: !45, line: 176, baseType: !126, size: 32, align: 32, offset: 192)
-!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !119, line: 53, baseType: !127)
-!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !121, line: 65, baseType: !128)
-!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !123, line: 126, baseType: !124)
-!129 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !110, file: !45, line: 178, baseType: !130, size: 64, align: 64, offset: 256)
-!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !45, line: 117, baseType: !131)
-!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !121, line: 48, baseType: !132)
-!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !123, line: 127, baseType: !33)
-!133 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !110, file: !45, line: 180, baseType: !134, size: 64, align: 64, offset: 320)
-!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !45, line: 121, baseType: !135)
-!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !121, line: 60, baseType: !136)
-!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !123, line: 124, baseType: !33)
-!137 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !110, file: !45, line: 182, baseType: !18, size: 32, align: 32, offset: 384)
-!138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !45, line: 184, baseType: !139, size: 64, align: 64, offset: 448)
-!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !19, line: 268, baseType: !140)
-!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !121, line: 86, baseType: !141)
-!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !123, line: 131, baseType: !26)
-!142 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !110, file: !45, line: 186, baseType: !139, size: 64, align: 64, offset: 512)
-!143 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !110, file: !45, line: 188, baseType: !144, size: 64, align: 64, offset: 576)
-!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !24, line: 45, baseType: !25)
-!145 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !110, file: !45, line: 190, baseType: !144, size: 64, align: 64, offset: 640)
-!146 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !110, file: !45, line: 192, baseType: !144, size: 64, align: 64, offset: 704)
-!147 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !110, file: !45, line: 194, baseType: !63, size: 64, align: 64, offset: 768)
-!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !45, line: 196, baseType: !63, size: 64, align: 64, offset: 832)
-!149 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !110, file: !45, line: 198, baseType: !150, size: 64, align: 64, offset: 896)
-!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
-!151 = !DILocation(line: 27, column: 17, scope: !68)
-!152 = !DILocalVariable(name: "perms", scope: !68, file: !58, line: 28, type: !65)
-!153 = !DILocation(line: 28, column: 21, scope: !68)
-!154 = !DILocation(line: 31, column: 32, scope: !68)
-!155 = !DILocation(line: 31, column: 69, scope: !68)
-!156 = !DILocation(line: 31, column: 14, scope: !68)
-!157 = !DILocation(line: 31, column: 12, scope: !68)
-!158 = !DILocation(line: 32, column: 9, scope: !159)
-!159 = distinct !DILexicalBlock(scope: !68, file: !58, line: 32, column: 9)
-!160 = !DILocation(line: 32, column: 9, scope: !68)
-!161 = !DILocation(line: 33, column: 16, scope: !159)
-!162 = !DILocation(line: 33, column: 9, scope: !159)
-!163 = !DILocation(line: 36, column: 9, scope: !164)
-!164 = distinct !DILexicalBlock(scope: !68, file: !58, line: 36, column: 9)
-!165 = !DILocation(line: 36, column: 18, scope: !164)
-!166 = !DILocation(line: 36, column: 9, scope: !68)
-!167 = !DILocation(line: 37, column: 60, scope: !168)
-!168 = distinct !DILexicalBlock(scope: !164, file: !58, line: 36, column: 44)
-!169 = !DILocation(line: 37, column: 18, scope: !168)
-!170 = !DILocation(line: 37, column: 16, scope: !168)
-!171 = !DILocation(line: 38, column: 13, scope: !172)
-!172 = distinct !DILexicalBlock(scope: !168, file: !58, line: 38, column: 13)
-!173 = !DILocation(line: 38, column: 20, scope: !172)
-!174 = !DILocation(line: 38, column: 35, scope: !172)
-!175 = !DILocation(line: 38, column: 38, scope: !176)
+!108 = !DILocalVariable(name: "perms", scope: !68, file: !58, line: 27, type: !65)
+!109 = !DILocation(line: 27, column: 21, scope: !68)
+!110 = !DILocation(line: 30, column: 32, scope: !68)
+!111 = !DILocation(line: 31, column: 44, scope: !68)
+!112 = !DILocation(line: 30, column: 14, scope: !68)
+!113 = !DILocation(line: 30, column: 12, scope: !68)
+!114 = !DILocation(line: 32, column: 9, scope: !115)
+!115 = distinct !DILexicalBlock(scope: !68, file: !58, line: 32, column: 9)
+!116 = !DILocation(line: 32, column: 9, scope: !68)
+!117 = !DILocation(line: 33, column: 16, scope: !115)
+!118 = !DILocation(line: 33, column: 9, scope: !115)
+!119 = !DILocation(line: 36, column: 9, scope: !120)
+!120 = distinct !DILexicalBlock(scope: !68, file: !58, line: 36, column: 9)
+!121 = !DILocation(line: 36, column: 18, scope: !120)
+!122 = !DILocation(line: 36, column: 9, scope: !68)
+!123 = !DILocalVariable(name: "finfo", scope: !124, file: !58, line: 45, type: !125)
+!124 = distinct !DILexicalBlock(scope: !120, file: !58, line: 36, column: 44)
+!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !45, line: 132, baseType: !126)
+!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !45, line: 163, size: 960, align: 64, elements: !127)
+!127 = !{!128, !129, !130, !131, !133, !141, !145, !149, !153, !154, !158, !159, !161, !162, !163, !164, !165}
+!128 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !126, file: !45, line: 165, baseType: !8, size: 64, align: 64)
+!129 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !126, file: !45, line: 168, baseType: !18, size: 32, align: 32, offset: 64)
+!130 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !126, file: !45, line: 170, baseType: !65, size: 32, align: 32, offset: 96)
+!131 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !126, file: !45, line: 175, baseType: !132, size: 32, align: 32, offset: 128)
+!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !45, line: 71, baseType: !44)
+!133 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !126, file: !45, line: 177, baseType: !134, size: 32, align: 32, offset: 160)
+!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !135, line: 44, baseType: !136)
+!135 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
+!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !137, line: 80, baseType: !138)
+!137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
+!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !139, line: 125, baseType: !140)
+!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
+!140 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
+!141 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !126, file: !45, line: 179, baseType: !142, size: 32, align: 32, offset: 192)
+!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !135, line: 53, baseType: !143)
+!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !137, line: 65, baseType: !144)
+!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !139, line: 126, baseType: !140)
+!145 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !126, file: !45, line: 181, baseType: !146, size: 64, align: 64, offset: 256)
+!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !45, line: 120, baseType: !147)
+!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !137, line: 48, baseType: !148)
+!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !139, line: 127, baseType: !33)
+!149 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !126, file: !45, line: 183, baseType: !150, size: 64, align: 64, offset: 320)
+!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !45, line: 124, baseType: !151)
+!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !137, line: 60, baseType: !152)
+!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !139, line: 124, baseType: !33)
+!153 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !126, file: !45, line: 185, baseType: !18, size: 32, align: 32, offset: 384)
+!154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !45, line: 187, baseType: !155, size: 64, align: 64, offset: 448)
+!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !19, line: 268, baseType: !156)
+!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !137, line: 86, baseType: !157)
+!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 131, baseType: !26)
+!158 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !126, file: !45, line: 189, baseType: !155, size: 64, align: 64, offset: 512)
+!159 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !126, file: !45, line: 191, baseType: !160, size: 64, align: 64, offset: 576)
+!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !24, line: 45, baseType: !25)
+!161 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !126, file: !45, line: 193, baseType: !160, size: 64, align: 64, offset: 640)
+!162 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !126, file: !45, line: 195, baseType: !160, size: 64, align: 64, offset: 704)
+!163 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !126, file: !45, line: 197, baseType: !63, size: 64, align: 64, offset: 768)
+!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !45, line: 199, baseType: !63, size: 64, align: 64, offset: 832)
+!165 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !126, file: !45, line: 201, baseType: !166, size: 64, align: 64, offset: 896)
+!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
+!167 = !DILocation(line: 45, column: 21, scope: !124)
+!168 = !DILocation(line: 47, column: 60, scope: !124)
+!169 = !DILocation(line: 47, column: 18, scope: !124)
+!170 = !DILocation(line: 47, column: 16, scope: !124)
+!171 = !DILocation(line: 48, column: 13, scope: !172)
+!172 = distinct !DILexicalBlock(scope: !124, file: !58, line: 48, column: 13)
+!173 = !DILocation(line: 48, column: 20, scope: !172)
+!174 = !DILocation(line: 48, column: 35, scope: !172)
+!175 = !DILocation(line: 48, column: 38, scope: !176)
 !176 = !DILexicalBlockFile(scope: !172, file: !58, discriminator: 1)
-!177 = !DILocation(line: 38, column: 45, scope: !176)
-!178 = !DILocation(line: 38, column: 13, scope: !176)
-!179 = !DILocation(line: 39, column: 28, scope: !180)
-!180 = distinct !DILexicalBlock(scope: !172, file: !58, line: 38, column: 64)
-!181 = !DILocation(line: 39, column: 13, scope: !180)
-!182 = !DILocation(line: 40, column: 20, scope: !180)
-!183 = !DILocation(line: 40, column: 13, scope: !180)
-!184 = !DILocation(line: 42, column: 23, scope: !168)
-!185 = !DILocation(line: 42, column: 15, scope: !168)
-!186 = !DILocation(line: 43, column: 5, scope: !168)
-!187 = !DILocation(line: 45, column: 17, scope: !164)
-!188 = !DILocation(line: 45, column: 15, scope: !164)
-!189 = !DILocation(line: 48, column: 32, scope: !68)
-!190 = !DILocation(line: 48, column: 41, scope: !68)
-!191 = !DILocation(line: 48, column: 48, scope: !68)
-!192 = !DILocation(line: 48, column: 55, scope: !68)
-!193 = !DILocation(line: 48, column: 14, scope: !68)
-!194 = !DILocation(line: 48, column: 12, scope: !68)
-!195 = !DILocation(line: 49, column: 9, scope: !196)
-!196 = distinct !DILexicalBlock(scope: !68, file: !58, line: 49, column: 9)
-!197 = !DILocation(line: 49, column: 9, scope: !68)
-!198 = !DILocation(line: 50, column: 24, scope: !199)
-!199 = distinct !DILexicalBlock(scope: !196, file: !58, line: 49, column: 17)
-!200 = !DILocation(line: 50, column: 9, scope: !199)
-!201 = !DILocation(line: 51, column: 16, scope: !199)
-!202 = !DILocation(line: 51, column: 9, scope: !199)
-!203 = !DILocation(line: 55, column: 5, scope: !68)
-!204 = !DILocalVariable(name: "buf", scope: !205, file: !58, line: 56, type: !206)
-!205 = distinct !DILexicalBlock(scope: !68, file: !58, line: 55, column: 15)
+!177 = !DILocation(line: 48, column: 45, scope: !176)
+!178 = !DILocation(line: 48, column: 13, scope: !176)
+!179 = !DILocation(line: 49, column: 28, scope: !180)
+!180 = distinct !DILexicalBlock(scope: !172, file: !58, line: 48, column: 64)
+!181 = !DILocation(line: 49, column: 13, scope: !180)
+!182 = !DILocation(line: 50, column: 20, scope: !180)
+!183 = !DILocation(line: 50, column: 13, scope: !180)
+!184 = !DILocation(line: 52, column: 23, scope: !124)
+!185 = !DILocation(line: 52, column: 15, scope: !124)
+!186 = !DILocation(line: 54, column: 5, scope: !124)
+!187 = !DILocation(line: 56, column: 17, scope: !120)
+!188 = !DILocation(line: 56, column: 15, scope: !120)
+!189 = !DILocation(line: 59, column: 32, scope: !68)
+!190 = !DILocation(line: 59, column: 41, scope: !68)
+!191 = !DILocation(line: 59, column: 48, scope: !68)
+!192 = !DILocation(line: 59, column: 55, scope: !68)
+!193 = !DILocation(line: 59, column: 14, scope: !68)
+!194 = !DILocation(line: 59, column: 12, scope: !68)
+!195 = !DILocation(line: 60, column: 9, scope: !196)
+!196 = distinct !DILexicalBlock(scope: !68, file: !58, line: 60, column: 9)
+!197 = !DILocation(line: 60, column: 9, scope: !68)
+!198 = !DILocation(line: 61, column: 24, scope: !199)
+!199 = distinct !DILexicalBlock(scope: !196, file: !58, line: 60, column: 17)
+!200 = !DILocation(line: 61, column: 9, scope: !199)
+!201 = !DILocation(line: 62, column: 16, scope: !199)
+!202 = !DILocation(line: 62, column: 9, scope: !199)
+!203 = !DILocation(line: 66, column: 5, scope: !68)
+!204 = !DILocalVariable(name: "buf", scope: !205, file: !58, line: 67, type: !206)
+!205 = distinct !DILexicalBlock(scope: !68, file: !58, line: 66, column: 15)
 !206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 65536, align: 8, elements: !207)
 !207 = !{!208}
 !208 = !DISubrange(count: 8192)
-!209 = !DILocation(line: 56, column: 14, scope: !205)
-!210 = !DILocalVariable(name: "bytes_this_time", scope: !205, file: !58, line: 57, type: !211)
+!209 = !DILocation(line: 67, column: 14, scope: !205)
+!210 = !DILocalVariable(name: "bytes_this_time", scope: !205, file: !58, line: 68, type: !211)
 !211 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !19, line: 266, baseType: !212)
 !212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !213, line: 62, baseType: !33)
-!213 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
-!214 = !DILocation(line: 57, column: 20, scope: !205)
-!215 = !DILocalVariable(name: "read_err", scope: !205, file: !58, line: 58, type: !61)
-!216 = !DILocation(line: 58, column: 22, scope: !205)
-!217 = !DILocalVariable(name: "write_err", scope: !205, file: !58, line: 59, type: !61)
-!218 = !DILocation(line: 59, column: 22, scope: !205)
-!219 = !DILocation(line: 62, column: 34, scope: !205)
-!220 = !DILocation(line: 62, column: 37, scope: !205)
-!221 = !DILocation(line: 62, column: 20, scope: !205)
-!222 = !DILocation(line: 62, column: 18, scope: !205)
-!223 = !DILocation(line: 63, column: 13, scope: !224)
-!224 = distinct !DILexicalBlock(scope: !205, file: !58, line: 63, column: 13)
-!225 = !DILocation(line: 63, column: 22, scope: !224)
-!226 = !DILocation(line: 63, column: 26, scope: !227)
+!213 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
+!214 = !DILocation(line: 68, column: 20, scope: !205)
+!215 = !DILocalVariable(name: "read_err", scope: !205, file: !58, line: 69, type: !61)
+!216 = !DILocation(line: 69, column: 22, scope: !205)
+!217 = !DILocalVariable(name: "write_err", scope: !205, file: !58, line: 70, type: !61)
+!218 = !DILocation(line: 70, column: 22, scope: !205)
+!219 = !DILocation(line: 73, column: 34, scope: !205)
+!220 = !DILocation(line: 73, column: 37, scope: !205)
+!221 = !DILocation(line: 73, column: 20, scope: !205)
+!222 = !DILocation(line: 73, column: 18, scope: !205)
+!223 = !DILocation(line: 74, column: 13, scope: !224)
+!224 = distinct !DILexicalBlock(scope: !205, file: !58, line: 74, column: 13)
+!225 = !DILocation(line: 74, column: 22, scope: !224)
+!226 = !DILocation(line: 74, column: 26, scope: !227)
 !227 = !DILexicalBlockFile(scope: !224, file: !58, discriminator: 1)
-!228 = !DILocation(line: 63, column: 13, scope: !227)
-!229 = !DILocation(line: 64, column: 28, scope: !230)
-!230 = distinct !DILexicalBlock(scope: !224, file: !58, line: 63, column: 55)
-!231 = !DILocation(line: 64, column: 13, scope: !230)
-!232 = !DILocation(line: 65, column: 28, scope: !230)
-!233 = !DILocation(line: 65, column: 13, scope: !230)
-!234 = !DILocation(line: 66, column: 20, scope: !230)
-!235 = !DILocation(line: 66, column: 13, scope: !230)
-!236 = !DILocation(line: 70, column: 41, scope: !205)
-!237 = !DILocation(line: 70, column: 44, scope: !205)
-!238 = !DILocation(line: 70, column: 49, scope: !205)
-!239 = !DILocation(line: 70, column: 21, scope: !205)
-!240 = !DILocation(line: 70, column: 19, scope: !205)
-!241 = !DILocation(line: 71, column: 13, scope: !242)
-!242 = distinct !DILexicalBlock(scope: !205, file: !58, line: 71, column: 13)
-!243 = !DILocation(line: 71, column: 13, scope: !205)
-!244 = !DILocation(line: 72, column: 28, scope: !245)
-!245 = distinct !DILexicalBlock(scope: !242, file: !58, line: 71, column: 24)
-!246 = !DILocation(line: 72, column: 13, scope: !245)
-!247 = !DILocation(line: 73, column: 28, scope: !245)
-!248 = !DILocation(line: 73, column: 13, scope: !245)
-!249 = !DILocation(line: 74, column: 20, scope: !245)
-!250 = !DILocation(line: 74, column: 13, scope: !245)
-!251 = !DILocation(line: 77, column: 13, scope: !252)
-!252 = distinct !DILexicalBlock(scope: !205, file: !58, line: 77, column: 13)
-!253 = !DILocation(line: 77, column: 22, scope: !252)
-!254 = !DILocation(line: 77, column: 25, scope: !255)
+!228 = !DILocation(line: 74, column: 13, scope: !227)
+!229 = !DILocation(line: 75, column: 28, scope: !230)
+!230 = distinct !DILexicalBlock(scope: !224, file: !58, line: 74, column: 55)
+!231 = !DILocation(line: 75, column: 13, scope: !230)
+!232 = !DILocation(line: 76, column: 28, scope: !230)
+!233 = !DILocation(line: 76, column: 13, scope: !230)
+!234 = !DILocation(line: 77, column: 20, scope: !230)
+!235 = !DILocation(line: 77, column: 13, scope: !230)
+!236 = !DILocation(line: 81, column: 41, scope: !205)
+!237 = !DILocation(line: 81, column: 44, scope: !205)
+!238 = !DILocation(line: 81, column: 49, scope: !205)
+!239 = !DILocation(line: 81, column: 21, scope: !205)
+!240 = !DILocation(line: 81, column: 19, scope: !205)
+!241 = !DILocation(line: 82, column: 13, scope: !242)
+!242 = distinct !DILexicalBlock(scope: !205, file: !58, line: 82, column: 13)
+!243 = !DILocation(line: 82, column: 13, scope: !205)
+!244 = !DILocation(line: 83, column: 28, scope: !245)
+!245 = distinct !DILexicalBlock(scope: !242, file: !58, line: 82, column: 24)
+!246 = !DILocation(line: 83, column: 13, scope: !245)
+!247 = !DILocation(line: 84, column: 28, scope: !245)
+!248 = !DILocation(line: 84, column: 13, scope: !245)
+!249 = !DILocation(line: 85, column: 20, scope: !245)
+!250 = !DILocation(line: 85, column: 13, scope: !245)
+!251 = !DILocation(line: 88, column: 13, scope: !252)
+!252 = distinct !DILexicalBlock(scope: !205, file: !58, line: 88, column: 13)
+!253 = !DILocation(line: 88, column: 22, scope: !252)
+!254 = !DILocation(line: 88, column: 25, scope: !255)
 !255 = !DILexicalBlockFile(scope: !252, file: !58, discriminator: 1)
-!256 = !DILocation(line: 77, column: 13, scope: !255)
-!257 = !DILocation(line: 78, column: 37, scope: !258)
-!258 = distinct !DILexicalBlock(scope: !252, file: !58, line: 77, column: 54)
-!259 = !DILocation(line: 78, column: 22, scope: !258)
-!260 = !DILocation(line: 78, column: 20, scope: !258)
-!261 = !DILocation(line: 79, column: 17, scope: !262)
-!262 = distinct !DILexicalBlock(scope: !258, file: !58, line: 79, column: 17)
-!263 = !DILocation(line: 79, column: 17, scope: !258)
-!264 = !DILocation(line: 80, column: 32, scope: !265)
-!265 = distinct !DILexicalBlock(scope: !262, file: !58, line: 79, column: 25)
-!266 = !DILocation(line: 80, column: 17, scope: !265)
-!267 = !DILocation(line: 81, column: 24, scope: !265)
-!268 = !DILocation(line: 81, column: 17, scope: !265)
-!269 = !DILocation(line: 85, column: 35, scope: !258)
-!270 = !DILocation(line: 85, column: 20, scope: !258)
-!271 = !DILocation(line: 85, column: 13, scope: !258)
-!272 = !DILocation(line: 55, column: 5, scope: !273)
+!256 = !DILocation(line: 88, column: 13, scope: !255)
+!257 = !DILocation(line: 89, column: 37, scope: !258)
+!258 = distinct !DILexicalBlock(scope: !252, file: !58, line: 88, column: 54)
+!259 = !DILocation(line: 89, column: 22, scope: !258)
+!260 = !DILocation(line: 89, column: 20, scope: !258)
+!261 = !DILocation(line: 90, column: 17, scope: !262)
+!262 = distinct !DILexicalBlock(scope: !258, file: !58, line: 90, column: 17)
+!263 = !DILocation(line: 90, column: 17, scope: !258)
+!264 = !DILocation(line: 91, column: 32, scope: !265)
+!265 = distinct !DILexicalBlock(scope: !262, file: !58, line: 90, column: 25)
+!266 = !DILocation(line: 91, column: 17, scope: !265)
+!267 = !DILocation(line: 92, column: 24, scope: !265)
+!268 = !DILocation(line: 92, column: 17, scope: !265)
+!269 = !DILocation(line: 96, column: 35, scope: !258)
+!270 = !DILocation(line: 96, column: 20, scope: !258)
+!271 = !DILocation(line: 96, column: 13, scope: !258)
+!272 = !DILocation(line: 66, column: 5, scope: !273)
 !273 = !DILexicalBlockFile(scope: !68, file: !58, discriminator: 1)
-!274 = !DILocation(line: 89, column: 1, scope: !68)
-!275 = !DILocalVariable(name: "from_path", arg: 1, scope: !67, file: !58, line: 102, type: !63)
-!276 = !DILocation(line: 102, column: 55, scope: !67)
-!277 = !DILocalVariable(name: "to_path", arg: 2, scope: !67, file: !58, line: 103, type: !63)
-!278 = !DILocation(line: 103, column: 55, scope: !67)
-!279 = !DILocalVariable(name: "perms", arg: 3, scope: !67, file: !58, line: 104, type: !65)
-!280 = !DILocation(line: 104, column: 59, scope: !67)
-!281 = !DILocalVariable(name: "pool", arg: 4, scope: !67, file: !58, line: 105, type: !8)
-!282 = !DILocation(line: 105, column: 55, scope: !67)
-!283 = !DILocation(line: 107, column: 39, scope: !67)
-!284 = !DILocation(line: 107, column: 50, scope: !67)
-!285 = !DILocation(line: 109, column: 39, scope: !67)
-!286 = !DILocation(line: 110, column: 39, scope: !67)
-!287 = !DILocation(line: 107, column: 12, scope: !67)
-!288 = !DILocation(line: 107, column: 5, scope: !67)
+!274 = !DILocation(line: 100, column: 1, scope: !68)
+!275 = !DILocalVariable(name: "from_path", arg: 1, scope: !67, file: !58, line: 114, type: !63)
+!276 = !DILocation(line: 114, column: 55, scope: !67)
+!277 = !DILocalVariable(name: "to_path", arg: 2, scope: !67, file: !58, line: 115, type: !63)
+!278 = !DILocation(line: 115, column: 55, scope: !67)
+!279 = !DILocalVariable(name: "perms", arg: 3, scope: !67, file: !58, line: 116, type: !65)
+!280 = !DILocation(line: 116, column: 59, scope: !67)
+!281 = !DILocalVariable(name: "pool", arg: 4, scope: !67, file: !58, line: 117, type: !8)
+!282 = !DILocation(line: 117, column: 55, scope: !67)
+!283 = !DILocation(line: 119, column: 39, scope: !67)
+!284 = !DILocation(line: 119, column: 50, scope: !67)
+!285 = !DILocation(line: 122, column: 39, scope: !67)
+!286 = !DILocation(line: 123, column: 39, scope: !67)
+!287 = !DILocation(line: 119, column: 12, scope: !67)
+!288 = !DILocation(line: 119, column: 5, scope: !67)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/copy.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/copy.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/copy.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/copy.o differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.c.ll	2017-09-25 16:45:41.520872319 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.c.ll	2017-09-25 16:48:01.220867200 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_dir_t = type { %struct.apr_pool_t*, i8*, %struct.__dirstream*, %struct.dirent* }
 %struct.__dirstream = type opaque
 %struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
@@ -926,48 +926,48 @@
 
 !llvm.dbg.cu = !{!0}
 !llvm.module.flags = !{!175, !176}
 !llvm.ident = !{!177}
 
 !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !56, subprograms: !87)
-!1 = !DIFile(filename: "dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!1 = !DIFile(filename: "dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !2 = !{!3, !15}
 !3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 61, size: 32, align: 32, elements: !5)
-!4 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!4 = !DIFile(filename: "../../include/apr_file_info.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
 !6 = !DIEnumerator(name: "APR_NOFILE", value: 0)
 !7 = !DIEnumerator(name: "APR_REG", value: 1)
 !8 = !DIEnumerator(name: "APR_DIR", value: 2)
 !9 = !DIEnumerator(name: "APR_CHR", value: 3)
 !10 = !DIEnumerator(name: "APR_BLK", value: 4)
 !11 = !DIEnumerator(name: "APR_PIPE", value: 5)
 !12 = !DIEnumerator(name: "APR_LNK", value: 6)
 !13 = !DIEnumerator(name: "APR_SOCK", value: 7)
 !14 = !DIEnumerator(name: "APR_UNKFILE", value: 127)
 !15 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !17, file: !16, line: 92, size: 32, align: 32, elements: !52)
-!16 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!16 = !DIFile(filename: "../../include/arch/unix/apr_arch_file_io.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !17 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_file_t", file: !16, line: 83, size: 896, align: 64, elements: !18)
 !18 = !{!19, !24, !26, !29, !32, !33, !34, !39, !40, !41, !42, !43, !44, !46, !47, !48}
 !19 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !17, file: !16, line: 84, baseType: !20, size: 64, align: 64)
 !20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
 !21 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_pool_t", file: !22, line: 53, baseType: !23)
-!22 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!22 = !DIFile(filename: "../../include/apr_pools.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !23 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_pool_t", file: !22, line: 53, flags: DIFlagFwdDecl)
 !24 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !17, file: !16, line: 85, baseType: !25, size: 32, align: 32, offset: 64)
 !25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
 !26 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !17, file: !16, line: 86, baseType: !27, size: 64, align: 64, offset: 128)
 !27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
 !28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
 !29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !16, line: 87, baseType: !30, size: 32, align: 32, offset: 192)
 !30 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int32_t", file: !31, line: 260, baseType: !25)
-!31 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!31 = !DIFile(filename: "../../include/apr.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !32 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hit", scope: !17, file: !16, line: 88, baseType: !25, size: 32, align: 32, offset: 224)
 !33 = !DIDerivedType(tag: DW_TAG_member, name: "is_pipe", scope: !17, file: !16, line: 89, baseType: !25, size: 32, align: 32, offset: 256)
 !34 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !17, file: !16, line: 90, baseType: !35, size: 64, align: 64, offset: 320)
 !35 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_interval_time_t", file: !36, line: 55, baseType: !37)
-!36 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!36 = !DIFile(filename: "../../include/apr_time.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !37 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_int64_t", file: !31, line: 263, baseType: !38)
 !38 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
 !39 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !17, file: !16, line: 91, baseType: !25, size: 32, align: 32, offset: 384)
 !40 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !17, file: !16, line: 92, baseType: !15, size: 32, align: 32, offset: 416)
 !41 = !DIDerivedType(tag: DW_TAG_member, name: "ungetchar", scope: !17, file: !16, line: 93, baseType: !25, size: 32, align: 32, offset: 448)
 !42 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !17, file: !16, line: 96, baseType: !27, size: 64, align: 64, offset: 512)
@@ -976,37 +976,37 @@
 !45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
 !46 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !17, file: !16, line: 99, baseType: !25, size: 32, align: 32, offset: 704)
 !47 = !DIDerivedType(tag: DW_TAG_member, name: "filePtr", scope: !17, file: !16, line: 100, baseType: !45, size: 64, align: 64, offset: 768)
 !48 = !DIDerivedType(tag: DW_TAG_member, name: "thlock", scope: !17, file: !16, line: 102, baseType: !49, size: 64, align: 64, offset: 832)
 !49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
 !50 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_thread_mutex_t", file: !51, line: 40, flags: DIFlagFwdDecl)
-!51 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!51 = !DIFile(filename: "../../include/apr_thread_mutex.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !52 = !{!53, !54, !55}
 !53 = !DIEnumerator(name: "BLK_UNKNOWN", value: 0)
 !54 = !DIEnumerator(name: "BLK_OFF", value: 1)
 !55 = !DIEnumerator(name: "BLK_ON", value: 2)
 !56 = !{!57, !86}
 !57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
-!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dir_t", file: !4, line: 101, baseType: !59)
+!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dir_t", file: !4, line: 104, baseType: !59)
 !59 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_dir_t", file: !16, line: 106, size: 256, align: 64, elements: !60)
 !60 = !{!61, !62, !63, !68}
 !61 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !59, file: !16, line: 107, baseType: !20, size: 64, align: 64)
 !62 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !59, file: !16, line: 108, baseType: !27, size: 64, align: 64, offset: 64)
 !63 = !DIDerivedType(tag: DW_TAG_member, name: "dirstruct", scope: !59, file: !16, line: 109, baseType: !64, size: 64, align: 64, offset: 128)
 !64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
 !65 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !66, line: 127, baseType: !67)
-!66 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!66 = !DIFile(filename: "/usr/include/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !66, line: 127, flags: DIFlagFwdDecl)
 !68 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !59, file: !16, line: 110, baseType: !69, size: 64, align: 64, offset: 192)
 !69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
 !70 = !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !71, line: 22, size: 2240, align: 64, elements: !72)
-!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !72 = !{!73, !76, !78, !80, !82}
 !73 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !70, file: !71, line: 25, baseType: !74, size: 64, align: 64)
 !74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !75, line: 127, baseType: !45)
-!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !76 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !70, file: !71, line: 26, baseType: !77, size: 64, align: 64, offset: 64)
 !77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 131, baseType: !38)
 !78 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !70, file: !71, line: 31, baseType: !79, size: 16, align: 16, offset: 128)
 !79 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
 !80 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !70, file: !71, line: 32, baseType: !81, size: 8, align: 8, offset: 144)
 !81 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
@@ -1014,67 +1014,67 @@
 !83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, align: 8, elements: !84)
 !84 = !{!85}
 !85 = !DISubrange(count: 256)
 !86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
 !87 = !{!88, !98, !101, !145, !146, !149, !150, !153, !160, !163, !166, !169, !172}
 !88 = distinct !DISubprogram(name: "apr_dir_open", scope: !89, file: !89, line: 70, type: !90, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
-!89 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!89 = !DIFile(filename: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.c", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !90 = !DISubroutineType(types: !91)
 !91 = !{!92, !94, !95, !20}
 !92 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_status_t", file: !93, line: 43, baseType: !25)
-!93 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!93 = !DIFile(filename: "../../include/apr_errno.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
 !95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
 !96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
 !97 = !{}
 !98 = distinct !DISubprogram(name: "apr_dir_close", scope: !89, file: !89, line: 99, type: !99, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !99 = !DISubroutineType(types: !100)
 !100 = !{!92, !57}
 !101 = distinct !DISubprogram(name: "apr_dir_read", scope: !89, file: !89, line: 132, type: !102, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !102 = !DISubroutineType(types: !103)
 !103 = !{!92, !104, !30, !57}
 !104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
-!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !4, line: 129, baseType: !106)
-!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !4, line: 160, size: 960, align: 64, elements: !107)
+!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_finfo_t", file: !4, line: 132, baseType: !106)
+!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "apr_finfo_t", file: !4, line: 163, size: 960, align: 64, elements: !107)
 !107 = !{!108, !109, !110, !112, !114, !121, !125, !128, !132, !133, !136, !137, !139, !140, !141, !142, !143}
-!108 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !106, file: !4, line: 162, baseType: !20, size: 64, align: 64)
-!109 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !106, file: !4, line: 165, baseType: !30, size: 32, align: 32, offset: 64)
-!110 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !106, file: !4, line: 167, baseType: !111, size: 32, align: 32, offset: 96)
-!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !4, line: 105, baseType: !30)
-!112 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !106, file: !4, line: 172, baseType: !113, size: 32, align: 32, offset: 128)
+!108 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !106, file: !4, line: 165, baseType: !20, size: 64, align: 64)
+!109 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !106, file: !4, line: 168, baseType: !30, size: 32, align: 32, offset: 64)
+!110 = !DIDerivedType(tag: DW_TAG_member, name: "protection", scope: !106, file: !4, line: 170, baseType: !111, size: 32, align: 32, offset: 96)
+!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_fileperms_t", file: !4, line: 108, baseType: !30)
+!112 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !106, file: !4, line: 175, baseType: !113, size: 32, align: 32, offset: 128)
 !113 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_filetype_e", file: !4, line: 71, baseType: !3)
-!114 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !106, file: !4, line: 174, baseType: !115, size: 32, align: 32, offset: 160)
+!114 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !106, file: !4, line: 177, baseType: !115, size: 32, align: 32, offset: 160)
 !115 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_uid_t", file: !116, line: 44, baseType: !117)
-!116 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!116 = !DIFile(filename: "../../include/apr_user.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !118, line: 80, baseType: !119)
-!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !75, line: 125, baseType: !120)
 !120 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
-!121 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !106, file: !4, line: 176, baseType: !122, size: 32, align: 32, offset: 192)
+!121 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !106, file: !4, line: 179, baseType: !122, size: 32, align: 32, offset: 192)
 !122 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_gid_t", file: !116, line: 53, baseType: !123)
 !123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !118, line: 65, baseType: !124)
 !124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !75, line: 126, baseType: !120)
-!125 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !106, file: !4, line: 178, baseType: !126, size: 64, align: 64, offset: 256)
-!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !4, line: 117, baseType: !127)
+!125 = !DIDerivedType(tag: DW_TAG_member, name: "inode", scope: !106, file: !4, line: 181, baseType: !126, size: 64, align: 64, offset: 256)
+!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_ino_t", file: !4, line: 120, baseType: !127)
 !127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !118, line: 48, baseType: !74)
-!128 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !106, file: !4, line: 180, baseType: !129, size: 64, align: 64, offset: 320)
-!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !4, line: 121, baseType: !130)
+!128 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !106, file: !4, line: 183, baseType: !129, size: 64, align: 64, offset: 320)
+!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_dev_t", file: !4, line: 124, baseType: !130)
 !130 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !118, line: 60, baseType: !131)
 !131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !75, line: 124, baseType: !45)
-!132 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !106, file: !4, line: 182, baseType: !30, size: 32, align: 32, offset: 384)
-!133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !4, line: 184, baseType: !134, size: 64, align: 64, offset: 448)
+!132 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !106, file: !4, line: 185, baseType: !30, size: 32, align: 32, offset: 384)
+!133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !4, line: 187, baseType: !134, size: 64, align: 64, offset: 448)
 !134 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_off_t", file: !31, line: 268, baseType: !135)
 !135 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !118, line: 86, baseType: !77)
-!136 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !106, file: !4, line: 186, baseType: !134, size: 64, align: 64, offset: 512)
-!137 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !106, file: !4, line: 188, baseType: !138, size: 64, align: 64, offset: 576)
+!136 = !DIDerivedType(tag: DW_TAG_member, name: "csize", scope: !106, file: !4, line: 189, baseType: !134, size: 64, align: 64, offset: 512)
+!137 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !106, file: !4, line: 191, baseType: !138, size: 64, align: 64, offset: 576)
 !138 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_time_t", file: !36, line: 45, baseType: !37)
-!139 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !106, file: !4, line: 190, baseType: !138, size: 64, align: 64, offset: 640)
-!140 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !106, file: !4, line: 192, baseType: !138, size: 64, align: 64, offset: 704)
-!141 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !106, file: !4, line: 194, baseType: !95, size: 64, align: 64, offset: 768)
-!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !4, line: 196, baseType: !95, size: 64, align: 64, offset: 832)
-!143 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !106, file: !4, line: 198, baseType: !144, size: 64, align: 64, offset: 896)
+!139 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !106, file: !4, line: 193, baseType: !138, size: 64, align: 64, offset: 640)
+!140 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !106, file: !4, line: 195, baseType: !138, size: 64, align: 64, offset: 704)
+!141 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !106, file: !4, line: 197, baseType: !95, size: 64, align: 64, offset: 768)
+!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !4, line: 199, baseType: !95, size: 64, align: 64, offset: 832)
+!143 = !DIDerivedType(tag: DW_TAG_member, name: "filehand", scope: !106, file: !4, line: 201, baseType: !144, size: 64, align: 64, offset: 896)
 !144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
 !145 = distinct !DISubprogram(name: "apr_dir_rewind", scope: !89, file: !89, line: 245, type: !99, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !146 = distinct !DISubprogram(name: "apr_dir_make", scope: !89, file: !89, line: 251, type: !147, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !147 = !DISubroutineType(types: !148)
 !148 = !{!92, !95, !111, !20}
 !149 = distinct !DISubprogram(name: "apr_dir_make_recursive", scope: !89, file: !89, line: 264, type: !147, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
@@ -1084,13 +1084,13 @@
 !153 = distinct !DISubprogram(name: "apr_os_dir_get", scope: !89, file: !89, line: 297, type: !154, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !154 = !DISubroutineType(types: !155)
 !155 = !{!92, !156, !57}
 !156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
 !157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
 !158 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_os_dir_t", file: !159, line: 142, baseType: !65)
-!159 = !DIFile(filename: "../../include/apr_portable.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!159 = !DIFile(filename: "../../include/apr_portable.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !160 = distinct !DISubprogram(name: "apr_os_dir_put", scope: !89, file: !89, line: 306, type: !161, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !161 = !DISubroutineType(types: !162)
 !162 = !{!92, !94, !157, !20}
 !163 = distinct !DISubprogram(name: "dir_cleanup", scope: !89, file: !89, line: 26, type: !164, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, variables: !97)
 !164 = !DISubroutineType(types: !165)
 !165 = !{!92, !86}
@@ -1113,13 +1113,13 @@
 !182 = !DILocation(line: 70, column: 56, scope: !88)
 !183 = !DILocalVariable(name: "pool", arg: 3, scope: !88, file: !89, line: 71, type: !20)
 !184 = !DILocation(line: 71, column: 39, scope: !88)
 !185 = !DILocalVariable(name: "dirent_size", scope: !88, file: !89, line: 78, type: !186)
 !186 = !DIDerivedType(tag: DW_TAG_typedef, name: "apr_size_t", file: !31, line: 266, baseType: !187)
 !187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 62, baseType: !45)
-!188 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix")
+!188 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix")
 !189 = !DILocation(line: 78, column: 16, scope: !88)
 !190 = !DILocation(line: 82, column: 38, scope: !88)
 !191 = !DILocation(line: 82, column: 27, scope: !88)
 !192 = !DILocation(line: 82, column: 14, scope: !88)
 !193 = !DILocation(line: 82, column: 7, scope: !88)
 !194 = !DILocation(line: 82, column: 12, scope: !88)
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.lo and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.lo differ
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/dir.o and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/dir.o differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/fileacc.c /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/fileacc.c
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/fileacc.c	2004-02-13 17:33:43.000000000 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/fileacc.c	2004-05-05 10:57:41.000000000 +0800
@@ -32,26 +32,34 @@
 
 #if !defined(OS2) && !defined(WIN32)
 mode_t apr_unix_perms2mode(apr_fileperms_t perms)
 {
     mode_t mode = 0;
 
+    if (perms & APR_USETID)
+        mode |= S_ISUID;
     if (perms & APR_UREAD)
         mode |= S_IRUSR;
     if (perms & APR_UWRITE)
         mode |= S_IWUSR;
     if (perms & APR_UEXECUTE)
         mode |= S_IXUSR;
 
+    if (perms & APR_GSETID)
+        mode |= S_ISGID;
     if (perms & APR_GREAD)
         mode |= S_IRGRP;
     if (perms & APR_GWRITE)
         mode |= S_IWGRP;
     if (perms & APR_GEXECUTE)
         mode |= S_IXGRP;
 
+#ifdef S_ISVTX
+    if (perms & APR_WSTICKY)
+        mode |= S_ISVTX;
+#endif
     if (perms & APR_WREAD)
         mode |= S_IROTH;
     if (perms & APR_WWRITE)
         mode |= S_IWOTH;
     if (perms & APR_WEXECUTE)
         mode |= S_IXOTH;
@@ -60,26 +68,34 @@
 }
 
 apr_fileperms_t apr_unix_mode2perms(mode_t mode)
 {
     apr_fileperms_t perms = 0;
 
+    if (mode & S_ISUID)
+        perms |= APR_USETID;
     if (mode & S_IRUSR)
         perms |= APR_UREAD;
     if (mode & S_IWUSR)
         perms |= APR_UWRITE;
     if (mode & S_IXUSR)
         perms |= APR_UEXECUTE;
 
+    if (mode & S_ISGID)
+        perms |= APR_GSETID;
     if (mode & S_IRGRP)
         perms |= APR_GREAD;
     if (mode & S_IWGRP)
         perms |= APR_GWRITE;
     if (mode & S_IXGRP)
         perms |= APR_GEXECUTE;
 
+#ifdef S_ISVTX
+    if (mode & S_ISVTX)
+        perms |= APR_WSTICKY;
+#endif
     if (mode & S_IROTH)
         perms |= APR_WREAD;
     if (mode & S_IWOTH)
         perms |= APR_WWRITE;
     if (mode & S_IXOTH)
         perms |= APR_WEXECUTE;
Binary files /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/fileacc.c.bc and /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/fileacc.c.bc differ
diff -BEr -U 6 /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/fileacc.c.ll /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/fileacc.c.ll
--- /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/fileacc.c.ll	2017-09-25 16:45:41.776872310 +0800
+++ /usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/fileacc.c.ll	2017-09-25 16:48:01.480867190 +0800
@@ -1,7 +1,7 @@
-; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.49/srclib/apr/file_io/unix/fileacc.c'
+; ModuleID = '/usr/info/code/cpp/LogMonitor/LogMonitor/second/download/httpd/repos/httpd-2.0.50/srclib/apr/file_io/unix/fileacc.c'
 target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
 target triple = "x86_64-unknown-linux-gnu"
 
 %struct.apr_file_t = type { %struct.apr_pool_t*, i32, i8*, i32, i32, i32, i64, i32, i32, i32, i8*, i32, i64, i32, i64, %struct.apr_thread_mutex_t* }
 %struct.apr_pool_t = type opaque
 %struct.apr_thread_mutex_t = type opaque
@@ -45,290 +45,362 @@
   %mode = alloca i32, align 4
   store i32 %perms, i32* %perms.addr, align 4
   call void @llvm.dbg.declare(metadata i32* %perms.addr, metadata !103, metadata !89), !dbg !104
   call void @llvm.dbg.declare(metadata i32* %mode, metadata !105, metadata !89), !dbg !106
   store i32 0, i32* %mode, align 4, !dbg !106
   %0 = load i32, i32* %perms.addr, align 4, !dbg !107
-  %and = and i32 %0, 1024, !dbg !109
+  %and = and i32 %0, 2048, !dbg !109
   %tobool = icmp ne i32 %and, 0, !dbg !109
   br i1 %tobool, label %if.then, label %if.end, !dbg !110
 
 if.then:                                          ; preds = %entry
   %1 = load i32, i32* %mode, align 4, !dbg !111
-  %or = or i32 %1, 256, !dbg !111
+  %or = or i32 %1, 2048, !dbg !111
   store i32 %or, i32* %mode, align 4, !dbg !111
   br label %if.end, !dbg !112
 
 if.end:                                           ; preds = %if.then, %entry
   %2 = load i32, i32* %perms.addr, align 4, !dbg !113
-  %and1 = and i32 %2, 512, !dbg !115
+  %and1 = and i32 %2, 1024, !dbg !115
   %tobool2 = icmp ne i32 %and1, 0, !dbg !115
   br i1 %tobool2, label %if.then3, label %if.end5, !dbg !116
 
 if.then3:                                         ; preds = %if.end
   %3 = load i32, i32* %mode, align 4, !dbg !117
-  %or4 = or i32 %3, 128, !dbg !117
+  %or4 = or i32 %3, 256, !dbg !117
   store i32 %or4, i32* %mode, align 4, !dbg !117
   br label %if.end5, !dbg !118
 
 if.end5:                                          ; preds = %if.then3, %if.end
   %4 = load i32, i32* %perms.addr, align 4, !dbg !119
-  %and6 = and i32 %4, 256, !dbg !121
+  %and6 = and i32 %4, 512, !dbg !121
   %tobool7 = icmp ne i32 %and6, 0, !dbg !121
   br i1 %tobool7, label %if.then8, label %if.end10, !dbg !122
 
 if.then8:                                         ; preds = %if.end5
   %5 = load i32, i32* %mode, align 4, !dbg !123
-  %or9 = or i32 %5, 64, !dbg !123
+  %or9 = or i32 %5, 128, !dbg !123
   store i32 %or9, i32* %mode, align 4, !dbg !123
   br label %if.end10, !dbg !124
 
 if.end10:                                         ; preds = %if.then8, %if.end5
   %6 = load i32, i32* %perms.addr, align 4, !dbg !125
-  %and11 = and i32 %6, 64, !dbg !127
+  %and11 = and i32 %6, 256, !dbg !127
   %tobool12 = icmp ne i32 %and11, 0, !dbg !127
   br i1 %tobool12, label %if.then13, label %if.end15, !dbg !128
 
 if.then13:                                        ; preds = %if.end10
   %7 = load i32, i32* %mode, align 4, !dbg !129
-  %or14 = or i32 %7, 32, !dbg !129
+  %or14 = or i32 %7, 64, !dbg !129
   store i32 %or14, i32* %mode, align 4, !dbg !129
   br label %if.end15, !dbg !130
 
 if.end15:                                         ; preds = %if.then13, %if.end10
   %8 = load i32, i32* %perms.addr, align 4, !dbg !131
-  %and16 = and i32 %8, 32, !dbg !133
+  %and16 = and i32 %8, 128, !dbg !133
   %tobool17 = icmp ne i32 %and16, 0, !dbg !133
   br i1 %tobool17, label %if.then18, label %if.end20, !dbg !134
 
 if.then18:                                        ; preds = %if.end15
   %9 = load i32, i32* %mode, align 4, !dbg !135
-  %or19 = or i32 %9, 16, !dbg !135
+  %or19 = or i32 %9, 1024, !dbg !135
   store i32 %or19, i32* %mode, align 4, !dbg !135
   br label %if.end20, !dbg !136
 
 if.end20:                                         ; preds = %if.then18, %if.end15
   %10 = load i32, i32* %perms.addr, align 4, !dbg !137
-  %and21 = and i32 %10, 16, !dbg !139
+  %and21 = and i32 %10, 64, !dbg !139
   %tobool22 = icmp ne i32 %and21, 0, !dbg !139
   br i1 %tobool22, label %if.then23, label %if.end25, !dbg !140
 
 if.then23:                                        ; preds = %if.end20
   %11 = load i32, i32* %mode, align 4, !dbg !141
-  %or24 = or i32 %11, 8, !dbg !141
+  %or24 = or i32 %11, 32, !dbg !141
   store i32 %or24, i32* %mode, align 4, !dbg !141
   br label %if.end25, !dbg !142
 
 if.end25:                                         ; preds = %if.then23, %if.end20
   %12 = load i32, i32* %perms.addr, align 4, !dbg !143
-  %and26 = and i32 %12, 4, !dbg !145
+  %and26 = and i32 %12, 32, !dbg !145
   %tobool27 = icmp ne i32 %and26, 0, !dbg !145
   br i1 %tobool27, label %if.then28, label %if.end30, !dbg !146
 
 if.then28:                                        ; preds = %if.end25
   %13 = load i32, i32* %mode, align 4, !dbg !147
-  %or29 = or i32 %13, 4, !dbg !147
+  %or29 = or i32 %13, 16, !dbg !147
   store i32 %or29, i32* %mode, align 4, !dbg !147
   br label %if.end30, !dbg !148
 
 if.end30:                                         ; preds = %if.then28, %if.end25
   %14 = load i32, i32* %perms.addr, align 4, !dbg !149
-  %and31 = and i32 %14, 2, !dbg !151
+  %and31 = and i32 %14, 16, !dbg !151
   %tobool32 = icmp ne i32 %and31, 0, !dbg !151
   br i1 %tobool32, label %if.then33, label %if.end35, !dbg !152
 
 if.then33:                                        ; preds = %if.end30
   %15 = load i32, i32* %mode, align 4, !dbg !153
-  %or34 = or i32 %15, 2, !dbg !153
+  %or34 = or i32 %15, 8, !dbg !153
   store i32 %or34, i32* %mode, align 4, !dbg !153
   br label %if.end35, !dbg !154
 
 if.end35:                                         ; preds = %if.then33, %if.end30
   %16 = load i32, i32* %perms.addr, align 4, !dbg !155
-  %and36 = and i32 %16, 1, !dbg !157
+  %and36 = and i32 %16, 8, !dbg !157
   %tobool37 = icmp ne i32 %and36, 0, !dbg !157
   br i1 %tobool37, label %if.then38, label %if.end40, !dbg !158
 
 if.then38:                                        ; preds = %if.end35
   %17 = load i32, i32* %mode, align 4, !dbg !159
-  %or39 = or i32 %17, 1, !dbg !159
+  %or39 = or i32 %17, 512, !dbg !159
   store i32 %or39, i32* %mode, align 4, !dbg !159
   br label %if.end40, !dbg !160
 
 if.end40:                                         ; preds = %if.then38, %if.end35
-  %18 = load i32, i32* %mode, align 4, !dbg !161
-  ret i32 %18, !dbg !162
+  %18 = load i32, i32* %perms.addr, align 4, !dbg !161
+  %and41 = and i32 %18, 4, !dbg !163
+  %tobool42 = icmp ne i32 %and41, 0, !dbg !163
+  br i1 %tobool42, label %if.then43, label %if.end45, !dbg !164
+
+if.then43:                                        ; preds = %if.end40
+  %19 = load i32, i32* %mode, align 4, !dbg !165
+  %or44 = or i32 %19, 4, !dbg !165
+  store i32 %or44, i32* %mode, align 4, !dbg !165
+  br label %if.end45, !dbg !166
+
+if.end45:                                         ; preds = %if.then43, %if.end40
+  %20 = load i32, i32* %perms.addr, align 4, !dbg !167
+  %and46 = and i32 %20, 2, !dbg !169
+  %tobool47 = icmp ne i32 %and46, 0, !dbg !169
+  br i1 %tobool47, label %if.then48, label %if.end50, !dbg !170
+
+if.then48:                                        ; preds = %if.end45
+  %21 = load i32, i32* %mode, align 4, !dbg !171
+  %or49 = or i32 %21, 2, !dbg !171
+  store i32 %or49, i32* %mode, align 4, !dbg !171
+  br label %if.end50, !dbg !172
+
+if.end50:                                         ; preds = %if.then48, %if.end45
+  %22 = load i32, i32* %perms.addr, align 4, !dbg !173
+  %and51 = and i32 %22, 1, !dbg !175
+  %tobool52 = icmp ne i32 %and51, 0, !dbg !175
+  br i1 %tobool52, label %if.then53, label %if.end55, !dbg !176
+
+if.then53:                                        ; preds = %if.end50
+  %23 = load i32, i32* %mode, align 4, !dbg !177
+  %or54 = or i32 %23, 1, !dbg !177
+  store i32 %or54, i32* %mode, align 4, !dbg !177
+  br label %if.end55, !dbg !178
+
+if.end55:                                         ; preds = %if.then53, %if.end50
+  %24 = load i32, i32* %mode, align 4, !dbg !179
+  ret i32 %24, !dbg !180
 }
 
 ; Function Attrs: nounwind uwtable
 define i32 @apr_unix_mode2perms(i32 %mode) #0 !dbg !71 {
 entry:
   %mode.addr = alloca i32, align 4
   %perms = alloca i32, align 4
   store i32 %mode, i32* %mode.addr, align 4
-  call void @llvm.dbg.declare(metadata i32* %mode.addr, metadata !163, metadata !89), !dbg !164
-  call void @llvm.dbg.declare(metadata i32* %perms, metadata !165, metadata !89), !dbg !166
-  store i32 0, i32* %perms, align 4, !dbg !166
-  %0 = load i32, i32* %mode.addr, align 4, !dbg !167
-  %and = and i32 %0, 256, !dbg !169
-  %tobool = icmp ne i32 %and, 0, !dbg !169
-  br i1 %tobool, label %if.then, label %if.end, !dbg !170
+  call void @llvm.dbg.declare(metadata i32* %mode.addr, metadata !181, metadata !89), !dbg !182
+  call void @llvm.dbg.declare(metadata i32* %perms, metadata !183, metadata !89), !dbg !184
+  store i32 0, i32* %perms, align 4, !dbg !184
+  %0 = load i32, i32* %mode.addr, align 4, !dbg !185
+  %and = and i32 %0, 2048, !dbg !187
+  %tobool = icmp ne i32 %and, 0, !dbg !187
+  br i1 %tobool, label %if.then, label %if.end, !dbg !188
 
 if.then:                                          ; preds = %entry
-  %1 = load i32, i32* %perms, align 4, !dbg !171
-  %or = or i32 %1, 1024, !dbg !171
-  store i32 %or, i32* %perms, align 4, !dbg !171
-  br label %if.end, !dbg !172
+  %1 = load i32, i32* %perms, align 4, !dbg !189
+  %or = or i32 %1, 2048, !dbg !189
+  store i32 %or, i32* %perms, align 4, !dbg !189
+  br label %if.end, !dbg !190
 
 if.end:                                           ; preds = %if.then, %entry
-  %2 = load i32, i32* %mode.addr, align 4, !dbg !173
-  %and1 = and i32 %2, 128, !dbg !175
-  %tobool2 = icmp ne i32 %and1, 0, !dbg !175
-  br i1 %tobool2, label %if.then3, label %if.end5, !dbg !176
+  %2 = load i32, i32* %mode.addr, align 4, !dbg !191
+  %and1 = and i32 %2, 256, !dbg !193
+  %tobool2 = icmp ne i32 %and1, 0, !dbg !193
+  br i1 %tobool2, label %if.then3, label %if.end5, !dbg !194
 
 if.then3:                                         ; preds = %if.end
-  %3 = load i32, i32* %perms, align 4, !dbg !177
-  %or4 = or i32 %3, 512, !dbg !177
-  store i32 %or4, i32* %perms, align 4, !dbg !177
-  br label %if.end5, !dbg !178
+  %3 = load i32, i32* %perms, align 4, !dbg !195
+  %or4 = or i32 %3, 1024, !dbg !195
+  store i32 %or4, i32* %perms, align 4, !dbg !195
+  br label %if.end5, !dbg !196
 
 if.end5:                                          ; preds = %if.then3, %if.end
-  %4 = load i32, i32* %mode.addr, align 4, !dbg !179
-  %and6 = and i32 %4, 64, !dbg !181
-  %tobool7 = icmp ne i32 %and6, 0, !dbg !181
-  br i1 %tobool7, label %if.then8, label %if.end10, !dbg !182
+  %4 = load i32, i32* %mode.addr, align 4, !dbg !197
+  %and6 = and i32 %4, 128, !dbg !199
+  %tobool7 = icmp ne i32 %and6, 0, !dbg !199
+  br i1 %tobool7, label %if.then8, label %if.end10, !dbg !200
 
 if.then8:                                         ; preds = %if.end5
-  %5 = load i32, i32* %perms, align 4, !dbg !183
-  %or9 = or i32 %5, 256, !dbg !183
-  store i32 %or9, i32* %perms, align 4, !dbg !183
-  br label %if.end10, !dbg !184
+  %5 = load i32, i32* %perms, align 4, !dbg !201
+  %or9 = or i32 %5, 512, !dbg !201
+  store i32 %or9, i32* %perms, align 4, !dbg !201
+  br label %if.end10, !dbg !202
 
 if.end10:                                         ; preds = %if.then8, %if.end5
-  %6 = load i32, i32* %mode.addr, align 4, !dbg !185
-  %and11 = and i32 %6, 32, !dbg !187
-  %tobool12 = icmp ne i32 %and11, 0, !dbg !187
-  br i1 %tobool12, label %if.then13, label %if.end15, !dbg !188
+  %6 = load i32, i32* %mode.addr, align 4, !dbg !203
+  %and11 = and i32 %6, 64, !dbg !205
+  %tobool12 = icmp ne i32 %and11, 0, !dbg !205
+  br i1 %tobool12, label %if.then13, label %if.end15, !dbg !206
 
 if.then13:                                        ; preds = %if.end10
-  %7 = load i32, i32* %perms, align 4, !dbg !189
-  %or14 = or i32 %7, 64, !dbg !189
-  store i32 %or14, i32* %perms, align 4, !dbg !189
-  br label %if.end15, !dbg !190
+  %7 = load i32, i32* %perms, align 4, !dbg !207
+  %or14 = or i32 %7, 256, !dbg !207
+  store i32 %or14, i32* %perms, align 4, !dbg !207
+  br label %if.end15, !dbg !208
 
 if.end15:                                         ; preds = %if.then13, %if.end10
-  %8 = load i32, i32* %mode.addr, align 4, !dbg !191
-  %and16 = and i32 %8, 16, !dbg !193
-  %tobool17 = icmp ne i32 %and16, 0, !dbg !193
-  br i1 %tobool17, label %if.then18, label %if.end20, !dbg !194
+  %8 = load i32, i32* %mode.addr, align 4, !dbg !209
+  %and16 = and i32 %8, 1024, !dbg !211
+  %tobool17 = icmp ne i32 %and16, 0, !dbg !211
+  br i1 %tobool17, label %if.then18, label %if.end20, !dbg !212
 
 if.then18:                                        ; preds = %if.end15
-  %9 = load i32, i32* %perms, align 4, !dbg !195
-  %or19 = or i32 %9, 32, !dbg !195
-  store i32 %or19, i32* %perms, align 4, !dbg !195
-  br label %if.end20, !dbg !196
+  %9 = load i32, i32* %perms, align 4, !dbg !213
+  %or19 = or i32 %9, 128, !dbg !213
+  store i32 %or19, i32* %perms, align 4, !dbg !213
+  br label %if.end20, !dbg !214
 
 if.end20:                                         ; preds = %if.then18, %if.end15
-  %10 = load i32, i32* %mode.addr, align 4, !dbg !197
-  %and21 = and i32 %10, 8, !dbg !199
-  %tobool22 = icmp ne i32 %and21, 0, !dbg !199
-  br i1 %tobool22, label %if.then23, label %if.end25, !dbg !200
+  %10 = load i32, i32* %mode.addr, align 4, !dbg !215
+  %and21 = and i32 %10, 32, !dbg !217
+  %tobool22 = icmp ne i32 %and21, 0, !dbg !217
+  br i1 %tobool22, label %if.then23, label %if.end25, !dbg !218
 
 if.then23:                                        ; preds = %if.end20
-  %11 = load i32, i32* %perms, align 4, !dbg !201
-  %or24 = or i32 %11, 16, !dbg !201
-  store i32 %or24, i32* %perms, align 4, !dbg !201
-  br label %if.end25, !dbg !202
+  %11 = load i32, i32* %perms, align 4, !dbg !219
+  %or24 = or i32 %11, 64, !dbg !219
+  store i32 %or24, i32* %perms, align 4, !dbg !219
+  br label %if.end25, !dbg !220
 
 if.end25:                                         ; preds = %if.then23, %if.end20
-  %12 = load i32, i32* %mode.addr, align 4, !dbg !203
-  %and26 = and i32 %12, 4, !dbg !205
-  %tobool27 = icmp ne i32 %and26, 0, !dbg !205
-  br i1 %tobool27, label %if.then28, label %if.end30, !dbg !206
+  %12 = load i32, i32* %mode.addr, align 4, !dbg !221
+  %and26 = and i32 %12, 16, !dbg !223
+  %tobool27 = icmp ne i32 %and26, 0, !dbg !223
+  br i1 %tobool27, label %if.then28, label %if.end30, !dbg !224
 
 if.then28:                                        ; preds = %if.end25
-  %13 = load i32, i32* %perms, align 4, !dbg !207
-  %or29 = or i32 %13, 4, !dbg !207
-  store i32 %or29, i32* %perms, align 4, !dbg !207
-  br label %if.end30, !dbg !208
+  %13 = load i32, i32* %perms, align 4, !dbg !225
+  %or29 = or i32 %13, 32, !dbg !225
+  store i32 %or29, i32* %perms, align 4, !dbg !225
+  br label %if.end30, !dbg !226
 
 if.end30:                                         ; preds = %if.then28, %if.end25
-  %14 = load i32, i32* %mode.addr, align 4, !dbg !209
-  %and31 = and i32 %14, 2, !dbg !211
-  %tobool32 = icmp ne i32 %and31, 0, !dbg !211
-  br i1 %tobool32, label %if.then33, label %if.end35, !dbg !212
+  %14 = load i32, i32* %mode.addr, align 4, !dbg !227
+  %and31 = and i32 %14, 8, !dbg !229
+  %tobool32 = icmp ne i32 %and31, 0, !dbg !229
+  br i1 %tobool32, label %if.then33, label %if.end35, !dbg !230
 
 if.then33:                                        ; preds = %if.end30
-  %15 = load i32, i32* %perms, align 4, !dbg !213
-  %or34 = or i32 %15, 2, !dbg !213
-  store i32 %or34, i32* %perms, align 4, !dbg !213
-  br label %if.end35, !dbg !214
+  %15 = load i32, i32* %perms, align 4, !dbg !231
+  %or34 = or i32 %15, 16, !dbg !231
+  store i32 %or34, i32* %perms, align 4, !dbg !231
+  br label %if.end35, !dbg !232
 
 if.end35:                                         ; preds = %if.then33, %if.end30
-  %16 = load i32, i32* %mode.addr, align 4, !dbg !215
-  %and36 = and i32 %16, 1, !dbg !217
-  %tobool37 = icmp ne i32 %and36, 0, !dbg !217
-  br i1 %tobool37, label %if.then38, label %if.end40, !dbg !218
+  %16 = load i32, i32* %mode.addr, align 4, !dbg !233
+  %and36 = and i32 %16, 512, !dbg !235
+  %tobool37 = icmp ne i32 %and36, 0, !dbg !235
+  br i1 %tobool37, label %if.then38, label %if.end40, !dbg !236
 
 if.then38:                                        ; preds = %if.end35
-  %17 = load i32, i32* %perms, align 4, !dbg !219
-  %or39 = or i32 %17, 1, !dbg !219
-  store i32 %or39, i32* %perms, align 4, !dbg !219
-  br label %if.end40, !dbg !220
+  %17 = load i32, i32* %perms, align 4, !dbg !237
+  %or39 = or i32 %17, 8, !dbg !237
+  store i32 %or39, i32* %perms, align 4, !dbg !237
+  br label %if.end40, !dbg !238
 
 if.end40:                                         ; preds = %if.then38, %if.end35
-  %18 = load i32, i32* %perms, align 4, !dbg !221
-  ret i32 %18, !dbg !222
+  %18 = load i32, i32* %mode.addr, align 4, !dbg !239
+  %and41 = and i32 %18, 4, !dbg !241
+  %tobool42 = icmp ne i32 %and41, 0, !dbg !241
+  br i1 %tobool42, label %if.then43, label %if.end45, !dbg !242
+
+if.then43:                                        ; preds = %if.end40
+  %19 = load i32, i32* %perms, align 4, !dbg !243
+  %or44 = or i32 %19, 4, !dbg !243
+  store i32 %or44, i32* %perms, align 4, !dbg !243
+  br label %if.end45, !dbg !244
+
+if.end45:                                         ; preds = %if.then43, %if.end40
+  %20 = load i32, i32* %mode.addr, align 4, !dbg !245
+  %and46 = and i32 %20, 2, !dbg !247
+  %tobool47 = icmp ne i32 %and46, 0, !dbg !247
+  br i1 %tobool47, label %if.then48, label %if.end50, !dbg !248
+
+if.then48:                                        ; preds = %if.end45
+  %21 = load i32, i32* %perms, align 4, !dbg !249
+  %or49 = or i32 %21, 2, !dbg !249
+  store i32 %or49, i32* %perms, align 4, !dbg !249
+  br label %if.end50, !dbg !250
+
+if.end50:                                         ; preds = %if.then48, %if.end45
+  %22 = load i32, i32* %mode.addr, align 4, !dbg !251
+  %and51 = and i32 %22, 1, !dbg !253
+  %tobool52 = icmp ne i32 %and51, 0, !dbg !253
+  br i1 %tobool52, label %if.then53, label %if.end55, !dbg !254
+
+if.then53:                                        ; preds = %if.end50
+  %23 = load i32, i32* %perms, align 4, !dbg !255
+  %or54 = or i32 %23, 1, !dbg !255
+  store i32 %or54, i32* %perms, align 4, !dbg !255
+  br label %if.end55, !dbg !256
+
+if.end55:                                         ; preds = %if.then53, %if.end50
+  %24 = load i32, i32* %perms, align 4, !dbg !257
+  ret i32 %24, !dbg !258
 }
 
 ; Function Attrs: nounwind uwtable
 define i32 @apr_file_data_get(i8** %data, i8* %key, %struct.apr_file_t* %file) #0 !dbg !74 {
 entry:
   %data.addr = alloca i8**, align 8
   %key.addr = alloca i8*, align 8
   %file.addr = alloca %struct.apr_file_t*, align 8
   store i8** %data, i8*** %data.addr, align 8
-  call void @llvm.dbg.declare(metadata i8*** %data.addr, metadata !223, metadata !89), !dbg !224
+  call void @llvm.dbg.declare(metadata i8*** %data.addr, metadata !259, metadata !89), !dbg !260
   store i8* %key, i8** %key.addr, align 8
-  call void @llvm.dbg.declare(metadata i8** %key.addr, metadata !225, metadata !89), !dbg !226
+  call void @llvm.dbg.declare(metadata i8** %key.addr, metadata !261, metadata !89), !dbg !262
   store %struct.apr_file_t* %file, %struct.apr_file_t** %file.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %file.addr, metadata !227, metadata !89), !dbg !228
-  %0 = load i8**, i8*** %data.addr, align 8, !dbg !229
-  %1 = load i8*, i8** %key.addr, align 8, !dbg !230
-  %2 = load %struct.apr_file_t*, %struct.apr_file_t** %file.addr, align 8, !dbg !231
-  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %2, i32 0, i32 0, !dbg !232
-  %3 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !232
-  %call = call i32 @apr_pool_userdata_get(i8** %0, i8* %1, %struct.apr_pool_t* %3), !dbg !233
-  ret i32 %call, !dbg !234
+  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %file.addr, metadata !263, metadata !89), !dbg !264
+  %0 = load i8**, i8*** %data.addr, align 8, !dbg !265
+  %1 = load i8*, i8** %key.addr, align 8, !dbg !266
+  %2 = load %struct.apr_file_t*, %struct.apr_file_t** %file.addr, align 8, !dbg !267
+  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %2, i32 0, i32 0, !dbg !268
+  %3 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !268
+  %call = call i32 @apr_pool_userdata_get(i8** %0, i8* %1, %struct.apr_pool_t* %3), !dbg !269
+  ret i32 %call, !dbg !270
 }
 
 declare i32 @apr_pool_userdata_get(i8**, i8*, %struct.apr_pool_t*) #2
 
 ; Function Attrs: nounwind uwtable
 define i32 @apr_file_data_set(%struct.apr_file_t* %file, i8* %data, i8* %key, i32 (i8*)* %cleanup) #0 !dbg !79 {
 entry:
   %file.addr = alloca %struct.apr_file_t*, align 8
   %data.addr = alloca i8*, align 8
   %key.addr = alloca i8*, align 8
   %cleanup.addr = alloca i32 (i8*)*, align 8
   store %struct.apr_file_t* %file, %struct.apr_file_t** %file.addr, align 8
-  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %file.addr, metadata !235, metadata !89), !dbg !236
+  call void @llvm.dbg.declare(metadata %struct.apr_file_t** %file.addr, metadata !271, metadata !89), !dbg !272
   store i8* %data, i8** %data.addr, align 8
-  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !237, metadata !89), !dbg !238
+  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !273, metadata !89), !dbg !274
   store i8* %key, i8** %key.addr, align 8
-  call void @llvm.dbg.declare(metadata i8** %key.addr, metadata !239, metadata !89), !dbg !240
+  call void @llvm.dbg.declare(metadata i8** %key.addr, metadata !275, metadata !89), !dbg !276
   store i32 (i8*)* %cleanup, i32 (i8*)** %cleanup.addr, align 8
-  call void @llvm.dbg.declare(metadata i32 (i8*)** %cleanup.addr, metadata !241, metadata !89), !dbg !242
-  %0 = load i8*, i8** %data.addr, align 8, !dbg !243
-  %1 = load i8*, i8** %key.addr, align 8, !dbg !244
-  %2 = load i32 (i8*)*, i32 (i8*)** %cleanup.addr, align 8, !dbg !245
-  %3 = load %struct.apr_file_t*, %struct.apr_file_t** %file.addr, align 8, !dbg !246
-  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %3, i32 0, i32 0, !dbg !247
-  %4 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !247
-  %call = call i32 @apr_pool_userdata_set(i8* %0, i8* %1, i32 (i8*)* %2, %struct.apr_pool_t* %4), !dbg !248
-  ret i32 %call, !dbg !249
+  call void @llvm.dbg.declare(metadata i32 (i8*)** %cleanup.addr, metadata !277, metadata !89), !dbg !278
+  %0 = load i8*, i8** %data.addr, align 8, !dbg !279
+  %1 = load i8*, i8** %key.addr, align 8, !dbg !280
+  %2 = load i32 (i8*)*, i32 (i8*)** %cleanup.addr, align 8, !dbg !281
+  %3 = load %struct.apr_file_t*, %struct.apr_file_t** %file.addr, align 8, !dbg !282
+  %pool = getelementptr inbounds %struct.apr_file_t, %struct.apr_file_t* %3, i32 0, i32 0, !dbg !283
+  %4 = load %struct.apr_pool_t*, %struct.apr_pool_t** %pool, align 8, !dbg !283
+  %call = call i32 @apr_pool_userdata_set(i8* %0, i8* %1, i32 (i8*)* %2, %struct.apr_pool_t* %4), !dbg !284
+  ret i32 %call, !dbg !285
 }
 
 declare i32 @apr_pool_userdata_set(i8*, i8*, i32 (i8*)*, %struct.apr_pool_t*) #2
 
 attributes #0 = { nounwind uwtable "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2" "unsafe-fp-math"="false" "use-soft-float"="false" }
 attributes #1 = { nounwind readnone }
@@ -336,36 +408,36 @@
 
 !llvm.dbg.cu = !{!0}
