; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/vtls/vtls.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ssl_primary_config = type { i64, i64, i8, i8, i8, i8*, i8*, i8*, i8*, i8*, i8*, i8 }

@Curl_cstrdup = external global i8* (i8*)*, align 8
@Curl_cfree = external global void (i8*)*, align 8

; Function Attrs: nounwind uwtable
define zeroext i1 @Curl_ssl_config_matches(%struct.ssl_primary_config* %data, %struct.ssl_primary_config* %needle) #0 !dbg !21 {
entry:
  %retval = alloca i1, align 1
  %data.addr = alloca %struct.ssl_primary_config*, align 8
  %needle.addr = alloca %struct.ssl_primary_config*, align 8
  store %struct.ssl_primary_config* %data, %struct.ssl_primary_config** %data.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.ssl_primary_config** %data.addr, metadata !54, metadata !55), !dbg !56
  store %struct.ssl_primary_config* %needle, %struct.ssl_primary_config** %needle.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.ssl_primary_config** %needle.addr, metadata !57, metadata !55), !dbg !58
  %0 = load %struct.ssl_primary_config*, %struct.ssl_primary_config** %data.addr, align 8, !dbg !59
  %version = getelementptr inbounds %struct.ssl_primary_config, %struct.ssl_primary_config* %0, i32 0, i32 0, !dbg !61
  %1 = load i64, i64* %version, align 8, !dbg !61

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !20)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/vtls/vtls.c", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2222, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/curl.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "CURLSSLBACKEND_NONE", value: 0)
!7 = !DIEnumerator(name: "CURLSSLBACKEND_OPENSSL", value: 1)
!8 = !DIEnumerator(name: "CURLSSLBACKEND_GNUTLS", value: 2)
!9 = !DIEnumerator(name: "CURLSSLBACKEND_NSS", value: 3)
!10 = !DIEnumerator(name: "CURLSSLBACKEND_OBSOLETE4", value: 4)
!11 = !DIEnumerator(name: "CURLSSLBACKEND_GSKIT", value: 5)
!12 = !DIEnumerator(name: "CURLSSLBACKEND_POLARSSL", value: 6)
!13 = !DIEnumerator(name: "CURLSSLBACKEND_CYASSL", value: 7)
!14 = !DIEnumerator(name: "CURLSSLBACKEND_SCHANNEL", value: 8)
!15 = !DIEnumerator(name: "CURLSSLBACKEND_DARWINSSL", value: 9)
!16 = !DIEnumerator(name: "CURLSSLBACKEND_AXTLS", value: 10)
!17 = !DIEnumerator(name: "CURLSSLBACKEND_MBEDTLS", value: 11)
!18 = !{!19}
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !{!21, !45, !46, !49}
!21 = distinct !DISubprogram(name: "Curl_ssl_config_matches", scope: !1, file: !1, line: 94, type: !22, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, variables: !44)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !25, !25}
!24 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_primary_config", file: !27, line: 351, size: 640, align: 64, elements: !28)
!27 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/urldata.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!28 = !{!29, !31, !32, !33, !34, !35, !38, !39, !40, !41, !42, !43}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !26, file: !27, line: 352, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "version_max", scope: !26, file: !27, line: 353, baseType: !30, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "verifypeer", scope: !26, file: !27, line: 354, baseType: !24, size: 8, align: 8, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "verifyhost", scope: !26, file: !27, line: 355, baseType: !24, size: 8, align: 8, offset: 136)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "verifystatus", scope: !26, file: !27, line: 356, baseType: !24, size: 8, align: 8, offset: 144)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "CApath", scope: !26, file: !27, line: 357, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "CAfile", scope: !26, file: !27, line: 358, baseType: !36, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "clientcert", scope: !26, file: !27, line: 359, baseType: !36, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "random_file", scope: !26, file: !27, line: 360, baseType: !36, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "egdsocket", scope: !26, file: !27, line: 361, baseType: !36, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !26, file: !27, line: 362, baseType: !36, size: 64, align: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "sessionid", scope: !26, file: !27, line: 363, baseType: !24, size: 8, align: 8, offset: 576)
!44 = !{}
!45 = distinct !DISubprogram(name: "Curl_clone_primary_ssl_config", scope: !1, file: !1, line: 111, type: !22, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, variables: !44)
!46 = distinct !DISubprogram(name: "Curl_free_primary_ssl_config", scope: !1, file: !1, line: 131, type: !47, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, variables: !44)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !25}
!49 = distinct !DISubprogram(name: "Curl_ssl_backend", scope: !1, file: !1, line: 141, type: !50, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, variables: !44)
!50 = !DISubroutineType(types: !18)
!51 = !{i32 2, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!54 = !DILocalVariable(name: "data", arg: 1, scope: !21, file: !1, line: 94, type: !25)
!55 = !DIExpression()
!56 = !DILocation(line: 94, column: 52, scope: !21)
!57 = !DILocalVariable(name: "needle", arg: 2, scope: !21, file: !1, line: 95, type: !25)
!58 = !DILocation(line: 95, column: 52, scope: !21)
!59 = !DILocation(line: 97, column: 7, scope: !60)
!60 = distinct !DILexicalBlock(scope: !21, file: !1, line: 97, column: 6)
!61 = !DILocation(line: 97, column: 13, scope: !60)
!62 = !DILocation(line: 97, column: 24, scope: !60)
!63 = !DILocation(line: 97, column: 32, scope: !60)
!64 = !DILocation(line: 97, column: 21, scope: !60)
!65 = !DILocation(line: 97, column: 41, scope: !60)
!66 = !DILocation(line: 98, column: 7, scope: !60)
!67 = !DILocation(line: 98, column: 13, scope: !60)
!68 = !DILocation(line: 98, column: 28, scope: !60)
!69 = !DILocation(line: 98, column: 36, scope: !60)
!70 = !DILocation(line: 98, column: 25, scope: !60)
!71 = !DILocation(line: 98, column: 49, scope: !60)
!72 = !DILocation(line: 99, column: 7, scope: !60)
!73 = !DILocation(line: 99, column: 13, scope: !60)
!74 = !DILocation(line: 99, column: 27, scope: !60)
!75 = !DILocation(line: 99, column: 35, scope: !60)
!76 = !DILocation(line: 99, column: 24, scope: !60)
!77 = !DILocation(line: 99, column: 47, scope: !60)
!78 = !DILocation(line: 100, column: 7, scope: !60)
!79 = !DILocation(line: 100, column: 13, scope: !60)
!80 = !DILocation(line: 100, column: 27, scope: !60)
!81 = !DILocation(line: 100, column: 35, scope: !60)
!82 = !DILocation(line: 100, column: 24, scope: !60)
!83 = !DILocation(line: 100, column: 47, scope: !60)
!84 = !DILocation(line: 101, column: 31, scope: !60)
!85 = !DILocation(line: 101, column: 37, scope: !60)
!86 = !DILocation(line: 101, column: 45, scope: !60)
!87 = !DILocation(line: 101, column: 53, scope: !60)
!88 = !DILocation(line: 101, column: 6, scope: !60)
!89 = !DILocation(line: 101, column: 61, scope: !60)
!90 = !DILocation(line: 102, column: 31, scope: !60)
!91 = !DILocation(line: 102, column: 37, scope: !60)
!92 = !DILocation(line: 102, column: 45, scope: !60)
!93 = !DILocation(line: 102, column: 53, scope: !60)
!94 = !DILocation(line: 102, column: 6, scope: !60)
!95 = !DILocation(line: 102, column: 61, scope: !60)
!96 = !DILocation(line: 103, column: 31, scope: !60)
!97 = !DILocation(line: 103, column: 37, scope: !60)
!98 = !DILocation(line: 103, column: 49, scope: !60)
!99 = !DILocation(line: 103, column: 57, scope: !60)
!100 = !DILocation(line: 103, column: 6, scope: !60)
!101 = !DILocation(line: 103, column: 69, scope: !60)
!102 = !DILocation(line: 104, column: 31, scope: !60)
!103 = !DILocation(line: 104, column: 37, scope: !60)
!104 = !DILocation(line: 104, column: 50, scope: !60)
!105 = !DILocation(line: 104, column: 58, scope: !60)
!106 = !DILocation(line: 104, column: 6, scope: !60)
!107 = !DILocation(line: 97, column: 6, scope: !108)
!108 = !DILexicalBlockFile(scope: !21, file: !1, discriminator: 1)
