; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/ia64.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i8, i8, i64 (%struct.lzma_simple_s*, i32, i1, i8*, i64)*, %struct.lzma_simple_s*, i32, i64, i64, i64, i64, [0 x i8] }
%struct.lzma_simple_s = type opaque
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }

@ia64_code.BRANCH_TABLE = internal constant [32 x i32] [i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 4, i32 4, i32 6, i32 6, i32 0, i32 0, i32 7, i32 7, i32 4, i32 4, i32 0, i32 0, i32 4, i32 4, i32 0, i32 0], align 16

; Function Attrs: nounwind uwtable
define i32 @lzma_simple_ia64_encoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !40 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !39, globals: !155)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/ia64.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !{!32, !35, !37}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !38)
!38 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40, !150, !151, !154}
!40 = distinct !DISubprogram(name: "lzma_simple_ia64_encoder_init", scope: !1, file: !1, line: 104, type: !41, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, variables: !149)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !89, !139}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !46, line: 75, baseType: !47)
!46 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !46, line: 119, size: 512, align: 64, elements: !48)
!48 = !{!49, !79, !82, !84, !110, !115, !122, !127}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !47, file: !46, line: 121, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !46, line: 73, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !53, line: 21, size: 1024, align: 64, elements: !54)
!53 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/simple_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !{!55, !56, !58, !59, !69, !70, !71, !72, !73, !74, !75}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !53, line: 23, baseType: !45, size: 512, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "end_was_reached", scope: !52, file: !53, line: 26, baseType: !57, size: 8, align: 8, offset: 512)
!57 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "is_encoder", scope: !52, file: !53, line: 32, baseType: !57, size: 8, align: 8, offset: 520)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !52, file: !53, line: 36, baseType: !60, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !65, !35, !57, !68, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 62, baseType: !34)
!64 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !53, line: 19, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !53, line: 19, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !52, file: !53, line: 41, baseType: !65, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "now_pos", scope: !52, file: !53, line: 46, baseType: !35, size: 32, align: 32, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !52, file: !53, line: 49, baseType: !63, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !52, file: !53, line: 53, baseType: !63, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !52, file: !53, line: 57, baseType: !63, size: 64, align: 64, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !52, file: !53, line: 61, baseType: !63, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !52, file: !53, line: 64, baseType: !76, offset: 1024)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: -1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !46, line: 125, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !81, line: 63, baseType: !32)
!81 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !47, file: !46, line: 131, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 122, baseType: !34)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !47, file: !46, line: 134, baseType: !85, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !46, line: 89, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!43, !50, !89, !103, !106, !63, !108, !106, !63, !109}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !92)
!92 = !{!93, !98, !102}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !91, file: !4, line: 376, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !97, !63, !63}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !91, file: !4, line: 390, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !97, !97}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !91, file: !4, line: 401, baseType: !97, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !47, file: !46, line: 139, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !46, line: 97, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !50, !89}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !47, file: !46, line: 143, baseType: !116, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !47, file: !46, line: 147, baseType: !123, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!43, !50, !126, !126, !32}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !47, file: !46, line: 152, baseType: !128, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!43, !50, !89, !131, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !134, line: 65, baseType: !135)
!134 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 43, size: 128, align: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !134, line: 54, baseType: !80, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !135, file: !134, line: 63, baseType: !97, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !46, line: 77, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !46, line: 104, size: 192, align: 64, elements: !143)
!143 = !{!144, !145, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !46, line: 107, baseType: !80, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !142, file: !46, line: 111, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !46, line: 81, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !142, file: !46, line: 114, baseType: !97, size: 64, align: 64, offset: 128)
!149 = !{}
!150 = distinct !DISubprogram(name: "lzma_simple_ia64_decoder_init", scope: !1, file: !1, line: 112, type: !41, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, variables: !149)
!151 = distinct !DISubprogram(name: "ia64_coder_init", scope: !1, file: !1, line: 95, type: !152, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, variables: !149)
!152 = !DISubroutineType(types: !153)
!153 = !{!43, !44, !89, !139, !57}
!154 = distinct !DISubprogram(name: "ia64_code", scope: !1, file: !1, line: 18, type: !61, isLocal: true, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, variables: !149)
!155 = !{!156}
!156 = !DIGlobalVariable(name: "BRANCH_TABLE", scope: !154, file: !1, line: 22, type: !157, isLocal: true, isDefinition: true, variable: [32 x i32]* @ia64_code.BRANCH_TABLE)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1024, align: 32, elements: !159)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!159 = !{!160}
!160 = !DISubrange(count: 32)
!161 = !{i32 2, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!164 = !DILocalVariable(name: "next", arg: 1, scope: !40, file: !1, line: 104, type: !44)
!165 = !DIExpression()
!166 = !DILocation(line: 104, column: 48, scope: !40)
!167 = !DILocalVariable(name: "allocator", arg: 2, scope: !40, file: !1, line: 105, type: !89)
!168 = !DILocation(line: 105, column: 19, scope: !40)
!169 = !DILocalVariable(name: "filters", arg: 3, scope: !40, file: !1, line: 105, type: !139)
!170 = !DILocation(line: 105, column: 54, scope: !40)
!171 = !DILocation(line: 107, column: 25, scope: !40)
!172 = !DILocation(line: 107, column: 31, scope: !40)
!173 = !DILocation(line: 107, column: 42, scope: !40)
!174 = !DILocation(line: 107, column: 9, scope: !40)
!175 = !DILocation(line: 107, column: 2, scope: !40)
!176 = !DILocalVariable(name: "next", arg: 1, scope: !151, file: !1, line: 95, type: !44)
!177 = !DILocation(line: 95, column: 34, scope: !151)
!178 = !DILocalVariable(name: "allocator", arg: 2, scope: !151, file: !1, line: 95, type: !89)
!179 = !DILocation(line: 95, column: 56, scope: !151)
!180 = !DILocalVariable(name: "filters", arg: 3, scope: !151, file: !1, line: 96, type: !139)
!181 = !DILocation(line: 96, column: 27, scope: !151)
!182 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !151, file: !1, line: 96, type: !57)
!183 = !DILocation(line: 96, column: 41, scope: !151)
!184 = !DILocation(line: 98, column: 32, scope: !151)
!185 = !DILocation(line: 98, column: 38, scope: !151)
!186 = !DILocation(line: 98, column: 49, scope: !151)
!187 = !DILocation(line: 99, column: 27, scope: !151)
!188 = !DILocation(line: 98, column: 9, scope: !151)
!189 = !DILocation(line: 98, column: 2, scope: !151)
!190 = !DILocalVariable(name: "next", arg: 1, scope: !150, file: !1, line: 112, type: !44)
!191 = !DILocation(line: 112, column: 48, scope: !150)
!192 = !DILocalVariable(name: "allocator", arg: 2, scope: !150, file: !1, line: 113, type: !89)
!193 = !DILocation(line: 113, column: 19, scope: !150)
!194 = !DILocalVariable(name: "filters", arg: 3, scope: !150, file: !1, line: 113, type: !139)
!195 = !DILocation(line: 113, column: 54, scope: !150)
!196 = !DILocation(line: 115, column: 25, scope: !150)
!197 = !DILocation(line: 115, column: 31, scope: !150)
!198 = !DILocation(line: 115, column: 42, scope: !150)
!199 = !DILocation(line: 115, column: 9, scope: !150)
!200 = !DILocation(line: 115, column: 2, scope: !150)
!201 = !DILocalVariable(name: "simple", arg: 1, scope: !154, file: !1, line: 18, type: !65)
!202 = !DILocation(line: 18, column: 24, scope: !154)
!203 = !DILocalVariable(name: "now_pos", arg: 2, scope: !154, file: !1, line: 19, type: !35)
