; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/simple_coder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i8, i8, i64 (%struct.lzma_simple_s*, i32, i1, i8*, i64)*, %struct.lzma_simple_s*, i32, i64, i64, i64, i64, [0 x i8] }
%struct.lzma_simple_s = type opaque
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_filter_info_s = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i8* }
%struct.lzma_options_bcj = type { i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !33, globals: !159)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/simple_coder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !{!34, !152, !153, !154, !157, !158}
!34 = distinct !DISubprogram(name: "lzma_simple_coder_init", scope: !1, file: !1, line: 228, type: !35, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, variables: !151)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !90, !139, !54, !57, !57, !63, !51}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !40, line: 75, baseType: !41)
!40 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !40, line: 119, size: 512, align: 64, elements: !42)
!42 = !{!43, !79, !83, !85, !110, !115, !122, !127}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !41, file: !40, line: 121, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !40, line: 73, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !47, line: 21, size: 1024, align: 64, elements: !48)
!47 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/simple_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!48 = !{!49, !50, !52, !53, !69, !70, !71, !72, !73, !74, !75}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !47, line: 23, baseType: !39, size: 512, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "end_was_reached", scope: !46, file: !47, line: 26, baseType: !51, size: 8, align: 8, offset: 512)
!51 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "is_encoder", scope: !46, file: !47, line: 32, baseType: !51, size: 8, align: 8, offset: 520)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !46, file: !47, line: 36, baseType: !54, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !60, !63, !51, !66, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 62, baseType: !59)
!58 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!59 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !47, line: 19, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !47, line: 19, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !64, line: 51, baseType: !65)
!64 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !64, line: 48, baseType: !68)
!68 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !46, file: !47, line: 41, baseType: !60, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "now_pos", scope: !46, file: !47, line: 46, baseType: !63, size: 32, align: 32, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !46, file: !47, line: 49, baseType: !57, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !46, file: !47, line: 53, baseType: !57, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !46, file: !47, line: 57, baseType: !57, size: 64, align: 64, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !47, line: 61, baseType: !57, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !46, file: !47, line: 64, baseType: !76, offset: 1024)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: -1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !41, file: !40, line: 125, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !81, line: 63, baseType: !82)
!81 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !64, line: 55, baseType: !59)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !41, file: !40, line: 131, baseType: !84, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !64, line: 122, baseType: !59)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !41, file: !40, line: 134, baseType: !86, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !40, line: 89, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!37, !44, !90, !103, !106, !57, !108, !106, !57, !109}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !93)
!93 = !{!94, !98, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !92, file: !4, line: 376, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!32, !32, !57, !57}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !92, file: !4, line: 390, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !32, !32}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !92, file: !4, line: 401, baseType: !32, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !41, file: !40, line: 139, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !40, line: 97, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !44, !90}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !41, file: !40, line: 143, baseType: !116, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !41, file: !40, line: 147, baseType: !123, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!37, !44, !126, !126, !82}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !41, file: !40, line: 152, baseType: !128, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!37, !44, !90, !131, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !134, line: 65, baseType: !135)
!134 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 43, size: 128, align: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !134, line: 54, baseType: !80, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !135, file: !134, line: 63, baseType: !32, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !40, line: 77, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !40, line: 104, size: 192, align: 64, elements: !143)
!143 = !{!144, !145, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !40, line: 107, baseType: !80, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !142, file: !40, line: 111, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !40, line: 81, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!37, !38, !90, !139}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !142, file: !40, line: 114, baseType: !32, size: 64, align: 64, offset: 128)
!151 = !{}
!152 = distinct !DISubprogram(name: "simple_code", scope: !1, file: !1, line: 69, type: !88, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, variables: !151)
!153 = distinct !DISubprogram(name: "copy_or_code", scope: !1, file: !1, line: 21, type: !88, isLocal: true, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, variables: !151)
!154 = distinct !DISubprogram(name: "call_filter", scope: !1, file: !1, line: 58, type: !155, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, variables: !151)
!155 = !DISubroutineType(types: !156)
!156 = !{!57, !44, !66, !57}
!157 = distinct !DISubprogram(name: "simple_coder_end", scope: !1, file: !1, line: 207, type: !113, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, variables: !151)
!158 = distinct !DISubprogram(name: "simple_coder_update", scope: !1, file: !1, line: 217, type: !129, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, variables: !151)
!159 = !{!160}
!160 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !40, line: 159, type: !161, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!165 = !DILocalVariable(name: "next", arg: 1, scope: !34, file: !1, line: 228, type: !38)
!166 = !DIExpression()
!167 = !DILocation(line: 228, column: 41, scope: !34)
!168 = !DILocalVariable(name: "allocator", arg: 2, scope: !34, file: !1, line: 228, type: !90)
!169 = !DILocation(line: 228, column: 63, scope: !34)
!170 = !DILocalVariable(name: "filters", arg: 3, scope: !34, file: !1, line: 229, type: !139)
!171 = !DILocation(line: 229, column: 27, scope: !34)
!172 = !DILocalVariable(name: "filter", arg: 4, scope: !34, file: !1, line: 230, type: !54)
!173 = !DILocation(line: 230, column: 12, scope: !34)
!174 = !DILocalVariable(name: "simple_size", arg: 5, scope: !34, file: !1, line: 232, type: !57)
!175 = !DILocation(line: 232, column: 10, scope: !34)
!176 = !DILocalVariable(name: "unfiltered_max", arg: 6, scope: !34, file: !1, line: 232, type: !57)
!177 = !DILocation(line: 232, column: 30, scope: !34)
!178 = !DILocalVariable(name: "alignment", arg: 7, scope: !34, file: !1, line: 233, type: !63)
!179 = !DILocation(line: 233, column: 12, scope: !34)
!180 = !DILocalVariable(name: "is_encoder", arg: 8, scope: !34, file: !1, line: 233, type: !51)
!181 = !DILocation(line: 233, column: 28, scope: !34)
!182 = !DILocation(line: 236, column: 6, scope: !183)
!183 = distinct !DILexicalBlock(scope: !34, file: !1, line: 236, column: 6)
!184 = !DILocation(line: 236, column: 12, scope: !183)
!185 = !DILocation(line: 236, column: 18, scope: !183)
!186 = !DILocation(line: 236, column: 6, scope: !34)
!187 = !DILocation(line: 242, column: 11, scope: !188)
!188 = distinct !DILexicalBlock(scope: !183, file: !1, line: 236, column: 27)
!189 = !DILocation(line: 242, column: 9, scope: !188)
!190 = !DILocation(line: 242, column: 5, scope: !188)
!191 = !DILocation(line: 242, column: 27, scope: !188)
!192 = !DILocation(line: 241, column: 17, scope: !188)
!193 = !DILocation(line: 241, column: 3, scope: !188)
!194 = !DILocation(line: 241, column: 9, scope: !188)
!195 = !DILocation(line: 241, column: 15, scope: !188)
!196 = !DILocation(line: 243, column: 7, scope: !197)
!197 = distinct !DILexicalBlock(scope: !188, file: !1, line: 243, column: 7)
!198 = !DILocation(line: 243, column: 13, scope: !197)
!199 = !DILocation(line: 243, column: 19, scope: !197)
!200 = !DILocation(line: 243, column: 7, scope: !188)
