; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/x86.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i8, i8, i64 (%struct.lzma_simple_s*, i32, i1, i8*, i64)*, %struct.lzma_simple_s*, i32, i64, i64, i64, i64, [0 x i8] }
%struct.lzma_simple_s = type { i32, i32 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }

@x86_code.MASK_TO_ALLOWED_STATUS = internal constant [8 x i8] c"\01\01\01\00\01\00\00\00", align 1
@x86_code.MASK_TO_BIT_NUMBER = internal constant [8 x i32] [i32 0, i32 1, i32 2, i32 2, i32 3, i32 3, i32 3, i32 3], align 16

; Function Attrs: nounwind uwtable
define i32 @lzma_simple_x86_encoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !38 {
entry:
  %next.addr = alloca %struct.lzma_next_coder_s*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !37, globals: !158)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/x86.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !{!32, !35}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!37 = !{!38, !153, !154, !157}
!38 = distinct !DISubprogram(name: "lzma_simple_x86_encoder_init", scope: !1, file: !1, line: 149, type: !39, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !152)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42, !92, !142}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !44, line: 75, baseType: !45)
!44 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !44, line: 119, size: 512, align: 64, elements: !46)
!46 = !{!47, !81, !85, !87, !113, !118, !125, !130}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !45, file: !44, line: 121, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !44, line: 73, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !51, line: 21, size: 1024, align: 64, elements: !52)
!51 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/simple/simple_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!52 = !{!53, !54, !56, !57, !71, !72, !73, !74, !75, !76, !77}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !50, file: !51, line: 23, baseType: !43, size: 512, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "end_was_reached", scope: !50, file: !51, line: 26, baseType: !55, size: 8, align: 8, offset: 512)
!55 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "is_encoder", scope: !50, file: !51, line: 32, baseType: !55, size: 8, align: 8, offset: 520)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !50, file: !51, line: 36, baseType: !58, size: 64, align: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !64, !32, !55, !70, !61}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 62, baseType: !63)
!62 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!63 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !51, line: 19, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !1, line: 20, size: 64, align: 32, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev_mask", scope: !66, file: !1, line: 21, baseType: !32, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev_pos", scope: !66, file: !1, line: 22, baseType: !32, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !50, file: !51, line: 41, baseType: !64, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "now_pos", scope: !50, file: !51, line: 46, baseType: !32, size: 32, align: 32, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !50, file: !51, line: 49, baseType: !61, size: 64, align: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !50, file: !51, line: 53, baseType: !61, size: 64, align: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !50, file: !51, line: 57, baseType: !61, size: 64, align: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !51, line: 61, baseType: !61, size: 64, align: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !50, file: !51, line: 64, baseType: !78, offset: 1024)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: -1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !45, file: !44, line: 125, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !83, line: 63, baseType: !84)
!83 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 55, baseType: !63)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !45, file: !44, line: 131, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 122, baseType: !63)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !45, file: !44, line: 134, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !44, line: 89, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!41, !48, !92, !106, !109, !61, !111, !109, !61, !112}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !95)
!95 = !{!96, !101, !105}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !94, file: !4, line: 376, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !100, !61, !61}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !94, file: !4, line: 390, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !100, !100}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !94, file: !4, line: 401, baseType: !100, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!109 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !45, file: !44, line: 139, baseType: !114, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !44, line: 97, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !48, !92}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !45, file: !44, line: 143, baseType: !119, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !45, file: !44, line: 147, baseType: !126, size: 64, align: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!41, !48, !129, !129, !84}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !45, file: !44, line: 152, baseType: !131, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!41, !48, !92, !134, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !137, line: 65, baseType: !138)
!137 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!138 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 43, size: 128, align: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !137, line: 54, baseType: !82, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !138, file: !137, line: 63, baseType: !100, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !44, line: 77, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !44, line: 104, size: 192, align: 64, elements: !146)
!146 = !{!147, !148, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !44, line: 107, baseType: !82, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !145, file: !44, line: 111, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !44, line: 81, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !145, file: !44, line: 114, baseType: !100, size: 64, align: 64, offset: 128)
!152 = !{}
!153 = distinct !DISubprogram(name: "lzma_simple_x86_decoder_init", scope: !1, file: !1, line: 157, type: !39, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, variables: !152)
!154 = distinct !DISubprogram(name: "x86_coder_init", scope: !1, file: !1, line: 133, type: !155, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, variables: !152)
!155 = !DISubroutineType(types: !156)
!156 = !{!41, !42, !92, !142, !55}
!157 = distinct !DISubprogram(name: "x86_code", scope: !1, file: !1, line: 27, type: !59, isLocal: true, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, variables: !152)
!158 = !{!159, !164}
!159 = !DIGlobalVariable(name: "MASK_TO_ALLOWED_STATUS", scope: !157, file: !1, line: 30, type: !160, isLocal: true, isDefinition: true, variable: [8 x i8]* @x86_code.MASK_TO_ALLOWED_STATUS)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, align: 8, elements: !162)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!162 = !{!163}
!163 = !DISubrange(count: 8)
!164 = !DIGlobalVariable(name: "MASK_TO_BIT_NUMBER", scope: !157, file: !1, line: 33, type: !165, isLocal: true, isDefinition: true, variable: [8 x i32]* @x86_code.MASK_TO_BIT_NUMBER)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 256, align: 32, elements: !162)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!167 = !{i32 2, !"Dwarf Version", i32 4}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!170 = !DILocalVariable(name: "next", arg: 1, scope: !38, file: !1, line: 149, type: !42)
!171 = !DIExpression()
!172 = !DILocation(line: 149, column: 47, scope: !38)
!173 = !DILocalVariable(name: "allocator", arg: 2, scope: !38, file: !1, line: 149, type: !92)
!174 = !DILocation(line: 149, column: 69, scope: !38)
!175 = !DILocalVariable(name: "filters", arg: 3, scope: !38, file: !1, line: 150, type: !142)
!176 = !DILocation(line: 150, column: 27, scope: !38)
!177 = !DILocation(line: 152, column: 24, scope: !38)
!178 = !DILocation(line: 152, column: 30, scope: !38)
!179 = !DILocation(line: 152, column: 41, scope: !38)
!180 = !DILocation(line: 152, column: 9, scope: !38)
!181 = !DILocation(line: 152, column: 2, scope: !38)
!182 = !DILocalVariable(name: "next", arg: 1, scope: !154, file: !1, line: 133, type: !42)
!183 = !DILocation(line: 133, column: 33, scope: !154)
!184 = !DILocalVariable(name: "allocator", arg: 2, scope: !154, file: !1, line: 133, type: !92)
!185 = !DILocation(line: 133, column: 55, scope: !154)
!186 = !DILocalVariable(name: "filters", arg: 3, scope: !154, file: !1, line: 134, type: !142)
!187 = !DILocation(line: 134, column: 27, scope: !154)
!188 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !154, file: !1, line: 134, type: !55)
!189 = !DILocation(line: 134, column: 41, scope: !154)
!190 = !DILocalVariable(name: "ret", scope: !154, file: !1, line: 136, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!192 = !DILocation(line: 136, column: 17, scope: !154)
!193 = !DILocation(line: 136, column: 46, scope: !154)
!194 = !DILocation(line: 136, column: 52, scope: !154)
!195 = !DILocation(line: 136, column: 63, scope: !154)
!196 = !DILocation(line: 137, column: 42, scope: !154)
!197 = !DILocation(line: 136, column: 23, scope: !154)
!198 = !DILocation(line: 139, column: 6, scope: !199)
!199 = distinct !DILexicalBlock(scope: !154, file: !1, line: 139, column: 6)
!200 = !DILocation(line: 139, column: 10, scope: !199)
!201 = !DILocation(line: 139, column: 6, scope: !154)
!202 = !DILocation(line: 140, column: 3, scope: !203)
!203 = distinct !DILexicalBlock(scope: !199, file: !1, line: 139, column: 22)
!204 = !DILocation(line: 140, column: 9, scope: !203)
