; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_decoder = type { %struct.lzma_coder_s*, i32 (%struct.lzma_coder_s*, %struct.lzma_dict*, i8*, i64*, i64)*, void (%struct.lzma_coder_s*, i8*)*, void (%struct.lzma_coder_s*, i64)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)* }
%struct.lzma_coder_s = type { %struct.lzma_dict, %struct.lzma_lz_decoder, %struct.lzma_next_coder_s, i8, i8, %struct.anon }
%struct.lzma_dict = type { i8*, i64, i64, i64, i64, i8 }
%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.anon = type { i64, i64, [4096 x i8] }
%struct.lzma_filter_info_s = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i8* }
%struct.lzma_lz_options = type { i64, i8*, i64 }

@LZMA_LZ_DECODER_INIT = internal constant %struct.lzma_lz_decoder zeroinitializer, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !38, globals: !198)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!21 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!22 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!23 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 27, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!28 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!30 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!31 = !{!32, !33, !36}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 62, baseType: !35)
!34 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!35 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !37, line: 55, baseType: !35)
!37 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!38 = !{!39, !186, !189, !190, !191, !194, !195}
!39 = distinct !DISubprogram(name: "lzma_lz_decoder_init", scope: !1, file: !1, line: 209, type: !40, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !101, !162, !174}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !45, line: 75, baseType: !46)
!45 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !45, line: 119, size: 512, align: 64, elements: !47)
!47 = !{!48, !126, !127, !129, !136, !138, !145, !150}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !46, file: !45, line: 121, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !45, line: 73, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 23, size: 34176, align: 64, elements: !52)
!52 = !{!53, !68, !114, !115, !116, !117}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !51, file: !1, line: 25, baseType: !54, size: 384, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !55, line: 44, baseType: !56)
!55 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_decoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!56 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 20, size: 384, align: 64, elements: !57)
!57 = !{!58, !62, !63, !64, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !55, line: 24, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !37, line: 48, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !56, file: !55, line: 28, baseType: !33, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !56, file: !55, line: 33, baseType: !33, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !56, file: !55, line: 36, baseType: !33, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !55, line: 39, baseType: !33, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !56, file: !55, line: 42, baseType: !67, size: 8, align: 8, offset: 320)
!67 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !51, file: !1, line: 28, baseType: !69, size: 320, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !55, line: 72, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 54, size: 320, align: 64, elements: !71)
!71 = !{!72, !73, !85, !91, !97}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !70, file: !55, line: 56, baseType: !49, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !70, file: !55, line: 59, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!42, !77, !78, !80, !83, !33}
!77 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!83 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !70, file: !55, line: 63, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !49, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !70, file: !55, line: 66, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !49, !95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !96, line: 63, baseType: !36)
!96 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !70, file: !55, line: 70, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !49, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !104)
!104 = !{!105, !109, !113}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !103, file: !4, line: 376, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!32, !32, !33, !33}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !103, file: !4, line: 390, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !32, !32}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !103, file: !4, line: 401, baseType: !32, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !1, line: 33, baseType: !44, size: 512, align: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next_finished", scope: !51, file: !1, line: 36, baseType: !67, size: 8, align: 8, offset: 1216)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "this_finished", scope: !51, file: !1, line: 40, baseType: !67, size: 8, align: 8, offset: 1224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !51, file: !1, line: 50, baseType: !118, size: 32896, align: 64, offset: 1280)
!118 = !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !1, line: 46, size: 32896, align: 64, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !118, file: !1, line: 47, baseType: !33, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !118, file: !1, line: 48, baseType: !33, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !118, file: !1, line: 49, baseType: !123, size: 32768, align: 8, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32768, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 4096)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !46, file: !45, line: 125, baseType: !95, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !46, file: !45, line: 131, baseType: !128, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !37, line: 122, baseType: !35)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !46, file: !45, line: 134, baseType: !130, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !45, line: 89, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!42, !49, !101, !80, !83, !33, !134, !83, !33, !135}
!134 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !18)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !46, file: !45, line: 139, baseType: !137, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !45, line: 97, baseType: !98)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !46, file: !45, line: 143, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !25, line: 55, baseType: !24)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !46, file: !45, line: 147, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!42, !49, !149, !149, !36}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !46, file: !45, line: 152, baseType: !151, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!42, !49, !101, !154, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !157, line: 65, baseType: !158)
!157 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!158 = !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 43, size: 128, align: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !157, line: 54, baseType: !95, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !158, file: !157, line: 63, baseType: !32, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !45, line: 77, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !45, line: 104, size: 192, align: 64, elements: !166)
!166 = !{!167, !168, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !45, line: 107, baseType: !95, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !165, file: !45, line: 111, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !45, line: 81, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!42, !43, !101, !162}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !165, file: !45, line: 114, baseType: !32, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!42, !177, !101, !89, !178}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !55, line: 51, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 47, size: 192, align: 64, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !180, file: !55, line: 48, baseType: !33, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !180, file: !55, line: 49, baseType: !81, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !180, file: !55, line: 50, baseType: !33, size: 64, align: 64, offset: 128)
!185 = !{}
!186 = distinct !DISubprogram(name: "lzma_lz_decoder_memusage", scope: !1, file: !1, line: 297, type: !187, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!187 = !DISubroutineType(types: !188)
!188 = !{!36, !33}
!189 = distinct !DISubprogram(name: "lzma_lz_decoder_uncompressed", scope: !1, file: !1, line: 304, type: !93, isLocal: false, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!190 = distinct !DISubprogram(name: "lz_decode", scope: !1, file: !1, line: 132, type: !132, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!191 = distinct !DISubprogram(name: "decode_buffer", scope: !1, file: !1, line: 66, type: !192, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!192 = !DISubroutineType(types: !193)
!193 = !{!42, !49, !80, !83, !33, !134, !83, !33}
!194 = distinct !DISubprogram(name: "lz_decoder_end", scope: !1, file: !1, line: 193, type: !99, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!195 = distinct !DISubprogram(name: "lz_decoder_reset", scope: !1, file: !1, line: 55, type: !196, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, variables: !185)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !49}
!198 = !{!199, !201}
!199 = !DIGlobalVariable(name: "LZMA_LZ_DECODER_INIT", scope: !0, file: !55, line: 75, type: !200, isLocal: true, isDefinition: true, variable: %struct.lzma_lz_decoder* @LZMA_LZ_DECODER_INIT)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!201 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !45, line: 159, type: !202, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!203 = !{i32 2, !"Dwarf Version", i32 4}
!204 = !{i32 2, !"Debug Info Version", i32 3}
!205 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!206 = !DILocalVariable(name: "next", arg: 1, scope: !39, file: !1, line: 209, type: !43)
!207 = !DIExpression()
!208 = !DILocation(line: 209, column: 39, scope: !39)
!209 = !DILocalVariable(name: "allocator", arg: 2, scope: !39, file: !1, line: 209, type: !101)
!210 = !DILocation(line: 209, column: 61, scope: !39)
!211 = !DILocalVariable(name: "filters", arg: 3, scope: !39, file: !1, line: 210, type: !162)
!212 = !DILocation(line: 210, column: 27, scope: !39)
!213 = !DILocalVariable(name: "lz_init", arg: 4, scope: !39, file: !1, line: 211, type: !174)
!214 = !DILocation(line: 211, column: 14, scope: !39)
!215 = !DILocalVariable(name: "lz_options", scope: !39, file: !1, line: 215, type: !179)
!216 = !DILocation(line: 215, column: 18, scope: !39)
!217 = !DILocation(line: 218, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !39, file: !1, line: 218, column: 6)
!219 = !DILocation(line: 218, column: 12, scope: !218)
!220 = !DILocation(line: 218, column: 18, scope: !218)
!221 = !DILocation(line: 218, column: 6, scope: !39)
!222 = !DILocation(line: 219, column: 48, scope: !223)
!223 = distinct !DILexicalBlock(scope: !218, file: !1, line: 218, column: 27)
!224 = !DILocation(line: 219, column: 17, scope: !223)
!225 = !DILocation(line: 219, column: 3, scope: !223)
!226 = !DILocation(line: 219, column: 9, scope: !223)
!227 = !DILocation(line: 219, column: 15, scope: !223)
!228 = !DILocation(line: 220, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !223, file: !1, line: 220, column: 7)
!230 = !DILocation(line: 220, column: 13, scope: !229)
!231 = !DILocation(line: 220, column: 19, scope: !229)
!232 = !DILocation(line: 220, column: 7, scope: !223)
