; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_lz_encoder, %struct.lzma_mf_s, %struct.lzma_next_coder_s }
%struct.lzma_lz_encoder = type { %struct.lzma_coder_s*, i32 (%struct.lzma_coder_s*, %struct.lzma_mf_s*, i8*, i64*, i64)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !39, subprograms: !46, globals: !240)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !11, !18, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!7 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!8 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!9 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!10 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 250, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!15 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!16 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!17 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 57, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "LZMA_OK", value: 0)
!21 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!22 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!23 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!24 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!25 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!26 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!27 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!28 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!29 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!30 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!31 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 27, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!36 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!37 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!38 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!39 = !{!40, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 55, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!42 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 62, baseType: !42)
!45 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!46 = !{!47, !73, !222, !226, !230, !231, !234, !237, !238, !239}
!47 = distinct !DISubprogram(name: "lzma_lz_encoder_memusage", scope: !1, file: !1, line: 457, type: !48, isLocal: false, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!48 = !DISubroutineType(types: !49)
!49 = !{!40, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !53, line: 161, baseType: !54)
!53 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!54 = !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 129, size: 512, align: 64, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !63, !66, !71}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !54, file: !53, line: 132, baseType: !44, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !54, file: !53, line: 135, baseType: !44, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !54, file: !53, line: 139, baseType: !44, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !54, file: !53, line: 144, baseType: !44, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !54, file: !53, line: 148, baseType: !44, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !54, file: !53, line: 151, baseType: !62, size: 32, align: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !4, line: 111, baseType: !3)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !54, file: !53, line: 154, baseType: !64, size: 32, align: 32, offset: 352)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 51, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !54, file: !53, line: 157, baseType: !67, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 48, baseType: !70)
!70 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !54, file: !53, line: 159, baseType: !64, size: 32, align: 32, offset: 448)
!72 = !{}
!73 = distinct !DISubprogram(name: "lzma_lz_encoder_init", scope: !1, file: !1, line: 508, type: !74, isLocal: false, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !77, !147, !203, !215}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !12, line: 237, baseType: !18)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !79, line: 75, baseType: !80)
!79 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !79, line: 119, size: 512, align: 64, elements: !81)
!81 = !{!82, !176, !177, !179, !185, !187, !194, !199}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !80, file: !79, line: 121, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !79, line: 73, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 24, size: 1728, align: 64, elements: !86)
!86 = !{!87, !174, !175}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !85, file: !1, line: 26, baseType: !88, size: 256, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !53, line: 208, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 192, size: 256, align: 64, elements: !90)
!90 = !{!91, !92, !143, !160}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !89, file: !53, line: 194, baseType: !83, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !89, file: !53, line: 197, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!76, !96, !97, !140, !141, !44}
!96 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!97 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !53, line: 28, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !53, line: 29, size: 960, align: 64, elements: !101)
!101 = !{!102, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !123, !127, !129, !130, !131, !132, !133, !134, !135, !136, !138, !139}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !100, file: !53, line: 35, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !53, line: 39, baseType: !64, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !100, file: !53, line: 45, baseType: !64, size: 32, align: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !100, file: !53, line: 51, baseType: !64, size: 32, align: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !100, file: !53, line: 58, baseType: !64, size: 32, align: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !100, file: !53, line: 63, baseType: !64, size: 32, align: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !100, file: !53, line: 67, baseType: !64, size: 32, align: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !100, file: !53, line: 75, baseType: !64, size: 32, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !100, file: !53, line: 80, baseType: !64, size: 32, align: 32, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !100, file: !53, line: 84, baseType: !64, size: 32, align: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !100, file: !53, line: 92, baseType: !114, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!64, !98, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !53, line: 25, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 22, size: 64, align: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !119, file: !53, line: 23, baseType: !64, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !119, file: !53, line: 24, baseType: !64, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !100, file: !53, line: 97, baseType: !124, size: 64, align: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !98, !64}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !100, file: !53, line: 99, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !100, file: !53, line: 100, baseType: !128, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !100, file: !53, line: 101, baseType: !64, size: 32, align: 32, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !100, file: !53, line: 102, baseType: !64, size: 32, align: 32, offset: 672)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !100, file: !53, line: 103, baseType: !64, size: 32, align: 32, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !100, file: !53, line: 106, baseType: !64, size: 32, align: 32, offset: 736)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !100, file: !53, line: 109, baseType: !64, size: 32, align: 32, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !100, file: !53, line: 114, baseType: !64, size: 32, align: 32, offset: 800)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !100, file: !53, line: 119, baseType: !137, size: 32, align: 32, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !12, line: 322, baseType: !11)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !100, file: !53, line: 122, baseType: !64, size: 32, align: 32, offset: 864)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !100, file: !53, line: 125, baseType: !64, size: 32, align: 32, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !103)
!141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !89, file: !53, line: 202, baseType: !144, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !83, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !12, line: 403, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 341, size: 192, align: 64, elements: !150)
!150 = !{!151, !155, !159}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !149, file: !12, line: 376, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!43, !43, !44, !44}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !149, file: !12, line: 390, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !43, !43}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !149, file: !12, line: 401, baseType: !43, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !89, file: !53, line: 205, baseType: !161, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!76, !83, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !167, line: 65, baseType: !168)
!167 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!168 = !DICompositeType(tag: DW_TAG_structure_type, file: !167, line: 43, size: 128, align: 64, elements: !169)
!169 = !{!170, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !167, line: 54, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !172, line: 63, baseType: !40)
!172 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !168, file: !167, line: 63, baseType: !43, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !85, file: !1, line: 29, baseType: !99, size: 960, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !1, line: 32, baseType: !78, size: 512, align: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !79, line: 125, baseType: !171, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !80, file: !79, line: 131, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !41, line: 122, baseType: !42)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !80, file: !79, line: 134, baseType: !180, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !79, line: 89, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!76, !83, !147, !184, !141, !44, !140, !141, !44, !137}
!184 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !80, file: !79, line: 139, baseType: !186, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !79, line: 97, baseType: !144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !80, file: !79, line: 143, baseType: !188, size: 64, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !33, line: 55, baseType: !32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !80, file: !79, line: 147, baseType: !195, size: 64, align: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!76, !83, !198, !198, !40}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !80, file: !79, line: 152, baseType: !200, size: 64, align: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!76, !83, !147, !164, !164}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !79, line: 77, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !79, line: 104, size: 192, align: 64, elements: !207)
!207 = !{!208, !209, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !206, file: !79, line: 107, baseType: !171, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !206, file: !79, line: 111, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !79, line: 81, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!76, !77, !147, !203}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !206, file: !79, line: 114, baseType: !43, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!76, !218, !147, !219, !221}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!222 = distinct !DISubprogram(name: "lzma_mf_is_supported", scope: !1, file: !1, line: 564, type: !223, isLocal: false, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !62}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !12, line: 29, baseType: !70)
!226 = distinct !DISubprogram(name: "lz_encoder_prepare", scope: !1, file: !1, line: 188, type: !227, isLocal: true, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !98, !147, !50}
!229 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!230 = distinct !DISubprogram(name: "lz_encode", scope: !1, file: !1, line: 155, type: !182, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!231 = distinct !DISubprogram(name: "fill_window", scope: !1, file: !1, line: 81, type: !232, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!232 = !DISubroutineType(types: !233)
!233 = !{!76, !83, !147, !67, !142, !44, !137}
!234 = distinct !DISubprogram(name: "move_window", scope: !1, file: !1, line: 44, type: !235, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !98}
!237 = distinct !DISubprogram(name: "lz_encoder_end", scope: !1, file: !1, line: 474, type: !145, isLocal: true, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!238 = distinct !DISubprogram(name: "lz_encoder_update", scope: !1, file: !1, line: 492, type: !201, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!239 = distinct !DISubprogram(name: "lz_encoder_init", scope: !1, file: !1, line: 376, type: !227, isLocal: true, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: false, variables: !72)
!240 = !{!241}
!241 = !DIGlobalVariable(name: "LZMA_NEXT_CODER_INIT", scope: !0, file: !79, line: 159, type: !242, isLocal: true, isDefinition: true, variable: %struct.lzma_next_coder_s* @LZMA_NEXT_CODER_INIT)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!243 = !{i32 2, !"Dwarf Version", i32 4}
!244 = !{i32 2, !"Debug Info Version", i32 3}
!245 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!246 = !DILocalVariable(name: "lz_options", arg: 1, scope: !47, file: !1, line: 457, type: !50)
!247 = !DIExpression()
!248 = !DILocation(line: 457, column: 49, scope: !47)
!249 = !DILocalVariable(name: "mf", scope: !47, file: !1, line: 460, type: !99)
!250 = !DILocation(line: 460, column: 10, scope: !47)
!251 = !DILocation(line: 463, column: 36, scope: !252)
!252 = distinct !DILexicalBlock(scope: !47, file: !1, line: 463, column: 6)
!253 = !DILocation(line: 463, column: 6, scope: !252)
!254 = !DILocation(line: 463, column: 6, scope: !47)
!255 = !DILocation(line: 464, column: 3, scope: !252)
!256 = !DILocation(line: 467, column: 23, scope: !47)
!257 = !DILocation(line: 467, column: 42, scope: !47)
!258 = !DILocation(line: 467, column: 37, scope: !47)
!259 = !DILocation(line: 467, column: 9, scope: !47)
