; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder_mf.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }

@.str = private unnamed_addr constant [31 x i8] c"matches[i].len <= mf->nice_len\00", align 1
@.str.1 = private unnamed_addr constant [81 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder_mf.c\00", align 1
@__PRETTY_FUNCTION__.lzma_mf_find = private unnamed_addr constant [59 x i8] c"uint32_t lzma_mf_find(lzma_mf *, uint32_t *, lzma_match *)\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"matches[i].dist < mf->read_pos\00", align 1
@.str.3 = private unnamed_addr constant [78 x i8] c"memcmp(mf_ptr(mf) - 1, mf_ptr(mf) - matches[i].dist - 2, matches[i].len) == 0\00", align 1
@.str.4 = private unnamed_addr constant [23 x i8] c"mf->action != LZMA_RUN\00", align 1
@__PRETTY_FUNCTION__.lzma_mf_hc3_find = private unnamed_addr constant [51 x i8] c"uint32_t lzma_mf_hc3_find(lzma_mf *, lzma_match *)\00", align 1
@lzma_crc32_table = external constant [8 x [256 x i32]], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !18)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder_mf.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!7 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!8 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!9 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!10 = !{!11, !14}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 51, baseType: !13)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!13 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 49, baseType: !17)
!17 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!18 = !{!19, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !83, !86, !89, !90, !91, !99, !100}
!19 = distinct !DISubprogram(name: "lzma_mf_find", scope: !1, file: !1, line: 22, type: !20, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!20 = !DISubroutineType(types: !21)
!21 = !{!11, !22, !55, !44}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !24, line: 28, baseType: !25)
!24 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !24, line: 29, size: 960, align: 64, elements: !26)
!26 = !{!27, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !50, !54, !56, !57, !58, !59, !60, !61, !62, !63, !65, !66}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !25, file: !24, line: 35, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 48, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !24, line: 39, baseType: !11, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !25, file: !24, line: 45, baseType: !11, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !25, file: !24, line: 51, baseType: !11, size: 32, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !25, file: !24, line: 58, baseType: !11, size: 32, align: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !25, file: !24, line: 63, baseType: !11, size: 32, align: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !25, file: !24, line: 67, baseType: !11, size: 32, align: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !25, file: !24, line: 75, baseType: !11, size: 32, align: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !25, file: !24, line: 80, baseType: !11, size: 32, align: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !25, file: !24, line: 84, baseType: !11, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !25, file: !24, line: 92, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!11, !22, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !24, line: 25, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 22, size: 64, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !24, line: 23, baseType: !11, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !46, file: !24, line: 24, baseType: !11, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !25, file: !24, line: 97, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !22, !11}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !25, file: !24, line: 99, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !25, file: !24, line: 100, baseType: !55, size: 64, align: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !25, file: !24, line: 101, baseType: !11, size: 32, align: 32, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !25, file: !24, line: 102, baseType: !11, size: 32, align: 32, offset: 672)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !25, file: !24, line: 103, baseType: !11, size: 32, align: 32, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !25, file: !24, line: 106, baseType: !11, size: 32, align: 32, offset: 736)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !25, file: !24, line: 109, baseType: !11, size: 32, align: 32, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !25, file: !24, line: 114, baseType: !11, size: 32, align: 32, offset: 800)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !25, file: !24, line: 119, baseType: !64, size: 32, align: 32, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !25, file: !24, line: 122, baseType: !11, size: 32, align: 32, offset: 864)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !25, file: !24, line: 125, baseType: !11, size: 32, align: 32, offset: 896)
!67 = !{}
!68 = distinct !DISubprogram(name: "lzma_mf_hc3_find", scope: !1, file: !1, line: 314, type: !42, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!69 = distinct !DISubprogram(name: "lzma_mf_hc3_skip", scope: !1, file: !1, line: 353, type: !52, isLocal: false, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!70 = distinct !DISubprogram(name: "lzma_mf_hc4_find", scope: !1, file: !1, line: 385, type: !42, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!71 = distinct !DISubprogram(name: "lzma_mf_hc4_skip", scope: !1, file: !1, line: 441, type: !52, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!72 = distinct !DISubprogram(name: "lzma_mf_bt2_find", scope: !1, file: !1, line: 627, type: !42, isLocal: false, isDefinition: true, scopeLine: 628, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!73 = distinct !DISubprogram(name: "lzma_mf_bt2_skip", scope: !1, file: !1, line: 647, type: !52, isLocal: false, isDefinition: true, scopeLine: 648, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!74 = distinct !DISubprogram(name: "lzma_mf_bt3_find", scope: !1, file: !1, line: 671, type: !42, isLocal: false, isDefinition: true, scopeLine: 672, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!75 = distinct !DISubprogram(name: "lzma_mf_bt3_skip", scope: !1, file: !1, line: 710, type: !52, isLocal: false, isDefinition: true, scopeLine: 711, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!76 = distinct !DISubprogram(name: "lzma_mf_bt4_find", scope: !1, file: !1, line: 736, type: !42, isLocal: false, isDefinition: true, scopeLine: 737, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!77 = distinct !DISubprogram(name: "lzma_mf_bt4_skip", scope: !1, file: !1, line: 792, type: !52, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!78 = distinct !DISubprogram(name: "mf_ptr", scope: !24, file: !24, line: 222, type: !79, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!79 = !DISubroutineType(types: !80)
!80 = !{!28, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!83 = distinct !DISubprogram(name: "mf_avail", scope: !24, file: !24, line: 230, type: !84, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!84 = !DISubroutineType(types: !85)
!85 = !{!11, !81}
!86 = distinct !DISubprogram(name: "move_pending", scope: !1, file: !1, line: 184, type: !87, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !22}
!89 = distinct !DISubprogram(name: "move_pos", scope: !1, file: !1, line: 156, type: !87, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!90 = distinct !DISubprogram(name: "normalize", scope: !1, file: !1, line: 113, type: !87, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!91 = distinct !DISubprogram(name: "hc_find_func", scope: !1, file: !1, line: 255, type: !92, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, variables: !67)
!92 = !DISubroutineType(types: !93)
!93 = !{!44, !94, !94, !95, !11, !11, !98, !94, !94, !44, !11}
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
