; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_addrinfo.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Curl_addrinfo = type { i32, i32, i32, i32, i32, i8*, %struct.sockaddr*, %struct.Curl_addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.hostent = type { i8*, i8**, i32, i32, i8** }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.namebuff = type { %struct.hostent, %union.anon, [2 x i8*] }
%union.anon = type { %struct.in_addr }

@Curl_cfree = external global void (i8*)*, align 8
@Curl_cmalloc = external global i8* (i64)*, align 8
@Curl_cstrdup = external global i8* (i8*)*, align 8
@Curl_ccalloc = external global i8* (i64, i64)*, align 8

; Function Attrs: nounwind uwtable
define void @Curl_freeaddrinfo(%struct.Curl_addrinfo* %cahead) #0 !dbg !127 {
entry:
  %cahead.addr = alloca %struct.Curl_addrinfo*, align 8
  %canext = alloca %struct.Curl_addrinfo*, align 8
  %ca = alloca %struct.Curl_addrinfo*, align 8
  store %struct.Curl_addrinfo* %cahead, %struct.Curl_addrinfo** %cahead.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.Curl_addrinfo** %cahead.addr, metadata !202, metadata !203), !dbg !204
  call void @llvm.dbg.declare(metadata %struct.Curl_addrinfo** %canext, metadata !205, metadata !203), !dbg !206

!57 = !DIEnumerator(name: "CURLE_PEER_FAILED_VERIFICATION", value: 51)
!58 = !DIEnumerator(name: "CURLE_GOT_NOTHING", value: 52)
!59 = !DIEnumerator(name: "CURLE_SSL_ENGINE_NOTFOUND", value: 53)
!60 = !DIEnumerator(name: "CURLE_SSL_ENGINE_SETFAILED", value: 54)
!61 = !DIEnumerator(name: "CURLE_SEND_ERROR", value: 55)
!62 = !DIEnumerator(name: "CURLE_RECV_ERROR", value: 56)
!63 = !DIEnumerator(name: "CURLE_OBSOLETE57", value: 57)
!64 = !DIEnumerator(name: "CURLE_SSL_CERTPROBLEM", value: 58)
!65 = !DIEnumerator(name: "CURLE_SSL_CIPHER", value: 59)
!66 = !DIEnumerator(name: "CURLE_SSL_CACERT", value: 60)
!67 = !DIEnumerator(name: "CURLE_BAD_CONTENT_ENCODING", value: 61)
!68 = !DIEnumerator(name: "CURLE_LDAP_INVALID_URL", value: 62)
!69 = !DIEnumerator(name: "CURLE_FILESIZE_EXCEEDED", value: 63)
!70 = !DIEnumerator(name: "CURLE_USE_SSL_FAILED", value: 64)
!71 = !DIEnumerator(name: "CURLE_SEND_FAIL_REWIND", value: 65)
!72 = !DIEnumerator(name: "CURLE_SSL_ENGINE_INITFAILED", value: 66)
!73 = !DIEnumerator(name: "CURLE_LOGIN_DENIED", value: 67)
!74 = !DIEnumerator(name: "CURLE_TFTP_NOTFOUND", value: 68)
!75 = !DIEnumerator(name: "CURLE_TFTP_PERM", value: 69)
!76 = !DIEnumerator(name: "CURLE_REMOTE_DISK_FULL", value: 70)
!77 = !DIEnumerator(name: "CURLE_TFTP_ILLEGAL", value: 71)
!78 = !DIEnumerator(name: "CURLE_TFTP_UNKNOWNID", value: 72)
!79 = !DIEnumerator(name: "CURLE_REMOTE_FILE_EXISTS", value: 73)
!80 = !DIEnumerator(name: "CURLE_TFTP_NOSUCHUSER", value: 74)
!81 = !DIEnumerator(name: "CURLE_CONV_FAILED", value: 75)
!82 = !DIEnumerator(name: "CURLE_CONV_REQD", value: 76)
!83 = !DIEnumerator(name: "CURLE_SSL_CACERT_BADFILE", value: 77)
!84 = !DIEnumerator(name: "CURLE_REMOTE_FILE_NOT_FOUND", value: 78)
!85 = !DIEnumerator(name: "CURLE_SSH", value: 79)
!86 = !DIEnumerator(name: "CURLE_SSL_SHUTDOWN_FAILED", value: 80)
!87 = !DIEnumerator(name: "CURLE_AGAIN", value: 81)
!88 = !DIEnumerator(name: "CURLE_SSL_CRL_BADFILE", value: 82)
!89 = !DIEnumerator(name: "CURLE_SSL_ISSUER_ERROR", value: 83)
!90 = !DIEnumerator(name: "CURLE_FTP_PRET_FAILED", value: 84)
!91 = !DIEnumerator(name: "CURLE_RTSP_CSEQ_ERROR", value: 85)
!92 = !DIEnumerator(name: "CURLE_RTSP_SESSION_ERROR", value: 86)
!93 = !DIEnumerator(name: "CURLE_FTP_BAD_FILE_LIST", value: 87)
!94 = !DIEnumerator(name: "CURLE_CHUNK_FAILED", value: 88)
!95 = !DIEnumerator(name: "CURLE_NO_CONNECTION_AVAILABLE", value: 89)
!96 = !DIEnumerator(name: "CURLE_SSL_PINNEDPUBKEYNOTMATCH", value: 90)
!97 = !DIEnumerator(name: "CURLE_SSL_INVALIDCERTSTATUS", value: 91)
!98 = !DIEnumerator(name: "CURLE_HTTP2_STREAM", value: 92)
!99 = !DIEnumerator(name: "CURL_LAST", value: 93)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !101, line: 24, size: 32, align: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111}
!103 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!104 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!105 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!106 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!107 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!108 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!109 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!110 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!111 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!112 = !{!113, !114, !117, !124, !125}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 62, baseType: !116)
!115 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!116 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socklen_t", file: !118, line: 186, baseType: !119)
!118 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/curlbuild.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !120, line: 33, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !122, line: 189, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!125 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!126 = !{!127, !158, !178, !191, !196}
!127 = distinct !DISubprogram(name: "Curl_freeaddrinfo", scope: !1, file: !1, line: 78, type: !128, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, variables: !157)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_addrinfo", file: !132, line: 61, baseType: !133)
!132 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_addrinfo.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_addrinfo", file: !132, line: 51, size: 384, align: 64, elements: !134)
!134 = !{!135, !137, !138, !139, !140, !141, !144, !155}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !133, file: !132, line: 52, baseType: !136, size: 32, align: 32)
!136 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !133, file: !132, line: 53, baseType: !136, size: 32, align: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !133, file: !132, line: 54, baseType: !136, size: 32, align: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !133, file: !132, line: 55, baseType: !136, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !133, file: !132, line: 56, baseType: !117, size: 32, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !133, file: !132, line: 57, baseType: !142, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !133, file: !132, line: 58, baseType: !145, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !120, line: 149, size: 128, align: 16, elements: !147)
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !146, file: !120, line: 151, baseType: !149, size: 16, align: 16)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !150, line: 28, baseType: !124)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !146, file: !120, line: 152, baseType: !152, size: 112, align: 8, offset: 16)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 112, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 14)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !133, file: !132, line: 59, baseType: !156, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!157 = !{}
!158 = distinct !DISubprogram(name: "Curl_getaddrinfo_ex", scope: !1, file: !1, line: 109, type: !159, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, variables: !157)
!159 = !DISubroutineType(types: !160)
!160 = !{!136, !161, !161, !163, !177}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !166, line: 567, size: 384, align: 64, elements: !167)
!166 = !DIFile(filename: "/usr/include/netdb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !165, file: !166, line: 569, baseType: !136, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !165, file: !166, line: 570, baseType: !136, size: 32, align: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !165, file: !166, line: 571, baseType: !136, size: 32, align: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !165, file: !166, line: 572, baseType: !136, size: 32, align: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !165, file: !166, line: 573, baseType: !119, size: 32, align: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !165, file: !166, line: 574, baseType: !145, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !165, file: !166, line: 575, baseType: !142, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !165, file: !166, line: 576, baseType: !176, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!178 = distinct !DISubprogram(name: "Curl_he2ai", scope: !1, file: !1, line: 270, type: !179, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, variables: !157)
!179 = !DISubroutineType(types: !180)
!180 = !{!130, !181, !136}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", file: !166, line: 100, size: 256, align: 64, elements: !184)
!184 = !{!185, !186, !188, !189, !190}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !183, file: !166, line: 102, baseType: !142, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !183, file: !166, line: 103, baseType: !187, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !183, file: !166, line: 104, baseType: !136, size: 32, align: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !183, file: !166, line: 105, baseType: !136, size: 32, align: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !183, file: !166, line: 106, baseType: !187, size: 64, align: 64, offset: 192)
!191 = distinct !DISubprogram(name: "Curl_ip2addr", scope: !1, file: !1, line: 390, type: !192, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: false, variables: !157)
!192 = !DISubroutineType(types: !193)
!193 = !{!130, !136, !194, !161, !136}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!196 = distinct !DISubprogram(name: "Curl_str2addr", scope: !1, file: !1, line: 465, type: !197, isLocal: false, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: false, variables: !157)
!197 = !DISubroutineType(types: !198)
!198 = !{!130, !142, !136}
!199 = !{i32 2, !"Dwarf Version", i32 4}
!200 = !{i32 2, !"Debug Info Version", i32 3}
!201 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!202 = !DILocalVariable(name: "cahead", arg: 1, scope: !127, file: !1, line: 78, type: !130)
!203 = !DIExpression()
!204 = !DILocation(line: 78, column: 34, scope: !127)
!205 = !DILocalVariable(name: "canext", scope: !127, file: !1, line: 80, type: !130)
!206 = !DILocation(line: 80, column: 29, scope: !127)
!207 = !DILocalVariable(name: "ca", scope: !127, file: !1, line: 81, type: !130)
!208 = !DILocation(line: 81, column: 18, scope: !127)
!209 = !DILocation(line: 83, column: 12, scope: !210)
!210 = distinct !DILexicalBlock(scope: !127, file: !1, line: 83, column: 3)
!211 = !DILocation(line: 83, column: 10, scope: !210)
!212 = !DILocation(line: 83, column: 7, scope: !210)
!213 = !DILocation(line: 83, column: 20, scope: !214)
!214 = !DILexicalBlockFile(scope: !215, file: !1, discriminator: 1)
!215 = distinct !DILexicalBlock(scope: !210, file: !1, line: 83, column: 3)
!216 = !DILocation(line: 83, column: 23, scope: !214)
!217 = !DILocation(line: 83, column: 3, scope: !214)
!218 = !DILocation(line: 84, column: 5, scope: !219)
!219 = distinct !DILexicalBlock(scope: !215, file: !1, line: 83, column: 45)
!220 = !DILocation(line: 85, column: 5, scope: !219)
!221 = !DILocation(line: 86, column: 14, scope: !219)
!222 = !DILocation(line: 86, column: 18, scope: !219)
!223 = !DILocation(line: 86, column: 12, scope: !219)
!224 = !DILocation(line: 88, column: 5, scope: !219)
!225 = !DILocation(line: 89, column: 3, scope: !219)
!226 = !DILocation(line: 83, column: 37, scope: !227)
!227 = !DILexicalBlockFile(scope: !215, file: !1, discriminator: 2)
!228 = !DILocation(line: 83, column: 35, scope: !227)
!229 = !DILocation(line: 83, column: 3, scope: !227)
!230 = !DILocation(line: 90, column: 1, scope: !127)
!231 = !DILocalVariable(name: "nodename", arg: 1, scope: !158, file: !1, line: 109, type: !161)
!232 = !DILocation(line: 109, column: 33, scope: !158)
!233 = !DILocalVariable(name: "servname", arg: 2, scope: !158, file: !1, line: 110, type: !161)
!234 = !DILocation(line: 110, column: 33, scope: !158)
!235 = !DILocalVariable(name: "hints", arg: 3, scope: !158, file: !1, line: 111, type: !163)
!236 = !DILocation(line: 111, column: 44, scope: !158)
!237 = !DILocalVariable(name: "result", arg: 4, scope: !158, file: !1, line: 112, type: !177)
!238 = !DILocation(line: 112, column: 37, scope: !158)
!239 = !DILocalVariable(name: "ai", scope: !158, file: !1, line: 114, type: !163)
!240 = !DILocation(line: 114, column: 26, scope: !158)
!241 = !DILocalVariable(name: "aihead", scope: !158, file: !1, line: 115, type: !176)
!242 = !DILocation(line: 115, column: 20, scope: !158)
!243 = !DILocalVariable(name: "cafirst", scope: !158, file: !1, line: 116, type: !130)
!244 = !DILocation(line: 116, column: 18, scope: !158)
!245 = !DILocalVariable(name: "calast", scope: !158, file: !1, line: 117, type: !130)
!246 = !DILocation(line: 117, column: 18, scope: !158)
!247 = !DILocalVariable(name: "ca", scope: !158, file: !1, line: 118, type: !130)
!248 = !DILocation(line: 118, column: 18, scope: !158)
!249 = !DILocalVariable(name: "ss_size", scope: !158, file: !1, line: 119, type: !114)
!250 = !DILocation(line: 119, column: 10, scope: !158)
!251 = !DILocalVariable(name: "error", scope: !158, file: !1, line: 120, type: !136)
!252 = !DILocation(line: 120, column: 7, scope: !158)
!253 = !DILocation(line: 122, column: 4, scope: !158)
!254 = !DILocation(line: 122, column: 11, scope: !158)
!255 = !DILocation(line: 124, column: 23, scope: !158)
!256 = !DILocation(line: 124, column: 33, scope: !158)
!257 = !DILocation(line: 124, column: 43, scope: !158)
!258 = !DILocation(line: 124, column: 11, scope: !158)
!259 = !DILocation(line: 124, column: 9, scope: !158)
!260 = !DILocation(line: 125, column: 6, scope: !261)
!261 = distinct !DILexicalBlock(scope: !158, file: !1, line: 125, column: 6)
!262 = !DILocation(line: 125, column: 6, scope: !158)
!263 = !DILocation(line: 126, column: 12, scope: !261)
!264 = !DILocation(line: 126, column: 5, scope: !261)
!265 = !DILocation(line: 130, column: 12, scope: !266)
!266 = distinct !DILexicalBlock(scope: !158, file: !1, line: 130, column: 3)
!267 = !DILocation(line: 130, column: 10, scope: !266)
!268 = !DILocation(line: 130, column: 7, scope: !266)
!269 = !DILocation(line: 130, column: 20, scope: !270)
!270 = !DILexicalBlockFile(scope: !271, file: !1, discriminator: 1)
!271 = distinct !DILexicalBlock(scope: !266, file: !1, line: 130, column: 3)
!272 = !DILocation(line: 130, column: 23, scope: !270)
!273 = !DILocation(line: 130, column: 3, scope: !270)
!274 = !DILocation(line: 134, column: 8, scope: !275)
!275 = distinct !DILexicalBlock(scope: !276, file: !1, line: 134, column: 8)
!276 = distinct !DILexicalBlock(scope: !271, file: !1, line: 130, column: 50)
!277 = !DILocation(line: 134, column: 12, scope: !275)
!278 = !DILocation(line: 134, column: 22, scope: !275)
!279 = !DILocation(line: 134, column: 8, scope: !276)
!280 = !DILocation(line: 135, column: 15, scope: !275)
!281 = !DILocation(line: 135, column: 7, scope: !275)
!282 = !DILocation(line: 141, column: 7, scope: !275)
!283 = !DILocation(line: 144, column: 9, scope: !284)
!284 = distinct !DILexicalBlock(scope: !276, file: !1, line: 144, column: 8)
!285 = !DILocation(line: 144, column: 13, scope: !284)
!286 = !DILocation(line: 144, column: 21, scope: !284)
!287 = !DILocation(line: 144, column: 30, scope: !284)
!288 = !DILocation(line: 144, column: 35, scope: !289)
!289 = !DILexicalBlockFile(scope: !284, file: !1, discriminator: 1)
!290 = !DILocation(line: 144, column: 39, scope: !289)
!291 = !DILocation(line: 144, column: 50, scope: !289)
!292 = !DILocation(line: 144, column: 8, scope: !289)
!293 = !DILocation(line: 145, column: 7, scope: !284)
!294 = !DILocation(line: 148, column: 16, scope: !295)
!295 = distinct !DILexicalBlock(scope: !276, file: !1, line: 148, column: 8)
!296 = !DILocation(line: 148, column: 20, scope: !295)
!297 = !DILocation(line: 148, column: 8, scope: !295)
!298 = !DILocation(line: 148, column: 33, scope: !295)
!299 = !DILocation(line: 148, column: 31, scope: !295)
!300 = !DILocation(line: 148, column: 8, scope: !276)
!301 = !DILocation(line: 149, column: 7, scope: !295)
!302 = !DILocation(line: 151, column: 10, scope: !276)
!303 = !DILocation(line: 151, column: 8, scope: !276)
!304 = !DILocation(line: 152, column: 9, scope: !305)
!305 = distinct !DILexicalBlock(scope: !276, file: !1, line: 152, column: 8)
!306 = !DILocation(line: 152, column: 8, scope: !276)
!307 = !DILocation(line: 153, column: 13, scope: !308)
!308 = distinct !DILexicalBlock(scope: !305, file: !1, line: 152, column: 13)
!309 = !DILocation(line: 154, column: 7, scope: !308)
!310 = !DILocation(line: 160, column: 24, scope: !276)
!311 = !DILocation(line: 160, column: 28, scope: !276)
!312 = !DILocation(line: 160, column: 5, scope: !276)
!313 = !DILocation(line: 160, column: 9, scope: !276)
!314 = !DILocation(line: 160, column: 22, scope: !276)
!315 = !DILocation(line: 161, column: 24, scope: !276)
!316 = !DILocation(line: 161, column: 28, scope: !276)
!317 = !DILocation(line: 161, column: 5, scope: !276)
!318 = !DILocation(line: 161, column: 9, scope: !276)
!319 = !DILocation(line: 161, column: 22, scope: !276)
!320 = !DILocation(line: 162, column: 24, scope: !276)
!321 = !DILocation(line: 162, column: 28, scope: !276)
!322 = !DILocation(line: 162, column: 5, scope: !276)
!323 = !DILocation(line: 162, column: 9, scope: !276)
!324 = !DILocation(line: 162, column: 22, scope: !276)
!325 = !DILocation(line: 163, column: 24, scope: !276)
!326 = !DILocation(line: 163, column: 28, scope: !276)
!327 = !DILocation(line: 163, column: 5, scope: !276)
!328 = !DILocation(line: 163, column: 9, scope: !276)
!329 = !DILocation(line: 163, column: 22, scope: !276)
!330 = !DILocation(line: 164, column: 40, scope: !276)
!331 = !DILocation(line: 164, column: 24, scope: !276)
!332 = !DILocation(line: 164, column: 5, scope: !276)
!333 = !DILocation(line: 164, column: 9, scope: !276)
!334 = !DILocation(line: 164, column: 22, scope: !276)
!335 = !DILocation(line: 165, column: 5, scope: !276)
!336 = !DILocation(line: 165, column: 9, scope: !276)
!337 = !DILocation(line: 165, column: 22, scope: !276)
!338 = !DILocation(line: 166, column: 5, scope: !276)
!339 = !DILocation(line: 166, column: 9, scope: !276)
!340 = !DILocation(line: 166, column: 22, scope: !276)
!341 = !DILocation(line: 167, column: 5, scope: !276)
!342 = !DILocation(line: 167, column: 9, scope: !276)
!343 = !DILocation(line: 167, column: 22, scope: !276)
!344 = !DILocation(line: 169, column: 19, scope: !276)
!345 = !DILocation(line: 169, column: 5, scope: !276)
!346 = !DILocation(line: 169, column: 9, scope: !276)
!347 = !DILocation(line: 169, column: 17, scope: !276)
!348 = !DILocation(line: 170, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !276, file: !1, line: 170, column: 8)
!350 = !DILocation(line: 170, column: 13, scope: !349)
!351 = !DILocation(line: 170, column: 8, scope: !276)
!352 = !DILocation(line: 171, column: 13, scope: !353)
!353 = distinct !DILexicalBlock(scope: !349, file: !1, line: 170, column: 22)
!354 = !DILocation(line: 172, column: 7, scope: !353)
!355 = !DILocation(line: 173, column: 7, scope: !353)
!356 = !DILocation(line: 175, column: 12, scope: !276)
!357 = !DILocation(line: 175, column: 16, scope: !276)
!358 = !DILocation(line: 175, column: 5, scope: !276)
!359 = !DILocation(line: 175, column: 25, scope: !276)
!360 = !DILocation(line: 175, column: 29, scope: !276)
!361 = !DILocation(line: 175, column: 38, scope: !276)
!362 = !DILocation(line: 177, column: 8, scope: !363)
!363 = distinct !DILexicalBlock(scope: !276, file: !1, line: 177, column: 8)
!364 = !DILocation(line: 177, column: 12, scope: !363)
!365 = !DILocation(line: 177, column: 25, scope: !363)
!366 = !DILocation(line: 177, column: 8, scope: !276)
!367 = !DILocation(line: 178, column: 26, scope: !368)
!368 = distinct !DILexicalBlock(scope: !363, file: !1, line: 177, column: 34)
!369 = !DILocation(line: 178, column: 7, scope: !368)
!370 = !DILocation(line: 178, column: 11, scope: !368)
!371 = !DILocation(line: 178, column: 24, scope: !368)
!372 = !DILocation(line: 179, column: 11, scope: !373)
!373 = distinct !DILexicalBlock(scope: !368, file: !1, line: 179, column: 10)
!374 = !DILocation(line: 179, column: 15, scope: !373)
!375 = !DILocation(line: 179, column: 10, scope: !368)
!376 = !DILocation(line: 180, column: 15, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !1, line: 179, column: 29)
!378 = !DILocation(line: 181, column: 9, scope: !377)
!379 = !DILocation(line: 182, column: 9, scope: !377)
!380 = !DILocation(line: 183, column: 9, scope: !377)
!381 = !DILocation(line: 185, column: 5, scope: !368)
!382 = !DILocation(line: 188, column: 9, scope: !383)
!383 = distinct !DILexicalBlock(scope: !276, file: !1, line: 188, column: 8)
!384 = !DILocation(line: 188, column: 8, scope: !276)
!385 = !DILocation(line: 189, column: 17, scope: !383)
!386 = !DILocation(line: 189, column: 15, scope: !383)
!387 = !DILocation(line: 189, column: 7, scope: !383)
!388 = !DILocation(line: 192, column: 8, scope: !389)
!389 = distinct !DILexicalBlock(scope: !276, file: !1, line: 192, column: 8)
!390 = !DILocation(line: 192, column: 8, scope: !276)
!391 = !DILocation(line: 193, column: 25, scope: !389)
!392 = !DILocation(line: 193, column: 7, scope: !389)
!393 = !DILocation(line: 193, column: 15, scope: !389)
!394 = !DILocation(line: 193, column: 23, scope: !389)
!395 = !DILocation(line: 194, column: 14, scope: !276)
!396 = !DILocation(line: 194, column: 12, scope: !276)
!397 = !DILocation(line: 196, column: 3, scope: !276)
!398 = !DILocation(line: 130, column: 37, scope: !399)
!399 = !DILexicalBlockFile(scope: !271, file: !1, discriminator: 2)
!400 = !DILocation(line: 130, column: 41, scope: !399)
!401 = !DILocation(line: 130, column: 35, scope: !399)
!402 = !DILocation(line: 130, column: 3, scope: !399)
!403 = !DILocation(line: 199, column: 6, scope: !404)
!404 = distinct !DILexicalBlock(scope: !158, file: !1, line: 199, column: 6)
!405 = !DILocation(line: 199, column: 6, scope: !158)
!406 = !DILocation(line: 200, column: 18, scope: !404)
!407 = !DILocation(line: 200, column: 5, scope: !404)
!408 = !DILocation(line: 203, column: 6, scope: !409)
!409 = distinct !DILexicalBlock(scope: !158, file: !1, line: 203, column: 6)
!410 = !DILocation(line: 203, column: 6, scope: !158)
!411 = !DILocation(line: 204, column: 23, scope: !412)
!412 = distinct !DILexicalBlock(scope: !409, file: !1, line: 203, column: 13)
!413 = !DILocation(line: 204, column: 5, scope: !412)
!414 = !DILocation(line: 205, column: 13, scope: !412)
!415 = !DILocation(line: 206, column: 3, scope: !412)
!416 = !DILocation(line: 207, column: 12, scope: !417)
!417 = distinct !DILexicalBlock(scope: !409, file: !1, line: 207, column: 11)
!418 = !DILocation(line: 207, column: 11, scope: !409)
!419 = !DILocation(line: 210, column: 11, scope: !420)
!420 = distinct !DILexicalBlock(scope: !417, file: !1, line: 207, column: 21)
!421 = !DILocation(line: 218, column: 3, scope: !420)
!422 = !DILocation(line: 220, column: 13, scope: !158)
!423 = !DILocation(line: 220, column: 4, scope: !158)
!424 = !DILocation(line: 220, column: 11, scope: !158)
!425 = !DILocation(line: 223, column: 10, scope: !158)
!426 = !DILocation(line: 223, column: 3, scope: !158)
!427 = !DILocation(line: 224, column: 1, scope: !158)
!428 = !DILocalVariable(name: "he", arg: 1, scope: !178, file: !1, line: 270, type: !181)
!429 = !DILocation(line: 270, column: 34, scope: !178)
!430 = !DILocalVariable(name: "port", arg: 2, scope: !178, file: !1, line: 270, type: !136)
!431 = !DILocation(line: 270, column: 42, scope: !178)
!432 = !DILocalVariable(name: "ai", scope: !178, file: !1, line: 272, type: !130)
!433 = !DILocation(line: 272, column: 18, scope: !178)
!434 = !DILocalVariable(name: "prevai", scope: !178, file: !1, line: 273, type: !130)
!435 = !DILocation(line: 273, column: 18, scope: !178)
!436 = !DILocalVariable(name: "firstai", scope: !178, file: !1, line: 274, type: !130)
!437 = !DILocation(line: 274, column: 18, scope: !178)
!438 = !DILocalVariable(name: "addr", scope: !178, file: !1, line: 275, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !441, line: 237, size: 128, align: 32, elements: !442)
!441 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!442 = !{!443, !444, !448, !454}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !440, file: !441, line: 239, baseType: !149, size: 16, align: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !440, file: !441, line: 240, baseType: !445, size: 16, align: 16, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !441, line: 117, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !447, line: 49, baseType: !124)
!447 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !440, file: !441, line: 241, baseType: !449, size: 32, align: 32, offset: 32)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !441, line: 31, size: 32, align: 32, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !449, file: !441, line: 33, baseType: !452, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !441, line: 30, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !447, line: 51, baseType: !123)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !440, file: !441, line: 244, baseType: !455, size: 64, align: 8, offset: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 64, align: 8, elements: !457)
!456 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!457 = !{!458}
!458 = !DISubrange(count: 8)
!459 = !DILocation(line: 275, column: 23, scope: !178)
!460 = !DILocalVariable(name: "result", scope: !178, file: !1, line: 279, type: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLcode", file: !4, line: 561, baseType: !3)
!462 = !DILocation(line: 279, column: 12, scope: !178)
!463 = !DILocalVariable(name: "i", scope: !178, file: !1, line: 280, type: !136)
!464 = !DILocation(line: 280, column: 7, scope: !178)
!465 = !DILocalVariable(name: "curr", scope: !178, file: !1, line: 281, type: !142)
!466 = !DILocation(line: 281, column: 9, scope: !178)
!467 = !DILocation(line: 283, column: 7, scope: !468)
!468 = distinct !DILexicalBlock(scope: !178, file: !1, line: 283, column: 6)
!469 = !DILocation(line: 283, column: 6, scope: !178)
!470 = !DILocation(line: 285, column: 5, scope: !468)
!471 = !DILocation(line: 287, column: 3, scope: !178)
!472 = !DILocation(line: 287, column: 3, scope: !473)
!473 = !DILexicalBlockFile(scope: !474, file: !1, discriminator: 1)
!474 = distinct !DILexicalBlock(scope: !178, file: !1, line: 287, column: 3)
!475 = !DILocation(line: 289, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !178, file: !1, line: 289, column: 3)
!477 = !DILocation(line: 289, column: 7, scope: !476)
!478 = !DILocation(line: 289, column: 36, scope: !479)
!479 = !DILexicalBlockFile(scope: !480, file: !1, discriminator: 1)
!480 = distinct !DILexicalBlock(scope: !476, file: !1, line: 289, column: 3)
!481 = !DILocation(line: 289, column: 20, scope: !479)
!482 = !DILocation(line: 289, column: 24, scope: !479)
!483 = !DILocation(line: 289, column: 18, scope: !479)
!484 = !DILocation(line: 289, column: 40, scope: !479)
!485 = !DILocation(line: 289, column: 3, scope: !479)
!486 = !DILocalVariable(name: "ss_size", scope: !487, file: !1, line: 291, type: !114)
!487 = distinct !DILexicalBlock(scope: !480, file: !1, line: 289, column: 54)
!488 = !DILocation(line: 291, column: 12, scope: !487)
!489 = !DILocation(line: 297, column: 15, scope: !487)
!490 = !DILocation(line: 299, column: 10, scope: !487)
!491 = !DILocation(line: 299, column: 8, scope: !487)
!492 = !DILocation(line: 300, column: 9, scope: !493)
!493 = distinct !DILexicalBlock(scope: !487, file: !1, line: 300, column: 8)
!494 = !DILocation(line: 300, column: 8, scope: !487)
!495 = !DILocation(line: 301, column: 14, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !1, line: 300, column: 13)
!497 = !DILocation(line: 302, column: 7, scope: !496)
!498 = !DILocation(line: 304, column: 24, scope: !487)
!499 = !DILocation(line: 304, column: 5, scope: !487)
!500 = !DILocation(line: 304, column: 9, scope: !487)
!501 = !DILocation(line: 304, column: 22, scope: !487)
!502 = !DILocation(line: 305, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !487, file: !1, line: 305, column: 8)
!504 = !DILocation(line: 305, column: 13, scope: !503)
!505 = !DILocation(line: 305, column: 8, scope: !487)
!506 = !DILocation(line: 306, column: 14, scope: !507)
!507 = distinct !DILexicalBlock(scope: !503, file: !1, line: 305, column: 27)
!508 = !DILocation(line: 307, column: 7, scope: !507)
!509 = !DILocation(line: 308, column: 7, scope: !507)
!510 = !DILocation(line: 310, column: 19, scope: !487)
!511 = !DILocation(line: 310, column: 5, scope: !487)
!512 = !DILocation(line: 310, column: 9, scope: !487)
!513 = !DILocation(line: 310, column: 17, scope: !487)
!514 = !DILocation(line: 311, column: 9, scope: !515)
!515 = distinct !DILexicalBlock(scope: !487, file: !1, line: 311, column: 8)
!516 = !DILocation(line: 311, column: 13, scope: !515)
!517 = !DILocation(line: 311, column: 8, scope: !487)
!518 = !DILocation(line: 312, column: 14, scope: !519)
!519 = distinct !DILexicalBlock(scope: !515, file: !1, line: 311, column: 22)
!520 = !DILocation(line: 313, column: 7, scope: !519)
!521 = !DILocation(line: 314, column: 7, scope: !519)
!522 = !DILocation(line: 315, column: 7, scope: !519)
!523 = !DILocation(line: 318, column: 9, scope: !524)
!524 = distinct !DILexicalBlock(scope: !487, file: !1, line: 318, column: 8)
!525 = !DILocation(line: 318, column: 8, scope: !487)
!526 = !DILocation(line: 320, column: 17, scope: !524)
!527 = !DILocation(line: 320, column: 15, scope: !524)
!528 = !DILocation(line: 320, column: 7, scope: !524)
!529 = !DILocation(line: 322, column: 8, scope: !530)
!530 = distinct !DILexicalBlock(scope: !487, file: !1, line: 322, column: 8)
!531 = !DILocation(line: 322, column: 8, scope: !487)
!532 = !DILocation(line: 324, column: 25, scope: !530)
!533 = !DILocation(line: 324, column: 7, scope: !530)
!534 = !DILocation(line: 324, column: 15, scope: !530)
!535 = !DILocation(line: 324, column: 23, scope: !530)
!536 = !DILocation(line: 326, column: 21, scope: !487)
!537 = !DILocation(line: 326, column: 25, scope: !487)
!538 = !DILocation(line: 326, column: 5, scope: !487)
!539 = !DILocation(line: 326, column: 9, scope: !487)
!540 = !DILocation(line: 326, column: 19, scope: !487)
!541 = !DILocation(line: 330, column: 5, scope: !487)
!542 = !DILocation(line: 330, column: 9, scope: !487)
!543 = !DILocation(line: 330, column: 21, scope: !487)
!544 = !DILocation(line: 332, column: 38, scope: !487)
!545 = !DILocation(line: 332, column: 22, scope: !487)
!546 = !DILocation(line: 332, column: 5, scope: !487)
!547 = !DILocation(line: 332, column: 9, scope: !487)
!548 = !DILocation(line: 332, column: 20, scope: !487)
!549 = !DILocation(line: 336, column: 12, scope: !487)
!550 = !DILocation(line: 336, column: 16, scope: !487)
!551 = !DILocation(line: 336, column: 5, scope: !487)
!552 = !DILocation(line: 338, column: 22, scope: !553)
!553 = distinct !DILexicalBlock(scope: !487, file: !1, line: 336, column: 27)
!554 = !DILocation(line: 338, column: 26, scope: !553)
!555 = !DILocation(line: 338, column: 14, scope: !553)
!556 = !DILocation(line: 338, column: 12, scope: !553)
!557 = !DILocation(line: 340, column: 15, scope: !553)
!558 = !DILocation(line: 340, column: 21, scope: !553)
!559 = !DILocation(line: 340, column: 7, scope: !553)
!560 = !DILocation(line: 340, column: 31, scope: !553)
!561 = !DILocation(line: 341, column: 43, scope: !553)
!562 = !DILocation(line: 341, column: 47, scope: !553)
!563 = !DILocation(line: 341, column: 26, scope: !553)
!564 = !DILocation(line: 341, column: 7, scope: !553)
!565 = !DILocation(line: 341, column: 13, scope: !553)
!566 = !DILocation(line: 341, column: 24, scope: !553)
!567 = !DILocation(line: 342, column: 46, scope: !553)
!568 = !DILocation(line: 342, column: 30, scope: !553)
!569 = !DILocation(line: 342, column: 24, scope: !553)
!570 = !DILocation(line: 342, column: 7, scope: !553)
!571 = !DILocation(line: 342, column: 13, scope: !553)
!572 = !DILocation(line: 342, column: 22, scope: !553)
!573 = !DILocation(line: 343, column: 7, scope: !553)
!574 = !DILocation(line: 356, column: 14, scope: !487)
!575 = !DILocation(line: 356, column: 12, scope: !487)
!576 = !DILocation(line: 357, column: 3, scope: !487)
!577 = !DILocation(line: 289, column: 50, scope: !578)
!578 = !DILexicalBlockFile(scope: !480, file: !1, discriminator: 2)
!579 = !DILocation(line: 289, column: 3, scope: !578)
!580 = !DILocation(line: 359, column: 6, scope: !581)
!581 = distinct !DILexicalBlock(scope: !178, file: !1, line: 359, column: 6)
!582 = !DILocation(line: 359, column: 6, scope: !178)
!583 = !DILocation(line: 360, column: 23, scope: !584)
!584 = distinct !DILexicalBlock(scope: !581, file: !1, line: 359, column: 14)
!585 = !DILocation(line: 360, column: 5, scope: !584)
!586 = !DILocation(line: 361, column: 13, scope: !584)
!587 = !DILocation(line: 362, column: 3, scope: !584)
!588 = !DILocation(line: 364, column: 10, scope: !178)
!589 = !DILocation(line: 364, column: 3, scope: !178)
!590 = !DILocation(line: 365, column: 1, scope: !178)
!591 = !DILocalVariable(name: "af", arg: 1, scope: !191, file: !1, line: 390, type: !136)
!592 = !DILocation(line: 390, column: 18, scope: !191)
!593 = !DILocalVariable(name: "inaddr", arg: 2, scope: !191, file: !1, line: 390, type: !194)
!594 = !DILocation(line: 390, column: 34, scope: !191)
!595 = !DILocalVariable(name: "hostname", arg: 3, scope: !191, file: !1, line: 390, type: !161)
!596 = !DILocation(line: 390, column: 54, scope: !191)
!597 = !DILocalVariable(name: "port", arg: 4, scope: !191, file: !1, line: 390, type: !136)
!598 = !DILocation(line: 390, column: 68, scope: !191)
!599 = !DILocalVariable(name: "ai", scope: !191, file: !1, line: 392, type: !130)
!600 = !DILocation(line: 392, column: 18, scope: !191)
!601 = !DILocalVariable(name: "h", scope: !191, file: !1, line: 401, type: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!603 = !DILocation(line: 401, column: 20, scope: !191)
!604 = !DILocalVariable(name: "buf", scope: !191, file: !1, line: 402, type: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "namebuff", file: !1, line: 368, size: 448, align: 64, elements: !607)
!607 = !{!608, !609, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "hostentry", scope: !606, file: !1, line: 369, baseType: !183, size: 256, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "addrentry", scope: !606, file: !1, line: 375, baseType: !610, size: 32, align: 32, offset: 256)
!610 = !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !1, line: 370, size: 32, align: 32, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ina4", scope: !610, file: !1, line: 371, baseType: !449, size: 32, align: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !606, file: !1, line: 376, baseType: !614, size: 128, align: 64, offset: 320)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, align: 64, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 2)
!617 = !DILocation(line: 402, column: 20, scope: !191)
!618 = !DILocalVariable(name: "addrentry", scope: !191, file: !1, line: 403, type: !142)
!619 = !DILocation(line: 403, column: 10, scope: !191)
!620 = !DILocalVariable(name: "hoststr", scope: !191, file: !1, line: 404, type: !142)
!621 = !DILocation(line: 404, column: 10, scope: !191)
!622 = !DILocalVariable(name: "addrsize", scope: !191, file: !1, line: 405, type: !114)
!623 = !DILocation(line: 405, column: 10, scope: !191)
!624 = !DILocation(line: 407, column: 3, scope: !191)
!625 = !DILocation(line: 407, column: 3, scope: !626)
!626 = !DILexicalBlockFile(scope: !627, file: !1, discriminator: 1)
!627 = distinct !DILexicalBlock(scope: !191, file: !1, line: 407, column: 3)
!628 = !DILocation(line: 409, column: 9, scope: !191)
!629 = !DILocation(line: 409, column: 7, scope: !191)
!630 = !DILocation(line: 410, column: 7, scope: !631)
!631 = distinct !DILexicalBlock(scope: !191, file: !1, line: 410, column: 6)
!632 = !DILocation(line: 410, column: 6, scope: !191)
!633 = !DILocation(line: 411, column: 5, scope: !631)
!634 = !DILocation(line: 413, column: 13, scope: !191)
!635 = !DILocation(line: 413, column: 11, scope: !191)
!636 = !DILocation(line: 414, column: 7, scope: !637)
!637 = distinct !DILexicalBlock(scope: !191, file: !1, line: 414, column: 6)
!638 = !DILocation(line: 414, column: 6, scope: !191)
!639 = !DILocation(line: 415, column: 5, scope: !640)
!640 = distinct !DILexicalBlock(scope: !637, file: !1, line: 414, column: 16)
!641 = !DILocation(line: 416, column: 5, scope: !640)
!642 = !DILocation(line: 419, column: 10, scope: !191)
!643 = !DILocation(line: 419, column: 3, scope: !191)
!644 = !DILocation(line: 421, column: 14, scope: !645)
!645 = distinct !DILexicalBlock(scope: !191, file: !1, line: 419, column: 14)
!646 = !DILocation(line: 422, column: 26, scope: !645)
!647 = !DILocation(line: 422, column: 31, scope: !645)
!648 = !DILocation(line: 422, column: 41, scope: !645)
!649 = !DILocation(line: 422, column: 17, scope: !645)
!650 = !DILocation(line: 422, column: 15, scope: !645)
!651 = !DILocation(line: 423, column: 12, scope: !645)
!652 = !DILocation(line: 423, column: 23, scope: !645)
!653 = !DILocation(line: 423, column: 5, scope: !645)
!654 = !DILocation(line: 424, column: 5, scope: !645)
!655 = !DILocation(line: 433, column: 5, scope: !645)
!656 = !DILocation(line: 434, column: 5, scope: !645)
!657 = !DILocation(line: 435, column: 5, scope: !645)
!658 = !DILocation(line: 438, column: 8, scope: !191)
!659 = !DILocation(line: 438, column: 13, scope: !191)
!660 = !DILocation(line: 438, column: 5, scope: !191)
!661 = !DILocation(line: 439, column: 15, scope: !191)
!662 = !DILocation(line: 439, column: 3, scope: !191)
!663 = !DILocation(line: 439, column: 6, scope: !191)
!664 = !DILocation(line: 439, column: 13, scope: !191)
!665 = !DILocation(line: 440, column: 3, scope: !191)
!666 = !DILocation(line: 440, column: 6, scope: !191)
!667 = !DILocation(line: 440, column: 16, scope: !191)
!668 = !DILocation(line: 441, column: 26, scope: !191)
!669 = !DILocation(line: 441, column: 19, scope: !191)
!670 = !DILocation(line: 441, column: 3, scope: !191)
!671 = !DILocation(line: 441, column: 6, scope: !191)
!672 = !DILocation(line: 441, column: 17, scope: !191)
!673 = !DILocation(line: 442, column: 24, scope: !191)
!674 = !DILocation(line: 442, column: 17, scope: !191)
!675 = !DILocation(line: 442, column: 3, scope: !191)
!676 = !DILocation(line: 442, column: 6, scope: !191)
!677 = !DILocation(line: 442, column: 15, scope: !191)
!678 = !DILocation(line: 443, column: 21, scope: !191)
!679 = !DILocation(line: 443, column: 26, scope: !191)
!680 = !DILocation(line: 443, column: 3, scope: !191)
