; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/formdata.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ContentType = type { i8*, i8* }
%struct.curl_httppost = type { %struct.curl_httppost*, i8*, i64, i8*, i64, i8*, i64, i8*, %struct.curl_slist*, %struct.curl_httppost*, i64, i8*, i8*, i64 }
%struct.curl_slist = type { i8*, %struct.curl_slist* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.FormInfo = type { i8*, i8, i64, i8*, i8, i64, i8*, i8, i64, i8*, i64, i8*, i8, i8*, %struct.curl_slist*, %struct.FormInfo* }
%struct.curl_forms = type { i32, i8* }
%struct.FormData = type { %struct.FormData*, i32, i8*, i64 }
%struct.Form = type { %struct.FormData*, i64, %struct._IO_FILE*, i64 (i8*, i64, i64, i8*)* }

!200 = !DIEnumerator(name: "IMAP_AUTHENTICATE", value: 5)
!201 = !DIEnumerator(name: "IMAP_LOGIN", value: 6)
!202 = !DIEnumerator(name: "IMAP_LIST", value: 7)
!203 = !DIEnumerator(name: "IMAP_SELECT", value: 8)
!204 = !DIEnumerator(name: "IMAP_FETCH", value: 9)
!205 = !DIEnumerator(name: "IMAP_FETCH_FINAL", value: 10)
!206 = !DIEnumerator(name: "IMAP_APPEND", value: 11)
!207 = !DIEnumerator(name: "IMAP_APPEND_FINAL", value: 12)
!208 = !DIEnumerator(name: "IMAP_SEARCH", value: 13)
!209 = !DIEnumerator(name: "IMAP_LOGOUT", value: 14)
!210 = !DIEnumerator(name: "IMAP_LAST", value: 15)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 58, size: 32, align: 32, elements: !213)
!212 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_sasl.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!214 = !DIEnumerator(name: "SASL_STOP", value: 0)
!215 = !DIEnumerator(name: "SASL_PLAIN", value: 1)
!216 = !DIEnumerator(name: "SASL_LOGIN", value: 2)
!217 = !DIEnumerator(name: "SASL_LOGIN_PASSWD", value: 3)
!218 = !DIEnumerator(name: "SASL_EXTERNAL", value: 4)
!219 = !DIEnumerator(name: "SASL_CRAMMD5", value: 5)
!220 = !DIEnumerator(name: "SASL_DIGESTMD5", value: 6)
!221 = !DIEnumerator(name: "SASL_DIGESTMD5_RESP", value: 7)
!222 = !DIEnumerator(name: "SASL_NTLM", value: 8)
!223 = !DIEnumerator(name: "SASL_NTLM_TYPE2MSG", value: 9)
!224 = !DIEnumerator(name: "SASL_GSSAPI", value: 10)
!225 = !DIEnumerator(name: "SASL_GSSAPI_TOKEN", value: 11)
!226 = !DIEnumerator(name: "SASL_GSSAPI_NO_DATA", value: 12)
!227 = !DIEnumerator(name: "SASL_OAUTH2", value: 13)
!228 = !DIEnumerator(name: "SASL_OAUTH2_RESP", value: 14)
!229 = !DIEnumerator(name: "SASL_CANCEL", value: 15)
!230 = !DIEnumerator(name: "SASL_FINAL", value: 16)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 31, size: 32, align: 32, elements: !233)
!232 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/pop3.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!234 = !DIEnumerator(name: "POP3_STOP", value: 0)
!235 = !DIEnumerator(name: "POP3_SERVERGREET", value: 1)
!236 = !DIEnumerator(name: "POP3_CAPA", value: 2)
!237 = !DIEnumerator(name: "POP3_STARTTLS", value: 3)
!238 = !DIEnumerator(name: "POP3_UPGRADETLS", value: 4)
!239 = !DIEnumerator(name: "POP3_AUTH", value: 5)
!240 = !DIEnumerator(name: "POP3_APOP", value: 6)
!241 = !DIEnumerator(name: "POP3_USER", value: 7)
!242 = !DIEnumerator(name: "POP3_PASS", value: 8)
!243 = !DIEnumerator(name: "POP3_COMMAND", value: 9)
!244 = !DIEnumerator(name: "POP3_QUIT", value: 10)
!245 = !DIEnumerator(name: "POP3_LAST", value: 11)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !247, line: 31, size: 32, align: 32, elements: !248)
!247 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/smtp.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!249 = !DIEnumerator(name: "SMTP_STOP", value: 0)
!250 = !DIEnumerator(name: "SMTP_SERVERGREET", value: 1)
!251 = !DIEnumerator(name: "SMTP_EHLO", value: 2)
!252 = !DIEnumerator(name: "SMTP_HELO", value: 3)
!253 = !DIEnumerator(name: "SMTP_STARTTLS", value: 4)
!254 = !DIEnumerator(name: "SMTP_UPGRADETLS", value: 5)
!255 = !DIEnumerator(name: "SMTP_AUTH", value: 6)
!256 = !DIEnumerator(name: "SMTP_COMMAND", value: 7)
!257 = !DIEnumerator(name: "SMTP_MAIL", value: 8)
!258 = !DIEnumerator(name: "SMTP_RCPT", value: 9)
!259 = !DIEnumerator(name: "SMTP_DATA", value: 10)
!260 = !DIEnumerator(name: "SMTP_POSTDATA", value: 11)
!261 = !DIEnumerator(name: "SMTP_QUIT", value: 12)
!262 = !DIEnumerator(name: "SMTP_LAST", value: 13)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "smb_conn_state", file: !264, line: 25, size: 32, align: 32, elements: !265)
!264 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/smb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!265 = !{!266, !267, !268, !269, !270}
!266 = !DIEnumerator(name: "SMB_NOT_CONNECTED", value: 0)
!267 = !DIEnumerator(name: "SMB_CONNECTING", value: 1)
!268 = !DIEnumerator(name: "SMB_NEGOTIATE", value: 2)
!269 = !DIEnumerator(name: "SMB_SETUP", value: 3)
!270 = !DIEnumerator(name: "SMB_CONNECTED", value: 4)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !272, file: !140, line: 1133, size: 32, align: 32, elements: !1693)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "connectdata", file: !140, line: 895, size: 13440, align: 64, elements: !273)
!273 = !{!274, !1274, !1286, !1287, !1288, !1289, !1290, !1316, !1317, !1321, !1322, !1323, !1324, !1331, !1332, !1333, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1360, !1361, !1363, !1370, !1376, !1385, !1386, !1387, !1388, !1389, !1425, !1426, !1427, !1428, !1482, !1483, !1484, !1485, !1486, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1512, !1513, !1514, !1515, !1678, !1679, !1680, !1681, !1682, !1683, !1685, !1692}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !140, line: 899, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_easy", file: !140, line: 1801, size: 160192, align: 64, elements: !277)
!277 = !{!278, !279, !280, !282, !307, !309, !332, !338, !339, !393, !469, !470, !473, !547, !1024, !1033, !1060, !1096, !1200, !1223, !1253, !1273}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !140, line: 1803, baseType: !275, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !276, file: !140, line: 1804, baseType: !275, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "easy_conn", scope: !276, file: !140, line: 1806, baseType: !281, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !276, file: !140, line: 1808, baseType: !283, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLMstate", file: !284, line: 59, baseType: !285)
!284 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/multihandle.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 35, size: 32, align: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!287 = !DIEnumerator(name: "CURLM_STATE_INIT", value: 0)
!288 = !DIEnumerator(name: "CURLM_STATE_CONNECT_PEND", value: 1)
!289 = !DIEnumerator(name: "CURLM_STATE_CONNECT", value: 2)
!290 = !DIEnumerator(name: "CURLM_STATE_WAITRESOLVE", value: 3)
!291 = !DIEnumerator(name: "CURLM_STATE_WAITCONNECT", value: 4)
!292 = !DIEnumerator(name: "CURLM_STATE_WAITPROXYCONNECT", value: 5)
!293 = !DIEnumerator(name: "CURLM_STATE_SENDPROTOCONNECT", value: 6)
!294 = !DIEnumerator(name: "CURLM_STATE_PROTOCONNECT", value: 7)
!295 = !DIEnumerator(name: "CURLM_STATE_WAITDO", value: 8)
!296 = !DIEnumerator(name: "CURLM_STATE_DO", value: 9)
!297 = !DIEnumerator(name: "CURLM_STATE_DOING", value: 10)
!298 = !DIEnumerator(name: "CURLM_STATE_DO_MORE", value: 11)
!299 = !DIEnumerator(name: "CURLM_STATE_DO_DONE", value: 12)
!300 = !DIEnumerator(name: "CURLM_STATE_WAITPERFORM", value: 13)
!301 = !DIEnumerator(name: "CURLM_STATE_PERFORM", value: 14)
!302 = !DIEnumerator(name: "CURLM_STATE_TOOFAST", value: 15)
!303 = !DIEnumerator(name: "CURLM_STATE_DONE", value: 16)
!304 = !DIEnumerator(name: "CURLM_STATE_COMPLETED", value: 17)
!305 = !DIEnumerator(name: "CURLM_STATE_MSGSENT", value: 18)
!306 = !DIEnumerator(name: "CURLM_STATE_LAST", value: 19)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !276, file: !140, line: 1809, baseType: !308, size: 32, align: 32, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLcode", file: !4, line: 561, baseType: !23)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !276, file: !140, line: 1811, baseType: !310, size: 192, align: 64, offset: 256)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_message", file: !284, line: 27, size: 192, align: 64, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "extmsg", scope: !310, file: !284, line: 29, baseType: !313, size: 192, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "CURLMsg", file: !314, line: 93, size: 192, align: 64, elements: !315)
!314 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/multi.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!315 = !{!316, !323, !326}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !313, file: !314, line: 94, baseType: !317, size: 32, align: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLMSG", file: !314, line: 91, baseType: !318)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 86, size: 32, align: 32, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIEnumerator(name: "CURLMSG_NONE", value: 0)
!321 = !DIEnumerator(name: "CURLMSG_DONE", value: 1)
!322 = !DIEnumerator(name: "CURLMSG_LAST", value: 2)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "easy_handle", scope: !313, file: !314, line: 95, baseType: !324, size: 64, align: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURL", file: !4, line: 100, baseType: !276)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !314, line: 99, baseType: !327, size: 64, align: 64, offset: 128)
!327 = !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !314, line: 96, size: 64, align: 64, elements: !328)
!328 = !{!329, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "whatever", scope: !327, file: !314, line: 97, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !327, file: !314, line: 98, baseType: !308, size: 32, align: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !276, file: !140, line: 1817, baseType: !333, size: 160, align: 32, offset: 448)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 160, align: 32, elements: !336)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socket_t", file: !4, line: 131, baseType: !335)
!335 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!336 = !{!337}
!337 = !DISubrange(count: 5)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "numsocks", scope: !276, file: !140, line: 1818, baseType: !335, size: 32, align: 32, offset: 608)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dns", scope: !276, file: !140, line: 1820, baseType: !340, size: 128, align: 64, offset: 640)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Names", file: !140, line: 1781, size: 128, align: 64, elements: !341)
!341 = !{!342, !386}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hostcache", scope: !340, file: !140, line: 1782, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_hash", file: !345, line: 46, size: 384, align: 64, elements: !346)
!345 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/hash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!346 = !{!347, !369, !374, !379, !384, !385}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !344, file: !345, line: 47, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist", file: !350, line: 37, size: 256, align: 64, elements: !351)
!350 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/llist.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!351 = !{!352, !359, !360, !365}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !349, file: !350, line: 38, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist_element", file: !350, line: 30, size: 192, align: 64, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !354, file: !350, line: 31, baseType: !330, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !350, line: 33, baseType: !353, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !350, line: 34, baseType: !353, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !349, file: !350, line: 39, baseType: !353, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !349, file: !350, line: 41, baseType: !361, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_llist_dtor", file: !350, line: 28, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !330, !330}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !350, line: 43, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !367, line: 62, baseType: !368)
!367 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!368 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !344, file: !345, line: 50, baseType: !370, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_function", file: !345, line: 32, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!366, !330, !366, !366}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "comp_func", scope: !344, file: !345, line: 53, baseType: !375, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "comp_function", file: !345, line: 39, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!366, !330, !366, !330, !366}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !344, file: !345, line: 54, baseType: !380, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_hash_dtor", file: !345, line: 44, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !330}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !344, file: !345, line: 55, baseType: !335, size: 32, align: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !344, file: !345, line: 56, baseType: !366, size: 64, align: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hostcachetype", scope: !340, file: !140, line: 1788, baseType: !387, size: 32, align: 32, offset: 64)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !340, file: !140, line: 1783, size: 32, align: 32, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIEnumerator(name: "HCACHE_NONE", value: 0)
!390 = !DIEnumerator(name: "HCACHE_GLOBAL", value: 1)
!391 = !DIEnumerator(name: "HCACHE_MULTI", value: 2)
!392 = !DIEnumerator(name: "HCACHE_SHARED", value: 3)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !276, file: !140, line: 1821, baseType: !394, size: 64, align: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_multi", file: !284, line: 70, size: 3840, align: 64, elements: !396)
!396 = !{!397, !399, !400, !401, !402, !403, !404, !405, !410, !411, !418, !419, !420, !439, !440, !441, !443, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !467, !468}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !284, line: 73, baseType: !398, size: 64, align: 64)
!398 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "easyp", scope: !395, file: !284, line: 76, baseType: !275, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "easylp", scope: !395, file: !284, line: 77, baseType: !275, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_easy", scope: !395, file: !284, line: 79, baseType: !335, size: 32, align: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_alive", scope: !395, file: !284, line: 80, baseType: !335, size: 32, align: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "msglist", scope: !395, file: !284, line: 83, baseType: !349, size: 256, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !395, file: !284, line: 85, baseType: !349, size: 256, align: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "socket_cb", scope: !395, file: !284, line: 89, baseType: !406, size: 64, align: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socket_callback", file: !314, line: 268, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!335, !324, !334, !335, !330, !330}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "socket_userp", scope: !395, file: !284, line: 90, baseType: !330, size: 64, align: 64, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "push_cb", scope: !395, file: !284, line: 93, baseType: !412, size: 64, align: 64, offset: 896)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_push_callback", file: !314, line: 429, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!335, !324, !324, !366, !416, !330}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_pushheaders", file: !314, line: 422, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "push_userp", scope: !395, file: !284, line: 94, baseType: !330, size: 64, align: 64, offset: 960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "hostcache", scope: !395, file: !284, line: 97, baseType: !344, size: 384, align: 64, offset: 1024)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timetree", scope: !395, file: !284, line: 101, baseType: !421, size: 64, align: 64, offset: 1408)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_tree", file: !423, line: 26, size: 448, align: 64, elements: !424)
!423 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/splay.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!424 = !{!425, !426, !427, !428, !429, !438}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "smaller", scope: !422, file: !423, line: 27, baseType: !421, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "larger", scope: !422, file: !423, line: 28, baseType: !421, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "samen", scope: !422, file: !423, line: 29, baseType: !421, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "samep", scope: !422, file: !423, line: 30, baseType: !421, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !422, file: !423, line: 31, baseType: !430, size: 128, align: 64, offset: 256)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !431, line: 30, size: 128, align: 64, elements: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!432 = !{!433, !436}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !430, file: !431, line: 32, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !435, line: 139, baseType: !398)
!435 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !430, file: !431, line: 33, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !435, line: 141, baseType: !398)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !422, file: !423, line: 32, baseType: !330, size: 64, align: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sockhash", scope: !395, file: !284, line: 106, baseType: !344, size: 384, align: 64, offset: 1472)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining", scope: !395, file: !284, line: 109, baseType: !398, size: 64, align: 64, offset: 1856)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "recheckstate", scope: !395, file: !284, line: 111, baseType: !442, size: 8, align: 8, offset: 1920)
!442 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cache", scope: !395, file: !284, line: 114, baseType: !444, size: 640, align: 64, offset: 1984)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "conncache", file: !445, line: 26, size: 640, align: 64, elements: !446)
!445 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/conncache.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!446 = !{!447, !448, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !444, file: !445, line: 27, baseType: !344, size: 384, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "num_connections", scope: !444, file: !445, line: 28, baseType: !366, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next_connection_id", scope: !444, file: !445, line: 29, baseType: !398, size: 64, align: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "last_cleanup", scope: !444, file: !445, line: 30, baseType: !430, size: 128, align: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "closure_handle", scope: !395, file: !284, line: 118, baseType: !275, size: 64, align: 64, offset: 2624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "maxconnects", scope: !395, file: !284, line: 120, baseType: !398, size: 64, align: 64, offset: 2688)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "max_host_connections", scope: !395, file: !284, line: 123, baseType: !398, size: 64, align: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "max_total_connections", scope: !395, file: !284, line: 126, baseType: !398, size: 64, align: 64, offset: 2816)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "max_pipeline_length", scope: !395, file: !284, line: 129, baseType: !398, size: 64, align: 64, offset: 2880)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "content_length_penalty_size", scope: !395, file: !284, line: 132, baseType: !398, size: 64, align: 64, offset: 2944)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_length_penalty_size", scope: !395, file: !284, line: 137, baseType: !398, size: 64, align: 64, offset: 3008)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining_site_bl", scope: !395, file: !284, line: 141, baseType: !349, size: 256, align: 64, offset: 3072)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining_server_bl", scope: !395, file: !284, line: 144, baseType: !349, size: 256, align: 64, offset: 3328)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cb", scope: !395, file: !284, line: 148, baseType: !461, size: 64, align: 64, offset: 3584)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_multi_timer_callback", file: !314, line: 285, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!335, !465, !398, !330}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLM", file: !314, line: 56, baseType: !395)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "timer_userp", scope: !395, file: !284, line: 149, baseType: !330, size: 64, align: 64, offset: 3648)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "timer_lastcall", scope: !395, file: !284, line: 150, baseType: !430, size: 128, align: 64, offset: 3712)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "multi_easy", scope: !276, file: !140, line: 1824, baseType: !394, size: 64, align: 64, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "share", scope: !276, file: !140, line: 1827, baseType: !471, size: 64, align: 64, offset: 896)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_share", file: !4, line: 101, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !276, file: !140, line: 1828, baseType: !474, size: 2496, align: 64, offset: 960)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "SingleRequest", file: !140, line: 658, size: 2496, align: 64, elements: !475)
!475 = !{!476, !479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !496, !497, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !516, !523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !541, !542, !543, !544, !545, !546}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !474, file: !140, line: 659, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_off_t", file: !478, line: 216, baseType: !398)
!478 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/curlbuild.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bytecountp", scope: !474, file: !140, line: 660, baseType: !480, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "maxdownload", scope: !474, file: !140, line: 662, baseType: !477, size: 64, align: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "writebytecountp", scope: !474, file: !140, line: 664, baseType: !480, size: 64, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bytecount", scope: !474, file: !140, line: 666, baseType: !477, size: 64, align: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "writebytecount", scope: !474, file: !140, line: 667, baseType: !477, size: 64, align: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "headerbytecount", scope: !474, file: !140, line: 669, baseType: !398, size: 64, align: 64, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "deductheadercount", scope: !474, file: !140, line: 670, baseType: !398, size: 64, align: 64, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !474, file: !140, line: 676, baseType: !430, size: 128, align: 64, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !474, file: !140, line: 677, baseType: !430, size: 128, align: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !474, file: !140, line: 678, baseType: !442, size: 8, align: 8, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "badheader", scope: !474, file: !140, line: 684, baseType: !491, size: 32, align: 32, offset: 800)
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !474, file: !140, line: 679, size: 32, align: 32, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIEnumerator(name: "HEADER_NORMAL", value: 0)
!494 = !DIEnumerator(name: "HEADER_PARTHEADER", value: 1)
!495 = !DIEnumerator(name: "HEADER_ALLBAD", value: 2)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "headerline", scope: !474, file: !140, line: 686, baseType: !335, size: 32, align: 32, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hbufp", scope: !474, file: !140, line: 688, baseType: !498, size: 64, align: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "hbuflen", scope: !474, file: !140, line: 689, baseType: !366, size: 64, align: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !474, file: !140, line: 690, baseType: !498, size: 64, align: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "str_start", scope: !474, file: !140, line: 691, baseType: !498, size: 64, align: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "end_ptr", scope: !474, file: !140, line: 692, baseType: !498, size: 64, align: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !474, file: !140, line: 693, baseType: !498, size: 64, align: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "content_range", scope: !474, file: !140, line: 694, baseType: !442, size: 8, align: 8, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !474, file: !140, line: 695, baseType: !477, size: 64, align: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "httpcode", scope: !474, file: !140, line: 697, baseType: !335, size: 32, align: 32, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "start100", scope: !474, file: !140, line: 699, baseType: !430, size: 128, align: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "exp100", scope: !474, file: !140, line: 700, baseType: !510, size: 32, align: 32, offset: 1600)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expect100", file: !140, line: 636, size: 32, align: 32, elements: !511)
!511 = !{!512, !513, !514, !515}
!512 = !DIEnumerator(name: "EXP100_SEND_DATA", value: 0)
!513 = !DIEnumerator(name: "EXP100_AWAITING_CONTINUE", value: 1)
!514 = !DIEnumerator(name: "EXP100_SENDING_REQUEST", value: 2)
!515 = !DIEnumerator(name: "EXP100_FAILED", value: 3)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "upgr101", scope: !474, file: !140, line: 701, baseType: !517, size: 32, align: 32, offset: 1632)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "upgrade101", file: !140, line: 644, size: 32, align: 32, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIEnumerator(name: "UPGR101_INIT", value: 0)
!520 = !DIEnumerator(name: "UPGR101_REQUESTED", value: 1)
!521 = !DIEnumerator(name: "UPGR101_RECEIVED", value: 2)
!522 = !DIEnumerator(name: "UPGR101_WORKING", value: 3)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "auto_decoding", scope: !474, file: !140, line: 703, baseType: !335, size: 32, align: 32, offset: 1664)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "timeofdoc", scope: !474, file: !140, line: 715, baseType: !525, size: 64, align: 64, offset: 1728)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !526, line: 75, baseType: !434)
!526 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bodywrites", scope: !474, file: !140, line: 716, baseType: !398, size: 64, align: 64, offset: 1792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !474, file: !140, line: 718, baseType: !498, size: 64, align: 64, offset: 1856)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "uploadbuf", scope: !474, file: !140, line: 719, baseType: !498, size: 64, align: 64, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !474, file: !140, line: 720, baseType: !334, size: 32, align: 32, offset: 1984)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "keepon", scope: !474, file: !140, line: 722, baseType: !335, size: 32, align: 32, offset: 2016)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "upload_done", scope: !474, file: !140, line: 724, baseType: !442, size: 8, align: 8, offset: 2048)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ignorebody", scope: !474, file: !140, line: 727, baseType: !442, size: 8, align: 8, offset: 2056)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ignorecl", scope: !474, file: !140, line: 728, baseType: !442, size: 8, align: 8, offset: 2064)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !474, file: !140, line: 731, baseType: !498, size: 64, align: 64, offset: 2112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "newurl", scope: !474, file: !140, line: 733, baseType: !498, size: 64, align: 64, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "upload_present", scope: !474, file: !140, line: 738, baseType: !538, size: 64, align: 64, offset: 2240)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !539, line: 109, baseType: !540)
!539 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !435, line: 172, baseType: !398)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "upload_fromhere", scope: !474, file: !140, line: 744, baseType: !498, size: 64, align: 64, offset: 2304)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !474, file: !140, line: 746, baseType: !442, size: 8, align: 8, offset: 2368)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "upload_chunky", scope: !474, file: !140, line: 747, baseType: !442, size: 8, align: 8, offset: 2376)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getheader", scope: !474, file: !140, line: 749, baseType: !442, size: 8, align: 8, offset: 2384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "forbidchunk", scope: !474, file: !140, line: 751, baseType: !442, size: 8, align: 8, offset: 2392)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "protop", scope: !474, file: !140, line: 755, baseType: !330, size: 64, align: 64, offset: 2432)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !276, file: !140, line: 1829, baseType: !548, size: 13760, align: 64, offset: 3456)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserDefined", file: !140, line: 1558, size: 13760, align: 64, elements: !549)
!549 = !{!550, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !625, !626, !627, !628, !633, !634, !635, !637, !638, !639, !645, !650, !666, !678, !689, !690, !714, !715, !720, !721, !722, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !749, !750, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !789, !790, !802, !803, !839, !840, !844, !846, !847, !848, !849, !850, !851, !852, !859, !860, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !912, !913, !914, !915, !916, !917, !918, !919, !928, !936, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !960, !961, !962, !963, !964, !965, !982, !983, !984, !991, !996, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1023}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !548, file: !140, line: 1559, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !553, line: 48, baseType: !554)
!553 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !555, line: 245, size: 1728, align: 64, elements: !556)
!555 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !577, !578, !579, !580, !582, !584, !586, !590, !593, !595, !596, !597, !598, !599, !600, !601}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !554, file: !555, line: 246, baseType: !335, size: 32, align: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !554, file: !555, line: 251, baseType: !498, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !554, file: !555, line: 252, baseType: !498, size: 64, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !554, file: !555, line: 253, baseType: !498, size: 64, align: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !554, file: !555, line: 254, baseType: !498, size: 64, align: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !554, file: !555, line: 255, baseType: !498, size: 64, align: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !554, file: !555, line: 256, baseType: !498, size: 64, align: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !554, file: !555, line: 257, baseType: !498, size: 64, align: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !554, file: !555, line: 258, baseType: !498, size: 64, align: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !554, file: !555, line: 260, baseType: !498, size: 64, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !554, file: !555, line: 261, baseType: !498, size: 64, align: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !554, file: !555, line: 262, baseType: !498, size: 64, align: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !554, file: !555, line: 264, baseType: !570, size: 64, align: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !555, line: 160, size: 192, align: 64, elements: !572)
!572 = !{!573, !574, !576}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !571, file: !555, line: 161, baseType: !570, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !571, file: !555, line: 162, baseType: !575, size: 64, align: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !571, file: !555, line: 166, baseType: !335, size: 32, align: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !554, file: !555, line: 266, baseType: !575, size: 64, align: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !554, file: !555, line: 268, baseType: !335, size: 32, align: 32, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !554, file: !555, line: 272, baseType: !335, size: 32, align: 32, offset: 928)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !554, file: !555, line: 274, baseType: !581, size: 64, align: 64, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !435, line: 131, baseType: !398)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !554, file: !555, line: 278, baseType: !583, size: 16, align: 16, offset: 1024)
!583 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !554, file: !555, line: 279, baseType: !585, size: 8, align: 8, offset: 1040)
!585 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !554, file: !555, line: 280, baseType: !587, size: 8, align: 8, offset: 1048)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 8, align: 8, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 1)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !554, file: !555, line: 284, baseType: !591, size: 64, align: 64, offset: 1088)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !555, line: 154, baseType: null)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !554, file: !555, line: 293, baseType: !594, size: 64, align: 64, offset: 1152)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !435, line: 132, baseType: !398)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !554, file: !555, line: 302, baseType: !330, size: 64, align: 64, offset: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !554, file: !555, line: 303, baseType: !330, size: 64, align: 64, offset: 1280)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !554, file: !555, line: 304, baseType: !330, size: 64, align: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !554, file: !555, line: 305, baseType: !330, size: 64, align: 64, offset: 1408)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !554, file: !555, line: 306, baseType: !366, size: 64, align: 64, offset: 1472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !554, file: !555, line: 308, baseType: !335, size: 32, align: 32, offset: 1536)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !554, file: !555, line: 310, baseType: !602, size: 160, align: 8, offset: 1568)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 160, align: 8, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 20)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "debugdata", scope: !548, file: !140, line: 1560, baseType: !330, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "errorbuffer", scope: !548, file: !140, line: 1561, baseType: !498, size: 64, align: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "proxyport", scope: !548, file: !140, line: 1562, baseType: !398, size: 64, align: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !548, file: !140, line: 1565, baseType: !330, size: 64, align: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "in_set", scope: !548, file: !140, line: 1566, baseType: !330, size: 64, align: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "writeheader", scope: !548, file: !140, line: 1567, baseType: !330, size: 64, align: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_out", scope: !548, file: !140, line: 1568, baseType: !330, size: 64, align: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "use_port", scope: !548, file: !140, line: 1569, baseType: !398, size: 64, align: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "httpauth", scope: !548, file: !140, line: 1570, baseType: !368, size: 64, align: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "proxyauth", scope: !548, file: !140, line: 1571, baseType: !368, size: 64, align: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "followlocation", scope: !548, file: !140, line: 1572, baseType: !398, size: 64, align: 64, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "maxredirs", scope: !548, file: !140, line: 1573, baseType: !398, size: 64, align: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "keep_post", scope: !548, file: !140, line: 1576, baseType: !335, size: 32, align: 32, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "free_referer", scope: !548, file: !140, line: 1578, baseType: !442, size: 8, align: 8, offset: 864)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "postfields", scope: !548, file: !140, line: 1580, baseType: !330, size: 64, align: 64, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "seek_func", scope: !548, file: !140, line: 1581, baseType: !621, size: 64, align: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_seek_callback", file: !4, line: 324, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!335, !330, !477, !335}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "postfieldsize", scope: !548, file: !140, line: 1582, baseType: !477, size: 64, align: 64, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "localport", scope: !548, file: !140, line: 1585, baseType: !583, size: 16, align: 16, offset: 1088)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "localportrange", scope: !548, file: !140, line: 1586, baseType: !335, size: 32, align: 32, offset: 1120)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_func", scope: !548, file: !140, line: 1588, baseType: !629, size: 64, align: 64, offset: 1152)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_write_callback", file: !4, line: 223, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!366, !498, !366, !366, !330}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_header", scope: !548, file: !140, line: 1589, baseType: !629, size: 64, align: 64, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_rtp", scope: !548, file: !140, line: 1590, baseType: !629, size: 64, align: 64, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fread_func_set", scope: !548, file: !140, line: 1591, baseType: !636, size: 64, align: 64, offset: 1344)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_read_callback", file: !4, line: 335, baseType: !630)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "is_fread_set", scope: !548, file: !140, line: 1592, baseType: !335, size: 32, align: 32, offset: 1408)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "is_fwrite_set", scope: !548, file: !140, line: 1593, baseType: !335, size: 32, align: 32, offset: 1440)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fprogress", scope: !548, file: !140, line: 1594, baseType: !640, size: 64, align: 64, offset: 1472)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_progress_callback", file: !4, line: 183, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!335, !330, !644, !644, !644, !644}
!644 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fxferinfo", scope: !548, file: !140, line: 1595, baseType: !646, size: 64, align: 64, offset: 1536)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_xferinfo_callback", file: !4, line: 191, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!335, !330, !477, !477, !477, !477}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fdebug", scope: !548, file: !140, line: 1596, baseType: !651, size: 64, align: 64, offset: 1600)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_debug_callback", file: !4, line: 420, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!335, !324, !655, !498, !366, !330}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_infotype", file: !4, line: 418, baseType: !656)
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 409, size: 32, align: 32, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665}
!658 = !DIEnumerator(name: "CURLINFO_TEXT", value: 0)
!659 = !DIEnumerator(name: "CURLINFO_HEADER_IN", value: 1)
!660 = !DIEnumerator(name: "CURLINFO_HEADER_OUT", value: 2)
!661 = !DIEnumerator(name: "CURLINFO_DATA_IN", value: 3)
!662 = !DIEnumerator(name: "CURLINFO_DATA_OUT", value: 4)
!663 = !DIEnumerator(name: "CURLINFO_SSL_DATA_IN", value: 5)
!664 = !DIEnumerator(name: "CURLINFO_SSL_DATA_OUT", value: 6)
!665 = !DIEnumerator(name: "CURLINFO_END", value: 7)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl_func", scope: !548, file: !140, line: 1597, baseType: !667, size: 64, align: 64, offset: 1664)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ioctl_callback", file: !4, line: 388, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!671, !324, !335, !330}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "curlioerr", file: !4, line: 380, baseType: !672)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 375, size: 32, align: 32, elements: !673)
!673 = !{!674, !675, !676, !677}
!674 = !DIEnumerator(name: "CURLIOE_OK", value: 0)
!675 = !DIEnumerator(name: "CURLIOE_UNKNOWNCMD", value: 1)
!676 = !DIEnumerator(name: "CURLIOE_FAILRESTART", value: 2)
!677 = !DIEnumerator(name: "CURLIOE_LAST", value: 3)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fsockopt", scope: !548, file: !140, line: 1598, baseType: !679, size: 64, align: 64, offset: 1728)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_sockopt_callback", file: !4, line: 353, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!335, !330, !334, !683}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "curlsocktype", file: !4, line: 344, baseType: !684)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 340, size: 32, align: 32, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIEnumerator(name: "CURLSOCKTYPE_IPCXN", value: 0)
!687 = !DIEnumerator(name: "CURLSOCKTYPE_ACCEPT", value: 1)
!688 = !DIEnumerator(name: "CURLSOCKTYPE_LAST", value: 2)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sockopt_client", scope: !548, file: !140, line: 1599, baseType: !330, size: 64, align: 64, offset: 1792)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fopensocket", scope: !548, file: !140, line: 1600, baseType: !691, size: 64, align: 64, offset: 1856)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_opensocket_callback", file: !4, line: 368, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!334, !330, !683, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_sockaddr", file: !4, line: 357, size: 256, align: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !703}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !696, file: !4, line: 358, baseType: !335, size: 32, align: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "socktype", scope: !696, file: !4, line: 359, baseType: !335, size: 32, align: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !696, file: !4, line: 360, baseType: !335, size: 32, align: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "addrlen", scope: !696, file: !4, line: 361, baseType: !702, size: 32, align: 32, offset: 96)
!702 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !696, file: !4, line: 364, baseType: !704, size: 128, align: 16, offset: 128)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !705, line: 149, size: 128, align: 16, elements: !706)
!705 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!706 = !{!707, !710}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !704, file: !705, line: 151, baseType: !708, size: 16, align: 16)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !709, line: 28, baseType: !583)
!709 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !704, file: !705, line: 152, baseType: !711, size: 112, align: 8, offset: 16)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 112, align: 8, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 14)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "opensocket_client", scope: !548, file: !140, line: 1603, baseType: !330, size: 64, align: 64, offset: 1920)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fclosesocket", scope: !548, file: !140, line: 1604, baseType: !716, size: 64, align: 64, offset: 1984)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_closesocket_callback", file: !4, line: 373, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!335, !330, !334}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "closesocket_client", scope: !548, file: !140, line: 1606, baseType: !330, size: 64, align: 64, offset: 2048)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "seek_client", scope: !548, file: !140, line: 1608, baseType: !330, size: 64, align: 64, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "convfromnetwork", scope: !548, file: !140, line: 1611, baseType: !723, size: 64, align: 64, offset: 2176)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_conv_callback", file: !4, line: 637, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!308, !498, !366}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "convtonetwork", scope: !548, file: !140, line: 1613, baseType: !723, size: 64, align: 64, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "convfromutf8", scope: !548, file: !140, line: 1615, baseType: !723, size: 64, align: 64, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "progress_client", scope: !548, file: !140, line: 1617, baseType: !330, size: 64, align: 64, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl_client", scope: !548, file: !140, line: 1618, baseType: !330, size: 64, align: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !548, file: !140, line: 1619, baseType: !398, size: 64, align: 64, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "connecttimeout", scope: !548, file: !140, line: 1620, baseType: !398, size: 64, align: 64, offset: 2560)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "accepttimeout", scope: !548, file: !140, line: 1621, baseType: !398, size: 64, align: 64, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "server_response_timeout", scope: !548, file: !140, line: 1622, baseType: !398, size: 64, align: 64, offset: 2688)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_blksize", scope: !548, file: !140, line: 1623, baseType: !398, size: 64, align: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_no_options", scope: !548, file: !140, line: 1624, baseType: !442, size: 8, align: 8, offset: 2816)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !548, file: !140, line: 1625, baseType: !477, size: 64, align: 64, offset: 2880)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "low_speed_limit", scope: !548, file: !140, line: 1626, baseType: !398, size: 64, align: 64, offset: 2944)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "low_speed_time", scope: !548, file: !140, line: 1627, baseType: !398, size: 64, align: 64, offset: 3008)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "max_send_speed", scope: !548, file: !140, line: 1628, baseType: !477, size: 64, align: 64, offset: 3072)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "max_recv_speed", scope: !548, file: !140, line: 1629, baseType: !477, size: 64, align: 64, offset: 3136)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "set_resume_from", scope: !548, file: !140, line: 1631, baseType: !477, size: 64, align: 64, offset: 3200)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !548, file: !140, line: 1632, baseType: !744, size: 64, align: 64, offset: 3264)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_slist", file: !4, line: 2176, size: 128, align: 64, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !745, file: !4, line: 2177, baseType: !498, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !4, line: 2178, baseType: !744, size: 64, align: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "proxyheaders", scope: !548, file: !140, line: 1633, baseType: !744, size: 64, align: 64, offset: 3328)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "httppost", scope: !548, file: !140, line: 1634, baseType: !751, size: 64, align: 64, offset: 3392)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_httppost", file: !4, line: 137, size: 896, align: 64, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !4, line: 138, baseType: !751, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !4, line: 139, baseType: !498, size: 64, align: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "namelength", scope: !752, file: !4, line: 140, baseType: !398, size: 64, align: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !752, file: !4, line: 141, baseType: !498, size: 64, align: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "contentslength", scope: !752, file: !4, line: 142, baseType: !398, size: 64, align: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !752, file: !4, line: 144, baseType: !498, size: 64, align: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bufferlength", scope: !752, file: !4, line: 145, baseType: !398, size: 64, align: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !752, file: !4, line: 146, baseType: !498, size: 64, align: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "contentheader", scope: !752, file: !4, line: 147, baseType: !744, size: 64, align: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "more", scope: !752, file: !4, line: 148, baseType: !751, size: 64, align: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !4, line: 151, baseType: !398, size: 64, align: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "showfilename", scope: !752, file: !4, line: 171, baseType: !498, size: 64, align: 64, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "userp", scope: !752, file: !4, line: 174, baseType: !330, size: 64, align: 64, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "contentlen", scope: !752, file: !4, line: 176, baseType: !477, size: 64, align: 64, offset: 832)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sep_headers", scope: !548, file: !140, line: 1635, baseType: !442, size: 8, align: 8, offset: 3456)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "cookiesession", scope: !548, file: !140, line: 1636, baseType: !442, size: 8, align: 8, offset: 3464)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "crlf", scope: !548, file: !140, line: 1637, baseType: !442, size: 8, align: 8, offset: 3472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !548, file: !140, line: 1638, baseType: !744, size: 64, align: 64, offset: 3520)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "postquote", scope: !548, file: !140, line: 1639, baseType: !744, size: 64, align: 64, offset: 3584)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "prequote", scope: !548, file: !140, line: 1640, baseType: !744, size: 64, align: 64, offset: 3648)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "source_quote", scope: !548, file: !140, line: 1641, baseType: !744, size: 64, align: 64, offset: 3712)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "source_prequote", scope: !548, file: !140, line: 1642, baseType: !744, size: 64, align: 64, offset: 3776)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "source_postquote", scope: !548, file: !140, line: 1644, baseType: !744, size: 64, align: 64, offset: 3840)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "telnet_options", scope: !548, file: !140, line: 1646, baseType: !744, size: 64, align: 64, offset: 3904)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !548, file: !140, line: 1647, baseType: !744, size: 64, align: 64, offset: 3968)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "connect_to", scope: !548, file: !140, line: 1649, baseType: !744, size: 64, align: 64, offset: 4032)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "timecondition", scope: !548, file: !140, line: 1651, baseType: !781, size: 32, align: 32, offset: 4096)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_TimeCond", file: !4, line: 1929, baseType: !782)
!782 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1921, size: 32, align: 32, elements: !783)
!783 = !{!784, !785, !786, !787, !788}
!784 = !DIEnumerator(name: "CURL_TIMECOND_NONE", value: 0)
!785 = !DIEnumerator(name: "CURL_TIMECOND_IFMODSINCE", value: 1)
!786 = !DIEnumerator(name: "CURL_TIMECOND_IFUNMODSINCE", value: 2)
!787 = !DIEnumerator(name: "CURL_TIMECOND_LASTMOD", value: 3)
!788 = !DIEnumerator(name: "CURL_TIMECOND_LAST", value: 4)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "timevalue", scope: !548, file: !140, line: 1652, baseType: !525, size: 64, align: 64, offset: 4160)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "httpreq", scope: !548, file: !140, line: 1653, baseType: !791, size: 32, align: 32, offset: 4224)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_HttpReq", file: !140, line: 1249, baseType: !792)
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !140, line: 1240, size: 32, align: 32, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801}
!794 = !DIEnumerator(name: "HTTPREQ_NONE", value: 0)
!795 = !DIEnumerator(name: "HTTPREQ_GET", value: 1)
!796 = !DIEnumerator(name: "HTTPREQ_POST", value: 2)
!797 = !DIEnumerator(name: "HTTPREQ_POST_FORM", value: 3)
!798 = !DIEnumerator(name: "HTTPREQ_PUT", value: 4)
!799 = !DIEnumerator(name: "HTTPREQ_HEAD", value: 5)
!800 = !DIEnumerator(name: "HTTPREQ_CUSTOM", value: 6)
!801 = !DIEnumerator(name: "HTTPREQ_LAST", value: 7)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "httpversion", scope: !548, file: !140, line: 1654, baseType: !398, size: 64, align: 64, offset: 4288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !548, file: !140, line: 1656, baseType: !804, size: 1408, align: 64, offset: 4352)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_config_data", file: !140, line: 366, size: 1408, align: 64, elements: !805)
!805 = !{!806, !821, !822, !823, !824, !825, !826, !831, !832, !833, !834, !835, !836, !837, !838}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !804, file: !140, line: 367, baseType: !807, size: 640, align: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_primary_config", file: !140, line: 351, size: 640, align: 64, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !807, file: !140, line: 352, baseType: !398, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "version_max", scope: !807, file: !140, line: 353, baseType: !398, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "verifypeer", scope: !807, file: !140, line: 354, baseType: !442, size: 8, align: 8, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "verifyhost", scope: !807, file: !140, line: 355, baseType: !442, size: 8, align: 8, offset: 136)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "verifystatus", scope: !807, file: !140, line: 356, baseType: !442, size: 8, align: 8, offset: 144)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "CApath", scope: !807, file: !140, line: 357, baseType: !498, size: 64, align: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "CAfile", scope: !807, file: !140, line: 358, baseType: !498, size: 64, align: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "clientcert", scope: !807, file: !140, line: 359, baseType: !498, size: 64, align: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "random_file", scope: !807, file: !140, line: 360, baseType: !498, size: 64, align: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "egdsocket", scope: !807, file: !140, line: 361, baseType: !498, size: 64, align: 64, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !807, file: !140, line: 362, baseType: !498, size: 64, align: 64, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sessionid", scope: !807, file: !140, line: 363, baseType: !442, size: 8, align: 8, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "enable_beast", scope: !804, file: !140, line: 368, baseType: !442, size: 8, align: 8, offset: 640)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "no_revoke", scope: !804, file: !140, line: 370, baseType: !442, size: 8, align: 8, offset: 648)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "certverifyresult", scope: !804, file: !140, line: 371, baseType: !398, size: 64, align: 64, offset: 704)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CRLfile", scope: !804, file: !140, line: 372, baseType: !498, size: 64, align: 64, offset: 768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "issuercert", scope: !804, file: !140, line: 373, baseType: !498, size: 64, align: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fsslctx", scope: !804, file: !140, line: 374, baseType: !827, size: 64, align: 64, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ssl_ctx_callback", file: !4, line: 639, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!308, !324, !330, !330}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fsslctxp", scope: !804, file: !140, line: 375, baseType: !330, size: 64, align: 64, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "certinfo", scope: !804, file: !140, line: 376, baseType: !442, size: 8, align: 8, offset: 1024)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "falsestart", scope: !804, file: !140, line: 377, baseType: !442, size: 8, align: 8, offset: 1032)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !804, file: !140, line: 379, baseType: !498, size: 64, align: 64, offset: 1088)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !804, file: !140, line: 380, baseType: !498, size: 64, align: 64, offset: 1152)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !804, file: !140, line: 381, baseType: !498, size: 64, align: 64, offset: 1216)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "key_type", scope: !804, file: !140, line: 382, baseType: !498, size: 64, align: 64, offset: 1280)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "key_passwd", scope: !804, file: !140, line: 383, baseType: !498, size: 64, align: 64, offset: 1344)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_ssl", scope: !548, file: !140, line: 1657, baseType: !804, size: 1408, align: 64, offset: 5760)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "general_ssl", scope: !548, file: !140, line: 1658, baseType: !841, size: 64, align: 64, offset: 7168)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_general_config", file: !140, line: 392, size: 64, align: 64, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "max_ssl_sessions", scope: !841, file: !140, line: 393, baseType: !366, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "proxytype", scope: !548, file: !140, line: 1659, baseType: !845, size: 32, align: 32, offset: 7232)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_proxytype", file: !4, line: 657, baseType: !130)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_timeout", scope: !548, file: !140, line: 1660, baseType: !398, size: 64, align: 64, offset: 7296)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !548, file: !140, line: 1661, baseType: !398, size: 64, align: 64, offset: 7360)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !548, file: !140, line: 1662, baseType: !330, size: 64, align: 64, offset: 7424)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "http200aliases", scope: !548, file: !140, line: 1664, baseType: !744, size: 64, align: 64, offset: 7488)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ipver", scope: !548, file: !140, line: 1666, baseType: !398, size: 64, align: 64, offset: 7552)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "max_filesize", scope: !548, file: !140, line: 1669, baseType: !477, size: 64, align: 64, offset: 7616)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_filemethod", scope: !548, file: !140, line: 1671, baseType: !853, size: 32, align: 32, offset: 7680)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpfile", file: !154, line: 98, baseType: !854)
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !154, line: 93, size: 32, align: 32, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIEnumerator(name: "FTPFILE_MULTICWD", value: 1)
!857 = !DIEnumerator(name: "FTPFILE_NOCWD", value: 2)
!858 = !DIEnumerator(name: "FTPFILE_SINGLECWD", value: 3)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_create_missing_dirs", scope: !548, file: !140, line: 1673, baseType: !335, size: 32, align: 32, offset: 7712)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_keyfunc", scope: !548, file: !140, line: 1677, baseType: !861, size: 64, align: 64, offset: 7744)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_sshkeycallback", file: !4, line: 739, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64, align: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!335, !324, !865, !865, !880, !330}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_khkey", file: !4, line: 711, size: 192, align: 64, elements: !868)
!868 = !{!869, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !867, file: !4, line: 712, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !867, file: !4, line: 714, baseType: !366, size: 64, align: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "keytype", scope: !867, file: !4, line: 715, baseType: !874, size: 32, align: 32, offset: 128)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "curl_khtype", file: !4, line: 704, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879}
!876 = !DIEnumerator(name: "CURLKHTYPE_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "CURLKHTYPE_RSA1", value: 1)
!878 = !DIEnumerator(name: "CURLKHTYPE_RSA", value: 2)
!879 = !DIEnumerator(name: "CURLKHTYPE_DSS", value: 3)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "curl_khmatch", file: !4, line: 731, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIEnumerator(name: "CURLKHMATCH_OK", value: 0)
!883 = !DIEnumerator(name: "CURLKHMATCH_MISMATCH", value: 1)
!884 = !DIEnumerator(name: "CURLKHMATCH_MISSING", value: 2)
!885 = !DIEnumerator(name: "CURLKHMATCH_LAST", value: 3)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_keyfunc_userp", scope: !548, file: !140, line: 1678, baseType: !330, size: 64, align: 64, offset: 7808)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "printhost", scope: !548, file: !140, line: 1684, baseType: !442, size: 8, align: 8, offset: 7872)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "get_filetime", scope: !548, file: !140, line: 1685, baseType: !442, size: 8, align: 8, offset: 7880)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tunnel_thru_httpproxy", scope: !548, file: !140, line: 1686, baseType: !442, size: 8, align: 8, offset: 7888)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "prefer_ascii", scope: !548, file: !140, line: 1687, baseType: !442, size: 8, align: 8, offset: 7896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_append", scope: !548, file: !140, line: 1688, baseType: !442, size: 8, align: 8, offset: 7904)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_list_only", scope: !548, file: !140, line: 1689, baseType: !442, size: 8, align: 8, offset: 7912)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_port", scope: !548, file: !140, line: 1690, baseType: !442, size: 8, align: 8, offset: 7920)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "hide_progress", scope: !548, file: !140, line: 1691, baseType: !442, size: 8, align: 8, offset: 7928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "http_fail_on_error", scope: !548, file: !140, line: 1692, baseType: !442, size: 8, align: 8, offset: 7936)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "http_keep_sending_on_error", scope: !548, file: !140, line: 1693, baseType: !442, size: 8, align: 8, offset: 7944)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "http_follow_location", scope: !548, file: !140, line: 1694, baseType: !442, size: 8, align: 8, offset: 7952)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "http_transfer_encoding", scope: !548, file: !140, line: 1695, baseType: !442, size: 8, align: 8, offset: 7960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "http_disable_hostname_check_before_authentication", scope: !548, file: !140, line: 1696, baseType: !442, size: 8, align: 8, offset: 7968)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "include_header", scope: !548, file: !140, line: 1697, baseType: !442, size: 8, align: 8, offset: 7976)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "http_set_referer", scope: !548, file: !140, line: 1698, baseType: !442, size: 8, align: 8, offset: 7984)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "http_auto_referer", scope: !548, file: !140, line: 1699, baseType: !442, size: 8, align: 8, offset: 7992)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "opt_no_body", scope: !548, file: !140, line: 1700, baseType: !442, size: 8, align: 8, offset: 8000)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !548, file: !140, line: 1701, baseType: !442, size: 8, align: 8, offset: 8008)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "use_netrc", scope: !548, file: !140, line: 1703, baseType: !906, size: 32, align: 32, offset: 8032)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CURL_NETRC_OPTION", file: !4, line: 1867, size: 32, align: 32, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIEnumerator(name: "CURL_NETRC_IGNORED", value: 0)
!909 = !DIEnumerator(name: "CURL_NETRC_OPTIONAL", value: 1)
!910 = !DIEnumerator(name: "CURL_NETRC_REQUIRED", value: 2)
!911 = !DIEnumerator(name: "CURL_NETRC_LAST", value: 3)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !548, file: !140, line: 1704, baseType: !442, size: 8, align: 8, offset: 8064)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "krb", scope: !548, file: !140, line: 1705, baseType: !442, size: 8, align: 8, offset: 8072)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_forbid", scope: !548, file: !140, line: 1706, baseType: !442, size: 8, align: 8, offset: 8080)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_fresh", scope: !548, file: !140, line: 1707, baseType: !442, size: 8, align: 8, offset: 8088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_epsv", scope: !548, file: !140, line: 1708, baseType: !442, size: 8, align: 8, offset: 8096)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_eprt", scope: !548, file: !140, line: 1709, baseType: !442, size: 8, align: 8, offset: 8104)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_pret", scope: !548, file: !140, line: 1710, baseType: !442, size: 8, align: 8, offset: 8112)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "use_ssl", scope: !548, file: !140, line: 1712, baseType: !920, size: 32, align: 32, offset: 8128)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_usessl", file: !4, line: 752, baseType: !921)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 746, size: 32, align: 32, elements: !922)
!922 = !{!923, !924, !925, !926, !927}
!923 = !DIEnumerator(name: "CURLUSESSL_NONE", value: 0)
!924 = !DIEnumerator(name: "CURLUSESSL_TRY", value: 1)
!925 = !DIEnumerator(name: "CURLUSESSL_CONTROL", value: 2)
!926 = !DIEnumerator(name: "CURLUSESSL_ALL", value: 3)
!927 = !DIEnumerator(name: "CURLUSESSL_LAST", value: 4)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ftpsslauth", scope: !548, file: !140, line: 1714, baseType: !929, size: 32, align: 32, offset: 8160)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpauth", file: !4, line: 795, baseType: !930)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 790, size: 32, align: 32, elements: !931)
!931 = !{!932, !933, !934, !935}
!932 = !DIEnumerator(name: "CURLFTPAUTH_DEFAULT", value: 0)
!933 = !DIEnumerator(name: "CURLFTPAUTH_SSL", value: 1)
!934 = !DIEnumerator(name: "CURLFTPAUTH_TLS", value: 2)
!935 = !DIEnumerator(name: "CURLFTPAUTH_LAST", value: 3)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_ccc", scope: !548, file: !140, line: 1715, baseType: !937, size: 32, align: 32, offset: 8192)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpccc", file: !4, line: 787, baseType: !938)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 782, size: 32, align: 32, elements: !939)
!939 = !{!940, !941, !942, !943}
!940 = !DIEnumerator(name: "CURLFTPSSL_CCC_NONE", value: 0)
!941 = !DIEnumerator(name: "CURLFTPSSL_CCC_PASSIVE", value: 1)
!942 = !DIEnumerator(name: "CURLFTPSSL_CCC_ACTIVE", value: 2)
!943 = !DIEnumerator(name: "CURLFTPSSL_CCC_LAST", value: 3)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "no_signal", scope: !548, file: !140, line: 1716, baseType: !442, size: 8, align: 8, offset: 8224)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "global_dns_cache", scope: !548, file: !140, line: 1717, baseType: !442, size: 8, align: 8, offset: 8232)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !548, file: !140, line: 1718, baseType: !442, size: 8, align: 8, offset: 8240)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ignorecl", scope: !548, file: !140, line: 1719, baseType: !442, size: 8, align: 8, offset: 8248)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_skip_ip", scope: !548, file: !140, line: 1720, baseType: !442, size: 8, align: 8, offset: 8256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "connect_only", scope: !548, file: !140, line: 1722, baseType: !442, size: 8, align: 8, offset: 8264)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_auth_types", scope: !548, file: !140, line: 1723, baseType: !398, size: 64, align: 64, offset: 8320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "http_te_skip", scope: !548, file: !140, line: 1724, baseType: !442, size: 8, align: 8, offset: 8384)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "http_ce_skip", scope: !548, file: !140, line: 1726, baseType: !442, size: 8, align: 8, offset: 8392)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "new_file_perms", scope: !548, file: !140, line: 1728, baseType: !398, size: 64, align: 64, offset: 8448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "new_directory_perms", scope: !548, file: !140, line: 1729, baseType: !398, size: 64, align: 64, offset: 8512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_transfer_mode", scope: !548, file: !140, line: 1730, baseType: !442, size: 8, align: 8, offset: 8576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !548, file: !140, line: 1732, baseType: !957, size: 3584, align: 64, offset: 8640)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 3584, align: 64, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 56)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !548, file: !140, line: 1733, baseType: !702, size: 32, align: 32, offset: 12224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_protocols", scope: !548, file: !140, line: 1734, baseType: !398, size: 64, align: 64, offset: 12288)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "redir_protocols", scope: !548, file: !140, line: 1735, baseType: !398, size: 64, align: 64, offset: 12352)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mail_rcpt", scope: !548, file: !140, line: 1739, baseType: !744, size: 64, align: 64, offset: 12416)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_ir", scope: !548, file: !140, line: 1740, baseType: !442, size: 8, align: 8, offset: 12480)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rtspreq", scope: !548, file: !140, line: 1742, baseType: !966, size: 32, align: 32, offset: 12512)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_RtspReq", file: !140, line: 1265, baseType: !967)
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !140, line: 1251, size: 32, align: 32, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!969 = !DIEnumerator(name: "RTSPREQ_NONE", value: 0)
!970 = !DIEnumerator(name: "RTSPREQ_OPTIONS", value: 1)
!971 = !DIEnumerator(name: "RTSPREQ_DESCRIBE", value: 2)
!972 = !DIEnumerator(name: "RTSPREQ_ANNOUNCE", value: 3)
!973 = !DIEnumerator(name: "RTSPREQ_SETUP", value: 4)
!974 = !DIEnumerator(name: "RTSPREQ_PLAY", value: 5)
!975 = !DIEnumerator(name: "RTSPREQ_PAUSE", value: 6)
!976 = !DIEnumerator(name: "RTSPREQ_TEARDOWN", value: 7)
!977 = !DIEnumerator(name: "RTSPREQ_GET_PARAMETER", value: 8)
!978 = !DIEnumerator(name: "RTSPREQ_SET_PARAMETER", value: 9)
!979 = !DIEnumerator(name: "RTSPREQ_RECORD", value: 10)
!980 = !DIEnumerator(name: "RTSPREQ_RECEIVE", value: 11)
!981 = !DIEnumerator(name: "RTSPREQ_LAST", value: 12)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rtspversion", scope: !548, file: !140, line: 1743, baseType: !398, size: 64, align: 64, offset: 12544)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "wildcardmatch", scope: !548, file: !140, line: 1744, baseType: !442, size: 8, align: 8, offset: 12608)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_bgn", scope: !548, file: !140, line: 1745, baseType: !985, size: 64, align: 64, offset: 12672)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_chunk_bgn_callback", file: !4, line: 292, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!398, !989, !330, !335}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_end", scope: !548, file: !140, line: 1747, baseType: !992, size: 64, align: 64, offset: 12736)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_chunk_end_callback", file: !4, line: 306, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!398, !330}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fnmatch", scope: !548, file: !140, line: 1749, baseType: !997, size: 64, align: 64, offset: 12800)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_fnmatch_callback", file: !4, line: 315, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!335, !330, !870, !870}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "fnmatch_data", scope: !548, file: !140, line: 1751, baseType: !330, size: 64, align: 64, offset: 12864)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gssapi_delegation", scope: !548, file: !140, line: 1753, baseType: !398, size: 64, align: 64, offset: 12928)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepalive", scope: !548, file: !140, line: 1756, baseType: !442, size: 8, align: 8, offset: 12992)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepidle", scope: !548, file: !140, line: 1757, baseType: !398, size: 64, align: 64, offset: 13056)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepintvl", scope: !548, file: !140, line: 1758, baseType: !398, size: 64, align: 64, offset: 13120)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_fastopen", scope: !548, file: !140, line: 1759, baseType: !442, size: 8, align: 8, offset: 13184)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "maxconnects", scope: !548, file: !140, line: 1761, baseType: !366, size: 64, align: 64, offset: 13248)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_enable_npn", scope: !548, file: !140, line: 1763, baseType: !442, size: 8, align: 8, offset: 13312)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_enable_alpn", scope: !548, file: !140, line: 1764, baseType: !442, size: 8, align: 8, offset: 13320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "path_as_is", scope: !548, file: !140, line: 1765, baseType: !442, size: 8, align: 8, offset: 13328)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pipewait", scope: !548, file: !140, line: 1766, baseType: !442, size: 8, align: 8, offset: 13336)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "expect_100_timeout", scope: !548, file: !140, line: 1768, baseType: !398, size: 64, align: 64, offset: 13376)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_connect_headers", scope: !548, file: !140, line: 1769, baseType: !442, size: 8, align: 8, offset: 13440)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "stream_depends_on", scope: !548, file: !140, line: 1772, baseType: !275, size: 64, align: 64, offset: 13504)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "stream_depends_e", scope: !548, file: !140, line: 1773, baseType: !442, size: 8, align: 8, offset: 13568)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stream_weight", scope: !548, file: !140, line: 1774, baseType: !335, size: 32, align: 32, offset: 13600)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "stream_dependents", scope: !548, file: !140, line: 1776, baseType: !1018, size: 64, align: 64, offset: 13632)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_http2_dep", file: !140, line: 1292, size: 128, align: 64, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !140, line: 1293, baseType: !1018, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1019, file: !140, line: 1294, baseType: !275, size: 64, align: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_unix_socket", scope: !548, file: !140, line: 1778, baseType: !442, size: 8, align: 8, offset: 13696)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "change", scope: !276, file: !140, line: 1830, baseType: !1025, size: 384, align: 64, offset: 17216)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicStatic", file: !140, line: 1444, size: 384, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1025, file: !140, line: 1445, baseType: !498, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "url_alloc", scope: !1025, file: !140, line: 1446, baseType: !442, size: 8, align: 8, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1025, file: !140, line: 1447, baseType: !498, size: 64, align: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "referer_alloc", scope: !1025, file: !140, line: 1448, baseType: !442, size: 8, align: 8, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "cookielist", scope: !1025, file: !140, line: 1449, baseType: !744, size: 64, align: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !1025, file: !140, line: 1451, baseType: !744, size: 64, align: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !276, file: !140, line: 1831, baseType: !1034, size: 64, align: 64, offset: 17600)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "CookieInfo", file: !1036, line: 48, size: 320, align: 64, elements: !1037)
!1036 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/cookie.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!1037 = !{!1038, !1056, !1057, !1058, !1059}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "cookies", scope: !1035, file: !1036, line: 50, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cookie", file: !1036, line: 28, size: 768, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !1036, line: 29, baseType: !1039, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1040, file: !1036, line: 30, baseType: !498, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1040, file: !1036, line: 31, baseType: !498, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1040, file: !1036, line: 32, baseType: !498, size: 64, align: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "spath", scope: !1040, file: !1036, line: 33, baseType: !498, size: 64, align: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !1040, file: !1036, line: 34, baseType: !498, size: 64, align: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1040, file: !1036, line: 35, baseType: !477, size: 64, align: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "expirestr", scope: !1040, file: !1036, line: 36, baseType: !498, size: 64, align: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tailmatch", scope: !1040, file: !1036, line: 37, baseType: !442, size: 8, align: 8, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1040, file: !1036, line: 40, baseType: !498, size: 64, align: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "maxage", scope: !1040, file: !1036, line: 41, baseType: !498, size: 64, align: 64, offset: 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "secure", scope: !1040, file: !1036, line: 43, baseType: !442, size: 8, align: 8, offset: 704)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "livecookie", scope: !1040, file: !1036, line: 44, baseType: !442, size: 8, align: 8, offset: 712)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "httponly", scope: !1040, file: !1036, line: 45, baseType: !442, size: 8, align: 8, offset: 720)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1035, file: !1036, line: 52, baseType: !498, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !1035, file: !1036, line: 53, baseType: !442, size: 8, align: 8, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "numcookies", scope: !1035, file: !1036, line: 54, baseType: !398, size: 64, align: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "newsession", scope: !1035, file: !1036, line: 55, baseType: !442, size: 8, align: 8, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !276, file: !140, line: 1835, baseType: !1061, size: 3200, align: 64, offset: 17664)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "Progress", file: !140, line: 1195, size: 3200, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1093, !1095}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "lastshow", scope: !1061, file: !140, line: 1196, baseType: !525, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "size_dl", scope: !1061, file: !140, line: 1198, baseType: !477, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size_ul", scope: !1061, file: !140, line: 1199, baseType: !477, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "downloaded", scope: !1061, file: !140, line: 1200, baseType: !477, size: 64, align: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "uploaded", scope: !1061, file: !140, line: 1201, baseType: !477, size: 64, align: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "current_speed", scope: !1061, file: !140, line: 1203, baseType: !477, size: 64, align: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1061, file: !140, line: 1205, baseType: !442, size: 8, align: 8, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1061, file: !140, line: 1206, baseType: !335, size: 32, align: 32, offset: 416)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1061, file: !140, line: 1207, baseType: !335, size: 32, align: 32, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "timespent", scope: !1061, file: !140, line: 1209, baseType: !644, size: 64, align: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "dlspeed", scope: !1061, file: !140, line: 1211, baseType: !477, size: 64, align: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ulspeed", scope: !1061, file: !140, line: 1212, baseType: !477, size: 64, align: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "t_nslookup", scope: !1061, file: !140, line: 1214, baseType: !644, size: 64, align: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "t_connect", scope: !1061, file: !140, line: 1215, baseType: !644, size: 64, align: 64, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "t_appconnect", scope: !1061, file: !140, line: 1216, baseType: !644, size: 64, align: 64, offset: 832)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "t_pretransfer", scope: !1061, file: !140, line: 1217, baseType: !644, size: 64, align: 64, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "t_starttransfer", scope: !1061, file: !140, line: 1218, baseType: !644, size: 64, align: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "t_redirect", scope: !1061, file: !140, line: 1219, baseType: !644, size: 64, align: 64, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1061, file: !140, line: 1221, baseType: !430, size: 128, align: 64, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "t_startsingle", scope: !1061, file: !140, line: 1222, baseType: !430, size: 128, align: 64, offset: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "t_startop", scope: !1061, file: !140, line: 1223, baseType: !430, size: 128, align: 64, offset: 1344)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "t_acceptdata", scope: !1061, file: !140, line: 1224, baseType: !430, size: 128, align: 64, offset: 1472)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ul_limit_start", scope: !1061, file: !140, line: 1227, baseType: !430, size: 128, align: 64, offset: 1600)
