; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/hash.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.curl_hash = type { %struct.curl_llist*, i64 (i8*, i64, i64)*, i64 (i8*, i64, i8*, i64)*, void (i8*)*, i32, i64 }
%struct.curl_llist = type { %struct.curl_llist_element*, %struct.curl_llist_element*, void (i8*, i8*)*, i64 }
%struct.curl_llist_element = type { i8*, %struct.curl_llist_element*, %struct.curl_llist_element* }
%struct.curl_hash_element = type { i8*, i64, [1 x i8] }
%struct.curl_hash_iterator = type { %struct.curl_hash*, i32, %struct.curl_llist_element* }

@Curl_cmalloc = external global i8* (i64)*, align 8
@Curl_cfree = external global void (i8*)*, align 8

; Function Attrs: nounwind uwtable
define i32 @Curl_hash_init(%struct.curl_hash* %h, i32 %slots, i64 (i8*, i64, i64)* %hfunc, i64 (i8*, i64, i8*, i64)* %comparator, void (i8*)* %dtor) #0 !dbg !62 {
entry:
  %retval = alloca i32, align 4
  %h.addr = alloca %struct.curl_hash*, align 8
  %slots.addr = alloca i32, align 4
  %hfunc.addr = alloca i64 (i8*, i64, i64)*, align 8
  %comparator.addr = alloca i64 (i8*, i64, i8*, i64)*, align 8
  %dtor.addr = alloca void (i8*)*, align 8
  %i = alloca i32, align 4
  store %struct.curl_hash* %h, %struct.curl_hash** %h.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.curl_hash** %h.addr, metadata !107, metadata !108), !dbg !109
  store i32 %slots, i32* %slots.addr, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !61)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/hash.c", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!2 = !{}
!3 = !{!4, !10, !9, !24, !18, !26}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_llist_dtor", file: !5, line: 28, baseType: !6)
!5 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/llist.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_hash_element", file: !12, line: 59, size: 192, align: 64, elements: !13)
!12 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/hash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!13 = !{!14, !15, !19}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, file: !12, line: 60, baseType: !9, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !11, file: !12, line: 61, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 62, baseType: !18)
!17 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!18 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !11, file: !12, line: 62, baseType: !20, size: 8, align: 8, offset: 128)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !22)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !{!23}
!23 = !DISubrange(count: 1)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_hash", file: !12, line: 46, size: 384, align: 64, elements: !28)
!28 = !{!29, !43, !48, !53, !58, !60}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !27, file: !12, line: 47, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist", file: !5, line: 37, size: 256, align: 64, elements: !32)
!32 = !{!33, !40, !41, !42}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !31, file: !5, line: 38, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist_element", file: !5, line: 30, size: 192, align: 64, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, file: !5, line: 31, baseType: !9, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !35, file: !5, line: 33, baseType: !34, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !35, file: !5, line: 34, baseType: !34, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !31, file: !5, line: 39, baseType: !34, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !31, file: !5, line: 41, baseType: !4, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !5, line: 43, baseType: !16, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !27, file: !12, line: 50, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_function", file: !12, line: 32, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!16, !9, !16, !16}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "comp_func", scope: !27, file: !12, line: 53, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "comp_function", file: !12, line: 39, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!16, !9, !16, !9, !16}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !27, file: !12, line: 54, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_hash_dtor", file: !12, line: 44, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !9}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !27, file: !12, line: 55, baseType: !59, size: 32, align: 32, offset: 256)
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !27, file: !12, line: 56, baseType: !16, size: 64, align: 64, offset: 320)
!61 = !{!62, !65, !68, !71, !74, !77, !78, !84, !85, !86, !95, !98, !99}
!62 = distinct !DISubprogram(name: "Curl_hash_init", scope: !1, file: !1, line: 57, type: !63, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!63 = !DISubroutineType(types: !64)
!64 = !{!59, !26, !59, !44, !49, !54}
!65 = distinct !DISubprogram(name: "Curl_hash_add", scope: !1, file: !1, line: 110, type: !66, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!66 = !DISubroutineType(types: !67)
!67 = !{!9, !26, !9, !16, !9}
!68 = distinct !DISubprogram(name: "Curl_hash_delete", scope: !1, file: !1, line: 148, type: !69, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!69 = !DISubroutineType(types: !70)
!70 = !{!59, !26, !9, !16}
!71 = distinct !DISubprogram(name: "Curl_hash_pick", scope: !1, file: !1, line: 170, type: !72, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!72 = !DISubroutineType(types: !73)
!73 = !{!9, !26, !9, !16}
!74 = distinct !DISubprogram(name: "Curl_hash_destroy", scope: !1, file: !1, line: 216, type: !75, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !26}
!77 = distinct !DISubprogram(name: "Curl_hash_clean", scope: !1, file: !1, line: 234, type: !75, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!78 = distinct !DISubprogram(name: "Curl_hash_clean_with_criterium", scope: !1, file: !1, line: 241, type: !79, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !26, !9, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!59, !9, !9}
!84 = distinct !DISubprogram(name: "Curl_hash_str", scope: !1, file: !1, line: 268, type: !46, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!85 = distinct !DISubprogram(name: "Curl_str_key_compare", scope: !1, file: !1, line: 282, type: !51, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!86 = distinct !DISubprogram(name: "Curl_hash_start_iterate", scope: !1, file: !1, line: 291, type: !87, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !26, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_hash_iterator", file: !12, line: 65, size: 192, align: 64, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !90, file: !12, line: 66, baseType: !26, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "slot_index", scope: !90, file: !12, line: 67, baseType: !59, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "current_element", scope: !90, file: !12, line: 68, baseType: !34, size: 64, align: 64, offset: 128)
!95 = distinct !DISubprogram(name: "Curl_hash_next_element", scope: !1, file: !1, line: 300, type: !96, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!96 = !DISubroutineType(types: !97)
!97 = !{!10, !89}
!98 = distinct !DISubprogram(name: "hash_element_dtor", scope: !1, file: !1, line: 35, type: !7, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!99 = distinct !DISubprogram(name: "mk_hash_element", scope: !1, file: !1, line: 86, type: !100, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!100 = !DISubroutineType(types: !101)
!101 = !{!10, !102, !16, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!104 = !{i32 2, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!107 = !DILocalVariable(name: "h", arg: 1, scope: !62, file: !1, line: 57, type: !26)
!108 = !DIExpression()
!109 = !DILocation(line: 57, column: 34, scope: !62)
!110 = !DILocalVariable(name: "slots", arg: 2, scope: !62, file: !1, line: 58, type: !59)
!111 = !DILocation(line: 58, column: 20, scope: !62)
!112 = !DILocalVariable(name: "hfunc", arg: 3, scope: !62, file: !1, line: 59, type: !44)
!113 = !DILocation(line: 59, column: 30, scope: !62)
!114 = !DILocalVariable(name: "comparator", arg: 4, scope: !62, file: !1, line: 60, type: !49)
!115 = !DILocation(line: 60, column: 30, scope: !62)
!116 = !DILocalVariable(name: "dtor", arg: 5, scope: !62, file: !1, line: 61, type: !54)
!117 = !DILocation(line: 61, column: 31, scope: !62)
!118 = !DILocalVariable(name: "i", scope: !62, file: !1, line: 63, type: !59)
!119 = !DILocation(line: 63, column: 7, scope: !62)
!120 = !DILocation(line: 65, column: 7, scope: !121)
!121 = distinct !DILexicalBlock(scope: !62, file: !1, line: 65, column: 6)
!122 = !DILocation(line: 65, column: 13, scope: !121)
!123 = !DILocation(line: 65, column: 17, scope: !124)
!124 = !DILexicalBlockFile(scope: !121, file: !1, discriminator: 1)
!125 = !DILocation(line: 65, column: 23, scope: !124)
!126 = !DILocation(line: 65, column: 27, scope: !127)
!127 = !DILexicalBlockFile(scope: !121, file: !1, discriminator: 2)
!128 = !DILocation(line: 65, column: 38, scope: !127)
!129 = !DILocation(line: 65, column: 41, scope: !130)
!130 = !DILexicalBlockFile(scope: !121, file: !1, discriminator: 3)
!131 = !DILocation(line: 65, column: 6, scope: !130)
!132 = !DILocation(line: 66, column: 5, scope: !133)
!133 = distinct !DILexicalBlock(scope: !121, file: !1, line: 65, column: 47)
!134 = !DILocation(line: 69, column: 18, scope: !62)
!135 = !DILocation(line: 69, column: 3, scope: !62)
!136 = !DILocation(line: 69, column: 6, scope: !62)
!137 = !DILocation(line: 69, column: 16, scope: !62)
!138 = !DILocation(line: 70, column: 18, scope: !62)
!139 = !DILocation(line: 70, column: 3, scope: !62)
!140 = !DILocation(line: 70, column: 6, scope: !62)
!141 = !DILocation(line: 70, column: 16, scope: !62)
!142 = !DILocation(line: 71, column: 13, scope: !62)
!143 = !DILocation(line: 71, column: 3, scope: !62)
!144 = !DILocation(line: 71, column: 6, scope: !62)
!145 = !DILocation(line: 71, column: 11, scope: !62)
!146 = !DILocation(line: 72, column: 3, scope: !62)
!147 = !DILocation(line: 72, column: 6, scope: !62)
!148 = !DILocation(line: 72, column: 11, scope: !62)
!149 = !DILocation(line: 73, column: 14, scope: !62)
!150 = !DILocation(line: 73, column: 3, scope: !62)
!151 = !DILocation(line: 73, column: 6, scope: !62)
!152 = !DILocation(line: 73, column: 12, scope: !62)
!153 = !DILocation(line: 75, column: 14, scope: !62)
!154 = !DILocation(line: 75, column: 3, scope: !62)
