; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/md5.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HMAC_params = type { void (i8*)*, void (i8*, i8*, i32)*, void (i8*, i8*)*, i32, i32, i32 }
%struct.MD5_params = type { void (i8*)*, void (i8*, i8*, i32)*, void (i8*, i8*)*, i32, i32 }
%struct.MD5_CTX = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }
%struct.MD5_context = type { %struct.MD5_params*, i8* }

@Curl_HMAC_MD5 = constant [1 x %struct.HMAC_params] [%struct.HMAC_params { void (i8*)* bitcast (void (%struct.MD5_CTX*)* @MD5_Init to void (i8*)*), void (i8*, i8*, i32)* bitcast (void (%struct.MD5_CTX*, i8*, i64)* @MD5_Update to void (i8*, i8*, i32)*), void (i8*, i8*)* bitcast (void (i8*, %struct.MD5_CTX*)* @MD5_Final to void (i8*, i8*)*), i32 152, i32 64, i32 16 }], align 16
@Curl_DIGEST_MD5 = constant [1 x %struct.MD5_params] [%struct.MD5_params { void (i8*)* bitcast (void (%struct.MD5_CTX*)* @MD5_Init to void (i8*)*), void (i8*, i8*, i32)* bitcast (void (%struct.MD5_CTX*, i8*, i64)* @MD5_Update to void (i8*, i8*, i32)*), void (i8*, i8*)* bitcast (void (i8*, %struct.MD5_CTX*)* @MD5_Final to void (i8*, i8*)*), i32 152, i32 16 }], align 16
@Curl_cmalloc = external global i8* (i64)*, align 8
@Curl_cfree = external global void (i8*)*, align 8

; Function Attrs: nounwind uwtable
define internal void @MD5_Init(%struct.MD5_CTX* %ctx) #0 !dbg !58 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !13, globals: !90)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/md5.c", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!2 = !{}
!3 = !{!4, !6, !8, !11, !12}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "MD5_u32plus", file: !1, line: 219, baseType: !7)
!7 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!13 = !{!14, !18, !51, !55, !58, !79, !84, !87}
!14 = distinct !DISubprogram(name: "Curl_md5it", scope: !1, file: !1, line: 511, type: !15, isLocal: false, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !8}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!18 = distinct !DISubprogram(name: "Curl_MD5_init", scope: !1, file: !1, line: 520, type: !19, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !27}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "MD5_context", file: !23, line: 47, baseType: !24)
!23 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_md5.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 44, size: 128, align: 64, elements: !25)
!25 = !{!26, !50}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "md5_hash", scope: !24, file: !23, line: 45, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "MD5_params", file: !23, line: 42, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 36, size: 256, align: 64, elements: !31)
!31 = !{!32, !38, !43, !48, !49}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "md5_init_func", scope: !30, file: !23, line: 37, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_MD5_init_func", file: !23, line: 30, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "md5_update_func", scope: !30, file: !23, line: 38, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_MD5_update_func", file: !23, line: 31, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !37, !8, !7}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "md5_final_func", scope: !30, file: !23, line: 39, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_MD5_final_func", file: !23, line: 34, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !17, !37}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "md5_ctxtsize", scope: !30, file: !23, line: 40, baseType: !7, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "md5_resultlen", scope: !30, file: !23, line: 41, baseType: !7, size: 32, align: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "md5_hashctx", scope: !24, file: !23, line: 46, baseType: !37, size: 64, align: 64, offset: 64)
!51 = distinct !DISubprogram(name: "Curl_MD5_update", scope: !1, file: !1, line: 544, type: !52, isLocal: false, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !21, !8, !7}
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = distinct !DISubprogram(name: "Curl_MD5_final", scope: !1, file: !1, line: 553, type: !56, isLocal: false, isDefinition: true, scopeLine: 554, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{!54, !21, !17}
!58 = distinct !DISubprogram(name: "MD5_Init", scope: !1, file: !1, line: 388, type: !59, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "MD5_CTX", file: !1, line: 226, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 221, size: 1216, align: 32, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !75}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !63, file: !1, line: 222, baseType: !6, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !63, file: !1, line: 222, baseType: !6, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !63, file: !1, line: 223, baseType: !6, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !63, file: !1, line: 223, baseType: !6, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !63, file: !1, line: 223, baseType: !6, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !63, file: !1, line: 223, baseType: !6, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !63, file: !1, line: 224, baseType: !72, size: 512, align: 8, offset: 192)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !63, file: !1, line: 225, baseType: !76, size: 512, align: 32, offset: 704)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, align: 32, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 16)
!79 = distinct !DISubprogram(name: "MD5_Update", scope: !1, file: !1, line: 399, type: !80, isLocal: true, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !61, !82, !11}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!84 = distinct !DISubprogram(name: "body", scope: !1, file: !1, line: 281, type: !85, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!85 = !DISubroutineType(types: !86)
!86 = !{!82, !61, !82, !11}
!87 = distinct !DISubprogram(name: "MD5_Final", scope: !1, file: !1, line: 434, type: !88, isLocal: true, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !17, !61}
!90 = !{!91, !109}
!91 = !DIGlobalVariable(name: "Curl_HMAC_MD5", scope: !0, file: !1, line: 487, type: !92, isLocal: false, isDefinition: true, variable: [1 x %struct.HMAC_params]* @Curl_HMAC_MD5)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 320, align: 64, elements: !107)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_params", file: !95, line: 43, baseType: !96)
!95 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_hmac.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!96 = !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 36, size: 320, align: 64, elements: !97)
!97 = !{!98, !100, !102, !104, !105, !106}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_hinit", scope: !96, file: !95, line: 37, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_hinit_func", file: !95, line: 27, baseType: !34)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_hupdate", scope: !96, file: !95, line: 38, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_hupdate_func", file: !95, line: 28, baseType: !40)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_hfinal", scope: !96, file: !95, line: 39, baseType: !103, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "HMAC_hfinal_func", file: !95, line: 31, baseType: !45)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_ctxtsize", scope: !96, file: !95, line: 40, baseType: !7, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_maxkeylen", scope: !96, file: !95, line: 41, baseType: !7, size: 32, align: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hmac_resultlen", scope: !96, file: !95, line: 42, baseType: !7, size: 32, align: 32, offset: 256)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIGlobalVariable(name: "Curl_DIGEST_MD5", scope: !0, file: !1, line: 498, type: !110, isLocal: false, isDefinition: true, variable: [1 x %struct.MD5_params]* @Curl_DIGEST_MD5)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, align: 64, elements: !107)
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!114 = !DILocalVariable(name: "ctx", arg: 1, scope: !58, file: !1, line: 388, type: !61)
!115 = !DIExpression()
!116 = !DILocation(line: 388, column: 31, scope: !58)
!117 = !DILocation(line: 390, column: 3, scope: !58)
!118 = !DILocation(line: 390, column: 8, scope: !58)
!119 = !DILocation(line: 390, column: 10, scope: !58)
!120 = !DILocation(line: 391, column: 3, scope: !58)
!121 = !DILocation(line: 391, column: 8, scope: !58)
!122 = !DILocation(line: 391, column: 10, scope: !58)
!123 = !DILocation(line: 392, column: 3, scope: !58)
!124 = !DILocation(line: 392, column: 8, scope: !58)
!125 = !DILocation(line: 392, column: 10, scope: !58)
!126 = !DILocation(line: 393, column: 3, scope: !58)
!127 = !DILocation(line: 393, column: 8, scope: !58)
!128 = !DILocation(line: 393, column: 10, scope: !58)
!129 = !DILocation(line: 395, column: 3, scope: !58)
!130 = !DILocation(line: 395, column: 8, scope: !58)
!131 = !DILocation(line: 395, column: 11, scope: !58)
!132 = !DILocation(line: 396, column: 3, scope: !58)
!133 = !DILocation(line: 396, column: 8, scope: !58)
!134 = !DILocation(line: 396, column: 11, scope: !58)
!135 = !DILocation(line: 397, column: 1, scope: !58)
!136 = !DILocalVariable(name: "ctx", arg: 1, scope: !79, file: !1, line: 399, type: !61)
!137 = !DILocation(line: 399, column: 33, scope: !79)
!138 = !DILocalVariable(name: "data", arg: 2, scope: !79, file: !1, line: 399, type: !82)
!139 = !DILocation(line: 399, column: 50, scope: !79)
!140 = !DILocalVariable(name: "size", arg: 3, scope: !79, file: !1, line: 399, type: !11)
!141 = !DILocation(line: 399, column: 70, scope: !79)
!142 = !DILocalVariable(name: "saved_lo", scope: !79, file: !1, line: 401, type: !6)
!143 = !DILocation(line: 401, column: 15, scope: !79)
!144 = !DILocalVariable(name: "used", scope: !79, file: !1, line: 402, type: !11)
!145 = !DILocation(line: 402, column: 17, scope: !79)
!146 = !DILocalVariable(name: "available", scope: !79, file: !1, line: 402, type: !11)
!147 = !DILocation(line: 402, column: 23, scope: !79)
!148 = !DILocation(line: 404, column: 14, scope: !79)
!149 = !DILocation(line: 404, column: 19, scope: !79)
!150 = !DILocation(line: 404, column: 12, scope: !79)
!151 = !DILocation(line: 405, column: 14, scope: !79)
!152 = !DILocation(line: 405, column: 25, scope: !79)
!153 = !DILocation(line: 405, column: 23, scope: !79)
!154 = !DILocation(line: 405, column: 31, scope: !79)
!155 = !DILocation(line: 405, column: 13, scope: !79)
!156 = !DILocation(line: 405, column: 3, scope: !79)
!157 = !DILocation(line: 405, column: 8, scope: !79)
!158 = !DILocation(line: 405, column: 11, scope: !79)
!159 = !DILocation(line: 406, column: 6, scope: !160)
!160 = distinct !DILexicalBlock(scope: !79, file: !1, line: 406, column: 6)
!161 = !DILocation(line: 406, column: 11, scope: !160)
!162 = !DILocation(line: 406, column: 16, scope: !160)
!163 = !DILocation(line: 406, column: 14, scope: !160)
!164 = !DILocation(line: 406, column: 6, scope: !79)
!165 = !DILocation(line: 407, column: 5, scope: !160)
!166 = !DILocation(line: 407, column: 10, scope: !160)
!167 = !DILocation(line: 407, column: 12, scope: !160)
!168 = !DILocation(line: 408, column: 27, scope: !79)
!169 = !DILocation(line: 408, column: 14, scope: !79)
!170 = !DILocation(line: 408, column: 32, scope: !79)
!171 = !DILocation(line: 408, column: 3, scope: !79)
!172 = !DILocation(line: 408, column: 8, scope: !79)
