; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/mprintf.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.nsprintf = type { i8*, i64, i64 }
%struct.va_stack_t = type { i32, i32, i64, i64, %union.anon }
%union.anon = type { i8* }
%union.anon.0 = type { i64 }
%struct.asprintf = type { i8*, i64, i64, i32 }

@Curl_cfree = external global void (i8*)*, align 8
@Curl_cstrdup = external global i8* (i8*)*, align 8
@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@stdout = external global %struct._IO_FILE*, align 8
@lower_digits = internal constant [37 x i8] c"0123456789abcdefghijklmnopqrstuvwxyz\00", align 16
@upper_digits = internal constant [37 x i8] c"0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ\00", align 16
@dprintf_formatf.null = internal constant [6 x i8] c"(nil)\00", align 1
@dprintf_formatf.strnil = internal constant [6 x i8] c"(nil)\00", align 1
@dprintf_formatf.formatbuf = private unnamed_addr constant [32 x i8] c"%\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !53, subprograms: !139, globals: !221)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/mprintf.c", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!2 = !{!3, !15, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 114, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7, !8, !9, !10, !11, !12, !13, !14}
!5 = !DIEnumerator(name: "FORMAT_UNKNOWN", value: 0)
!6 = !DIEnumerator(name: "FORMAT_STRING", value: 1)
!7 = !DIEnumerator(name: "FORMAT_PTR", value: 2)
!8 = !DIEnumerator(name: "FORMAT_INT", value: 3)
!9 = !DIEnumerator(name: "FORMAT_INTPTR", value: 4)
!10 = !DIEnumerator(name: "FORMAT_LONG", value: 5)
!11 = !DIEnumerator(name: "FORMAT_LONGLONG", value: 6)
!12 = !DIEnumerator(name: "FORMAT_DOUBLE", value: 7)
!13 = !DIEnumerator(name: "FORMAT_LONGDOUBLE", value: 8)
!14 = !DIEnumerator(name: "FORMAT_WIDTH", value: 9)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 128, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!17 = !DIEnumerator(name: "FLAGS_NEW", value: 0)
!18 = !DIEnumerator(name: "FLAGS_SPACE", value: 1)
!19 = !DIEnumerator(name: "FLAGS_SHOWSIGN", value: 2)
!20 = !DIEnumerator(name: "FLAGS_LEFT", value: 4)
!21 = !DIEnumerator(name: "FLAGS_ALT", value: 8)
!22 = !DIEnumerator(name: "FLAGS_SHORT", value: 16)
!23 = !DIEnumerator(name: "FLAGS_LONG", value: 32)
!24 = !DIEnumerator(name: "FLAGS_LONGLONG", value: 64)
!25 = !DIEnumerator(name: "FLAGS_LONGDOUBLE", value: 128)
!26 = !DIEnumerator(name: "FLAGS_PAD_NIL", value: 256)
!27 = !DIEnumerator(name: "FLAGS_UNSIGNED", value: 512)
!28 = !DIEnumerator(name: "FLAGS_OCTAL", value: 1024)
!29 = !DIEnumerator(name: "FLAGS_HEX", value: 2048)
!30 = !DIEnumerator(name: "FLAGS_UPPER", value: 4096)
!31 = !DIEnumerator(name: "FLAGS_WIDTH", value: 8192)
!32 = !DIEnumerator(name: "FLAGS_WIDTHPARAM", value: 16384)
!33 = !DIEnumerator(name: "FLAGS_PREC", value: 32768)
!34 = !DIEnumerator(name: "FLAGS_PRECPARAM", value: 65536)
!35 = !DIEnumerator(name: "FLAGS_CHAR", value: 131072)
!36 = !DIEnumerator(name: "FLAGS_FLOATE", value: 262144)
!37 = !DIEnumerator(name: "FLAGS_FLOATG", value: 524288)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 46, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/ctype.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!41 = !DIEnumerator(name: "_ISupper", value: 256)
!42 = !DIEnumerator(name: "_ISlower", value: 512)
!43 = !DIEnumerator(name: "_ISalpha", value: 1024)
!44 = !DIEnumerator(name: "_ISdigit", value: 2048)
!45 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!46 = !DIEnumerator(name: "_ISspace", value: 8192)
!47 = !DIEnumerator(name: "_ISprint", value: 16384)
!48 = !DIEnumerator(name: "_ISgraph", value: 32768)
!49 = !DIEnumerator(name: "_ISblank", value: 1)
!50 = !DIEnumerator(name: "_IScntrl", value: 2)
!51 = !DIEnumerator(name: "_ISpunct", value: 4)
!52 = !DIEnumerator(name: "_ISalnum", value: 8)
!53 = !{!54, !56, !57, !90, !55, !118, !119, !105, !110, !120, !121, !64, !122, !123, !124, !92, !125, !131, !138}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 48, baseType: !60)
!59 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 245, size: 1728, align: 64, elements: !62)
!61 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!62 = !{!63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !84, !85, !86, !87, !91, !93, !95, !99, !102, !104, !106, !107, !108, !109, !113, !114}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 246, baseType: !64, size: 32, align: 32)
!64 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 251, baseType: !54, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 252, baseType: !54, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 253, baseType: !54, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 254, baseType: !54, size: 64, align: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 255, baseType: !54, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 256, baseType: !54, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 257, baseType: !54, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 258, baseType: !54, size: 64, align: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 260, baseType: !54, size: 64, align: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 261, baseType: !54, size: 64, align: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 262, baseType: !54, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 264, baseType: !77, size: 64, align: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 160, size: 192, align: 64, elements: !79)
!79 = !{!80, !81, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !78, file: !61, line: 161, baseType: !77, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !78, file: !61, line: 162, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !78, file: !61, line: 166, baseType: !64, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 266, baseType: !82, size: 64, align: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 268, baseType: !64, size: 32, align: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 272, baseType: !64, size: 32, align: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 274, baseType: !88, size: 64, align: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 131, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!90 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 278, baseType: !92, size: 16, align: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 279, baseType: !94, size: 8, align: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 280, baseType: !96, size: 8, align: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 284, baseType: !100, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 154, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 293, baseType: !103, size: 64, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !89, line: 132, baseType: !90)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !60, file: !61, line: 302, baseType: !105, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !60, file: !61, line: 303, baseType: !105, size: 64, align: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !60, file: !61, line: 304, baseType: !105, size: 64, align: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !60, file: !61, line: 305, baseType: !105, size: 64, align: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 306, baseType: !110, size: 64, align: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !112)
!111 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 308, baseType: !64, size: 32, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 310, baseType: !115, size: 160, align: 8, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!119 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!123 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsprintf", file: !1, line: 168, size: 192, align: 64, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !126, file: !1, line: 169, baseType: !54, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !126, file: !1, line: 170, baseType: !110, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !126, file: !1, line: 171, baseType: !110, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "asprintf", file: !1, line: 174, size: 256, align: 64, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !132, file: !1, line: 175, baseType: !54, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !132, file: !1, line: 176, baseType: !110, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !132, file: !1, line: 177, baseType: !110, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !132, file: !1, line: 178, baseType: !64, size: 32, align: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!139 = !{!140, !154, !157, !160, !163, !166, !169, !172, !175, !178, !181, !187, !211, !215, !218, !219, !220}
!140 = distinct !DISubprogram(name: "curl_mvsnprintf", scope: !1, file: !1, line: 1002, type: !141, isLocal: false, isDefinition: true, scopeLine: 1004, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!141 = !DISubroutineType(types: !142)
!142 = !{!64, !54, !110, !143, !145}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !147)
!147 = !{!148, !150, !151, !152}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !146, file: !1, baseType: !149, size: 32, align: 32)
!149 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !146, file: !1, baseType: !149, size: 32, align: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !146, file: !1, baseType: !105, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !146, file: !1, baseType: !105, size: 64, align: 64, offset: 128)
!153 = !{}
!154 = distinct !DISubprogram(name: "curl_msnprintf", scope: !1, file: !1, line: 1024, type: !155, isLocal: false, isDefinition: true, scopeLine: 1025, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!155 = !DISubroutineType(types: !156)
!156 = !{!64, !54, !110, !143, null}
!157 = distinct !DISubprogram(name: "curl_maprintf", scope: !1, file: !1, line: 1072, type: !158, isLocal: false, isDefinition: true, scopeLine: 1073, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!158 = !DISubroutineType(types: !159)
!159 = !{!54, !143, null}
!160 = distinct !DISubprogram(name: "curl_mvaprintf", scope: !1, file: !1, line: 1098, type: !161, isLocal: false, isDefinition: true, scopeLine: 1099, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!161 = !DISubroutineType(types: !162)
!162 = !{!54, !143, !145}
!163 = distinct !DISubprogram(name: "curl_msprintf", scope: !1, file: !1, line: 1131, type: !164, isLocal: false, isDefinition: true, scopeLine: 1132, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!164 = !DISubroutineType(types: !165)
!165 = !{!64, !54, !143, null}
!166 = distinct !DISubprogram(name: "curl_mprintf", scope: !1, file: !1, line: 1142, type: !167, isLocal: false, isDefinition: true, scopeLine: 1143, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!167 = !DISubroutineType(types: !168)
!168 = !{!64, !143, null}
!169 = distinct !DISubprogram(name: "curl_mfprintf", scope: !1, file: !1, line: 1153, type: !170, isLocal: false, isDefinition: true, scopeLine: 1154, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!170 = !DISubroutineType(types: !171)
!171 = !{!64, !57, !143, null}
!172 = distinct !DISubprogram(name: "curl_mvsprintf", scope: !1, file: !1, line: 1163, type: !173, isLocal: false, isDefinition: true, scopeLine: 1164, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!173 = !DISubroutineType(types: !174)
!174 = !{!64, !54, !143, !145}
!175 = distinct !DISubprogram(name: "curl_mvprintf", scope: !1, file: !1, line: 1171, type: !176, isLocal: false, isDefinition: true, scopeLine: 1172, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!176 = !DISubroutineType(types: !177)
!177 = !{!64, !143, !145}
!178 = distinct !DISubprogram(name: "curl_mvfprintf", scope: !1, file: !1, line: 1176, type: !179, isLocal: false, isDefinition: true, scopeLine: 1177, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!179 = !DISubroutineType(types: !180)
!180 = !{!64, !57, !143, !145}
!181 = distinct !DISubprogram(name: "dprintf_formatf", scope: !1, file: !1, line: 558, type: !182, isLocal: true, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!182 = !DISubroutineType(types: !183)
!183 = !{!64, !105, !184, !143, !145}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!64, !64, !57}
!187 = distinct !DISubprogram(name: "dprintf_Pass1", scope: !1, file: !1, line: 231, type: !188, isLocal: true, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!188 = !DISubroutineType(types: !189)
!189 = !{!64, !143, !190, !138, !145}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_stack_t", file: !1, line: 166, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 152, size: 256, align: 64, elements: !193)
!193 = !{!194, !196, !197, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !1, line: 153, baseType: !195, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "FormatType", file: !1, line: 125, baseType: !3)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !1, line: 154, baseType: !64, size: 32, align: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !192, file: !1, line: 155, baseType: !90, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !192, file: !1, line: 156, baseType: !90, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !1, line: 165, baseType: !200, size: 64, align: 64, offset: 192)
!200 = !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !1, line: 157, size: 64, align: 64, elements: !201)
!201 = !{!202, !203, !204, !209}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !200, file: !1, line: 158, baseType: !54, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !200, file: !1, line: 159, baseType: !105, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !200, file: !1, line: 163, baseType: !205, size: 64, align: 64)
!205 = !DICompositeType(tag: DW_TAG_union_type, scope: !200, file: !1, line: 160, size: 64, align: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "as_signed", scope: !205, file: !1, line: 161, baseType: !118, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "as_unsigned", scope: !205, file: !1, line: 162, baseType: !119, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dnum", scope: !200, file: !1, line: 164, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = distinct !DISubprogram(name: "dprintf_IsQualifierNoDollar", scope: !1, file: !1, line: 197, type: !212, isLocal: true, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !143}
!214 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!215 = distinct !DISubprogram(name: "dprintf_DollarString", scope: !1, file: !1, line: 182, type: !216, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!216 = !DISubroutineType(types: !217)
!217 = !{!90, !54, !138}
!218 = distinct !DISubprogram(name: "addbyter", scope: !1, file: !1, line: 987, type: !185, isLocal: true, isDefinition: true, scopeLine: 988, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!219 = distinct !DISubprogram(name: "alloc_addbyter", scope: !1, file: !1, line: 1035, type: !185, isLocal: true, isDefinition: true, scopeLine: 1036, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!220 = distinct !DISubprogram(name: "storebuffer", scope: !1, file: !1, line: 1122, type: !185, isLocal: true, isDefinition: true, scopeLine: 1123, flags: DIFlagPrototyped, isOptimized: false, variables: !153)
!221 = !{!222, !226, !227, !231}
!222 = !DIGlobalVariable(name: "null", scope: !181, file: !1, line: 810, type: !223, isLocal: true, isDefinition: true, variable: [6 x i8]* @dprintf_formatf.null)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 48, align: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 6)
!226 = !DIGlobalVariable(name: "strnil", scope: !181, file: !1, line: 869, type: !223, isLocal: true, isDefinition: true, variable: [6 x i8]* @dprintf_formatf.strnil)
!227 = !DIGlobalVariable(name: "lower_digits", scope: !0, file: !1, line: 100, type: !228, isLocal: true, isDefinition: true, variable: [37 x i8]* @lower_digits)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 296, align: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 37)
!231 = !DIGlobalVariable(name: "upper_digits", scope: !0, file: !1, line: 103, type: !228, isLocal: true, isDefinition: true, variable: [37 x i8]* @upper_digits)
!232 = !{i32 2, !"Dwarf Version", i32 4}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!235 = !DILocalVariable(name: "buffer", arg: 1, scope: !140, file: !1, line: 1002, type: !54)
!236 = !DIExpression()
!237 = !DILocation(line: 1002, column: 27, scope: !140)
!238 = !DILocalVariable(name: "maxlength", arg: 2, scope: !140, file: !1, line: 1002, type: !110)
!239 = !DILocation(line: 1002, column: 42, scope: !140)
