; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/netrc.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }

@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%s%s%s\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"/\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c".netrc\00", align 1
@Curl_cfree = external global void (i8*)*, align 8
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c" \09\0A\00", align 1
@.str.6 = private unnamed_addr constant [8 x i8] c"machine\00", align 1
@.str.7 = private unnamed_addr constant [8 x i8] c"default\00", align 1
@Curl_cstrdup = external global i8* (i8*)*, align 8
@.str.8 = private unnamed_addr constant [6 x i8] c"login\00", align 1
@.str.9 = private unnamed_addr constant [9 x i8] c"password\00", align 1

; Function Attrs: nounwind uwtable
define i32 @Curl_parsenetrc(i8* %host, i8** %loginp, i8** %passwordp, i8* %netrcfile) #0 !dbg !11 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !10)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/netrc.c", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "host_lookup_state", file: !1, line: 41, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7}
!5 = !DIEnumerator(name: "NOTHING", value: 0)
!6 = !DIEnumerator(name: "HOSTFOUND", value: 1)
!7 = !DIEnumerator(name: "HOSTVALID", value: 2)
!8 = !{!9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !{!11}
!11 = distinct !DISubprogram(name: "Curl_parsenetrc", scope: !1, file: !1, line: 53, type: !12, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !19)
!12 = !DISubroutineType(types: !13)
!13 = !{!9, !14, !17, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!19 = !{}
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!23 = !DILocalVariable(name: "host", arg: 1, scope: !11, file: !1, line: 53, type: !14)
!24 = !DIExpression()
!25 = !DILocation(line: 53, column: 33, scope: !11)
!26 = !DILocalVariable(name: "loginp", arg: 2, scope: !11, file: !1, line: 54, type: !17)
!27 = !DILocation(line: 54, column: 28, scope: !11)
!28 = !DILocalVariable(name: "passwordp", arg: 3, scope: !11, file: !1, line: 55, type: !17)
!29 = !DILocation(line: 55, column: 28, scope: !11)
!30 = !DILocalVariable(name: "netrcfile", arg: 4, scope: !11, file: !1, line: 56, type: !18)
!31 = !DILocation(line: 56, column: 27, scope: !11)
!32 = !DILocalVariable(name: "file", scope: !11, file: !1, line: 58, type: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !35, line: 48, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 245, size: 1728, align: 64, elements: !38)
!37 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !59, !60, !61, !62, !66, !68, !70, !74, !77, !79, !81, !82, !83, !84, !88, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 246, baseType: !9, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 251, baseType: !18, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 252, baseType: !18, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 253, baseType: !18, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 254, baseType: !18, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 255, baseType: !18, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 256, baseType: !18, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 257, baseType: !18, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 258, baseType: !18, size: 64, align: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 260, baseType: !18, size: 64, align: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 261, baseType: !18, size: 64, align: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 262, baseType: !18, size: 64, align: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 264, baseType: !52, size: 64, align: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 160, size: 192, align: 64, elements: !54)
!54 = !{!55, !56, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !53, file: !37, line: 161, baseType: !52, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !53, file: !37, line: 162, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !53, file: !37, line: 166, baseType: !9, size: 32, align: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 266, baseType: !57, size: 64, align: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 268, baseType: !9, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 272, baseType: !9, size: 32, align: 32, offset: 928)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 274, baseType: !63, size: 64, align: 64, offset: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !64, line: 131, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 278, baseType: !67, size: 16, align: 16, offset: 1024)
!67 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 279, baseType: !69, size: 8, align: 8, offset: 1040)
!69 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 280, baseType: !71, size: 8, align: 8, offset: 1048)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 284, baseType: !75, size: 64, align: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 154, baseType: null)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 293, baseType: !78, size: 64, align: 64, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !64, line: 132, baseType: !65)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !36, file: !37, line: 302, baseType: !80, size: 64, align: 64, offset: 1216)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !36, file: !37, line: 303, baseType: !80, size: 64, align: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !36, file: !37, line: 304, baseType: !80, size: 64, align: 64, offset: 1344)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !36, file: !37, line: 305, baseType: !80, size: 64, align: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 306, baseType: !85, size: 64, align: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 62, baseType: !87)
!86 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!87 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 308, baseType: !9, size: 32, align: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 310, baseType: !90, size: 160, align: 8, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DILocation(line: 58, column: 9, scope: !11)
!94 = !DILocalVariable(name: "retcode", scope: !11, file: !1, line: 59, type: !9)
!95 = !DILocation(line: 59, column: 7, scope: !11)
!96 = !DILocalVariable(name: "specific_login", scope: !11, file: !1, line: 60, type: !9)
!97 = !DILocation(line: 60, column: 7, scope: !11)
!98 = !DILocation(line: 60, column: 26, scope: !11)
!99 = !DILocation(line: 60, column: 25, scope: !11)
!100 = !DILocation(line: 60, column: 33, scope: !11)
!101 = !DILocation(line: 60, column: 38, scope: !102)
!102 = !DILexicalBlockFile(scope: !11, file: !1, discriminator: 1)
!103 = !DILocation(line: 60, column: 37, scope: !102)
!104 = !DILocation(line: 60, column: 36, scope: !102)
!105 = !DILocation(line: 60, column: 45, scope: !102)
!106 = !DILocation(line: 60, column: 33, scope: !107)
!107 = !DILexicalBlockFile(scope: !11, file: !1, discriminator: 2)
!108 = !DILocation(line: 60, column: 7, scope: !107)
!109 = !DILocalVariable(name: "netrc_alloc", scope: !11, file: !1, line: 61, type: !110)
!110 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!111 = !DILocation(line: 61, column: 8, scope: !11)
!112 = !DILocalVariable(name: "state", scope: !11, file: !1, line: 62, type: !3)
!113 = !DILocation(line: 62, column: 26, scope: !11)
!114 = !DILocalVariable(name: "state_login", scope: !11, file: !1, line: 64, type: !16)
!115 = !DILocation(line: 64, column: 8, scope: !11)
!116 = !DILocalVariable(name: "state_password", scope: !11, file: !1, line: 65, type: !16)
!117 = !DILocation(line: 65, column: 8, scope: !11)
!118 = !DILocalVariable(name: "state_our_login", scope: !11, file: !1, line: 66, type: !9)
!119 = !DILocation(line: 66, column: 7, scope: !11)
!120 = !DILocation(line: 70, column: 7, scope: !121)
!121 = distinct !DILexicalBlock(scope: !11, file: !1, line: 70, column: 6)
!122 = !DILocation(line: 70, column: 6, scope: !11)
!123 = !DILocalVariable(name: "home_alloc", scope: !124, file: !1, line: 71, type: !110)
!124 = distinct !DILexicalBlock(scope: !121, file: !1, line: 70, column: 18)
!125 = !DILocation(line: 71, column: 10, scope: !124)
!126 = !DILocalVariable(name: "home", scope: !124, file: !1, line: 72, type: !18)
!127 = !DILocation(line: 72, column: 11, scope: !124)
!128 = !DILocation(line: 72, column: 18, scope: !124)
!129 = !DILocation(line: 73, column: 8, scope: !130)
!130 = distinct !DILexicalBlock(scope: !124, file: !1, line: 73, column: 8)
!131 = !DILocation(line: 73, column: 8, scope: !124)
!132 = !DILocation(line: 74, column: 18, scope: !133)
!133 = distinct !DILexicalBlock(scope: !130, file: !1, line: 73, column: 14)
!134 = !DILocation(line: 88, column: 5, scope: !133)
!135 = !DILocalVariable(name: "pw", scope: !136, file: !1, line: 90, type: !137)
!136 = distinct !DILexicalBlock(scope: !130, file: !1, line: 89, column: 10)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !139, line: 49, size: 384, align: 64, elements: !140)
!139 = !DIFile(filename: "/usr/include/pwd.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!140 = !{!141, !142, !143, !146, !148, !149, !150}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !138, file: !139, line: 51, baseType: !18, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !138, file: !139, line: 52, baseType: !18, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !138, file: !139, line: 53, baseType: !144, size: 32, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !64, line: 125, baseType: !145)
!145 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !138, file: !139, line: 54, baseType: !147, size: 32, align: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !64, line: 126, baseType: !145)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !138, file: !139, line: 55, baseType: !18, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !138, file: !139, line: 56, baseType: !18, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !138, file: !139, line: 57, baseType: !18, size: 64, align: 64, offset: 320)
!151 = !DILocation(line: 90, column: 22, scope: !136)
!152 = !DILocation(line: 91, column: 20, scope: !136)
!153 = !DILocation(line: 91, column: 11, scope: !154)
!154 = !DILexicalBlockFile(scope: !136, file: !1, discriminator: 1)
!155 = !DILocation(line: 91, column: 9, scope: !136)
!156 = !DILocation(line: 92, column: 10, scope: !157)
!157 = distinct !DILexicalBlock(scope: !136, file: !1, line: 92, column: 10)
!158 = !DILocation(line: 92, column: 10, scope: !136)
!159 = !DILocation(line: 93, column: 16, scope: !160)
!160 = distinct !DILexicalBlock(scope: !157, file: !1, line: 92, column: 14)
!161 = !DILocation(line: 93, column: 20, scope: !160)
!162 = !DILocation(line: 93, column: 14, scope: !160)
!163 = !DILocation(line: 94, column: 7, scope: !160)
!164 = !DILocation(line: 98, column: 9, scope: !165)
!165 = distinct !DILexicalBlock(scope: !124, file: !1, line: 98, column: 8)
!166 = !DILocation(line: 98, column: 8, scope: !124)
!167 = !DILocation(line: 99, column: 14, scope: !165)
!168 = !DILocation(line: 99, column: 7, scope: !165)
!169 = !DILocation(line: 101, column: 41, scope: !124)
!170 = !DILocation(line: 101, column: 17, scope: !124)
!171 = !DILocation(line: 101, column: 15, scope: !124)
!172 = !DILocation(line: 102, column: 8, scope: !173)
!173 = distinct !DILexicalBlock(scope: !124, file: !1, line: 102, column: 8)
!174 = !DILocation(line: 102, column: 8, scope: !124)
!175 = !DILocation(line: 103, column: 7, scope: !173)
!176 = !DILocation(line: 104, column: 9, scope: !177)
!177 = distinct !DILexicalBlock(scope: !124, file: !1, line: 104, column: 8)
!178 = !DILocation(line: 104, column: 8, scope: !124)
!179 = !DILocation(line: 105, column: 7, scope: !180)
!180 = distinct !DILexicalBlock(scope: !177, file: !1, line: 104, column: 20)
!181 = !DILocation(line: 107, column: 17, scope: !124)
!182 = !DILocation(line: 108, column: 3, scope: !124)
!183 = !DILocation(line: 110, column: 16, scope: !11)
!184 = !DILocation(line: 110, column: 10, scope: !11)
!185 = !DILocation(line: 110, column: 8, scope: !11)
!186 = !DILocation(line: 111, column: 6, scope: !187)
!187 = distinct !DILexicalBlock(scope: !11, file: !1, line: 111, column: 6)
!188 = !DILocation(line: 111, column: 6, scope: !11)
!189 = !DILocation(line: 112, column: 5, scope: !187)
!190 = !DILocation(line: 113, column: 6, scope: !191)
!191 = distinct !DILexicalBlock(scope: !11, file: !1, line: 113, column: 6)
!192 = !DILocation(line: 113, column: 6, scope: !11)
!193 = !DILocalVariable(name: "tok", scope: !194, file: !1, line: 114, type: !18)
!194 = distinct !DILexicalBlock(scope: !191, file: !1, line: 113, column: 12)
!195 = !DILocation(line: 114, column: 11, scope: !194)
!196 = !DILocalVariable(name: "tok_buf", scope: !194, file: !1, line: 115, type: !18)
!197 = !DILocation(line: 115, column: 11, scope: !194)
!198 = !DILocalVariable(name: "done", scope: !194, file: !1, line: 116, type: !110)
!199 = !DILocation(line: 116, column: 10, scope: !194)
!200 = !DILocalVariable(name: "netrcbuffer", scope: !194, file: !1, line: 117, type: !201)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, align: 8, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 256)
!204 = !DILocation(line: 117, column: 10, scope: !194)
!205 = !DILocalVariable(name: "netrcbuffsize", scope: !194, file: !1, line: 118, type: !9)
!206 = !DILocation(line: 118, column: 10, scope: !194)
!207 = !DILocation(line: 120, column: 5, scope: !194)
!208 = !DILocation(line: 120, column: 12, scope: !209)
!209 = !DILexicalBlockFile(scope: !194, file: !1, discriminator: 1)
!210 = !DILocation(line: 120, column: 17, scope: !209)
!211 = !DILocation(line: 120, column: 26, scope: !212)
!212 = !DILexicalBlockFile(scope: !194, file: !1, discriminator: 2)
!213 = !DILocation(line: 120, column: 39, scope: !212)
!214 = !DILocation(line: 120, column: 54, scope: !212)
