; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcurl/lib/strerror.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.connectdata = type { %struct.Curl_easy*, %struct.Curl_chunker, i32 (i8*, i32)*, i8*, i8, i64, %struct.Curl_dns_entry*, %struct.Curl_addrinfo*, [2 x %struct.Curl_addrinfo*], [46 x i8], i32, i32, %struct.hostname, i8*, %struct.hostname, %struct.proxy_info, %struct.proxy_info, i64, i32, i32, i16, [46 x i8], i64, [46 x i8], i64, i8*, i8*, i8*, i8*, i32, i32, %struct.timeval, %struct.timeval, [2 x i32], [2 x i32], [2 x i8], [2 x i64 (%struct.connectdata*, i32, i8*, i64, i32*)*], [2 x i64 (%struct.connectdata*, i32, i8*, i64, i32*)*], [2 x %struct.ssl_connect_data], [2 x %struct.ssl_connect_data], %struct.ssl_primary_config, %struct.ssl_primary_config, i8, %struct.ConnectBits, %struct.timeval, i32, i64, %struct.Curl_handler*, %struct.Curl_handler*, i64, i32, i32, %struct.dynamically_allocated_data, i8, i8, %struct.curl_llist, %struct.curl_llist, i8*, i64, i64, i32 (i8*, i64, i32)*, i8*, [256 x i8], i8*, i32, i32, %union.anon.0, i32, i32, i8*, i16, i32, [2 x i32], %struct.connectbundle*, i32 }

!93 = !DIEnumerator(name: "CURLE_FTP_BAD_FILE_LIST", value: 87)
!94 = !DIEnumerator(name: "CURLE_CHUNK_FAILED", value: 88)
!95 = !DIEnumerator(name: "CURLE_NO_CONNECTION_AVAILABLE", value: 89)
!96 = !DIEnumerator(name: "CURLE_SSL_PINNEDPUBKEYNOTMATCH", value: 90)
!97 = !DIEnumerator(name: "CURLE_SSL_INVALIDCERTSTATUS", value: 91)
!98 = !DIEnumerator(name: "CURLE_HTTP2_STREAM", value: 92)
!99 = !DIEnumerator(name: "CURL_LAST", value: 93)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 61, size: 32, align: 32, elements: !102)
!101 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/multi.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!103 = !DIEnumerator(name: "CURLM_CALL_MULTI_PERFORM", value: -1)
!104 = !DIEnumerator(name: "CURLM_OK", value: 0)
!105 = !DIEnumerator(name: "CURLM_BAD_HANDLE", value: 1)
!106 = !DIEnumerator(name: "CURLM_BAD_EASY_HANDLE", value: 2)
!107 = !DIEnumerator(name: "CURLM_OUT_OF_MEMORY", value: 3)
!108 = !DIEnumerator(name: "CURLM_INTERNAL_ERROR", value: 4)
!109 = !DIEnumerator(name: "CURLM_BAD_SOCKET", value: 5)
!110 = !DIEnumerator(name: "CURLM_UNKNOWN_OPTION", value: 6)
!111 = !DIEnumerator(name: "CURLM_ADDED_ALREADY", value: 7)
!112 = !DIEnumerator(name: "CURLM_LAST", value: 8)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2374, size: 32, align: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121}
!115 = !DIEnumerator(name: "CURLSHE_OK", value: 0)
!116 = !DIEnumerator(name: "CURLSHE_BAD_OPTION", value: 1)
!117 = !DIEnumerator(name: "CURLSHE_IN_USE", value: 2)
!118 = !DIEnumerator(name: "CURLSHE_INVALID", value: 3)
!119 = !DIEnumerator(name: "CURLSHE_NOMEM", value: 4)
!120 = !DIEnumerator(name: "CURLSHE_NOT_BUILT_IN", value: 5)
!121 = !DIEnumerator(name: "CURLSHE_LAST", value: 6)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 35, size: 32, align: 32, elements: !124)
!123 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/multihandle.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!125 = !DIEnumerator(name: "CURLM_STATE_INIT", value: 0)
!126 = !DIEnumerator(name: "CURLM_STATE_CONNECT_PEND", value: 1)
!127 = !DIEnumerator(name: "CURLM_STATE_CONNECT", value: 2)
!128 = !DIEnumerator(name: "CURLM_STATE_WAITRESOLVE", value: 3)
!129 = !DIEnumerator(name: "CURLM_STATE_WAITCONNECT", value: 4)
!130 = !DIEnumerator(name: "CURLM_STATE_WAITPROXYCONNECT", value: 5)
!131 = !DIEnumerator(name: "CURLM_STATE_SENDPROTOCONNECT", value: 6)
!132 = !DIEnumerator(name: "CURLM_STATE_PROTOCONNECT", value: 7)
!133 = !DIEnumerator(name: "CURLM_STATE_WAITDO", value: 8)
!134 = !DIEnumerator(name: "CURLM_STATE_DO", value: 9)
!135 = !DIEnumerator(name: "CURLM_STATE_DOING", value: 10)
!136 = !DIEnumerator(name: "CURLM_STATE_DO_MORE", value: 11)
!137 = !DIEnumerator(name: "CURLM_STATE_DO_DONE", value: 12)
!138 = !DIEnumerator(name: "CURLM_STATE_WAITPERFORM", value: 13)
!139 = !DIEnumerator(name: "CURLM_STATE_PERFORM", value: 14)
!140 = !DIEnumerator(name: "CURLM_STATE_TOOFAST", value: 15)
!141 = !DIEnumerator(name: "CURLM_STATE_DONE", value: 16)
!142 = !DIEnumerator(name: "CURLM_STATE_COMPLETED", value: 17)
!143 = !DIEnumerator(name: "CURLM_STATE_MSGSENT", value: 18)
!144 = !DIEnumerator(name: "CURLM_STATE_LAST", value: 19)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 86, size: 32, align: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIEnumerator(name: "CURLMSG_NONE", value: 0)
!148 = !DIEnumerator(name: "CURLMSG_DONE", value: 1)
!149 = !DIEnumerator(name: "CURLMSG_LAST", value: 2)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !152, file: !151, line: 1783, size: 32, align: 32, elements: !201)
!151 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/urldata.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Names", file: !151, line: 1781, size: 128, align: 64, elements: !153)
!153 = !{!154, !200}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hostcache", scope: !152, file: !151, line: 1782, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_hash", file: !157, line: 46, size: 384, align: 64, elements: !158)
!157 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/hash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!158 = !{!159, !182, !187, !192, !197, !199}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !156, file: !157, line: 47, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist", file: !162, line: 37, size: 256, align: 64, elements: !163)
!162 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/llist.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!163 = !{!164, !172, !173, !178}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !161, file: !162, line: 38, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_llist_element", file: !162, line: 30, size: 192, align: 64, elements: !167)
!167 = !{!168, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !166, file: !162, line: 31, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !162, line: 33, baseType: !165, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !162, line: 34, baseType: !165, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !162, line: 39, baseType: !165, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !161, file: !162, line: 41, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_llist_dtor", file: !162, line: 28, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !169, !169}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !161, file: !162, line: 43, baseType: !179, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 62, baseType: !181)
!180 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!181 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !156, file: !157, line: 50, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_function", file: !157, line: 32, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!179, !169, !179, !179}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "comp_func", scope: !156, file: !157, line: 53, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "comp_function", file: !157, line: 39, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!179, !169, !179, !169, !179}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !156, file: !157, line: 54, baseType: !193, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_hash_dtor", file: !157, line: 44, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !169}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !156, file: !157, line: 55, baseType: !198, size: 32, align: 32, offset: 256)
!198 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !157, line: 56, baseType: !179, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hostcachetype", scope: !152, file: !151, line: 1788, baseType: !150, size: 32, align: 32, offset: 64)
!201 = !{!202, !203, !204, !205}
!202 = !DIEnumerator(name: "HCACHE_NONE", value: 0)
!203 = !DIEnumerator(name: "HCACHE_GLOBAL", value: 1)
!204 = !DIEnumerator(name: "HCACHE_MULTI", value: 2)
!205 = !DIEnumerator(name: "HCACHE_SHARED", value: 3)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !207, file: !151, line: 679, size: 32, align: 32, elements: !286)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "SingleRequest", file: !151, line: 658, size: 2496, align: 64, elements: !208)
!208 = !{!209, !213, !215, !216, !217, !218, !219, !220, !221, !230, !231, !233, !234, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !254, !261, !262, !265, !266, !267, !268, !270, !271, !272, !273, !274, !275, !276, !280, !281, !282, !283, !284, !285}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !207, file: !151, line: 659, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_off_t", file: !211, line: 216, baseType: !212)
!211 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/include/curl/curlbuild.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!212 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bytecountp", scope: !207, file: !151, line: 660, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "maxdownload", scope: !207, file: !151, line: 662, baseType: !210, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "writebytecountp", scope: !207, file: !151, line: 664, baseType: !214, size: 64, align: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bytecount", scope: !207, file: !151, line: 666, baseType: !210, size: 64, align: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "writebytecount", scope: !207, file: !151, line: 667, baseType: !210, size: 64, align: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "headerbytecount", scope: !207, file: !151, line: 669, baseType: !212, size: 64, align: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "deductheadercount", scope: !207, file: !151, line: 670, baseType: !212, size: 64, align: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !207, file: !151, line: 676, baseType: !222, size: 128, align: 64, offset: 512)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !223, line: 30, size: 128, align: 64, elements: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!224 = !{!225, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !222, file: !223, line: 32, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !227, line: 139, baseType: !212)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !222, file: !223, line: 33, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !227, line: 141, baseType: !212)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "now", scope: !207, file: !151, line: 677, baseType: !222, size: 128, align: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !207, file: !151, line: 678, baseType: !232, size: 8, align: 8, offset: 768)
!232 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "badheader", scope: !207, file: !151, line: 684, baseType: !206, size: 32, align: 32, offset: 800)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "headerline", scope: !207, file: !151, line: 686, baseType: !198, size: 32, align: 32, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "hbufp", scope: !207, file: !151, line: 688, baseType: !236, size: 64, align: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "hbuflen", scope: !207, file: !151, line: 689, baseType: !179, size: 64, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !207, file: !151, line: 690, baseType: !236, size: 64, align: 64, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "str_start", scope: !207, file: !151, line: 691, baseType: !236, size: 64, align: 64, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "end_ptr", scope: !207, file: !151, line: 692, baseType: !236, size: 64, align: 64, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !207, file: !151, line: 693, baseType: !236, size: 64, align: 64, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "content_range", scope: !207, file: !151, line: 694, baseType: !232, size: 8, align: 8, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !207, file: !151, line: 695, baseType: !210, size: 64, align: 64, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "httpcode", scope: !207, file: !151, line: 697, baseType: !198, size: 32, align: 32, offset: 1408)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "start100", scope: !207, file: !151, line: 699, baseType: !222, size: 128, align: 64, offset: 1472)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exp100", scope: !207, file: !151, line: 700, baseType: !248, size: 32, align: 32, offset: 1600)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expect100", file: !151, line: 636, size: 32, align: 32, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIEnumerator(name: "EXP100_SEND_DATA", value: 0)
!251 = !DIEnumerator(name: "EXP100_AWAITING_CONTINUE", value: 1)
!252 = !DIEnumerator(name: "EXP100_SENDING_REQUEST", value: 2)
!253 = !DIEnumerator(name: "EXP100_FAILED", value: 3)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "upgr101", scope: !207, file: !151, line: 701, baseType: !255, size: 32, align: 32, offset: 1632)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "upgrade101", file: !151, line: 644, size: 32, align: 32, elements: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DIEnumerator(name: "UPGR101_INIT", value: 0)
!258 = !DIEnumerator(name: "UPGR101_REQUESTED", value: 1)
!259 = !DIEnumerator(name: "UPGR101_RECEIVED", value: 2)
!260 = !DIEnumerator(name: "UPGR101_WORKING", value: 3)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "auto_decoding", scope: !207, file: !151, line: 703, baseType: !198, size: 32, align: 32, offset: 1664)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "timeofdoc", scope: !207, file: !151, line: 715, baseType: !263, size: 64, align: 64, offset: 1728)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !264, line: 75, baseType: !226)
!264 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bodywrites", scope: !207, file: !151, line: 716, baseType: !212, size: 64, align: 64, offset: 1792)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !207, file: !151, line: 718, baseType: !236, size: 64, align: 64, offset: 1856)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "uploadbuf", scope: !207, file: !151, line: 719, baseType: !236, size: 64, align: 64, offset: 1920)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "maxfd", scope: !207, file: !151, line: 720, baseType: !269, size: 32, align: 32, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socket_t", file: !4, line: 131, baseType: !198)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "keepon", scope: !207, file: !151, line: 722, baseType: !198, size: 32, align: 32, offset: 2016)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "upload_done", scope: !207, file: !151, line: 724, baseType: !232, size: 8, align: 8, offset: 2048)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ignorebody", scope: !207, file: !151, line: 727, baseType: !232, size: 8, align: 8, offset: 2056)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ignorecl", scope: !207, file: !151, line: 728, baseType: !232, size: 8, align: 8, offset: 2064)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !207, file: !151, line: 731, baseType: !236, size: 64, align: 64, offset: 2112)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "newurl", scope: !207, file: !151, line: 733, baseType: !236, size: 64, align: 64, offset: 2176)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "upload_present", scope: !207, file: !151, line: 738, baseType: !277, size: 64, align: 64, offset: 2240)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !278, line: 109, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !227, line: 172, baseType: !212)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "upload_fromhere", scope: !207, file: !151, line: 744, baseType: !236, size: 64, align: 64, offset: 2304)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !207, file: !151, line: 746, baseType: !232, size: 8, align: 8, offset: 2368)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "upload_chunky", scope: !207, file: !151, line: 747, baseType: !232, size: 8, align: 8, offset: 2376)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "getheader", scope: !207, file: !151, line: 749, baseType: !232, size: 8, align: 8, offset: 2384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "forbidchunk", scope: !207, file: !151, line: 751, baseType: !232, size: 8, align: 8, offset: 2392)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "protop", scope: !207, file: !151, line: 755, baseType: !169, size: 64, align: 64, offset: 2432)
!286 = !{!287, !288, !289}
!287 = !DIEnumerator(name: "HEADER_NORMAL", value: 0)
!288 = !DIEnumerator(name: "HEADER_PARTHEADER", value: 1)
!289 = !DIEnumerator(name: "HEADER_ALLBAD", value: 2)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 409, size: 32, align: 32, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299}
!292 = !DIEnumerator(name: "CURLINFO_TEXT", value: 0)
!293 = !DIEnumerator(name: "CURLINFO_HEADER_IN", value: 1)
!294 = !DIEnumerator(name: "CURLINFO_HEADER_OUT", value: 2)
!295 = !DIEnumerator(name: "CURLINFO_DATA_IN", value: 3)
!296 = !DIEnumerator(name: "CURLINFO_DATA_OUT", value: 4)
!297 = !DIEnumerator(name: "CURLINFO_SSL_DATA_IN", value: 5)
!298 = !DIEnumerator(name: "CURLINFO_SSL_DATA_OUT", value: 6)
!299 = !DIEnumerator(name: "CURLINFO_END", value: 7)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 375, size: 32, align: 32, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIEnumerator(name: "CURLIOE_OK", value: 0)
!303 = !DIEnumerator(name: "CURLIOE_UNKNOWNCMD", value: 1)
!304 = !DIEnumerator(name: "CURLIOE_FAILRESTART", value: 2)
!305 = !DIEnumerator(name: "CURLIOE_LAST", value: 3)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 340, size: 32, align: 32, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "CURLSOCKTYPE_IPCXN", value: 0)
!309 = !DIEnumerator(name: "CURLSOCKTYPE_ACCEPT", value: 1)
!310 = !DIEnumerator(name: "CURLSOCKTYPE_LAST", value: 2)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1921, size: 32, align: 32, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIEnumerator(name: "CURL_TIMECOND_NONE", value: 0)
!314 = !DIEnumerator(name: "CURL_TIMECOND_IFMODSINCE", value: 1)
!315 = !DIEnumerator(name: "CURL_TIMECOND_IFUNMODSINCE", value: 2)
!316 = !DIEnumerator(name: "CURL_TIMECOND_LASTMOD", value: 3)
!317 = !DIEnumerator(name: "CURL_TIMECOND_LAST", value: 4)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 1240, size: 32, align: 32, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327}
!320 = !DIEnumerator(name: "HTTPREQ_NONE", value: 0)
!321 = !DIEnumerator(name: "HTTPREQ_GET", value: 1)
!322 = !DIEnumerator(name: "HTTPREQ_POST", value: 2)
!323 = !DIEnumerator(name: "HTTPREQ_POST_FORM", value: 3)
!324 = !DIEnumerator(name: "HTTPREQ_PUT", value: 4)
!325 = !DIEnumerator(name: "HTTPREQ_HEAD", value: 5)
!326 = !DIEnumerator(name: "HTTPREQ_CUSTOM", value: 6)
!327 = !DIEnumerator(name: "HTTPREQ_LAST", value: 7)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 644, size: 32, align: 32, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336}
!330 = !DIEnumerator(name: "CURLPROXY_HTTP", value: 0)
!331 = !DIEnumerator(name: "CURLPROXY_HTTP_1_0", value: 1)
!332 = !DIEnumerator(name: "CURLPROXY_HTTPS", value: 2)
!333 = !DIEnumerator(name: "CURLPROXY_SOCKS4", value: 4)
!334 = !DIEnumerator(name: "CURLPROXY_SOCKS5", value: 5)
!335 = !DIEnumerator(name: "CURLPROXY_SOCKS4A", value: 6)
!336 = !DIEnumerator(name: "CURLPROXY_SOCKS5_HOSTNAME", value: 7)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 93, size: 32, align: 32, elements: !339)
!338 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/ftp.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!339 = !{!340, !341, !342}
!340 = !DIEnumerator(name: "FTPFILE_MULTICWD", value: 1)
!341 = !DIEnumerator(name: "FTPFILE_NOCWD", value: 2)
!342 = !DIEnumerator(name: "FTPFILE_SINGLECWD", value: 3)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "curl_khtype", file: !4, line: 704, size: 32, align: 32, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIEnumerator(name: "CURLKHTYPE_UNKNOWN", value: 0)
!346 = !DIEnumerator(name: "CURLKHTYPE_RSA1", value: 1)
!347 = !DIEnumerator(name: "CURLKHTYPE_RSA", value: 2)
!348 = !DIEnumerator(name: "CURLKHTYPE_DSS", value: 3)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "curl_khmatch", file: !4, line: 731, size: 32, align: 32, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIEnumerator(name: "CURLKHMATCH_OK", value: 0)
!352 = !DIEnumerator(name: "CURLKHMATCH_MISMATCH", value: 1)
!353 = !DIEnumerator(name: "CURLKHMATCH_MISSING", value: 2)
!354 = !DIEnumerator(name: "CURLKHMATCH_LAST", value: 3)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CURL_NETRC_OPTION", file: !4, line: 1867, size: 32, align: 32, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIEnumerator(name: "CURL_NETRC_IGNORED", value: 0)
!358 = !DIEnumerator(name: "CURL_NETRC_OPTIONAL", value: 1)
!359 = !DIEnumerator(name: "CURL_NETRC_REQUIRED", value: 2)
!360 = !DIEnumerator(name: "CURL_NETRC_LAST", value: 3)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 746, size: 32, align: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367}
!363 = !DIEnumerator(name: "CURLUSESSL_NONE", value: 0)
!364 = !DIEnumerator(name: "CURLUSESSL_TRY", value: 1)
!365 = !DIEnumerator(name: "CURLUSESSL_CONTROL", value: 2)
!366 = !DIEnumerator(name: "CURLUSESSL_ALL", value: 3)
!367 = !DIEnumerator(name: "CURLUSESSL_LAST", value: 4)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 790, size: 32, align: 32, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIEnumerator(name: "CURLFTPAUTH_DEFAULT", value: 0)
!371 = !DIEnumerator(name: "CURLFTPAUTH_SSL", value: 1)
!372 = !DIEnumerator(name: "CURLFTPAUTH_TLS", value: 2)
!373 = !DIEnumerator(name: "CURLFTPAUTH_LAST", value: 3)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 782, size: 32, align: 32, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIEnumerator(name: "CURLFTPSSL_CCC_NONE", value: 0)
!377 = !DIEnumerator(name: "CURLFTPSSL_CCC_PASSIVE", value: 1)
!378 = !DIEnumerator(name: "CURLFTPSSL_CCC_ACTIVE", value: 2)
!379 = !DIEnumerator(name: "CURLFTPSSL_CCC_LAST", value: 3)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 1251, size: 32, align: 32, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!382 = !DIEnumerator(name: "RTSPREQ_NONE", value: 0)
!383 = !DIEnumerator(name: "RTSPREQ_OPTIONS", value: 1)
!384 = !DIEnumerator(name: "RTSPREQ_DESCRIBE", value: 2)
!385 = !DIEnumerator(name: "RTSPREQ_ANNOUNCE", value: 3)
!386 = !DIEnumerator(name: "RTSPREQ_SETUP", value: 4)
!387 = !DIEnumerator(name: "RTSPREQ_PLAY", value: 5)
!388 = !DIEnumerator(name: "RTSPREQ_PAUSE", value: 6)
!389 = !DIEnumerator(name: "RTSPREQ_TEARDOWN", value: 7)
!390 = !DIEnumerator(name: "RTSPREQ_GET_PARAMETER", value: 8)
!391 = !DIEnumerator(name: "RTSPREQ_SET_PARAMETER", value: 9)
!392 = !DIEnumerator(name: "RTSPREQ_RECORD", value: 10)
!393 = !DIEnumerator(name: "RTSPREQ_RECEIVE", value: 11)
!394 = !DIEnumerator(name: "RTSPREQ_LAST", value: 12)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !396, line: 30, size: 32, align: 32, elements: !397)
!396 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/wildcard.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!397 = !{!398, !399, !400, !401, !402, !403, !404, !405}
!398 = !DIEnumerator(name: "CURLWC_CLEAR", value: 0)
!399 = !DIEnumerator(name: "CURLWC_INIT", value: 1)
!400 = !DIEnumerator(name: "CURLWC_MATCHING", value: 2)
!401 = !DIEnumerator(name: "CURLWC_DOWNLOADING", value: 3)
!402 = !DIEnumerator(name: "CURLWC_CLEAN", value: 4)
!403 = !DIEnumerator(name: "CURLWC_SKIP", value: 5)
!404 = !DIEnumerator(name: "CURLWC_ERROR", value: 6)
!405 = !DIEnumerator(name: "CURLWC_DONE", value: 7)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 2222, size: 32, align: 32, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!408 = !DIEnumerator(name: "CURLSSLBACKEND_NONE", value: 0)
!409 = !DIEnumerator(name: "CURLSSLBACKEND_OPENSSL", value: 1)
!410 = !DIEnumerator(name: "CURLSSLBACKEND_GNUTLS", value: 2)
!411 = !DIEnumerator(name: "CURLSSLBACKEND_NSS", value: 3)
!412 = !DIEnumerator(name: "CURLSSLBACKEND_OBSOLETE4", value: 4)
!413 = !DIEnumerator(name: "CURLSSLBACKEND_GSKIT", value: 5)
!414 = !DIEnumerator(name: "CURLSSLBACKEND_POLARSSL", value: 6)
!415 = !DIEnumerator(name: "CURLSSLBACKEND_CYASSL", value: 7)
!416 = !DIEnumerator(name: "CURLSSLBACKEND_SCHANNEL", value: 8)
!417 = !DIEnumerator(name: "CURLSSLBACKEND_DARWINSSL", value: 9)
!418 = !DIEnumerator(name: "CURLSSLBACKEND_AXTLS", value: 10)
!419 = !DIEnumerator(name: "CURLSSLBACKEND_MBEDTLS", value: 11)
!420 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !421, line: 31, size: 32, align: 32, elements: !422)
!421 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/http_chunks.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430}
!423 = !DIEnumerator(name: "CHUNK_HEX", value: 0)
!424 = !DIEnumerator(name: "CHUNK_LF", value: 1)
!425 = !DIEnumerator(name: "CHUNK_DATA", value: 2)
!426 = !DIEnumerator(name: "CHUNK_POSTLF", value: 3)
!427 = !DIEnumerator(name: "CHUNK_STOP", value: 4)
!428 = !DIEnumerator(name: "CHUNK_TRAILER", value: 5)
!429 = !DIEnumerator(name: "CHUNK_TRAILER_CR", value: 6)
!430 = !DIEnumerator(name: "CHUNK_TRAILER_POSTCR", value: 7)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 267, size: 32, align: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "ssl_connection_none", value: 0)
!434 = !DIEnumerator(name: "ssl_connection_negotiating", value: 1)
!435 = !DIEnumerator(name: "ssl_connection_complete", value: 2)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 258, size: 32, align: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443}
!438 = !DIEnumerator(name: "ssl_connect_1", value: 0)
!439 = !DIEnumerator(name: "ssl_connect_2", value: 1)
!440 = !DIEnumerator(name: "ssl_connect_2_reading", value: 2)
!441 = !DIEnumerator(name: "ssl_connect_2_writing", value: 3)
!442 = !DIEnumerator(name: "ssl_connect_3", value: 4)
!443 = !DIEnumerator(name: "ssl_connect_done", value: 5)
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 42, size: 32, align: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!446 = !DIEnumerator(name: "FTP_STOP", value: 0)
!447 = !DIEnumerator(name: "FTP_WAIT220", value: 1)
!448 = !DIEnumerator(name: "FTP_AUTH", value: 2)
!449 = !DIEnumerator(name: "FTP_USER", value: 3)
!450 = !DIEnumerator(name: "FTP_PASS", value: 4)
!451 = !DIEnumerator(name: "FTP_ACCT", value: 5)
!452 = !DIEnumerator(name: "FTP_PBSZ", value: 6)
!453 = !DIEnumerator(name: "FTP_PROT", value: 7)
!454 = !DIEnumerator(name: "FTP_CCC", value: 8)
!455 = !DIEnumerator(name: "FTP_PWD", value: 9)
!456 = !DIEnumerator(name: "FTP_SYST", value: 10)
!457 = !DIEnumerator(name: "FTP_NAMEFMT", value: 11)
!458 = !DIEnumerator(name: "FTP_QUOTE", value: 12)
!459 = !DIEnumerator(name: "FTP_RETR_PREQUOTE", value: 13)
!460 = !DIEnumerator(name: "FTP_STOR_PREQUOTE", value: 14)
!461 = !DIEnumerator(name: "FTP_POSTQUOTE", value: 15)
!462 = !DIEnumerator(name: "FTP_CWD", value: 16)
!463 = !DIEnumerator(name: "FTP_MKD", value: 17)
!464 = !DIEnumerator(name: "FTP_MDTM", value: 18)
!465 = !DIEnumerator(name: "FTP_TYPE", value: 19)
!466 = !DIEnumerator(name: "FTP_LIST_TYPE", value: 20)
!467 = !DIEnumerator(name: "FTP_RETR_TYPE", value: 21)
!468 = !DIEnumerator(name: "FTP_STOR_TYPE", value: 22)
!469 = !DIEnumerator(name: "FTP_SIZE", value: 23)
!470 = !DIEnumerator(name: "FTP_RETR_SIZE", value: 24)
!471 = !DIEnumerator(name: "FTP_STOR_SIZE", value: 25)
!472 = !DIEnumerator(name: "FTP_REST", value: 26)
!473 = !DIEnumerator(name: "FTP_RETR_REST", value: 27)
!474 = !DIEnumerator(name: "FTP_PORT", value: 28)
!475 = !DIEnumerator(name: "FTP_PRET", value: 29)
!476 = !DIEnumerator(name: "FTP_PASV", value: 30)
!477 = !DIEnumerator(name: "FTP_LIST", value: 31)
!478 = !DIEnumerator(name: "FTP_RETR", value: 32)
!479 = !DIEnumerator(name: "FTP_STOR", value: 33)
!480 = !DIEnumerator(name: "FTP_QUIT", value: 34)
!481 = !DIEnumerator(name: "FTP_LAST", value: 35)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !483, line: 31, size: 32, align: 32, elements: !484)
!483 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/imap.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!485 = !DIEnumerator(name: "IMAP_STOP", value: 0)
!486 = !DIEnumerator(name: "IMAP_SERVERGREET", value: 1)
!487 = !DIEnumerator(name: "IMAP_CAPABILITY", value: 2)
!488 = !DIEnumerator(name: "IMAP_STARTTLS", value: 3)
!489 = !DIEnumerator(name: "IMAP_UPGRADETLS", value: 4)
!490 = !DIEnumerator(name: "IMAP_AUTHENTICATE", value: 5)
!491 = !DIEnumerator(name: "IMAP_LOGIN", value: 6)
!492 = !DIEnumerator(name: "IMAP_LIST", value: 7)
!493 = !DIEnumerator(name: "IMAP_SELECT", value: 8)
!494 = !DIEnumerator(name: "IMAP_FETCH", value: 9)
!495 = !DIEnumerator(name: "IMAP_FETCH_FINAL", value: 10)
!496 = !DIEnumerator(name: "IMAP_APPEND", value: 11)
!497 = !DIEnumerator(name: "IMAP_APPEND_FINAL", value: 12)
!498 = !DIEnumerator(name: "IMAP_SEARCH", value: 13)
!499 = !DIEnumerator(name: "IMAP_LOGOUT", value: 14)
!500 = !DIEnumerator(name: "IMAP_LAST", value: 15)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !502, line: 58, size: 32, align: 32, elements: !503)
!502 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/curl_sasl.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!504 = !DIEnumerator(name: "SASL_STOP", value: 0)
!505 = !DIEnumerator(name: "SASL_PLAIN", value: 1)
!506 = !DIEnumerator(name: "SASL_LOGIN", value: 2)
!507 = !DIEnumerator(name: "SASL_LOGIN_PASSWD", value: 3)
!508 = !DIEnumerator(name: "SASL_EXTERNAL", value: 4)
!509 = !DIEnumerator(name: "SASL_CRAMMD5", value: 5)
!510 = !DIEnumerator(name: "SASL_DIGESTMD5", value: 6)
!511 = !DIEnumerator(name: "SASL_DIGESTMD5_RESP", value: 7)
!512 = !DIEnumerator(name: "SASL_NTLM", value: 8)
!513 = !DIEnumerator(name: "SASL_NTLM_TYPE2MSG", value: 9)
!514 = !DIEnumerator(name: "SASL_GSSAPI", value: 10)
!515 = !DIEnumerator(name: "SASL_GSSAPI_TOKEN", value: 11)
!516 = !DIEnumerator(name: "SASL_GSSAPI_NO_DATA", value: 12)
!517 = !DIEnumerator(name: "SASL_OAUTH2", value: 13)
!518 = !DIEnumerator(name: "SASL_OAUTH2_RESP", value: 14)
!519 = !DIEnumerator(name: "SASL_CANCEL", value: 15)
!520 = !DIEnumerator(name: "SASL_FINAL", value: 16)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !522, line: 31, size: 32, align: 32, elements: !523)
!522 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/pop3.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!524 = !DIEnumerator(name: "POP3_STOP", value: 0)
!525 = !DIEnumerator(name: "POP3_SERVERGREET", value: 1)
!526 = !DIEnumerator(name: "POP3_CAPA", value: 2)
!527 = !DIEnumerator(name: "POP3_STARTTLS", value: 3)
!528 = !DIEnumerator(name: "POP3_UPGRADETLS", value: 4)
!529 = !DIEnumerator(name: "POP3_AUTH", value: 5)
!530 = !DIEnumerator(name: "POP3_APOP", value: 6)
!531 = !DIEnumerator(name: "POP3_USER", value: 7)
!532 = !DIEnumerator(name: "POP3_PASS", value: 8)
!533 = !DIEnumerator(name: "POP3_COMMAND", value: 9)
!534 = !DIEnumerator(name: "POP3_QUIT", value: 10)
!535 = !DIEnumerator(name: "POP3_LAST", value: 11)
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !537, line: 31, size: 32, align: 32, elements: !538)
!537 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/smtp.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!539 = !DIEnumerator(name: "SMTP_STOP", value: 0)
!540 = !DIEnumerator(name: "SMTP_SERVERGREET", value: 1)
!541 = !DIEnumerator(name: "SMTP_EHLO", value: 2)
!542 = !DIEnumerator(name: "SMTP_HELO", value: 3)
!543 = !DIEnumerator(name: "SMTP_STARTTLS", value: 4)
!544 = !DIEnumerator(name: "SMTP_UPGRADETLS", value: 5)
!545 = !DIEnumerator(name: "SMTP_AUTH", value: 6)
!546 = !DIEnumerator(name: "SMTP_COMMAND", value: 7)
!547 = !DIEnumerator(name: "SMTP_MAIL", value: 8)
!548 = !DIEnumerator(name: "SMTP_RCPT", value: 9)
!549 = !DIEnumerator(name: "SMTP_DATA", value: 10)
!550 = !DIEnumerator(name: "SMTP_POSTDATA", value: 11)
!551 = !DIEnumerator(name: "SMTP_QUIT", value: 12)
!552 = !DIEnumerator(name: "SMTP_LAST", value: 13)
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "smb_conn_state", file: !554, line: 25, size: 32, align: 32, elements: !555)
!554 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/smb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!555 = !{!556, !557, !558, !559, !560}
!556 = !DIEnumerator(name: "SMB_NOT_CONNECTED", value: 0)
!557 = !DIEnumerator(name: "SMB_CONNECTING", value: 1)
!558 = !DIEnumerator(name: "SMB_NEGOTIATE", value: 2)
!559 = !DIEnumerator(name: "SMB_SETUP", value: 3)
!560 = !DIEnumerator(name: "SMB_CONNECTED", value: 4)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !562, file: !151, line: 1133, size: 32, align: 32, elements: !1695)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "connectdata", file: !151, line: 895, size: 13440, align: 64, elements: !563)
!563 = !{!564, !1276, !1288, !1289, !1290, !1291, !1292, !1318, !1319, !1323, !1324, !1325, !1326, !1333, !1334, !1335, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1362, !1363, !1365, !1372, !1378, !1387, !1388, !1389, !1390, !1391, !1427, !1428, !1429, !1430, !1484, !1485, !1486, !1487, !1488, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1514, !1515, !1516, !1517, !1680, !1681, !1682, !1683, !1684, !1685, !1687, !1694}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !151, line: 899, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_easy", file: !151, line: 1801, size: 160192, align: 64, elements: !567)
!567 = !{!568, !569, !570, !572, !574, !576, !592, !596, !597, !598, !664, !665, !668, !669, !1051, !1060, !1087, !1123, !1227, !1239, !1269, !1275}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !151, line: 1803, baseType: !565, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !151, line: 1804, baseType: !565, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "easy_conn", scope: !566, file: !151, line: 1806, baseType: !571, size: 64, align: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mstate", scope: !566, file: !151, line: 1808, baseType: !573, size: 32, align: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLMstate", file: !123, line: 59, baseType: !122)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !566, file: !151, line: 1809, baseType: !575, size: 32, align: 32, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLcode", file: !4, line: 561, baseType: !3)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !566, file: !151, line: 1811, baseType: !577, size: 192, align: 64, offset: 256)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_message", file: !123, line: 27, size: 192, align: 64, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "extmsg", scope: !577, file: !123, line: 29, baseType: !580, size: 192, align: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "CURLMsg", file: !101, line: 93, size: 192, align: 64, elements: !581)
!581 = !{!582, !584, !587}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !580, file: !101, line: 94, baseType: !583, size: 32, align: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLMSG", file: !101, line: 91, baseType: !145)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "easy_handle", scope: !580, file: !101, line: 95, baseType: !585, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURL", file: !4, line: 100, baseType: !566)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !580, file: !101, line: 99, baseType: !588, size: 64, align: 64, offset: 128)
!588 = !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !101, line: 96, size: 64, align: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "whatever", scope: !588, file: !101, line: 97, baseType: !169, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !588, file: !101, line: 98, baseType: !575, size: 32, align: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !566, file: !151, line: 1817, baseType: !593, size: 160, align: 32, offset: 448)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 160, align: 32, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 5)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "numsocks", scope: !566, file: !151, line: 1818, baseType: !198, size: 32, align: 32, offset: 608)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dns", scope: !566, file: !151, line: 1820, baseType: !152, size: 128, align: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !566, file: !151, line: 1821, baseType: !599, size: 64, align: 64, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_multi", file: !123, line: 70, size: 3840, align: 64, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !614, !615, !622, !623, !624, !635, !636, !637, !638, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !662, !663}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !123, line: 73, baseType: !212, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "easyp", scope: !600, file: !123, line: 76, baseType: !565, size: 64, align: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "easylp", scope: !600, file: !123, line: 77, baseType: !565, size: 64, align: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "num_easy", scope: !600, file: !123, line: 79, baseType: !198, size: 32, align: 32, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "num_alive", scope: !600, file: !123, line: 80, baseType: !198, size: 32, align: 32, offset: 224)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "msglist", scope: !600, file: !123, line: 83, baseType: !161, size: 256, align: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !600, file: !123, line: 85, baseType: !161, size: 256, align: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "socket_cb", scope: !600, file: !123, line: 89, baseType: !610, size: 64, align: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_socket_callback", file: !101, line: 268, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!198, !585, !269, !198, !169, !169}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "socket_userp", scope: !600, file: !123, line: 90, baseType: !169, size: 64, align: 64, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "push_cb", scope: !600, file: !123, line: 93, baseType: !616, size: 64, align: 64, offset: 896)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_push_callback", file: !101, line: 429, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!198, !585, !585, !179, !620, !169}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_pushheaders", file: !101, line: 422, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "push_userp", scope: !600, file: !123, line: 94, baseType: !169, size: 64, align: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hostcache", scope: !600, file: !123, line: 97, baseType: !156, size: 384, align: 64, offset: 1024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "timetree", scope: !600, file: !123, line: 101, baseType: !625, size: 64, align: 64, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_tree", file: !627, line: 26, size: 448, align: 64, elements: !628)
!627 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/splay.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!628 = !{!629, !630, !631, !632, !633, !634}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "smaller", scope: !626, file: !627, line: 27, baseType: !625, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "larger", scope: !626, file: !627, line: 28, baseType: !625, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "samen", scope: !626, file: !627, line: 29, baseType: !625, size: 64, align: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "samep", scope: !626, file: !627, line: 30, baseType: !625, size: 64, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !626, file: !627, line: 31, baseType: !222, size: 128, align: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !626, file: !627, line: 32, baseType: !169, size: 64, align: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sockhash", scope: !600, file: !123, line: 106, baseType: !156, size: 384, align: 64, offset: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining", scope: !600, file: !123, line: 109, baseType: !212, size: 64, align: 64, offset: 1856)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "recheckstate", scope: !600, file: !123, line: 111, baseType: !232, size: 8, align: 8, offset: 1920)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cache", scope: !600, file: !123, line: 114, baseType: !639, size: 640, align: 64, offset: 1984)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "conncache", file: !640, line: 26, size: 640, align: 64, elements: !641)
!640 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib/conncache.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !639, file: !640, line: 27, baseType: !156, size: 384, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num_connections", scope: !639, file: !640, line: 28, baseType: !179, size: 64, align: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next_connection_id", scope: !639, file: !640, line: 29, baseType: !212, size: 64, align: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "last_cleanup", scope: !639, file: !640, line: 30, baseType: !222, size: 128, align: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "closure_handle", scope: !600, file: !123, line: 118, baseType: !565, size: 64, align: 64, offset: 2624)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "maxconnects", scope: !600, file: !123, line: 120, baseType: !212, size: 64, align: 64, offset: 2688)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "max_host_connections", scope: !600, file: !123, line: 123, baseType: !212, size: 64, align: 64, offset: 2752)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "max_total_connections", scope: !600, file: !123, line: 126, baseType: !212, size: 64, align: 64, offset: 2816)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "max_pipeline_length", scope: !600, file: !123, line: 129, baseType: !212, size: 64, align: 64, offset: 2880)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "content_length_penalty_size", scope: !600, file: !123, line: 132, baseType: !212, size: 64, align: 64, offset: 2944)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_length_penalty_size", scope: !600, file: !123, line: 137, baseType: !212, size: 64, align: 64, offset: 3008)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining_site_bl", scope: !600, file: !123, line: 141, baseType: !161, size: 256, align: 64, offset: 3072)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pipelining_server_bl", scope: !600, file: !123, line: 144, baseType: !161, size: 256, align: 64, offset: 3328)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cb", scope: !600, file: !123, line: 148, baseType: !656, size: 64, align: 64, offset: 3584)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_multi_timer_callback", file: !101, line: 285, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!198, !660, !212, !169}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "CURLM", file: !101, line: 56, baseType: !600)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "timer_userp", scope: !600, file: !123, line: 149, baseType: !169, size: 64, align: 64, offset: 3648)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "timer_lastcall", scope: !600, file: !123, line: 150, baseType: !222, size: 128, align: 64, offset: 3712)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "multi_easy", scope: !566, file: !151, line: 1824, baseType: !599, size: 64, align: 64, offset: 832)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "share", scope: !566, file: !151, line: 1827, baseType: !666, size: 64, align: 64, offset: 896)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_share", file: !4, line: 101, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !566, file: !151, line: 1828, baseType: !207, size: 2496, align: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !566, file: !151, line: 1829, baseType: !670, size: 13760, align: 64, offset: 3456)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserDefined", file: !151, line: 1558, size: 13760, align: 64, elements: !671)
!671 = !{!672, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !747, !748, !749, !750, !755, !756, !757, !759, !760, !761, !767, !772, !778, !784, !790, !791, !815, !816, !821, !822, !823, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !850, !851, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !883, !884, !886, !887, !923, !924, !928, !930, !931, !932, !933, !934, !935, !936, !938, !939, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !982, !984, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1002, !1003, !1004, !1005, !1006, !1007, !1009, !1010, !1011, !1018, !1023, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1050}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !670, file: !151, line: 1559, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !675, line: 48, baseType: !676)
!675 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !677, line: 245, size: 1728, align: 64, elements: !678)
!677 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !699, !700, !701, !702, !704, !706, !708, !712, !715, !717, !718, !719, !720, !721, !722, !723}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !676, file: !677, line: 246, baseType: !198, size: 32, align: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !676, file: !677, line: 251, baseType: !236, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !676, file: !677, line: 252, baseType: !236, size: 64, align: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !676, file: !677, line: 253, baseType: !236, size: 64, align: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !676, file: !677, line: 254, baseType: !236, size: 64, align: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !676, file: !677, line: 255, baseType: !236, size: 64, align: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !676, file: !677, line: 256, baseType: !236, size: 64, align: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !676, file: !677, line: 257, baseType: !236, size: 64, align: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !676, file: !677, line: 258, baseType: !236, size: 64, align: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !676, file: !677, line: 260, baseType: !236, size: 64, align: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !676, file: !677, line: 261, baseType: !236, size: 64, align: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !676, file: !677, line: 262, baseType: !236, size: 64, align: 64, offset: 704)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !676, file: !677, line: 264, baseType: !692, size: 64, align: 64, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !677, line: 160, size: 192, align: 64, elements: !694)
!694 = !{!695, !696, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !693, file: !677, line: 161, baseType: !692, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !693, file: !677, line: 162, baseType: !697, size: 64, align: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !693, file: !677, line: 166, baseType: !198, size: 32, align: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !676, file: !677, line: 266, baseType: !697, size: 64, align: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !676, file: !677, line: 268, baseType: !198, size: 32, align: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !676, file: !677, line: 272, baseType: !198, size: 32, align: 32, offset: 928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !676, file: !677, line: 274, baseType: !703, size: 64, align: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !227, line: 131, baseType: !212)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !676, file: !677, line: 278, baseType: !705, size: 16, align: 16, offset: 1024)
!705 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !676, file: !677, line: 279, baseType: !707, size: 8, align: 8, offset: 1040)
!707 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !676, file: !677, line: 280, baseType: !709, size: 8, align: 8, offset: 1048)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 8, align: 8, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 1)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !676, file: !677, line: 284, baseType: !713, size: 64, align: 64, offset: 1088)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !677, line: 154, baseType: null)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !676, file: !677, line: 293, baseType: !716, size: 64, align: 64, offset: 1152)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !227, line: 132, baseType: !212)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !676, file: !677, line: 302, baseType: !169, size: 64, align: 64, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !676, file: !677, line: 303, baseType: !169, size: 64, align: 64, offset: 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !676, file: !677, line: 304, baseType: !169, size: 64, align: 64, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !676, file: !677, line: 305, baseType: !169, size: 64, align: 64, offset: 1408)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !676, file: !677, line: 306, baseType: !179, size: 64, align: 64, offset: 1472)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !676, file: !677, line: 308, baseType: !198, size: 32, align: 32, offset: 1536)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !676, file: !677, line: 310, baseType: !724, size: 160, align: 8, offset: 1568)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 160, align: 8, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 20)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "debugdata", scope: !670, file: !151, line: 1560, baseType: !169, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "errorbuffer", scope: !670, file: !151, line: 1561, baseType: !236, size: 64, align: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "proxyport", scope: !670, file: !151, line: 1562, baseType: !212, size: 64, align: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !670, file: !151, line: 1565, baseType: !169, size: 64, align: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "in_set", scope: !670, file: !151, line: 1566, baseType: !169, size: 64, align: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "writeheader", scope: !670, file: !151, line: 1567, baseType: !169, size: 64, align: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_out", scope: !670, file: !151, line: 1568, baseType: !169, size: 64, align: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "use_port", scope: !670, file: !151, line: 1569, baseType: !212, size: 64, align: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "httpauth", scope: !670, file: !151, line: 1570, baseType: !181, size: 64, align: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "proxyauth", scope: !670, file: !151, line: 1571, baseType: !181, size: 64, align: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "followlocation", scope: !670, file: !151, line: 1572, baseType: !212, size: 64, align: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "maxredirs", scope: !670, file: !151, line: 1573, baseType: !212, size: 64, align: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "keep_post", scope: !670, file: !151, line: 1576, baseType: !198, size: 32, align: 32, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "free_referer", scope: !670, file: !151, line: 1578, baseType: !232, size: 8, align: 8, offset: 864)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "postfields", scope: !670, file: !151, line: 1580, baseType: !169, size: 64, align: 64, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "seek_func", scope: !670, file: !151, line: 1581, baseType: !743, size: 64, align: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_seek_callback", file: !4, line: 324, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!198, !169, !210, !198}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "postfieldsize", scope: !670, file: !151, line: 1582, baseType: !210, size: 64, align: 64, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "localport", scope: !670, file: !151, line: 1585, baseType: !705, size: 16, align: 16, offset: 1088)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "localportrange", scope: !670, file: !151, line: 1586, baseType: !198, size: 32, align: 32, offset: 1120)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_func", scope: !670, file: !151, line: 1588, baseType: !751, size: 64, align: 64, offset: 1152)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_write_callback", file: !4, line: 223, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!179, !236, !179, !179, !169}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_header", scope: !670, file: !151, line: 1589, baseType: !751, size: 64, align: 64, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fwrite_rtp", scope: !670, file: !151, line: 1590, baseType: !751, size: 64, align: 64, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fread_func_set", scope: !670, file: !151, line: 1591, baseType: !758, size: 64, align: 64, offset: 1344)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_read_callback", file: !4, line: 335, baseType: !752)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "is_fread_set", scope: !670, file: !151, line: 1592, baseType: !198, size: 32, align: 32, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "is_fwrite_set", scope: !670, file: !151, line: 1593, baseType: !198, size: 32, align: 32, offset: 1440)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "fprogress", scope: !670, file: !151, line: 1594, baseType: !762, size: 64, align: 64, offset: 1472)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_progress_callback", file: !4, line: 183, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!198, !169, !766, !766, !766, !766}
!766 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fxferinfo", scope: !670, file: !151, line: 1595, baseType: !768, size: 64, align: 64, offset: 1536)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_xferinfo_callback", file: !4, line: 191, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!198, !169, !210, !210, !210, !210}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fdebug", scope: !670, file: !151, line: 1596, baseType: !773, size: 64, align: 64, offset: 1600)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_debug_callback", file: !4, line: 420, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!198, !585, !777, !236, !179, !169}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_infotype", file: !4, line: 418, baseType: !290)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl_func", scope: !670, file: !151, line: 1597, baseType: !779, size: 64, align: 64, offset: 1664)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ioctl_callback", file: !4, line: 388, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !585, !198, !169}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "curlioerr", file: !4, line: 380, baseType: !300)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fsockopt", scope: !670, file: !151, line: 1598, baseType: !785, size: 64, align: 64, offset: 1728)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_sockopt_callback", file: !4, line: 353, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!198, !169, !269, !789}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "curlsocktype", file: !4, line: 344, baseType: !306)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sockopt_client", scope: !670, file: !151, line: 1599, baseType: !169, size: 64, align: 64, offset: 1792)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fopensocket", scope: !670, file: !151, line: 1600, baseType: !792, size: 64, align: 64, offset: 1856)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_opensocket_callback", file: !4, line: 368, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64, align: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!269, !169, !789, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_sockaddr", file: !4, line: 357, size: 256, align: 32, elements: !798)
!798 = !{!799, !800, !801, !802, !804}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !797, file: !4, line: 358, baseType: !198, size: 32, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "socktype", scope: !797, file: !4, line: 359, baseType: !198, size: 32, align: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !797, file: !4, line: 360, baseType: !198, size: 32, align: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "addrlen", scope: !797, file: !4, line: 361, baseType: !803, size: 32, align: 32, offset: 96)
!803 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !797, file: !4, line: 364, baseType: !805, size: 128, align: 16, offset: 128)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !806, line: 149, size: 128, align: 16, elements: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!807 = !{!808, !811}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !805, file: !806, line: 151, baseType: !809, size: 16, align: 16)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !810, line: 28, baseType: !705)
!810 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcurl/lib")
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !805, file: !806, line: 152, baseType: !812, size: 112, align: 8, offset: 16)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 112, align: 8, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 14)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "opensocket_client", scope: !670, file: !151, line: 1603, baseType: !169, size: 64, align: 64, offset: 1920)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fclosesocket", scope: !670, file: !151, line: 1604, baseType: !817, size: 64, align: 64, offset: 1984)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_closesocket_callback", file: !4, line: 373, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!198, !169, !269}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "closesocket_client", scope: !670, file: !151, line: 1606, baseType: !169, size: 64, align: 64, offset: 2048)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seek_client", scope: !670, file: !151, line: 1608, baseType: !169, size: 64, align: 64, offset: 2112)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "convfromnetwork", scope: !670, file: !151, line: 1611, baseType: !824, size: 64, align: 64, offset: 2176)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_conv_callback", file: !4, line: 637, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!575, !236, !179}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "convtonetwork", scope: !670, file: !151, line: 1613, baseType: !824, size: 64, align: 64, offset: 2240)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "convfromutf8", scope: !670, file: !151, line: 1615, baseType: !824, size: 64, align: 64, offset: 2304)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "progress_client", scope: !670, file: !151, line: 1617, baseType: !169, size: 64, align: 64, offset: 2368)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl_client", scope: !670, file: !151, line: 1618, baseType: !169, size: 64, align: 64, offset: 2432)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !670, file: !151, line: 1619, baseType: !212, size: 64, align: 64, offset: 2496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "connecttimeout", scope: !670, file: !151, line: 1620, baseType: !212, size: 64, align: 64, offset: 2560)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "accepttimeout", scope: !670, file: !151, line: 1621, baseType: !212, size: 64, align: 64, offset: 2624)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "server_response_timeout", scope: !670, file: !151, line: 1622, baseType: !212, size: 64, align: 64, offset: 2688)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_blksize", scope: !670, file: !151, line: 1623, baseType: !212, size: 64, align: 64, offset: 2752)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tftp_no_options", scope: !670, file: !151, line: 1624, baseType: !232, size: 8, align: 8, offset: 2816)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !670, file: !151, line: 1625, baseType: !210, size: 64, align: 64, offset: 2880)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "low_speed_limit", scope: !670, file: !151, line: 1626, baseType: !212, size: 64, align: 64, offset: 2944)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "low_speed_time", scope: !670, file: !151, line: 1627, baseType: !212, size: 64, align: 64, offset: 3008)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "max_send_speed", scope: !670, file: !151, line: 1628, baseType: !210, size: 64, align: 64, offset: 3072)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "max_recv_speed", scope: !670, file: !151, line: 1629, baseType: !210, size: 64, align: 64, offset: 3136)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "set_resume_from", scope: !670, file: !151, line: 1631, baseType: !210, size: 64, align: 64, offset: 3200)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !670, file: !151, line: 1632, baseType: !845, size: 64, align: 64, offset: 3264)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, align: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_slist", file: !4, line: 2176, size: 128, align: 64, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !846, file: !4, line: 2177, baseType: !236, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !4, line: 2178, baseType: !845, size: 64, align: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "proxyheaders", scope: !670, file: !151, line: 1633, baseType: !845, size: 64, align: 64, offset: 3328)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "httppost", scope: !670, file: !151, line: 1634, baseType: !852, size: 64, align: 64, offset: 3392)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_httppost", file: !4, line: 137, size: 896, align: 64, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !4, line: 138, baseType: !852, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !4, line: 139, baseType: !236, size: 64, align: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "namelength", scope: !853, file: !4, line: 140, baseType: !212, size: 64, align: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !853, file: !4, line: 141, baseType: !236, size: 64, align: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "contentslength", scope: !853, file: !4, line: 142, baseType: !212, size: 64, align: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !853, file: !4, line: 144, baseType: !236, size: 64, align: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bufferlength", scope: !853, file: !4, line: 145, baseType: !212, size: 64, align: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !853, file: !4, line: 146, baseType: !236, size: 64, align: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "contentheader", scope: !853, file: !4, line: 147, baseType: !845, size: 64, align: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "more", scope: !853, file: !4, line: 148, baseType: !852, size: 64, align: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !853, file: !4, line: 151, baseType: !212, size: 64, align: 64, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "showfilename", scope: !853, file: !4, line: 171, baseType: !236, size: 64, align: 64, offset: 704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "userp", scope: !853, file: !4, line: 174, baseType: !169, size: 64, align: 64, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "contentlen", scope: !853, file: !4, line: 176, baseType: !210, size: 64, align: 64, offset: 832)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sep_headers", scope: !670, file: !151, line: 1635, baseType: !232, size: 8, align: 8, offset: 3456)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "cookiesession", scope: !670, file: !151, line: 1636, baseType: !232, size: 8, align: 8, offset: 3464)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "crlf", scope: !670, file: !151, line: 1637, baseType: !232, size: 8, align: 8, offset: 3472)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !670, file: !151, line: 1638, baseType: !845, size: 64, align: 64, offset: 3520)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "postquote", scope: !670, file: !151, line: 1639, baseType: !845, size: 64, align: 64, offset: 3584)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prequote", scope: !670, file: !151, line: 1640, baseType: !845, size: 64, align: 64, offset: 3648)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "source_quote", scope: !670, file: !151, line: 1641, baseType: !845, size: 64, align: 64, offset: 3712)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "source_prequote", scope: !670, file: !151, line: 1642, baseType: !845, size: 64, align: 64, offset: 3776)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "source_postquote", scope: !670, file: !151, line: 1644, baseType: !845, size: 64, align: 64, offset: 3840)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "telnet_options", scope: !670, file: !151, line: 1646, baseType: !845, size: 64, align: 64, offset: 3904)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "resolve", scope: !670, file: !151, line: 1647, baseType: !845, size: 64, align: 64, offset: 3968)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "connect_to", scope: !670, file: !151, line: 1649, baseType: !845, size: 64, align: 64, offset: 4032)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "timecondition", scope: !670, file: !151, line: 1651, baseType: !882, size: 32, align: 32, offset: 4096)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_TimeCond", file: !4, line: 1929, baseType: !311)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "timevalue", scope: !670, file: !151, line: 1652, baseType: !263, size: 64, align: 64, offset: 4160)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "httpreq", scope: !670, file: !151, line: 1653, baseType: !885, size: 32, align: 32, offset: 4224)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_HttpReq", file: !151, line: 1249, baseType: !318)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "httpversion", scope: !670, file: !151, line: 1654, baseType: !212, size: 64, align: 64, offset: 4288)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !670, file: !151, line: 1656, baseType: !888, size: 1408, align: 64, offset: 4352)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_config_data", file: !151, line: 366, size: 1408, align: 64, elements: !889)
!889 = !{!890, !905, !906, !907, !908, !909, !910, !915, !916, !917, !918, !919, !920, !921, !922}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !888, file: !151, line: 367, baseType: !891, size: 640, align: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_primary_config", file: !151, line: 351, size: 640, align: 64, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !891, file: !151, line: 352, baseType: !212, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "version_max", scope: !891, file: !151, line: 353, baseType: !212, size: 64, align: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "verifypeer", scope: !891, file: !151, line: 354, baseType: !232, size: 8, align: 8, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "verifyhost", scope: !891, file: !151, line: 355, baseType: !232, size: 8, align: 8, offset: 136)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "verifystatus", scope: !891, file: !151, line: 356, baseType: !232, size: 8, align: 8, offset: 144)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "CApath", scope: !891, file: !151, line: 357, baseType: !236, size: 64, align: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "CAfile", scope: !891, file: !151, line: 358, baseType: !236, size: 64, align: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "clientcert", scope: !891, file: !151, line: 359, baseType: !236, size: 64, align: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "random_file", scope: !891, file: !151, line: 360, baseType: !236, size: 64, align: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "egdsocket", scope: !891, file: !151, line: 361, baseType: !236, size: 64, align: 64, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !891, file: !151, line: 362, baseType: !236, size: 64, align: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "sessionid", scope: !891, file: !151, line: 363, baseType: !232, size: 8, align: 8, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "enable_beast", scope: !888, file: !151, line: 368, baseType: !232, size: 8, align: 8, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "no_revoke", scope: !888, file: !151, line: 370, baseType: !232, size: 8, align: 8, offset: 648)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "certverifyresult", scope: !888, file: !151, line: 371, baseType: !212, size: 64, align: 64, offset: 704)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "CRLfile", scope: !888, file: !151, line: 372, baseType: !236, size: 64, align: 64, offset: 768)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "issuercert", scope: !888, file: !151, line: 373, baseType: !236, size: 64, align: 64, offset: 832)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fsslctx", scope: !888, file: !151, line: 374, baseType: !911, size: 64, align: 64, offset: 896)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ssl_ctx_callback", file: !4, line: 639, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!575, !585, !169, !169}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fsslctxp", scope: !888, file: !151, line: 375, baseType: !169, size: 64, align: 64, offset: 960)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "certinfo", scope: !888, file: !151, line: 376, baseType: !232, size: 8, align: 8, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "falsestart", scope: !888, file: !151, line: 377, baseType: !232, size: 8, align: 8, offset: 1032)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !888, file: !151, line: 379, baseType: !236, size: 64, align: 64, offset: 1088)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !888, file: !151, line: 380, baseType: !236, size: 64, align: 64, offset: 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !888, file: !151, line: 381, baseType: !236, size: 64, align: 64, offset: 1216)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "key_type", scope: !888, file: !151, line: 382, baseType: !236, size: 64, align: 64, offset: 1280)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "key_passwd", scope: !888, file: !151, line: 383, baseType: !236, size: 64, align: 64, offset: 1344)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_ssl", scope: !670, file: !151, line: 1657, baseType: !888, size: 1408, align: 64, offset: 5760)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "general_ssl", scope: !670, file: !151, line: 1658, baseType: !925, size: 64, align: 64, offset: 7168)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_general_config", file: !151, line: 392, size: 64, align: 64, elements: !926)
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "max_ssl_sessions", scope: !925, file: !151, line: 393, baseType: !179, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "proxytype", scope: !670, file: !151, line: 1659, baseType: !929, size: 32, align: 32, offset: 7232)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_proxytype", file: !4, line: 657, baseType: !328)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_timeout", scope: !670, file: !151, line: 1660, baseType: !212, size: 64, align: 64, offset: 7296)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !670, file: !151, line: 1661, baseType: !212, size: 64, align: 64, offset: 7360)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !670, file: !151, line: 1662, baseType: !169, size: 64, align: 64, offset: 7424)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "http200aliases", scope: !670, file: !151, line: 1664, baseType: !845, size: 64, align: 64, offset: 7488)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ipver", scope: !670, file: !151, line: 1666, baseType: !212, size: 64, align: 64, offset: 7552)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "max_filesize", scope: !670, file: !151, line: 1669, baseType: !210, size: 64, align: 64, offset: 7616)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_filemethod", scope: !670, file: !151, line: 1671, baseType: !937, size: 32, align: 32, offset: 7680)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpfile", file: !338, line: 98, baseType: !337)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_create_missing_dirs", scope: !670, file: !151, line: 1673, baseType: !198, size: 32, align: 32, offset: 7712)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_keyfunc", scope: !670, file: !151, line: 1677, baseType: !940, size: 64, align: 64, offset: 7744)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_sshkeycallback", file: !4, line: 739, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!198, !585, !944, !944, !349, !169}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "curl_khkey", file: !4, line: 711, size: 192, align: 64, elements: !947)
!947 = !{!948, !951, !952}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !946, file: !4, line: 712, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !946, file: !4, line: 714, baseType: !179, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "keytype", scope: !946, file: !4, line: 715, baseType: !343, size: 32, align: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_keyfunc_userp", scope: !670, file: !151, line: 1678, baseType: !169, size: 64, align: 64, offset: 7808)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "printhost", scope: !670, file: !151, line: 1684, baseType: !232, size: 8, align: 8, offset: 7872)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "get_filetime", scope: !670, file: !151, line: 1685, baseType: !232, size: 8, align: 8, offset: 7880)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tunnel_thru_httpproxy", scope: !670, file: !151, line: 1686, baseType: !232, size: 8, align: 8, offset: 7888)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "prefer_ascii", scope: !670, file: !151, line: 1687, baseType: !232, size: 8, align: 8, offset: 7896)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_append", scope: !670, file: !151, line: 1688, baseType: !232, size: 8, align: 8, offset: 7904)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_list_only", scope: !670, file: !151, line: 1689, baseType: !232, size: 8, align: 8, offset: 7912)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_port", scope: !670, file: !151, line: 1690, baseType: !232, size: 8, align: 8, offset: 7920)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "hide_progress", scope: !670, file: !151, line: 1691, baseType: !232, size: 8, align: 8, offset: 7928)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "http_fail_on_error", scope: !670, file: !151, line: 1692, baseType: !232, size: 8, align: 8, offset: 7936)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "http_keep_sending_on_error", scope: !670, file: !151, line: 1693, baseType: !232, size: 8, align: 8, offset: 7944)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "http_follow_location", scope: !670, file: !151, line: 1694, baseType: !232, size: 8, align: 8, offset: 7952)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "http_transfer_encoding", scope: !670, file: !151, line: 1695, baseType: !232, size: 8, align: 8, offset: 7960)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "http_disable_hostname_check_before_authentication", scope: !670, file: !151, line: 1696, baseType: !232, size: 8, align: 8, offset: 7968)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "include_header", scope: !670, file: !151, line: 1697, baseType: !232, size: 8, align: 8, offset: 7976)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "http_set_referer", scope: !670, file: !151, line: 1698, baseType: !232, size: 8, align: 8, offset: 7984)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "http_auto_referer", scope: !670, file: !151, line: 1699, baseType: !232, size: 8, align: 8, offset: 7992)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "opt_no_body", scope: !670, file: !151, line: 1700, baseType: !232, size: 8, align: 8, offset: 8000)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !670, file: !151, line: 1701, baseType: !232, size: 8, align: 8, offset: 8008)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "use_netrc", scope: !670, file: !151, line: 1703, baseType: !355, size: 32, align: 32, offset: 8032)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !670, file: !151, line: 1704, baseType: !232, size: 8, align: 8, offset: 8064)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "krb", scope: !670, file: !151, line: 1705, baseType: !232, size: 8, align: 8, offset: 8072)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_forbid", scope: !670, file: !151, line: 1706, baseType: !232, size: 8, align: 8, offset: 8080)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_fresh", scope: !670, file: !151, line: 1707, baseType: !232, size: 8, align: 8, offset: 8088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_epsv", scope: !670, file: !151, line: 1708, baseType: !232, size: 8, align: 8, offset: 8096)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_eprt", scope: !670, file: !151, line: 1709, baseType: !232, size: 8, align: 8, offset: 8104)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_use_pret", scope: !670, file: !151, line: 1710, baseType: !232, size: 8, align: 8, offset: 8112)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "use_ssl", scope: !670, file: !151, line: 1712, baseType: !981, size: 32, align: 32, offset: 8128)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_usessl", file: !4, line: 752, baseType: !361)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ftpsslauth", scope: !670, file: !151, line: 1714, baseType: !983, size: 32, align: 32, offset: 8160)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpauth", file: !4, line: 795, baseType: !368)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_ccc", scope: !670, file: !151, line: 1715, baseType: !985, size: 32, align: 32, offset: 8192)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_ftpccc", file: !4, line: 787, baseType: !374)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "no_signal", scope: !670, file: !151, line: 1716, baseType: !232, size: 8, align: 8, offset: 8224)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "global_dns_cache", scope: !670, file: !151, line: 1717, baseType: !232, size: 8, align: 8, offset: 8232)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !670, file: !151, line: 1718, baseType: !232, size: 8, align: 8, offset: 8240)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ignorecl", scope: !670, file: !151, line: 1719, baseType: !232, size: 8, align: 8, offset: 8248)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_skip_ip", scope: !670, file: !151, line: 1720, baseType: !232, size: 8, align: 8, offset: 8256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "connect_only", scope: !670, file: !151, line: 1722, baseType: !232, size: 8, align: 8, offset: 8264)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ssh_auth_types", scope: !670, file: !151, line: 1723, baseType: !212, size: 64, align: 64, offset: 8320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "http_te_skip", scope: !670, file: !151, line: 1724, baseType: !232, size: 8, align: 8, offset: 8384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "http_ce_skip", scope: !670, file: !151, line: 1726, baseType: !232, size: 8, align: 8, offset: 8392)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "new_file_perms", scope: !670, file: !151, line: 1728, baseType: !212, size: 64, align: 64, offset: 8448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "new_directory_perms", scope: !670, file: !151, line: 1729, baseType: !212, size: 64, align: 64, offset: 8512)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_transfer_mode", scope: !670, file: !151, line: 1730, baseType: !232, size: 8, align: 8, offset: 8576)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !670, file: !151, line: 1732, baseType: !999, size: 3584, align: 64, offset: 8640)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 3584, align: 64, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 56)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !670, file: !151, line: 1733, baseType: !803, size: 32, align: 32, offset: 12224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "allowed_protocols", scope: !670, file: !151, line: 1734, baseType: !212, size: 64, align: 64, offset: 12288)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "redir_protocols", scope: !670, file: !151, line: 1735, baseType: !212, size: 64, align: 64, offset: 12352)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mail_rcpt", scope: !670, file: !151, line: 1739, baseType: !845, size: 64, align: 64, offset: 12416)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_ir", scope: !670, file: !151, line: 1740, baseType: !232, size: 8, align: 8, offset: 12480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rtspreq", scope: !670, file: !151, line: 1742, baseType: !1008, size: 32, align: 32, offset: 12512)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curl_RtspReq", file: !151, line: 1265, baseType: !380)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rtspversion", scope: !670, file: !151, line: 1743, baseType: !212, size: 64, align: 64, offset: 12544)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "wildcardmatch", scope: !670, file: !151, line: 1744, baseType: !232, size: 8, align: 8, offset: 12608)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_bgn", scope: !670, file: !151, line: 1745, baseType: !1012, size: 64, align: 64, offset: 12672)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_chunk_bgn_callback", file: !4, line: 292, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!212, !1016, !169, !198}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_end", scope: !670, file: !151, line: 1747, baseType: !1019, size: 64, align: 64, offset: 12736)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_chunk_end_callback", file: !4, line: 306, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!212, !169}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "fnmatch", scope: !670, file: !151, line: 1749, baseType: !1024, size: 64, align: 64, offset: 12800)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "curl_fnmatch_callback", file: !4, line: 315, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!198, !169, !949, !949}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "fnmatch_data", scope: !670, file: !151, line: 1751, baseType: !169, size: 64, align: 64, offset: 12864)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gssapi_delegation", scope: !670, file: !151, line: 1753, baseType: !212, size: 64, align: 64, offset: 12928)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepalive", scope: !670, file: !151, line: 1756, baseType: !232, size: 8, align: 8, offset: 12992)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepidle", scope: !670, file: !151, line: 1757, baseType: !212, size: 64, align: 64, offset: 13056)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_keepintvl", scope: !670, file: !151, line: 1758, baseType: !212, size: 64, align: 64, offset: 13120)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_fastopen", scope: !670, file: !151, line: 1759, baseType: !232, size: 8, align: 8, offset: 13184)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "maxconnects", scope: !670, file: !151, line: 1761, baseType: !179, size: 64, align: 64, offset: 13248)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_enable_npn", scope: !670, file: !151, line: 1763, baseType: !232, size: 8, align: 8, offset: 13312)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_enable_alpn", scope: !670, file: !151, line: 1764, baseType: !232, size: 8, align: 8, offset: 13320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "path_as_is", scope: !670, file: !151, line: 1765, baseType: !232, size: 8, align: 8, offset: 13328)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pipewait", scope: !670, file: !151, line: 1766, baseType: !232, size: 8, align: 8, offset: 13336)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "expect_100_timeout", scope: !670, file: !151, line: 1768, baseType: !212, size: 64, align: 64, offset: 13376)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_connect_headers", scope: !670, file: !151, line: 1769, baseType: !232, size: 8, align: 8, offset: 13440)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "stream_depends_on", scope: !670, file: !151, line: 1772, baseType: !565, size: 64, align: 64, offset: 13504)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "stream_depends_e", scope: !670, file: !151, line: 1773, baseType: !232, size: 8, align: 8, offset: 13568)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "stream_weight", scope: !670, file: !151, line: 1774, baseType: !198, size: 32, align: 32, offset: 13600)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "stream_dependents", scope: !670, file: !151, line: 1776, baseType: !1045, size: 64, align: 64, offset: 13632)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "Curl_http2_dep", file: !151, line: 1292, size: 128, align: 64, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1046, file: !151, line: 1293, baseType: !1045, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !151, line: 1294, baseType: !565, size: 64, align: 64, offset: 64)
