; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma2_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { i32, %struct.lzma_coder_s*, %struct.lzma_options_lzma, i8, i8, i8, i64, i64, i64, [65542 x i8] }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_lz_encoder = type { %struct.lzma_coder_s*, i32 (%struct.lzma_coder_s*, %struct.lzma_mf_s*, i8*, i64*, i64)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*, %struct.lzma_filter*)* }
%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !113, subprograms: !116)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma2_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !46, !53, !71, !100, !106}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !19, file: !1, line: 21, size: 32, align: 32, elements: !94)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 20, size: 525632, align: 64, elements: !20)
!20 = !{!21, !22, !26, !80, !82, !83, !84, !88, !89, !90}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !19, file: !1, line: 27, baseType: !18, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !19, file: !1, line: 30, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !25, line: 73, baseType: !19)
!25 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "opt_cur", scope: !19, file: !1, line: 33, baseType: !27, size: 896, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !28, line: 399, baseType: !29)
!28 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 185, size: 896, align: 64, elements: !30)
!30 = !{!31, !35, !40, !41, !42, !43, !44, !50, !51, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !74, !75, !76, !77, !79}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !29, file: !28, line: 217, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 51, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !29, file: !28, line: 240, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 48, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !29, file: !28, line: 254, baseType: !32, size: 32, align: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !29, file: !28, line: 281, baseType: !32, size: 32, align: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !29, file: !28, line: 293, baseType: !32, size: 32, align: 32, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !29, file: !28, line: 316, baseType: !32, size: 32, align: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !29, file: !28, line: 322, baseType: !45, size: 32, align: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !28, line: 155, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 138, size: 32, align: 32, elements: !47)
!47 = !{!48, !49}
!48 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!49 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !29, file: !28, line: 342, baseType: !32, size: 32, align: 32, offset: 288)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !29, file: !28, line: 345, baseType: !52, size: 32, align: 32, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !28, line: 111, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 58, size: 32, align: 32, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!56 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!57 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!58 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!59 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !29, file: !28, line: 375, baseType: !32, size: 32, align: 32, offset: 352)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !29, file: !28, line: 384, baseType: !32, size: 32, align: 32, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !29, file: !28, line: 385, baseType: !32, size: 32, align: 32, offset: 416)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !29, file: !28, line: 386, baseType: !32, size: 32, align: 32, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !29, file: !28, line: 387, baseType: !32, size: 32, align: 32, offset: 480)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !29, file: !28, line: 388, baseType: !32, size: 32, align: 32, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !29, file: !28, line: 389, baseType: !32, size: 32, align: 32, offset: 544)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !29, file: !28, line: 390, baseType: !32, size: 32, align: 32, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !29, file: !28, line: 391, baseType: !32, size: 32, align: 32, offset: 608)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !29, file: !28, line: 392, baseType: !70, size: 32, align: 32, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !72)
!72 = !{!73}
!73 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !29, file: !28, line: 393, baseType: !70, size: 32, align: 32, offset: 672)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !29, file: !28, line: 394, baseType: !70, size: 32, align: 32, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !29, file: !28, line: 395, baseType: !70, size: 32, align: 32, offset: 736)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !29, file: !28, line: 396, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !29, file: !28, line: 397, baseType: !78, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !19, file: !1, line: 35, baseType: !81, size: 8, align: 8, offset: 1024)
!81 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "need_state_reset", scope: !19, file: !1, line: 36, baseType: !81, size: 8, align: 8, offset: 1032)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !19, file: !1, line: 37, baseType: !81, size: 8, align: 8, offset: 1040)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !19, file: !1, line: 40, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 62, baseType: !87)
!86 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!87 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !19, file: !1, line: 44, baseType: !85, size: 64, align: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !19, file: !1, line: 47, baseType: !85, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !19, file: !1, line: 50, baseType: !91, size: 524336, align: 8, offset: 1280)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 524336, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 65542)
!94 = !{!95, !96, !97, !98, !99}
!95 = !DIEnumerator(name: "SEQ_INIT", value: 0)
!96 = !DIEnumerator(name: "SEQ_LZMA_ENCODE", value: 1)
!97 = !DIEnumerator(name: "SEQ_LZMA_COPY", value: 2)
!98 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_HEADER", value: 3)
!99 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_COPY", value: 4)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!103 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!104 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!105 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 27, size: 32, align: 32, elements: !108)
!107 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!108 = !{!109, !110, !111, !112}
!109 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!110 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!111 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!112 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!113 = !{!78, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!116 = !{!117, !196, !201, !204, !277, !278, !283, !286, !287, !290, !291, !292}
!117 = distinct !DISubprogram(name: "lzma_lzma2_encoder_init", scope: !1, file: !1, line: 358, type: !118, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !121, !137, !185}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !25, line: 75, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !25, line: 119, size: 512, align: 64, elements: !124)
!124 = !{!125, !126, !130, !132, !156, !161, !168, !173}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !123, file: !25, line: 121, baseType: !23, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !25, line: 125, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !128, line: 63, baseType: !129)
!128 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 55, baseType: !87)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !123, file: !25, line: 131, baseType: !131, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 122, baseType: !87)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !123, file: !25, line: 134, baseType: !133, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !25, line: 89, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!120, !23, !137, !150, !151, !85, !153, !151, !85, !155}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !140)
!140 = !{!141, !145, !149}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !139, file: !4, line: 376, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!78, !78, !85, !85}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !139, file: !4, line: 390, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !78, !78}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !139, file: !4, line: 401, baseType: !78, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !36)
!151 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !100)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !123, file: !25, line: 139, baseType: !157, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !25, line: 97, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !23, !137}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !123, file: !25, line: 143, baseType: !162, size: 64, align: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !107, line: 55, baseType: !106)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !123, file: !25, line: 147, baseType: !169, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!120, !23, !172, !172, !129}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !123, file: !25, line: 152, baseType: !174, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!120, !23, !137, !177, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !180, line: 65, baseType: !181)
!180 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 43, size: 128, align: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !181, file: !180, line: 54, baseType: !127, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !181, file: !180, line: 63, baseType: !78, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !25, line: 77, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !25, line: 104, size: 192, align: 64, elements: !189)
!189 = !{!190, !191, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !188, file: !25, line: 107, baseType: !127, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !188, file: !25, line: 111, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !25, line: 81, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !188, file: !25, line: 114, baseType: !78, size: 64, align: 64, offset: 128)
!195 = !{}
!196 = distinct !DISubprogram(name: "lzma_lzma2_encoder_memusage", scope: !1, file: !1, line: 367, type: !197, isLocal: false, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!197 = !DISubroutineType(types: !198)
!198 = !{!129, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!201 = distinct !DISubprogram(name: "lzma_lzma2_props_encode", scope: !1, file: !1, line: 378, type: !202, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!202 = !DISubroutineType(types: !203)
!203 = !{!120, !199, !154}
!204 = distinct !DISubprogram(name: "lzma2_encoder_init", scope: !1, file: !1, line: 313, type: !205, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!205 = !DISubroutineType(types: !206)
!206 = !{!120, !207, !137, !199, !264}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !209, line: 208, baseType: !210)
!209 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 192, size: 256, align: 64, elements: !211)
!211 = !{!212, !213, !259, !260}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !210, file: !209, line: 194, baseType: !23, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !210, file: !209, line: 197, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!120, !217, !218, !153, !151, !85}
!217 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !23)
!218 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !209, line: 28, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !209, line: 29, size: 960, align: 64, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !243, !247, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !221, file: !209, line: 35, baseType: !154, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !209, line: 39, baseType: !32, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !221, file: !209, line: 45, baseType: !32, size: 32, align: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !221, file: !209, line: 51, baseType: !32, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !221, file: !209, line: 58, baseType: !32, size: 32, align: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !221, file: !209, line: 63, baseType: !32, size: 32, align: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !221, file: !209, line: 67, baseType: !32, size: 32, align: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !221, file: !209, line: 75, baseType: !32, size: 32, align: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !221, file: !209, line: 80, baseType: !32, size: 32, align: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !221, file: !209, line: 84, baseType: !32, size: 32, align: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !221, file: !209, line: 92, baseType: !234, size: 64, align: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!32, !219, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !209, line: 25, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 22, size: 64, align: 32, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !239, file: !209, line: 23, baseType: !32, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !239, file: !209, line: 24, baseType: !32, size: 32, align: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !221, file: !209, line: 97, baseType: !244, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !219, !32}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !221, file: !209, line: 99, baseType: !248, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !221, file: !209, line: 100, baseType: !248, size: 64, align: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !221, file: !209, line: 101, baseType: !32, size: 32, align: 32, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !221, file: !209, line: 102, baseType: !32, size: 32, align: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !221, file: !209, line: 103, baseType: !32, size: 32, align: 32, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !221, file: !209, line: 106, baseType: !32, size: 32, align: 32, offset: 736)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !221, file: !209, line: 109, baseType: !32, size: 32, align: 32, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !221, file: !209, line: 114, baseType: !32, size: 32, align: 32, offset: 800)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !221, file: !209, line: 119, baseType: !155, size: 32, align: 32, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !221, file: !209, line: 122, baseType: !32, size: 32, align: 32, offset: 864)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !221, file: !209, line: 125, baseType: !32, size: 32, align: 32, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !210, file: !209, line: 202, baseType: !158, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !210, file: !209, line: 205, baseType: !261, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!120, !23, !177}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !209, line: 161, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 129, size: 512, align: 64, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !266, file: !209, line: 132, baseType: !85, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !266, file: !209, line: 135, baseType: !85, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !266, file: !209, line: 139, baseType: !85, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !266, file: !209, line: 144, baseType: !85, size: 64, align: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !266, file: !209, line: 148, baseType: !85, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !266, file: !209, line: 151, baseType: !52, size: 32, align: 32, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !266, file: !209, line: 154, baseType: !32, size: 32, align: 32, offset: 352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !266, file: !209, line: 157, baseType: !36, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !266, file: !209, line: 159, baseType: !32, size: 32, align: 32, offset: 448)
!277 = distinct !DISubprogram(name: "lzma2_encode", scope: !1, file: !1, line: 137, type: !215, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!278 = distinct !DISubprogram(name: "mf_unencoded", scope: !209, file: !209, line: 239, type: !279, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!279 = !DISubroutineType(types: !280)
!280 = !{!32, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!283 = distinct !DISubprogram(name: "lzma2_header_uncompressed", scope: !1, file: !1, line: 112, type: !284, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !23}
!286 = distinct !DISubprogram(name: "lzma2_header_lzma", scope: !1, file: !1, line: 55, type: !284, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!287 = distinct !DISubprogram(name: "mf_read", scope: !209, file: !209, line: 280, type: !288, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !219, !154, !152, !85, !152}
!290 = distinct !DISubprogram(name: "lzma2_encoder_end", scope: !1, file: !1, line: 269, type: !159, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!291 = distinct !DISubprogram(name: "lzma2_encoder_options_update", scope: !1, file: !1, line: 278, type: !262, isLocal: true, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!292 = distinct !DISubprogram(name: "get_pos_slot", scope: !293, file: !293, line: 110, type: !294, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !195)
!293 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/fastpos.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!294 = !DISubroutineType(types: !295)
!295 = !{!32, !32}
!296 = !{i32 2, !"Dwarf Version", i32 4}
!297 = !{i32 2, !"Debug Info Version", i32 3}
!298 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!299 = !DILocalVariable(name: "next", arg: 1, scope: !117, file: !1, line: 358, type: !121)
!300 = !DIExpression()
!301 = !DILocation(line: 358, column: 42, scope: !117)
!302 = !DILocalVariable(name: "allocator", arg: 2, scope: !117, file: !1, line: 358, type: !137)
!303 = !DILocation(line: 358, column: 64, scope: !117)
!304 = !DILocalVariable(name: "filters", arg: 3, scope: !117, file: !1, line: 359, type: !185)
!305 = !DILocation(line: 359, column: 27, scope: !117)
!306 = !DILocation(line: 362, column: 4, scope: !117)
!307 = !DILocation(line: 362, column: 10, scope: !117)
!308 = !DILocation(line: 362, column: 21, scope: !117)
!309 = !DILocation(line: 361, column: 9, scope: !117)
!310 = !DILocation(line: 361, column: 2, scope: !117)
!311 = !DILocalVariable(name: "lz", arg: 1, scope: !204, file: !1, line: 313, type: !207)
!312 = !DILocation(line: 313, column: 37, scope: !204)
!313 = !DILocalVariable(name: "allocator", arg: 2, scope: !204, file: !1, line: 313, type: !137)
!314 = !DILocation(line: 313, column: 57, scope: !204)
!315 = !DILocalVariable(name: "options", arg: 3, scope: !204, file: !1, line: 314, type: !199)
!316 = !DILocation(line: 314, column: 15, scope: !204)
!317 = !DILocalVariable(name: "lz_options", arg: 4, scope: !204, file: !1, line: 314, type: !264)
!318 = !DILocation(line: 314, column: 41, scope: !204)
!319 = !DILocation(line: 316, column: 6, scope: !320)
