; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_coder_s = type { %struct.lzma_range_encoder, i32, [4 x i32], [274 x %struct.lzma_match], i32, i32, i8, i8, i8, i32, i32, i32, [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_encoder, %struct.lzma_length_encoder, [4 x [64 x i32]], [4 x [128 x i32]], i32, i32, [16 x i32], i32, i32, i32, [4096 x %struct.lzma_optimal] }
%struct.lzma_range_encoder = type { i64, i64, i32, i8, i64, i64, [58 x i32], [58 x i16*] }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_length_encoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16], [16 x [272 x i32]], i32, [16 x i32] }
%struct.lzma_optimal = type { i32, i8, i8, i32, i32, i32, i32, i32, [4 x i32] }
%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !97, subprograms: !100)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !54, !69, !75, !80, !87, !90}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !20, file: !19, line: 40, size: 32, align: 32, elements: !48)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/range_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 27, size: 5888, align: 64, elements: !21)
!21 = !{!22, !26, !27, !30, !33, !36, !37, !41}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !20, file: !19, line: 28, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!25 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !20, file: !19, line: 29, baseType: !23, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !20, file: !19, line: 30, baseType: !28, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 51, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !20, file: !19, line: 31, baseType: !31, size: 8, align: 8, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !24, line: 48, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !20, file: !19, line: 34, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 62, baseType: !25)
!35 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !19, line: 37, baseType: !34, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !20, file: !19, line: 46, baseType: !38, size: 1856, align: 32, offset: 320)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1856, align: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 58)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !20, file: !19, line: 49, baseType: !42, size: 3712, align: 64, offset: 2176)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 3712, align: 64, elements: !39)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !45, line: 72, baseType: !46)
!45 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/range_common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !24, line: 49, baseType: !47)
!47 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!48 = !{!49, !50, !51, !52, !53}
!49 = !DIEnumerator(name: "RC_BIT_0", value: 0)
!50 = !DIEnumerator(name: "RC_BIT_1", value: 1)
!51 = !DIEnumerator(name: "RC_DIRECT_0", value: 2)
!52 = !DIEnumerator(name: "RC_DIRECT_1", value: 3)
!53 = !DIEnumerator(name: "RC_FLUSH", value: 4)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 56, size: 32, align: 32, elements: !56)
!55 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!57 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0)
!58 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1)
!59 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2)
!60 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3)
!61 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4)
!62 = !DIEnumerator(name: "STATE_REP_LIT", value: 5)
!63 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6)
!64 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7)
!65 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8)
!66 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9)
!67 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10)
!68 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!72 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!73 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!74 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 138, size: 32, align: 32, elements: !77)
!76 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!79 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 58, size: 32, align: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!83 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!84 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!85 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!86 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !88)
!88 = !{!89}
!89 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 27, size: 32, align: 32, elements: !92)
!91 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!94 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!95 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!96 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!97 = !{!98, !23, !28, !31, !99}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!100 = !{!101, !258, !295, !325, !383, !388, !391, !394, !398, !401, !402, !406, !409, !414, !417, !418, !423, !426, !429, !430, !434, !439, !442, !447, !448, !453, !456, !457, !461, !462, !465, !468, !471, !474, !475, !481, !484, !487, !504, !505, !506}
!101 = distinct !DISubprogram(name: "lzma_lzma_encode", scope: !1, file: !1, line: 321, type: !102, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !105, !217, !254, !255, !34, !28}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !108, line: 73, baseType: !109)
!108 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !110, line: 72, size: 1996608, align: 64, elements: !111)
!110 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!111 = !{!112, !114, !116, !120, !130, !131, !132, !134, !135, !136, !137, !138, !139, !144, !148, !151, !152, !153, !154, !155, !159, !163, !166, !188, !189, !191, !195, !196, !197, !198, !199, !200, !201}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !109, file: !110, line: 74, baseType: !113, size: 5888, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !19, line: 51, baseType: !20)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 77, baseType: !115, size: 32, align: 32, offset: 5888)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !55, line: 69, baseType: !54)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !109, file: !110, line: 80, baseType: !117, size: 128, align: 32, offset: 5920)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, align: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !109, file: !110, line: 83, baseType: !121, size: 17536, align: 32, offset: 6048)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 17536, align: 32, elements: !128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !123, line: 25, baseType: !124)
!123 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!124 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 22, size: 64, align: 32, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !124, file: !123, line: 23, baseType: !28, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !124, file: !123, line: 24, baseType: !28, size: 32, align: 32, offset: 32)
!128 = !{!129}
!129 = !DISubrange(count: 274)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !109, file: !110, line: 86, baseType: !28, size: 32, align: 32, offset: 23584)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !109, file: !110, line: 90, baseType: !28, size: 32, align: 32, offset: 23616)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !109, file: !110, line: 93, baseType: !133, size: 8, align: 8, offset: 23648)
!133 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !109, file: !110, line: 97, baseType: !133, size: 8, align: 8, offset: 23656)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !109, file: !110, line: 101, baseType: !133, size: 8, align: 8, offset: 23664)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !109, file: !110, line: 103, baseType: !28, size: 32, align: 32, offset: 23680)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !109, file: !110, line: 104, baseType: !28, size: 32, align: 32, offset: 23712)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !109, file: !110, line: 105, baseType: !28, size: 32, align: 32, offset: 23744)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !109, file: !110, line: 108, baseType: !140, size: 196608, align: 16, offset: 23776)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 196608, align: 16, elements: !141)
!141 = !{!142, !143}
!142 = !DISubrange(count: 16)
!143 = !DISubrange(count: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !109, file: !110, line: 109, baseType: !145, size: 3072, align: 16, offset: 220384)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 3072, align: 16, elements: !146)
!146 = !{!147, !142}
!147 = !DISubrange(count: 12)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !109, file: !110, line: 110, baseType: !149, size: 192, align: 16, offset: 223456)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 192, align: 16, elements: !150)
!150 = !{!147}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !109, file: !110, line: 111, baseType: !149, size: 192, align: 16, offset: 223648)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !109, file: !110, line: 112, baseType: !149, size: 192, align: 16, offset: 223840)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !109, file: !110, line: 113, baseType: !149, size: 192, align: 16, offset: 224032)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !109, file: !110, line: 114, baseType: !145, size: 3072, align: 16, offset: 224224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !109, file: !110, line: 115, baseType: !156, size: 4096, align: 16, offset: 227296)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4096, align: 16, elements: !157)
!157 = !{!119, !158}
!158 = !DISubrange(count: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !109, file: !110, line: 116, baseType: !160, size: 1824, align: 16, offset: 231392)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1824, align: 16, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 114)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !109, file: !110, line: 117, baseType: !164, size: 256, align: 16, offset: 233216)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, align: 16, elements: !165)
!165 = !{!142}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !109, file: !110, line: 121, baseType: !167, size: 148032, align: 32, offset: 233472)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !110, line: 51, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 40, size: 148032, align: 32, elements: !169)
!169 = !{!170, !171, !172, !176, !177, !181, !185, !186}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !168, file: !110, line: 41, baseType: !44, size: 16, align: 16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !168, file: !110, line: 42, baseType: !44, size: 16, align: 16, offset: 16)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !168, file: !110, line: 43, baseType: !173, size: 2048, align: 16, offset: 32)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, align: 16, elements: !174)
!174 = !{!142, !175}
!175 = !DISubrange(count: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !168, file: !110, line: 44, baseType: !173, size: 2048, align: 16, offset: 2080)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !168, file: !110, line: 45, baseType: !178, size: 4096, align: 16, offset: 4128)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4096, align: 16, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !168, file: !110, line: 47, baseType: !182, size: 139264, align: 32, offset: 8224)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 139264, align: 32, elements: !183)
!183 = !{!142, !184}
!184 = !DISubrange(count: 272)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !168, file: !110, line: 48, baseType: !28, size: 32, align: 32, offset: 147488)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !168, file: !110, line: 49, baseType: !187, size: 512, align: 32, offset: 147520)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, align: 32, elements: !165)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !109, file: !110, line: 122, baseType: !167, size: 148032, align: 32, offset: 381504)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !109, file: !110, line: 125, baseType: !190, size: 8192, align: 32, offset: 529536)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 32, elements: !157)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !109, file: !110, line: 126, baseType: !192, size: 16384, align: 32, offset: 537728)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 16384, align: 32, elements: !193)
!193 = !{!119, !194}
!194 = !DISubrange(count: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !109, file: !110, line: 127, baseType: !28, size: 32, align: 32, offset: 554112)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !109, file: !110, line: 128, baseType: !28, size: 32, align: 32, offset: 554144)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !109, file: !110, line: 130, baseType: !187, size: 512, align: 32, offset: 554176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !109, file: !110, line: 131, baseType: !28, size: 32, align: 32, offset: 554688)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !109, file: !110, line: 134, baseType: !28, size: 32, align: 32, offset: 554720)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !109, file: !110, line: 135, baseType: !28, size: 32, align: 32, offset: 554752)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !109, file: !110, line: 136, baseType: !202, size: 1441792, align: 32, offset: 554784)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 1441792, align: 32, elements: !215)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !110, line: 69, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 54, size: 352, align: 32, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !204, file: !110, line: 55, baseType: !115, size: 32, align: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !204, file: !110, line: 57, baseType: !133, size: 8, align: 8, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !204, file: !110, line: 58, baseType: !133, size: 8, align: 8, offset: 40)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !204, file: !110, line: 60, baseType: !28, size: 32, align: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !204, file: !110, line: 61, baseType: !28, size: 32, align: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !204, file: !110, line: 63, baseType: !28, size: 32, align: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !204, file: !110, line: 64, baseType: !28, size: 32, align: 32, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !204, file: !110, line: 65, baseType: !28, size: 32, align: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !204, file: !110, line: 67, baseType: !117, size: 128, align: 32, offset: 224)
!215 = !{!216}
!216 = !DISubrange(count: 4096)
!217 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !123, line: 28, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !123, line: 29, size: 960, align: 64, elements: !221)
!221 = !{!222, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !238, !242, !243, !244, !245, !246, !247, !248, !249, !250, !252, !253}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !220, file: !123, line: 35, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !220, file: !123, line: 39, baseType: !28, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !220, file: !123, line: 45, baseType: !28, size: 32, align: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !220, file: !123, line: 51, baseType: !28, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !220, file: !123, line: 58, baseType: !28, size: 32, align: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !220, file: !123, line: 63, baseType: !28, size: 32, align: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !220, file: !123, line: 67, baseType: !28, size: 32, align: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !220, file: !123, line: 75, baseType: !28, size: 32, align: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !220, file: !123, line: 80, baseType: !28, size: 32, align: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !220, file: !123, line: 84, baseType: !28, size: 32, align: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !220, file: !123, line: 92, baseType: !234, size: 64, align: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!28, !218, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !220, file: !123, line: 97, baseType: !239, size: 64, align: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !218, !28}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !220, file: !123, line: 99, baseType: !99, size: 64, align: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !220, file: !123, line: 100, baseType: !99, size: 64, align: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !220, file: !123, line: 101, baseType: !28, size: 32, align: 32, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !220, file: !123, line: 102, baseType: !28, size: 32, align: 32, offset: 672)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !220, file: !123, line: 103, baseType: !28, size: 32, align: 32, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !220, file: !123, line: 106, baseType: !28, size: 32, align: 32, offset: 736)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !220, file: !123, line: 109, baseType: !28, size: 32, align: 32, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !220, file: !123, line: 114, baseType: !28, size: 32, align: 32, offset: 800)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !220, file: !123, line: 119, baseType: !251, size: 32, align: 32, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !69)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !220, file: !123, line: 122, baseType: !28, size: 32, align: 32, offset: 864)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !220, file: !123, line: 125, baseType: !28, size: 32, align: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !223)
!255 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!257 = !{}
!258 = distinct !DISubprogram(name: "lzma_lzma_encoder_reset", scope: !1, file: !1, line: 490, type: !259, isLocal: false, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!259 = !DISubroutineType(types: !260)
!260 = !{!104, !106, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !76, line: 399, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 185, size: 896, align: 64, elements: !265)
!265 = !{!266, !267, !270, !271, !272, !273, !274, !276, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !290, !291, !292, !293, !294}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !264, file: !76, line: 217, baseType: !28, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !264, file: !76, line: 240, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !264, file: !76, line: 254, baseType: !28, size: 32, align: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !264, file: !76, line: 281, baseType: !28, size: 32, align: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !264, file: !76, line: 293, baseType: !28, size: 32, align: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !264, file: !76, line: 316, baseType: !28, size: 32, align: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !264, file: !76, line: 322, baseType: !275, size: 32, align: 32, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !76, line: 155, baseType: !75)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !264, file: !76, line: 342, baseType: !28, size: 32, align: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !264, file: !76, line: 345, baseType: !278, size: 32, align: 32, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !76, line: 111, baseType: !80)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !264, file: !76, line: 375, baseType: !28, size: 32, align: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !264, file: !76, line: 384, baseType: !28, size: 32, align: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !264, file: !76, line: 385, baseType: !28, size: 32, align: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !264, file: !76, line: 386, baseType: !28, size: 32, align: 32, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !264, file: !76, line: 387, baseType: !28, size: 32, align: 32, offset: 480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !264, file: !76, line: 388, baseType: !28, size: 32, align: 32, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !264, file: !76, line: 389, baseType: !28, size: 32, align: 32, offset: 544)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !264, file: !76, line: 390, baseType: !28, size: 32, align: 32, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !264, file: !76, line: 391, baseType: !28, size: 32, align: 32, offset: 608)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !264, file: !76, line: 392, baseType: !289, size: 32, align: 32, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !87)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !264, file: !76, line: 393, baseType: !289, size: 32, align: 32, offset: 672)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !264, file: !76, line: 394, baseType: !289, size: 32, align: 32, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !264, file: !76, line: 395, baseType: !289, size: 32, align: 32, offset: 736)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !264, file: !76, line: 396, baseType: !98, size: 64, align: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !264, file: !76, line: 397, baseType: !98, size: 64, align: 64, offset: 832)
!295 = distinct !DISubprogram(name: "lzma_lzma_encoder_create", scope: !1, file: !1, line: 564, type: !296, isLocal: false, isDefinition: true, scopeLine: 566, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!296 = !DISubroutineType(types: !297)
!297 = !{!104, !298, !299, !261, !312}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !301)
!301 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !302)
!302 = !{!303, !307, !311}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !301, file: !4, line: 376, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!98, !98, !34, !34}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !301, file: !4, line: 390, baseType: !308, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !98, !98}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !301, file: !4, line: 401, baseType: !98, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !123, line: 161, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 129, size: 512, align: 64, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !314, file: !123, line: 132, baseType: !34, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !314, file: !123, line: 135, baseType: !34, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !314, file: !123, line: 139, baseType: !34, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !314, file: !123, line: 144, baseType: !34, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !314, file: !123, line: 148, baseType: !34, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !314, file: !123, line: 151, baseType: !278, size: 32, align: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !314, file: !123, line: 154, baseType: !28, size: 32, align: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !314, file: !123, line: 157, baseType: !268, size: 64, align: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !314, file: !123, line: 159, baseType: !28, size: 32, align: 32, offset: 448)
!325 = distinct !DISubprogram(name: "lzma_lzma_encoder_init", scope: !1, file: !1, line: 635, type: !326, isLocal: false, isDefinition: true, scopeLine: 637, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!326 = !DISubroutineType(types: !327)
!327 = !{!104, !328, !299, !373}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !108, line: 75, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !108, line: 119, size: 512, align: 64, elements: !331)
!331 = !{!332, !333, !336, !338, !344, !349, !356, !361}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !330, file: !108, line: 121, baseType: !106, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !108, line: 125, baseType: !334, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !335, line: 63, baseType: !23)
!335 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !330, file: !108, line: 131, baseType: !337, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !24, line: 122, baseType: !25)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !330, file: !108, line: 134, baseType: !339, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !108, line: 89, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!104, !106, !299, !343, !255, !34, !254, !255, !34, !251}
!343 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !330, file: !108, line: 139, baseType: !345, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !108, line: 97, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !106, !299}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !330, file: !108, line: 143, baseType: !350, size: 64, align: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !91, line: 55, baseType: !90)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !330, file: !108, line: 147, baseType: !357, size: 64, align: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!104, !106, !360, !360, !23}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !330, file: !108, line: 152, baseType: !362, size: 64, align: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!104, !106, !299, !365, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !368, line: 65, baseType: !369)
!368 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 43, size: 128, align: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !369, file: !368, line: 54, baseType: !334, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !369, file: !368, line: 63, baseType: !98, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !108, line: 77, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !108, line: 104, size: 192, align: 64, elements: !377)
!377 = !{!378, !379, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !376, file: !108, line: 107, baseType: !334, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !376, file: !108, line: 111, baseType: !380, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !108, line: 81, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !376, file: !108, line: 114, baseType: !98, size: 64, align: 64, offset: 128)
!383 = distinct !DISubprogram(name: "lzma_lzma_encoder_memusage", scope: !1, file: !1, line: 644, type: !384, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!384 = !DISubroutineType(types: !385)
!385 = !{!23, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!388 = distinct !DISubprogram(name: "lzma_lzma_lclppb_encode", scope: !1, file: !1, line: 663, type: !389, isLocal: false, isDefinition: true, scopeLine: 664, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!389 = !DISubroutineType(types: !390)
!390 = !{!133, !261, !223}
!391 = distinct !DISubprogram(name: "lzma_lzma_props_encode", scope: !1, file: !1, line: 677, type: !392, isLocal: false, isDefinition: true, scopeLine: 678, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!392 = !DISubroutineType(types: !393)
!393 = !{!104, !386, !223}
!394 = distinct !DISubprogram(name: "lzma_mode_is_supported", scope: !1, file: !1, line: 692, type: !395, isLocal: false, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!395 = !DISubroutineType(types: !396)
!396 = !{!397, !275}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !32)
!398 = distinct !DISubprogram(name: "encode_init", scope: !1, file: !1, line: 277, type: !399, isLocal: true, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!399 = !DISubroutineType(types: !400)
!400 = !{!133, !106, !218}
!401 = distinct !DISubprogram(name: "mf_skip", scope: !123, file: !123, line: 268, type: !240, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!402 = distinct !DISubprogram(name: "rc_bit", scope: !19, file: !19, line: 67, type: !403, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !405, !43, !28}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!406 = distinct !DISubprogram(name: "rc_bittree", scope: !19, file: !19, line: 76, type: !407, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !405, !43, !28, !28}
!409 = distinct !DISubprogram(name: "mf_position", scope: !123, file: !123, line: 253, type: !410, isLocal: true, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!410 = !DISubroutineType(types: !411)
!411 = !{!28, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!414 = distinct !DISubprogram(name: "rc_encode", scope: !19, file: !19, line: 151, type: !415, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!415 = !DISubroutineType(types: !416)
!416 = !{!133, !405, !223, !256, !34}
!417 = distinct !DISubprogram(name: "rc_shift_low", scope: !19, file: !19, line: 125, type: !415, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!418 = distinct !DISubprogram(name: "rc_pending", scope: !19, file: !19, line: 227, type: !419, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!419 = !DISubroutineType(types: !420)
!420 = !{!23, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!423 = distinct !DISubprogram(name: "encode_symbol", scope: !1, file: !1, line: 243, type: !424, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !106, !218, !28, !28, !28}
!426 = distinct !DISubprogram(name: "literal", scope: !1, file: !1, line: 49, type: !427, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !106, !218, !28}
!429 = distinct !DISubprogram(name: "literal_matched", scope: !1, file: !1, line: 24, type: !407, isLocal: true, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!430 = distinct !DISubprogram(name: "rep_match", scope: !1, file: !1, line: 199, type: !431, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !106, !433, !433, !433}
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!434 = distinct !DISubprogram(name: "length", scope: !1, file: !1, line: 113, type: !435, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !405, !437, !433, !28, !438}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!439 = distinct !DISubprogram(name: "length_update_prices", scope: !1, file: !1, line: 81, type: !440, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !437, !433}
!442 = distinct !DISubprogram(name: "rc_bit_0_price", scope: !443, file: !443, line: 37, type: !444, isLocal: true, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!443 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/price.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!444 = !DISubroutineType(types: !445)
!445 = !{!28, !446}
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!447 = distinct !DISubprogram(name: "rc_bit_1_price", scope: !443, file: !443, line: 44, type: !444, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!448 = distinct !DISubprogram(name: "rc_bittree_price", scope: !443, file: !443, line: 52, type: !449, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!449 = !DISubroutineType(types: !450)
!450 = !{!28, !451, !433, !28}
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!453 = distinct !DISubprogram(name: "rc_bit_price", scope: !443, file: !443, line: 29, type: !454, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!454 = !DISubroutineType(types: !455)
!455 = !{!28, !446, !433}
!456 = distinct !DISubprogram(name: "match", scope: !1, file: !1, line: 149, type: !431, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!457 = distinct !DISubprogram(name: "get_pos_slot", scope: !458, file: !458, line: 110, type: !459, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!458 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/fastpos.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!459 = !DISubroutineType(types: !460)
!460 = !{!28, !28}
!461 = distinct !DISubprogram(name: "rc_bittree_reverse", scope: !19, file: !19, line: 90, type: !407, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!462 = distinct !DISubprogram(name: "rc_direct", scope: !19, file: !19, line: 105, type: !463, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !405, !28, !28}
!465 = distinct !DISubprogram(name: "encode_eopm", scope: !1, file: !1, line: 305, type: !466, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !106, !28}
!468 = distinct !DISubprogram(name: "rc_flush", scope: !19, file: !19, line: 116, type: !469, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !405}
!471 = distinct !DISubprogram(name: "is_options_valid", scope: !1, file: !1, line: 434, type: !472, isLocal: true, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!472 = !DISubroutineType(types: !473)
!473 = !{!133, !261}
!474 = distinct !DISubprogram(name: "rc_reset", scope: !19, file: !19, line: 55, type: !469, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!475 = distinct !DISubprogram(name: "literal_init", scope: !55, file: !55, line: 129, type: !476, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478, !28, !28}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 12288, align: 16, elements: !480)
!480 = !{!143}
!481 = distinct !DISubprogram(name: "length_encoder_reset", scope: !1, file: !1, line: 465, type: !482, isLocal: true, isDefinition: true, scopeLine: 467, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !437, !433, !438}
!484 = distinct !DISubprogram(name: "set_lz_options", scope: !1, file: !1, line: 447, type: !485, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !312, !261}
!487 = distinct !DISubprogram(name: "lzma_encoder_init", scope: !1, file: !1, line: 625, type: !488, isLocal: true, isDefinition: true, scopeLine: 627, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!488 = !DISubroutineType(types: !489)
!489 = !{!104, !490, !299, !386, !312}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !123, line: 208, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 192, size: 256, align: 64, elements: !493)
!493 = !{!494, !495, !499, !500}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !492, file: !123, line: 194, baseType: !106, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !492, file: !123, line: 197, baseType: !496, size: 64, align: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!104, !105, !217, !254, !255, !34}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !492, file: !123, line: 202, baseType: !346, size: 64, align: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !492, file: !123, line: 205, baseType: !501, size: 64, align: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!104, !106, !365}
!504 = distinct !DISubprogram(name: "lzma_encode", scope: !1, file: !1, line: 417, type: !497, isLocal: true, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!505 = distinct !DISubprogram(name: "is_lclppb_valid", scope: !55, file: !55, line: 33, type: !472, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!506 = distinct !DISubprogram(name: "write32ne", scope: !507, file: !507, line: 255, type: !508, isLocal: true, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: false, variables: !257)
!507 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/common/tuklib_integer.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!508 = !DISubroutineType(types: !509)
!509 = !{null, !223, !28}
!510 = !{i32 2, !"Dwarf Version", i32 4}
!511 = !{i32 2, !"Debug Info Version", i32 3}
!512 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!513 = !DILocalVariable(name: "coder", arg: 1, scope: !101, file: !1, line: 321, type: !105)
!514 = !DIExpression()
!515 = !DILocation(line: 321, column: 44, scope: !101)
!516 = !DILocalVariable(name: "mf", arg: 2, scope: !101, file: !1, line: 321, type: !217)
!517 = !DILocation(line: 321, column: 74, scope: !101)
!518 = !DILocalVariable(name: "out", arg: 3, scope: !101, file: !1, line: 322, type: !254)
!519 = !DILocation(line: 322, column: 26, scope: !101)
!520 = !DILocalVariable(name: "out_pos", arg: 4, scope: !101, file: !1, line: 322, type: !255)
!521 = !DILocation(line: 322, column: 53, scope: !101)
!522 = !DILocalVariable(name: "out_size", arg: 5, scope: !101, file: !1, line: 323, type: !34)
!523 = !DILocation(line: 323, column: 10, scope: !101)
!524 = !DILocalVariable(name: "limit", arg: 6, scope: !101, file: !1, line: 323, type: !28)
!525 = !DILocation(line: 323, column: 29, scope: !101)
!526 = !DILocalVariable(name: "position", scope: !101, file: !1, line: 325, type: !28)
!527 = !DILocation(line: 325, column: 11, scope: !101)
!528 = !DILocation(line: 328, column: 7, scope: !529)
!529 = distinct !DILexicalBlock(scope: !101, file: !1, line: 328, column: 6)
!530 = !DILocation(line: 328, column: 14, scope: !529)
!531 = !DILocation(line: 328, column: 29, scope: !529)
!532 = !DILocation(line: 328, column: 45, scope: !533)
!533 = !DILexicalBlockFile(scope: !529, file: !1, discriminator: 1)
!534 = !DILocation(line: 328, column: 52, scope: !533)
!535 = !DILocation(line: 328, column: 33, scope: !533)
!536 = !DILocation(line: 328, column: 6, scope: !533)
!537 = !DILocation(line: 329, column: 3, scope: !529)
!538 = !DILocation(line: 332, column: 25, scope: !101)
!539 = !DILocation(line: 332, column: 13, scope: !101)
!540 = !DILocation(line: 332, column: 11, scope: !101)
!541 = !DILocation(line: 334, column: 2, scope: !101)
!542 = !DILocalVariable(name: "len", scope: !543, file: !1, line: 335, type: !28)
!543 = distinct !DILexicalBlock(scope: !101, file: !1, line: 334, column: 15)
!544 = !DILocation(line: 335, column: 12, scope: !543)
!545 = !DILocalVariable(name: "back", scope: !543, file: !1, line: 336, type: !28)
!546 = !DILocation(line: 336, column: 12, scope: !543)
!547 = !DILocation(line: 344, column: 18, scope: !548)
!548 = distinct !DILexicalBlock(scope: !543, file: !1, line: 344, column: 7)
!549 = !DILocation(line: 344, column: 25, scope: !548)
!550 = !DILocation(line: 344, column: 29, scope: !548)
!551 = !DILocation(line: 344, column: 34, scope: !548)
!552 = !DILocation(line: 344, column: 43, scope: !548)
!553 = !DILocation(line: 344, column: 7, scope: !548)
!554 = !DILocation(line: 344, column: 7, scope: !543)
