; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder_optimum_normal.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_coder_s = type { %struct.lzma_range_encoder, i32, [4 x i32], [274 x %struct.lzma_match], i32, i32, i8, i8, i8, i32, i32, i32, [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_encoder, %struct.lzma_length_encoder, [4 x [64 x i32]], [4 x [128 x i32]], i32, i32, [16 x i32], i32, i32, i32, [4096 x %struct.lzma_optimal] }
%struct.lzma_range_encoder = type { i64, i64, i32, i8, i64, i64, [58 x i32], [58 x i16*] }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_length_encoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16], [16 x [272 x i32]], i32, [16 x i32] }
%struct.lzma_optimal = type { i32, i8, i8, i32, i32, i32, i32, i32, [4 x i32] }
%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [19 x i8] c"mf->read_ahead > 0\00", align 1
@.str.1 = private unnamed_addr constant [97 x i8] c"/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder_optimum_normal.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !61, subprograms: !64)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder_optimum_normal.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !39, !54}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 40, size: 32, align: 32, elements: !33)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/range_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 27, size: 5888, align: 64, elements: !6)
!6 = !{!7, !11, !12, !15, !18, !21, !22, !26}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !5, file: !4, line: 28, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 55, baseType: !10)
!9 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !5, file: !4, line: 29, baseType: !8, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !5, file: !4, line: 30, baseType: !13, size: 32, align: 32, offset: 128)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 51, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !5, file: !4, line: 31, baseType: !16, size: 8, align: 8, offset: 160)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 48, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !5, file: !4, line: 34, baseType: !19, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 62, baseType: !10)
!20 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !5, file: !4, line: 37, baseType: !19, size: 64, align: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !5, file: !4, line: 46, baseType: !23, size: 1856, align: 32, offset: 320)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 1856, align: 32, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 58)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !5, file: !4, line: 49, baseType: !27, size: 3712, align: 64, offset: 2176)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 3712, align: 64, elements: !24)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !30, line: 72, baseType: !31)
!30 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/range_common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 49, baseType: !32)
!32 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "RC_BIT_0", value: 0)
!35 = !DIEnumerator(name: "RC_BIT_1", value: 1)
!36 = !DIEnumerator(name: "RC_DIRECT_0", value: 2)
!37 = !DIEnumerator(name: "RC_DIRECT_1", value: 3)
!38 = !DIEnumerator(name: "RC_FLUSH", value: 4)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 56, size: 32, align: 32, elements: !41)
!40 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!42 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0)
!43 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1)
!44 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2)
!45 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3)
!46 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4)
!47 = !DIEnumerator(name: "STATE_REP_LIT", value: 5)
!48 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6)
!49 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7)
!50 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8)
!51 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9)
!52 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10)
!53 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 250, size: 32, align: 32, elements: !56)
!55 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!58 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!59 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!60 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!64 = !{!65, !220, !223, !231, !234, !237, !241, !244, !245, !248, !249, !252, !259, !263, !264, !268, !269, !272, !278, !281, !282, !287, !290, !295, !298}
!65 = distinct !DISubprogram(name: "lzma_lzma_optimum_normal", scope: !1, file: !1, line: 868, type: !66, isLocal: false, isDefinition: true, scopeLine: 871, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !180, !218, !218, !13}
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !71, line: 73, baseType: !72)
!71 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !73, line: 72, size: 1996608, align: 64, elements: !74)
!73 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_encoder_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!74 = !{!75, !77, !79, !83, !93, !94, !95, !97, !98, !99, !100, !101, !102, !107, !111, !114, !115, !116, !117, !118, !122, !126, !129, !151, !152, !154, !158, !159, !160, !161, !162, !163, !164}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !72, file: !73, line: 74, baseType: !76, size: 5888, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !4, line: 51, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !72, file: !73, line: 77, baseType: !78, size: 32, align: 32, offset: 5888)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !40, line: 69, baseType: !39)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !72, file: !73, line: 80, baseType: !80, size: 128, align: 32, offset: 5920)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, align: 32, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 4)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !72, file: !73, line: 83, baseType: !84, size: 17536, align: 32, offset: 6048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 17536, align: 32, elements: !91)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !86, line: 25, baseType: !87)
!86 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_encoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 22, size: 64, align: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !87, file: !86, line: 23, baseType: !13, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !87, file: !86, line: 24, baseType: !13, size: 32, align: 32, offset: 32)
!91 = !{!92}
!92 = !DISubrange(count: 274)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !72, file: !73, line: 86, baseType: !13, size: 32, align: 32, offset: 23584)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !72, file: !73, line: 90, baseType: !13, size: 32, align: 32, offset: 23616)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !72, file: !73, line: 93, baseType: !96, size: 8, align: 8, offset: 23648)
!96 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !72, file: !73, line: 97, baseType: !96, size: 8, align: 8, offset: 23656)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !72, file: !73, line: 101, baseType: !96, size: 8, align: 8, offset: 23664)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !72, file: !73, line: 103, baseType: !13, size: 32, align: 32, offset: 23680)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !72, file: !73, line: 104, baseType: !13, size: 32, align: 32, offset: 23712)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !72, file: !73, line: 105, baseType: !13, size: 32, align: 32, offset: 23744)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !72, file: !73, line: 108, baseType: !103, size: 196608, align: 16, offset: 23776)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 196608, align: 16, elements: !104)
!104 = !{!105, !106}
!105 = !DISubrange(count: 16)
!106 = !DISubrange(count: 768)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !72, file: !73, line: 109, baseType: !108, size: 3072, align: 16, offset: 220384)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 3072, align: 16, elements: !109)
!109 = !{!110, !105}
!110 = !DISubrange(count: 12)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !72, file: !73, line: 110, baseType: !112, size: 192, align: 16, offset: 223456)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 192, align: 16, elements: !113)
!113 = !{!110}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !72, file: !73, line: 111, baseType: !112, size: 192, align: 16, offset: 223648)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !72, file: !73, line: 112, baseType: !112, size: 192, align: 16, offset: 223840)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !72, file: !73, line: 113, baseType: !112, size: 192, align: 16, offset: 224032)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !72, file: !73, line: 114, baseType: !108, size: 3072, align: 16, offset: 224224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !72, file: !73, line: 115, baseType: !119, size: 4096, align: 16, offset: 227296)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 4096, align: 16, elements: !120)
!120 = !{!82, !121}
!121 = !DISubrange(count: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !72, file: !73, line: 116, baseType: !123, size: 1824, align: 16, offset: 231392)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1824, align: 16, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 114)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !72, file: !73, line: 117, baseType: !127, size: 256, align: 16, offset: 233216)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, align: 16, elements: !128)
!128 = !{!105}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !72, file: !73, line: 121, baseType: !130, size: 148032, align: 32, offset: 233472)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !73, line: 51, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 40, size: 148032, align: 32, elements: !132)
!132 = !{!133, !134, !135, !139, !140, !144, !148, !149}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !131, file: !73, line: 41, baseType: !29, size: 16, align: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !131, file: !73, line: 42, baseType: !29, size: 16, align: 16, offset: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !131, file: !73, line: 43, baseType: !136, size: 2048, align: 16, offset: 32)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, align: 16, elements: !137)
!137 = !{!105, !138}
!138 = !DISubrange(count: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !131, file: !73, line: 44, baseType: !136, size: 2048, align: 16, offset: 2080)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !131, file: !73, line: 45, baseType: !141, size: 4096, align: 16, offset: 4128)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 4096, align: 16, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !131, file: !73, line: 47, baseType: !145, size: 139264, align: 32, offset: 8224)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 139264, align: 32, elements: !146)
!146 = !{!105, !147}
!147 = !DISubrange(count: 272)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !131, file: !73, line: 48, baseType: !13, size: 32, align: 32, offset: 147488)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !131, file: !73, line: 49, baseType: !150, size: 512, align: 32, offset: 147520)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 32, elements: !128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !72, file: !73, line: 122, baseType: !130, size: 148032, align: 32, offset: 381504)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !72, file: !73, line: 125, baseType: !153, size: 8192, align: 32, offset: 529536)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, align: 32, elements: !120)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !72, file: !73, line: 126, baseType: !155, size: 16384, align: 32, offset: 537728)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 16384, align: 32, elements: !156)
!156 = !{!82, !157}
!157 = !DISubrange(count: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !72, file: !73, line: 127, baseType: !13, size: 32, align: 32, offset: 554112)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !72, file: !73, line: 128, baseType: !13, size: 32, align: 32, offset: 554144)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !72, file: !73, line: 130, baseType: !150, size: 512, align: 32, offset: 554176)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !72, file: !73, line: 131, baseType: !13, size: 32, align: 32, offset: 554688)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !72, file: !73, line: 134, baseType: !13, size: 32, align: 32, offset: 554720)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !72, file: !73, line: 135, baseType: !13, size: 32, align: 32, offset: 554752)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !72, file: !73, line: 136, baseType: !165, size: 1441792, align: 32, offset: 554784)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 1441792, align: 32, elements: !178)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !73, line: 69, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 54, size: 352, align: 32, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !167, file: !73, line: 55, baseType: !78, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !167, file: !73, line: 57, baseType: !96, size: 8, align: 8, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !167, file: !73, line: 58, baseType: !96, size: 8, align: 8, offset: 40)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !167, file: !73, line: 60, baseType: !13, size: 32, align: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !167, file: !73, line: 61, baseType: !13, size: 32, align: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !167, file: !73, line: 63, baseType: !13, size: 32, align: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !167, file: !73, line: 64, baseType: !13, size: 32, align: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !167, file: !73, line: 65, baseType: !13, size: 32, align: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !167, file: !73, line: 67, baseType: !80, size: 128, align: 32, offset: 224)
!178 = !{!179}
!179 = !DISubrange(count: 4096)
!180 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !86, line: 28, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !86, line: 29, size: 960, align: 64, elements: !184)
!184 = !{!185, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !201, !205, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !183, file: !86, line: 35, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !86, line: 39, baseType: !13, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !183, file: !86, line: 45, baseType: !13, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !183, file: !86, line: 51, baseType: !13, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !183, file: !86, line: 58, baseType: !13, size: 32, align: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !183, file: !86, line: 63, baseType: !13, size: 32, align: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !183, file: !86, line: 67, baseType: !13, size: 32, align: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !183, file: !86, line: 75, baseType: !13, size: 32, align: 32, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !183, file: !86, line: 80, baseType: !13, size: 32, align: 32, offset: 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !183, file: !86, line: 84, baseType: !13, size: 32, align: 32, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !183, file: !86, line: 92, baseType: !197, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!13, !181, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !183, file: !86, line: 97, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !181, !13}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !183, file: !86, line: 99, baseType: !206, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !183, file: !86, line: 100, baseType: !206, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !183, file: !86, line: 101, baseType: !13, size: 32, align: 32, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !183, file: !86, line: 102, baseType: !13, size: 32, align: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !183, file: !86, line: 103, baseType: !13, size: 32, align: 32, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !183, file: !86, line: 106, baseType: !13, size: 32, align: 32, offset: 736)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !183, file: !86, line: 109, baseType: !13, size: 32, align: 32, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !183, file: !86, line: 114, baseType: !13, size: 32, align: 32, offset: 800)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !183, file: !86, line: 119, baseType: !215, size: 32, align: 32, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !55, line: 322, baseType: !54)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !183, file: !86, line: 122, baseType: !13, size: 32, align: 32, offset: 864)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !183, file: !86, line: 125, baseType: !13, size: 32, align: 32, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !206)
!219 = !{}
!220 = distinct !DISubprogram(name: "fill_distances_prices", scope: !1, file: !1, line: 135, type: !221, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !69}
!223 = distinct !DISubprogram(name: "rc_bittree_price", scope: !224, file: !224, line: 52, type: !225, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!224 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/price.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!225 = !DISubroutineType(types: !226)
!226 = !{!13, !227, !230, !13}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!231 = distinct !DISubprogram(name: "rc_bit_price", scope: !224, file: !224, line: 29, type: !232, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!232 = !DISubroutineType(types: !233)
!233 = !{!13, !229, !230}
!234 = distinct !DISubprogram(name: "rc_direct_price", scope: !224, file: !224, line: 87, type: !235, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!235 = !DISubroutineType(types: !236)
!236 = !{!13, !230}
!237 = distinct !DISubprogram(name: "get_pos_slot", scope: !238, file: !238, line: 110, type: !239, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!238 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/fastpos.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!239 = !DISubroutineType(types: !240)
!240 = !{!13, !13}
!241 = distinct !DISubprogram(name: "rc_bittree_reverse_price", scope: !224, file: !224, line: 69, type: !242, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!242 = !DISubroutineType(types: !243)
!243 = !{!13, !227, !13, !13}
!244 = distinct !DISubprogram(name: "fill_align_prices", scope: !1, file: !1, line: 196, type: !221, isLocal: true, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!245 = distinct !DISubprogram(name: "helper1", scope: !1, file: !1, line: 281, type: !246, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!246 = !DISubroutineType(types: !247)
!247 = !{!13, !68, !180, !218, !218, !13}
!248 = distinct !DISubprogram(name: "mf_skip", scope: !86, file: !86, line: 268, type: !203, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!249 = distinct !DISubprogram(name: "rc_bit_0_price", scope: !224, file: !224, line: 37, type: !250, isLocal: true, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!250 = !DISubroutineType(types: !251)
!251 = !{!13, !229}
!252 = distinct !DISubprogram(name: "get_literal_price", scope: !1, file: !1, line: 21, type: !253, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, variables: !219)
!253 = !DISubroutineType(types: !254)
!254 = !{!13, !255, !230, !230, !258, !13, !13}
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
