; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma2_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_decoder = type { %struct.lzma_coder_s*, i32 (%struct.lzma_coder_s*, %struct.lzma_dict*, i8*, i64*, i64)*, void (%struct.lzma_coder_s*, i8*)*, void (%struct.lzma_coder_s*, i64)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)* }
%struct.lzma_coder_s = type { i32, i32, %struct.lzma_lz_decoder, i64, i64, i8, i8, %struct.lzma_options_lzma }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_dict = type { i8*, i64, i64, i64, i64, i8 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_next_coder_s = type { %struct.lzma_coder_s*, i64, i64, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)*, i32 (%struct.lzma_coder_s*)*, i32 (%struct.lzma_coder_s*, i64*, i64*, i64)*, i32 (%struct.lzma_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_lz_options = type { i64, i8*, i64 }

@.str = private unnamed_addr constant [30 x i8] c"filters[1].init == ((void*)0)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !56, subprograms: !61, globals: !250)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma2_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !28, !33, !40, !43, !49}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sequence", file: !1, line: 20, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27}
!20 = !DIEnumerator(name: "SEQ_CONTROL", value: 0)
!21 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_1", value: 1)
!22 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_2", value: 2)
!23 = !DIEnumerator(name: "SEQ_COMPRESSED_0", value: 3)
!24 = !DIEnumerator(name: "SEQ_COMPRESSED_1", value: 4)
!25 = !DIEnumerator(name: "SEQ_PROPERTIES", value: 5)
!26 = !DIEnumerator(name: "SEQ_LZMA", value: 6)
!27 = !DIEnumerator(name: "SEQ_COPY", value: 7)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 138, size: 32, align: 32, elements: !30)
!29 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!32 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 58, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!36 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!37 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!38 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!39 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !41)
!41 = !{!42}
!42 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!46 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!47 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!48 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 27, size: 32, align: 32, elements: !51)
!50 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!53 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!54 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!55 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 51, baseType: !60)
!59 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !{!62, !224, !227, !231, !242, !243, !246, !249}
!62 = distinct !DISubprogram(name: "lzma_lzma2_decoder_init", scope: !1, file: !1, line: 251, type: !63, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !66, !129, !213}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !68, line: 75, baseType: !69)
!68 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !68, line: 119, size: 512, align: 64, elements: !70)
!70 = !{!71, !177, !178, !180, !187, !189, !196, !201}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !69, file: !68, line: 121, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !68, line: 73, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 19, size: 1472, align: 64, elements: !75)
!75 = !{!76, !77, !78, !142, !143, !144, !145, !146}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !74, file: !1, line: 29, baseType: !18, size: 32, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next_sequence", scope: !74, file: !1, line: 32, baseType: !18, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !74, file: !1, line: 35, baseType: !79, size: 320, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !80, line: 72, baseType: !81)
!80 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_decoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!81 = !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 54, size: 320, align: 64, elements: !82)
!82 = !{!83, !84, !112, !118, !125}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !81, file: !80, line: 56, baseType: !72, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !81, file: !80, line: 59, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!65, !88, !89, !107, !110, !99}
!88 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !80, line: 44, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 20, size: 384, align: 64, elements: !93)
!93 = !{!94, !98, !102, !103, !104, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !92, file: !80, line: 24, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !59, line: 48, baseType: !97)
!97 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !92, file: !80, line: 28, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 62, baseType: !101)
!100 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!101 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !92, file: !80, line: 33, baseType: !99, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !92, file: !80, line: 36, baseType: !99, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !92, file: !80, line: 39, baseType: !99, size: 64, align: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !92, file: !80, line: 42, baseType: !106, size: 8, align: 8, offset: 320)
!106 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!107 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!110 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !81, file: !80, line: 63, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !72, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !81, file: !80, line: 66, baseType: !119, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !72, !122}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !123, line: 63, baseType: !124)
!123 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !59, line: 55, baseType: !101)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !81, file: !80, line: 70, baseType: !126, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !72, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !132)
!132 = !{!133, !137, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !131, file: !4, line: 376, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!57, !57, !99, !99}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !131, file: !4, line: 390, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !57, !57}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !131, file: !4, line: 401, baseType: !57, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !74, file: !1, line: 38, baseType: !99, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !74, file: !1, line: 42, baseType: !99, size: 64, align: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !74, file: !1, line: 46, baseType: !106, size: 8, align: 8, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !74, file: !1, line: 50, baseType: !106, size: 8, align: 8, offset: 520)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !74, file: !1, line: 52, baseType: !147, size: 896, align: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !29, line: 399, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 185, size: 896, align: 64, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !158, !159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !172, !173, !174, !175, !176}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !148, file: !29, line: 217, baseType: !58, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !148, file: !29, line: 240, baseType: !108, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !148, file: !29, line: 254, baseType: !58, size: 32, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !148, file: !29, line: 281, baseType: !58, size: 32, align: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !148, file: !29, line: 293, baseType: !58, size: 32, align: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !148, file: !29, line: 316, baseType: !58, size: 32, align: 32, offset: 224)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !148, file: !29, line: 322, baseType: !157, size: 32, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !29, line: 155, baseType: !28)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !148, file: !29, line: 342, baseType: !58, size: 32, align: 32, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !148, file: !29, line: 345, baseType: !160, size: 32, align: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !29, line: 111, baseType: !33)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !148, file: !29, line: 375, baseType: !58, size: 32, align: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !148, file: !29, line: 384, baseType: !58, size: 32, align: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !148, file: !29, line: 385, baseType: !58, size: 32, align: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !148, file: !29, line: 386, baseType: !58, size: 32, align: 32, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !148, file: !29, line: 387, baseType: !58, size: 32, align: 32, offset: 480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !148, file: !29, line: 388, baseType: !58, size: 32, align: 32, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !148, file: !29, line: 389, baseType: !58, size: 32, align: 32, offset: 544)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !148, file: !29, line: 390, baseType: !58, size: 32, align: 32, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !148, file: !29, line: 391, baseType: !58, size: 32, align: 32, offset: 608)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !148, file: !29, line: 392, baseType: !171, size: 32, align: 32, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !40)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !148, file: !29, line: 393, baseType: !171, size: 32, align: 32, offset: 672)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !148, file: !29, line: 394, baseType: !171, size: 32, align: 32, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !148, file: !29, line: 395, baseType: !171, size: 32, align: 32, offset: 736)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !148, file: !29, line: 396, baseType: !57, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !148, file: !29, line: 397, baseType: !57, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !69, file: !68, line: 125, baseType: !122, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !69, file: !68, line: 131, baseType: !179, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !59, line: 122, baseType: !101)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !69, file: !68, line: 134, baseType: !181, size: 64, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !68, line: 89, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!65, !72, !129, !107, !110, !99, !185, !110, !99, !186}
!185 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !95)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !43)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !69, file: !68, line: 139, baseType: !188, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !68, line: 97, baseType: !126)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !69, file: !68, line: 143, baseType: !190, size: 64, align: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !50, line: 55, baseType: !49)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !69, file: !68, line: 147, baseType: !197, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!65, !72, !200, !200, !124}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !69, file: !68, line: 152, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!65, !72, !129, !205, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !208, line: 65, baseType: !209)
!208 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!209 = !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 43, size: 128, align: 64, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !209, file: !208, line: 54, baseType: !122, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !209, file: !208, line: 63, baseType: !57, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !68, line: 77, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !68, line: 104, size: 192, align: 64, elements: !217)
!217 = !{!218, !219, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !68, line: 107, baseType: !122, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !216, file: !68, line: 111, baseType: !220, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !68, line: 81, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !216, file: !68, line: 114, baseType: !57, size: 64, align: 64, offset: 128)
!223 = !{}
!224 = distinct !DISubprogram(name: "lzma_lzma2_decoder_memusage", scope: !1, file: !1, line: 264, type: !225, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!225 = !DISubroutineType(types: !226)
!226 = !{!124, !116}
!227 = distinct !DISubprogram(name: "lzma_lzma2_props_decode", scope: !1, file: !1, line: 272, type: !228, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!228 = !DISubroutineType(types: !229)
!229 = !{!65, !230, !129, !108, !99}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!231 = distinct !DISubprogram(name: "lzma2_decoder_init", scope: !1, file: !1, line: 224, type: !232, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!232 = !DISubroutineType(types: !233)
!233 = !{!65, !234, !129, !116, !235}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !80, line: 51, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 47, size: 192, align: 64, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !237, file: !80, line: 48, baseType: !99, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !237, file: !80, line: 49, baseType: !108, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !237, file: !80, line: 50, baseType: !99, size: 64, align: 64, offset: 128)
!242 = distinct !DISubprogram(name: "lzma2_decode", scope: !1, file: !1, line: 57, type: !86, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!243 = distinct !DISubprogram(name: "dict_reset", scope: !80, file: !80, line: 230, type: !244, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !90}
!246 = distinct !DISubprogram(name: "dict_write", scope: !80, file: !80, line: 205, type: !247, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !89, !107, !110, !99, !110}
!249 = distinct !DISubprogram(name: "lzma2_decoder_end", scope: !1, file: !1, line: 212, type: !127, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false, variables: !223)
!250 = !{!251}
!251 = !DIGlobalVariable(name: "LZMA_LZ_DECODER_INIT", scope: !0, file: !80, line: 75, type: !252, isLocal: true, isDefinition: true, variable: %struct.lzma_lz_decoder* @LZMA_LZ_DECODER_INIT)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!253 = !{i32 2, !"Dwarf Version", i32 4}
!254 = !{i32 2, !"Debug Info Version", i32 3}
!255 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!256 = !DILocalVariable(name: "next", arg: 1, scope: !62, file: !1, line: 251, type: !66)
!257 = !DIExpression()
!258 = !DILocation(line: 251, column: 42, scope: !62)
!259 = !DILocalVariable(name: "allocator", arg: 2, scope: !62, file: !1, line: 251, type: !129)
!260 = !DILocation(line: 251, column: 64, scope: !62)
!261 = !DILocalVariable(name: "filters", arg: 3, scope: !62, file: !1, line: 252, type: !213)
!262 = !DILocation(line: 252, column: 27, scope: !62)
!263 = !DILocation(line: 256, column: 2, scope: !62)
!264 = !DILocation(line: 256, column: 2, scope: !265)
!265 = !DILexicalBlockFile(scope: !62, file: !1, discriminator: 1)
!266 = !DILocation(line: 256, column: 2, scope: !267)
!267 = !DILexicalBlockFile(scope: !62, file: !1, discriminator: 2)
!268 = !DILocation(line: 256, column: 2, scope: !269)
!269 = !DILexicalBlockFile(scope: !62, file: !1, discriminator: 3)
!270 = !DILocation(line: 258, column: 30, scope: !62)
!271 = !DILocation(line: 258, column: 36, scope: !62)
!272 = !DILocation(line: 258, column: 47, scope: !62)
!273 = !DILocation(line: 258, column: 9, scope: !62)
!274 = !DILocation(line: 258, column: 2, scope: !62)
!275 = !DILocalVariable(name: "lz", arg: 1, scope: !231, file: !1, line: 224, type: !234)
!276 = !DILocation(line: 224, column: 37, scope: !231)
!277 = !DILocalVariable(name: "allocator", arg: 2, scope: !231, file: !1, line: 224, type: !129)
!278 = !DILocation(line: 224, column: 57, scope: !231)
!279 = !DILocalVariable(name: "opt", arg: 3, scope: !231, file: !1, line: 225, type: !116)
!280 = !DILocation(line: 225, column: 15, scope: !231)
!281 = !DILocalVariable(name: "lz_options", arg: 4, scope: !231, file: !1, line: 225, type: !235)
!282 = !DILocation(line: 225, column: 37, scope: !231)
!283 = !DILocalVariable(name: "options", scope: !231, file: !1, line: 227, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!286 = !DILocation(line: 227, column: 27, scope: !231)
!287 = !DILocation(line: 227, column: 37, scope: !231)
!288 = !DILocation(line: 229, column: 6, scope: !289)
!289 = distinct !DILexicalBlock(scope: !231, file: !1, line: 229, column: 6)
!290 = !DILocation(line: 229, column: 10, scope: !289)
!291 = !DILocation(line: 229, column: 16, scope: !289)
!292 = !DILocation(line: 229, column: 6, scope: !231)
!293 = !DILocation(line: 230, column: 46, scope: !294)
