; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_decoder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_decoder = type { %struct.lzma_coder_s*, i32 (%struct.lzma_coder_s*, %struct.lzma_dict*, i8*, i64*, i64)*, void (%struct.lzma_coder_s*, i8*)*, void (%struct.lzma_coder_s*, i64)*, void (%struct.lzma_coder_s*, %struct.lzma_allocator*)* }
%struct.lzma_coder_s = type { [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_decoder, %struct.lzma_length_decoder, %struct.lzma_range_decoder, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i16*, i32, i32, i32, i32 }
%struct.lzma_length_decoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16] }
%struct.lzma_range_decoder = type { i32, i32, i32 }
%struct.lzma_dict = type { i8*, i64, i64, i64, i64, i8 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_lz_options = type { i64, i8*, i64 }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !216, subprograms: !224, globals: !434)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_decoder.c", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!2 = !{!3, !18, !33, !188, !193, !200, !203, !209}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/base.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LZMA_OK", value: 0)
!7 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1)
!8 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2)
!9 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3)
!10 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4)
!11 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5)
!12 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6)
!13 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7)
!14 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8)
!15 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9)
!16 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10)
!17 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 56, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lzma/lzma_common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0)
!22 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1)
!23 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2)
!24 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3)
!25 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4)
!26 = !DIEnumerator(name: "STATE_REP_LIT", value: 5)
!27 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6)
!28 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7)
!29 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8)
!30 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9)
!31 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10)
!32 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !1, line: 240, size: 32, align: 32, elements: !116)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 164, size: 226816, align: 64, elements: !35)
!35 = !{!36, !46, !50, !53, !54, !55, !56, !57, !62, !66, !69, !84, !85, !95, !97, !98, !99, !100, !101, !102, !103, !104, !109, !110, !112, !113, !114, !115}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !34, file: !1, line: 170, baseType: !37, size: 196608, align: 16)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 196608, align: 16, elements: !43)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !39, line: 72, baseType: !40)
!39 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/range_common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 49, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!42 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!43 = !{!44, !45}
!44 = !DISubrange(count: 16)
!45 = !DISubrange(count: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !34, file: !1, line: 173, baseType: !47, size: 3072, align: 16, offset: 196608)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 3072, align: 16, elements: !48)
!48 = !{!49, !44}
!49 = !DISubrange(count: 12)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !34, file: !1, line: 176, baseType: !51, size: 192, align: 16, offset: 199680)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, align: 16, elements: !52)
!52 = !{!49}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !34, file: !1, line: 180, baseType: !51, size: 192, align: 16, offset: 199872)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !34, file: !1, line: 184, baseType: !51, size: 192, align: 16, offset: 200064)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !34, file: !1, line: 187, baseType: !51, size: 192, align: 16, offset: 200256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !34, file: !1, line: 191, baseType: !47, size: 3072, align: 16, offset: 200448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !34, file: !1, line: 196, baseType: !58, size: 4096, align: 16, offset: 203520)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 4096, align: 16, elements: !59)
!59 = !{!60, !61}
!60 = !DISubrange(count: 4)
!61 = !DISubrange(count: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !34, file: !1, line: 200, baseType: !63, size: 1824, align: 16, offset: 207616)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1824, align: 16, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 114)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !34, file: !1, line: 204, baseType: !67, size: 256, align: 16, offset: 209440)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, align: 16, elements: !68)
!68 = !{!44}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_decoder", scope: !34, file: !1, line: 207, baseType: !70, size: 8224, align: 16, offset: 209696)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_decoder", file: !1, line: 161, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 155, size: 8224, align: 16, elements: !72)
!72 = !{!73, !74, !75, !79, !80}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !71, file: !1, line: 156, baseType: !38, size: 16, align: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !71, file: !1, line: 157, baseType: !38, size: 16, align: 16, offset: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !71, file: !1, line: 158, baseType: !76, size: 2048, align: 16, offset: 32)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 16, elements: !77)
!77 = !{!44, !78}
!78 = !DISubrange(count: 8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !71, file: !1, line: 159, baseType: !76, size: 2048, align: 16, offset: 2080)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !71, file: !1, line: 160, baseType: !81, size: 4096, align: 16, offset: 4128)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 4096, align: 16, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_decoder", scope: !34, file: !1, line: 210, baseType: !70, size: 8224, align: 16, offset: 217920)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !34, file: !1, line: 217, baseType: !86, size: 96, align: 32, offset: 226144)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_decoder", file: !87, line: 24, baseType: !88)
!87 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/rangecoder/range_decoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!88 = !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 20, size: 96, align: 32, elements: !89)
!89 = !{!90, !93, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !88, file: !87, line: 21, baseType: !91, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 51, baseType: !92)
!92 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !88, file: !87, line: 22, baseType: !91, size: 32, align: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes_left", scope: !88, file: !87, line: 23, baseType: !91, size: 32, align: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !34, file: !1, line: 220, baseType: !96, size: 32, align: 32, offset: 226240)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !19, line: 69, baseType: !18)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rep0", scope: !34, file: !1, line: 222, baseType: !91, size: 32, align: 32, offset: 226272)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rep1", scope: !34, file: !1, line: 223, baseType: !91, size: 32, align: 32, offset: 226304)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rep2", scope: !34, file: !1, line: 224, baseType: !91, size: 32, align: 32, offset: 226336)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "rep3", scope: !34, file: !1, line: 225, baseType: !91, size: 32, align: 32, offset: 226368)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !34, file: !1, line: 227, baseType: !91, size: 32, align: 32, offset: 226400)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !34, file: !1, line: 228, baseType: !91, size: 32, align: 32, offset: 226432)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !34, file: !1, line: 229, baseType: !91, size: 32, align: 32, offset: 226464)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !34, file: !1, line: 233, baseType: !105, size: 64, align: 64, offset: 226496)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !106, line: 63, baseType: !107)
!106 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/vli.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 55, baseType: !108)
!108 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !1, line: 260, baseType: !33, size: 32, align: 32, offset: 226560)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !34, file: !1, line: 263, baseType: !111, size: 64, align: 64, offset: 226624)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !34, file: !1, line: 267, baseType: !91, size: 32, align: 32, offset: 226688)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !34, file: !1, line: 271, baseType: !91, size: 32, align: 32, offset: 226720)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !34, file: !1, line: 275, baseType: !91, size: 32, align: 32, offset: 226752)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !1, line: 279, baseType: !91, size: 32, align: 32, offset: 226784)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!117 = !DIEnumerator(name: "SEQ_NORMALIZE", value: 0)
!118 = !DIEnumerator(name: "SEQ_IS_MATCH", value: 1)
!119 = !DIEnumerator(name: "SEQ_LITERAL0", value: 2)
!120 = !DIEnumerator(name: "SEQ_LITERAL1", value: 3)
!121 = !DIEnumerator(name: "SEQ_LITERAL2", value: 4)
!122 = !DIEnumerator(name: "SEQ_LITERAL3", value: 5)
!123 = !DIEnumerator(name: "SEQ_LITERAL4", value: 6)
!124 = !DIEnumerator(name: "SEQ_LITERAL5", value: 7)
!125 = !DIEnumerator(name: "SEQ_LITERAL6", value: 8)
!126 = !DIEnumerator(name: "SEQ_LITERAL7", value: 9)
!127 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED0", value: 10)
!128 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED1", value: 11)
!129 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED2", value: 12)
!130 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED3", value: 13)
!131 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED4", value: 14)
!132 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED5", value: 15)
!133 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED6", value: 16)
!134 = !DIEnumerator(name: "SEQ_LITERAL_MATCHED7", value: 17)
!135 = !DIEnumerator(name: "SEQ_LITERAL_WRITE", value: 18)
!136 = !DIEnumerator(name: "SEQ_IS_REP", value: 19)
!137 = !DIEnumerator(name: "SEQ_MATCH_LEN_CHOICE", value: 20)
!138 = !DIEnumerator(name: "SEQ_MATCH_LEN_LOW0", value: 21)
!139 = !DIEnumerator(name: "SEQ_MATCH_LEN_LOW1", value: 22)
!140 = !DIEnumerator(name: "SEQ_MATCH_LEN_LOW2", value: 23)
!141 = !DIEnumerator(name: "SEQ_MATCH_LEN_CHOICE2", value: 24)
!142 = !DIEnumerator(name: "SEQ_MATCH_LEN_MID0", value: 25)
!143 = !DIEnumerator(name: "SEQ_MATCH_LEN_MID1", value: 26)
!144 = !DIEnumerator(name: "SEQ_MATCH_LEN_MID2", value: 27)
!145 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH0", value: 28)
!146 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH1", value: 29)
!147 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH2", value: 30)
!148 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH3", value: 31)
!149 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH4", value: 32)
!150 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH5", value: 33)
!151 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH6", value: 34)
!152 = !DIEnumerator(name: "SEQ_MATCH_LEN_HIGH7", value: 35)
!153 = !DIEnumerator(name: "SEQ_POS_SLOT0", value: 36)
!154 = !DIEnumerator(name: "SEQ_POS_SLOT1", value: 37)
!155 = !DIEnumerator(name: "SEQ_POS_SLOT2", value: 38)
!156 = !DIEnumerator(name: "SEQ_POS_SLOT3", value: 39)
!157 = !DIEnumerator(name: "SEQ_POS_SLOT4", value: 40)
!158 = !DIEnumerator(name: "SEQ_POS_SLOT5", value: 41)
!159 = !DIEnumerator(name: "SEQ_POS_MODEL", value: 42)
!160 = !DIEnumerator(name: "SEQ_DIRECT", value: 43)
!161 = !DIEnumerator(name: "SEQ_ALIGN0", value: 44)
!162 = !DIEnumerator(name: "SEQ_ALIGN1", value: 45)
!163 = !DIEnumerator(name: "SEQ_ALIGN2", value: 46)
!164 = !DIEnumerator(name: "SEQ_ALIGN3", value: 47)
!165 = !DIEnumerator(name: "SEQ_EOPM", value: 48)
!166 = !DIEnumerator(name: "SEQ_IS_REP0", value: 49)
!167 = !DIEnumerator(name: "SEQ_SHORTREP", value: 50)
!168 = !DIEnumerator(name: "SEQ_IS_REP0_LONG", value: 51)
!169 = !DIEnumerator(name: "SEQ_IS_REP1", value: 52)
!170 = !DIEnumerator(name: "SEQ_IS_REP2", value: 53)
!171 = !DIEnumerator(name: "SEQ_REP_LEN_CHOICE", value: 54)
!172 = !DIEnumerator(name: "SEQ_REP_LEN_LOW0", value: 55)
!173 = !DIEnumerator(name: "SEQ_REP_LEN_LOW1", value: 56)
!174 = !DIEnumerator(name: "SEQ_REP_LEN_LOW2", value: 57)
!175 = !DIEnumerator(name: "SEQ_REP_LEN_CHOICE2", value: 58)
!176 = !DIEnumerator(name: "SEQ_REP_LEN_MID0", value: 59)
!177 = !DIEnumerator(name: "SEQ_REP_LEN_MID1", value: 60)
!178 = !DIEnumerator(name: "SEQ_REP_LEN_MID2", value: 61)
!179 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH0", value: 62)
!180 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH1", value: 63)
!181 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH2", value: 64)
!182 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH3", value: 65)
!183 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH4", value: 66)
!184 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH5", value: 67)
!185 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH6", value: 68)
!186 = !DIEnumerator(name: "SEQ_REP_LEN_HIGH7", value: 69)
!187 = !DIEnumerator(name: "SEQ_COPY", value: 70)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 138, size: 32, align: 32, elements: !190)
!189 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/lzma.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!190 = !{!191, !192}
!191 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1)
!192 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 58, size: 32, align: 32, elements: !194)
!194 = !{!195, !196, !197, !198, !199}
!195 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3)
!196 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4)
!197 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18)
!198 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19)
!199 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !201)
!201 = !{!202}
!202 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, size: 32, align: 32, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIEnumerator(name: "LZMA_RUN", value: 0)
!206 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1)
!207 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2)
!208 = !DIEnumerator(name: "LZMA_FINISH", value: 3)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !210, line: 27, size: 32, align: 32, elements: !211)
!210 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/check.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!211 = !{!212, !213, !214, !215}
!212 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0)
!213 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1)
!214 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4)
!215 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10)
!216 = !{!217, !218, !220, !222, !91}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !219, line: 62, baseType: !108)
!219 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !41, line: 38, baseType: !221)
!221 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!224 = !{!225, !298, !352, !386, !389, !390, !394, !395, !399, !405, !408, !412, !416, !417, !423, !424, !425, !430}
!225 = distinct !DISubprogram(name: "lzma_lzma_decoder_create", scope: !1, file: !1, line: 952, type: !226, isLocal: false, isDefinition: true, scopeLine: 954, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !229, !277, !267, !290}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !231, line: 72, baseType: !232)
!231 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/lz/lz_decoder.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!232 = !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 54, size: 320, align: 64, elements: !233)
!233 = !{!234, !238, !263, !269, !273}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !232, file: !231, line: 56, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !237, line: 73, baseType: !34)
!237 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/common/common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !232, file: !231, line: 59, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!228, !242, !243, !258, !261, !218}
!242 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!243 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !231, line: 44, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 20, size: 384, align: 64, elements: !247)
!247 = !{!248, !252, !253, !254, !255, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !246, file: !231, line: 24, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 48, baseType: !251)
!251 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !246, file: !231, line: 28, baseType: !218, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !246, file: !231, line: 33, baseType: !218, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !246, file: !231, line: 36, baseType: !218, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !231, line: 39, baseType: !218, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !246, file: !231, line: 42, baseType: !257, size: 8, align: 8, offset: 320)
!257 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!258 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!261 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !232, file: !231, line: 63, baseType: !264, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !235, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !232, file: !231, line: 66, baseType: !270, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !235, !105}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !232, file: !231, line: 70, baseType: !274, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !235, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, align: 64, elements: !280)
!280 = !{!281, !285, !289}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !279, file: !4, line: 376, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!217, !217, !218, !218}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !279, file: !4, line: 390, baseType: !286, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !217, !217}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !279, file: !4, line: 401, baseType: !217, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !231, line: 51, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 47, size: 192, align: 64, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !292, file: !231, line: 48, baseType: !218, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !292, file: !231, line: 49, baseType: !259, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !292, file: !231, line: 50, baseType: !218, size: 64, align: 64, offset: 128)
!297 = !{}
!298 = distinct !DISubprogram(name: "lzma_lzma_decoder_init", scope: !1, file: !1, line: 998, type: !299, isLocal: false, isDefinition: true, scopeLine: 1000, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!299 = !DISubroutineType(types: !300)
!300 = !{!228, !301, !277, !342}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !237, line: 75, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !237, line: 119, size: 512, align: 64, elements: !304)
!304 = !{!305, !306, !307, !309, !316, !318, !325, !330}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !303, file: !237, line: 121, baseType: !235, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !303, file: !237, line: 125, baseType: !105, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !303, file: !237, line: 131, baseType: !308, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !41, line: 122, baseType: !108)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !303, file: !237, line: 134, baseType: !310, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !237, line: 89, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!228, !235, !277, !258, !261, !218, !314, !261, !218, !315}
!314 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !249)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !203)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !303, file: !237, line: 139, baseType: !317, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !237, line: 97, baseType: !274)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !303, file: !237, line: 143, baseType: !319, size: 64, align: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !210, line: 55, baseType: !209)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !303, file: !237, line: 147, baseType: !326, size: 64, align: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!228, !235, !329, !329, !107}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !303, file: !237, line: 152, baseType: !331, size: 64, align: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!228, !235, !277, !334, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !337, line: 65, baseType: !338)
!337 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmliblzma/liblzma/api/lzma/filter.h", directory: "/data/download/cmake/cmake-master/Utilities/cmliblzma")
!338 = !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 43, size: 128, align: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !337, line: 54, baseType: !105, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !338, file: !337, line: 63, baseType: !217, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !237, line: 77, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !237, line: 104, size: 192, align: 64, elements: !346)
!346 = !{!347, !348, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !345, file: !237, line: 107, baseType: !105, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !345, file: !237, line: 111, baseType: !349, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !237, line: 81, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !345, file: !237, line: 114, baseType: !217, size: 64, align: 64, offset: 128)
!352 = distinct !DISubprogram(name: "lzma_lzma_lclppb_decode", scope: !1, file: !1, line: 1011, type: !353, isLocal: false, isDefinition: true, scopeLine: 1012, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!353 = !DISubroutineType(types: !354)
!354 = !{!257, !355, !250}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !189, line: 399, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, file: !189, line: 185, size: 896, align: 64, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !367, !368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !381, !382, !383, !384, !385}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !357, file: !189, line: 217, baseType: !91, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !357, file: !189, line: 240, baseType: !259, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !357, file: !189, line: 254, baseType: !91, size: 32, align: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !357, file: !189, line: 281, baseType: !91, size: 32, align: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !357, file: !189, line: 293, baseType: !91, size: 32, align: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !357, file: !189, line: 316, baseType: !91, size: 32, align: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !357, file: !189, line: 322, baseType: !366, size: 32, align: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !189, line: 155, baseType: !188)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !357, file: !189, line: 342, baseType: !91, size: 32, align: 32, offset: 288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !357, file: !189, line: 345, baseType: !369, size: 32, align: 32, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !189, line: 111, baseType: !193)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !357, file: !189, line: 375, baseType: !91, size: 32, align: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !357, file: !189, line: 384, baseType: !91, size: 32, align: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !357, file: !189, line: 385, baseType: !91, size: 32, align: 32, offset: 416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !357, file: !189, line: 386, baseType: !91, size: 32, align: 32, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !357, file: !189, line: 387, baseType: !91, size: 32, align: 32, offset: 480)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !357, file: !189, line: 388, baseType: !91, size: 32, align: 32, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !357, file: !189, line: 389, baseType: !91, size: 32, align: 32, offset: 544)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !357, file: !189, line: 390, baseType: !91, size: 32, align: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !357, file: !189, line: 391, baseType: !91, size: 32, align: 32, offset: 608)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !357, file: !189, line: 392, baseType: !380, size: 32, align: 32, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !200)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !357, file: !189, line: 393, baseType: !380, size: 32, align: 32, offset: 672)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !357, file: !189, line: 394, baseType: !380, size: 32, align: 32, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !357, file: !189, line: 395, baseType: !380, size: 32, align: 32, offset: 736)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !357, file: !189, line: 396, baseType: !217, size: 64, align: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !357, file: !189, line: 397, baseType: !217, size: 64, align: 64, offset: 832)
!386 = distinct !DISubprogram(name: "lzma_lzma_decoder_memusage_nocheck", scope: !1, file: !1, line: 1027, type: !387, isLocal: false, isDefinition: true, scopeLine: 1028, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!387 = !DISubroutineType(types: !388)
!388 = !{!107, !267}
!389 = distinct !DISubprogram(name: "lzma_lzma_decoder_memusage", scope: !1, file: !1, line: 1035, type: !387, isLocal: false, isDefinition: true, scopeLine: 1036, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!390 = distinct !DISubprogram(name: "lzma_lzma_props_decode", scope: !1, file: !1, line: 1045, type: !391, isLocal: false, isDefinition: true, scopeLine: 1047, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!391 = !DISubroutineType(types: !392)
!392 = !{!228, !393, !277, !259, !218}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!394 = distinct !DISubprogram(name: "lzma_decode", scope: !1, file: !1, line: 284, type: !240, isLocal: true, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!395 = distinct !DISubprogram(name: "rc_read_init", scope: !87, file: !87, line: 29, type: !396, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!396 = !DISubroutineType(types: !397)
!397 = !{!257, !398, !258, !261, !218}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!399 = distinct !DISubprogram(name: "dict_get", scope: !231, file: !231, line: 103, type: !400, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!400 = !DISubroutineType(types: !401)
!401 = !{!250, !402, !223}
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!405 = distinct !DISubprogram(name: "dict_put", scope: !231, file: !231, line: 189, type: !406, isLocal: true, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!406 = !DISubroutineType(types: !407)
!407 = !{!257, !244, !250}
!408 = distinct !DISubprogram(name: "dict_is_distance_valid", scope: !231, file: !231, line: 120, type: !409, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!409 = !DISubroutineType(types: !410)
!410 = !{!257, !402, !411}
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!412 = distinct !DISubprogram(name: "dict_repeat", scope: !231, file: !231, line: 128, type: !413, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!413 = !DISubroutineType(types: !414)
!414 = !{!257, !244, !91, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!416 = distinct !DISubprogram(name: "lzma_decoder_reset", scope: !1, file: !1, line: 867, type: !265, isLocal: true, isDefinition: true, scopeLine: 868, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!417 = distinct !DISubprogram(name: "literal_init", scope: !19, file: !19, line: 129, type: !418, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420, !91, !91}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 12288, align: 16, elements: !422)
!422 = !{!45}
!423 = distinct !DISubprogram(name: "lzma_decoder_uncompressed", scope: !1, file: !1, line: 852, type: !271, isLocal: true, isDefinition: true, scopeLine: 853, flags: DIFlagPrototyped, isOptimized: false, variables: !297)
