; ModuleID = '/data/download/cmake/cmake-master/Source/kwsys/Terminal.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [15 x i8] c"CLICOLOR_FORCE\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"EMACS\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"TERM\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !30, globals: !106)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Source/kwsys/Terminal.c", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmsysTerminal_Color_e", file: !4, line: 96, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Source/cmsys/Terminal.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!6 = !DIEnumerator(name: "cmsysTerminal_Color_Normal", value: 0)
!7 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundBlack", value: 1)
!8 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundRed", value: 2)
!9 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundGreen", value: 3)
!10 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundYellow", value: 4)
!11 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundBlue", value: 5)
!12 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundMagenta", value: 6)
!13 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundCyan", value: 7)
!14 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundWhite", value: 8)
!15 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundMask", value: 15)
!16 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundBlack", value: 16)
!17 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundRed", value: 32)
!18 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundGreen", value: 48)
!19 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundYellow", value: 64)
!20 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundBlue", value: 80)
!21 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundMagenta", value: 96)
!22 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundCyan", value: 112)
!23 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundWhite", value: 128)
!24 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundMask", value: 240)
!25 = !DIEnumerator(name: "cmsysTerminal_Color_ForegroundBold", value: 256)
!26 = !DIEnumerator(name: "cmsysTerminal_Color_BackgroundBold", value: 512)
!27 = !DIEnumerator(name: "cmsysTerminal_Color_AssumeTTY", value: 1024)
!28 = !DIEnumerator(name: "cmsysTerminal_Color_AssumeVT100", value: 2048)
!29 = !DIEnumerator(name: "cmsysTerminal_Color_AttributeMask", value: 3840)
!30 = !{!31, !100, !103}
!31 = distinct !DISubprogram(name: "cmsysTerminal_cfprintf", scope: !1, file: !1, line: 47, type: !32, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, variables: !99)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !35, !97, null}
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 48, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !39, line: 245, size: 1728, align: 64, elements: !40)
!39 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!40 = !{!41, !42, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !85, !86, !87, !88, !92, !93}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !39, line: 246, baseType: !34, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !38, file: !39, line: 251, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !38, file: !39, line: 252, baseType: !43, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !38, file: !39, line: 253, baseType: !43, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !38, file: !39, line: 254, baseType: !43, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !38, file: !39, line: 255, baseType: !43, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !38, file: !39, line: 256, baseType: !43, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !38, file: !39, line: 257, baseType: !43, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !38, file: !39, line: 258, baseType: !43, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !38, file: !39, line: 260, baseType: !43, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !38, file: !39, line: 261, baseType: !43, size: 64, align: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !38, file: !39, line: 262, baseType: !43, size: 64, align: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !38, file: !39, line: 264, baseType: !56, size: 64, align: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !39, line: 160, size: 192, align: 64, elements: !58)
!58 = !{!59, !60, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !57, file: !39, line: 161, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !57, file: !39, line: 162, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !57, file: !39, line: 166, baseType: !34, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !38, file: !39, line: 266, baseType: !61, size: 64, align: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !38, file: !39, line: 268, baseType: !34, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !38, file: !39, line: 272, baseType: !34, size: 32, align: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !38, file: !39, line: 274, baseType: !67, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 131, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!69 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !38, file: !39, line: 278, baseType: !71, size: 16, align: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !38, file: !39, line: 279, baseType: !73, size: 8, align: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !38, file: !39, line: 280, baseType: !75, size: 8, align: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !38, file: !39, line: 284, baseType: !79, size: 64, align: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !39, line: 154, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !39, line: 293, baseType: !82, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 132, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !38, file: !39, line: 302, baseType: !84, size: 64, align: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !38, file: !39, line: 303, baseType: !84, size: 64, align: 64, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !38, file: !39, line: 304, baseType: !84, size: 64, align: 64, offset: 1344)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !38, file: !39, line: 305, baseType: !84, size: 64, align: 64, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !38, file: !39, line: 306, baseType: !89, size: 64, align: 64, offset: 1472)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 62, baseType: !91)
!90 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!91 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !38, file: !39, line: 308, baseType: !34, size: 32, align: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !38, file: !39, line: 310, baseType: !94, size: 160, align: 8, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!99 = !{}
!100 = distinct !DISubprogram(name: "kwsysTerminalStreamIsVT100", scope: !1, file: !1, line: 160, type: !101, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, variables: !99)
!101 = !DISubroutineType(types: !102)
!102 = !{!34, !35, !34, !34}
!103 = distinct !DISubprogram(name: "kwsysTerminalSetVT100Color", scope: !1, file: !1, line: 234, type: !104, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, variables: !99)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !35, !34}
!106 = !{!107}
!107 = !DIGlobalVariable(name: "kwsysTerminalVT100Names", scope: !0, file: !1, line: 105, type: !108, isLocal: true, isDefinition: true, variable: [53 x i8*]* @kwsysTerminalVT100Names)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 3392, align: 64, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 53)
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!114 = !DILocalVariable(name: "color", arg: 1, scope: !31, file: !1, line: 47, type: !34)
!115 = !DIExpression()
!116 = !DILocation(line: 47, column: 33, scope: !31)
!117 = !DILocalVariable(name: "stream", arg: 2, scope: !31, file: !1, line: 47, type: !35)
!118 = !DILocation(line: 47, column: 46, scope: !31)
!119 = !DILocalVariable(name: "format", arg: 3, scope: !31, file: !1, line: 47, type: !97)
!120 = !DILocation(line: 47, column: 66, scope: !31)
!121 = !DILocalVariable(name: "pipeIsConsole", scope: !31, file: !1, line: 50, type: !34)
!122 = !DILocation(line: 50, column: 7, scope: !31)
!123 = !DILocalVariable(name: "pipeIsVT100", scope: !31, file: !1, line: 51, type: !34)
!124 = !DILocation(line: 51, column: 7, scope: !31)
!125 = !DILocalVariable(name: "default_vt100", scope: !31, file: !1, line: 52, type: !34)
!126 = !DILocation(line: 52, column: 7, scope: !31)
!127 = !DILocation(line: 52, column: 23, scope: !31)
!128 = !DILocation(line: 52, column: 29, scope: !31)
!129 = !DILocalVariable(name: "default_tty", scope: !31, file: !1, line: 53, type: !34)
!130 = !DILocation(line: 53, column: 7, scope: !31)
!131 = !DILocation(line: 53, column: 21, scope: !31)
!132 = !DILocation(line: 53, column: 27, scope: !31)
!133 = !DILocation(line: 62, column: 8, scope: !134)
!134 = distinct !DILexicalBlock(scope: !31, file: !1, line: 62, column: 7)
!135 = !DILocation(line: 62, column: 22, scope: !134)
!136 = !DILocation(line: 63, column: 34, scope: !134)
!137 = !DILocation(line: 63, column: 42, scope: !134)
!138 = !DILocation(line: 63, column: 57, scope: !134)
!139 = !DILocation(line: 63, column: 7, scope: !134)
!140 = !DILocation(line: 62, column: 7, scope: !141)
!141 = !DILexicalBlockFile(scope: !31, file: !1, discriminator: 1)
!142 = !DILocation(line: 64, column: 17, scope: !143)
!143 = distinct !DILexicalBlock(scope: !134, file: !1, line: 63, column: 71)
!144 = !DILocation(line: 65, column: 32, scope: !143)
!145 = !DILocation(line: 65, column: 40, scope: !143)
!146 = !DILocation(line: 65, column: 5, scope: !143)
!147 = !DILocation(line: 66, column: 3, scope: !143)
!148 = !DILocalVariable(name: "var_args", scope: !149, file: !1, line: 70, type: !150)
!149 = distinct !DILexicalBlock(scope: !31, file: !1, line: 69, column: 3)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !37, line: 79, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !152, line: 50, baseType: !153)
!152 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stdarg.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 70, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 192, align: 64, elements: !76)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 70, size: 192, align: 64, elements: !156)
!156 = !{!157, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !155, file: !1, line: 70, baseType: !158, size: 32, align: 32)
!158 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !155, file: !1, line: 70, baseType: !158, size: 32, align: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !155, file: !1, line: 70, baseType: !84, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !155, file: !1, line: 70, baseType: !84, size: 64, align: 64, offset: 128)
!162 = !DILocation(line: 70, column: 13, scope: !149)
!163 = !DILocation(line: 71, column: 5, scope: !149)
!164 = !DILocation(line: 72, column: 14, scope: !149)
!165 = !DILocation(line: 72, column: 22, scope: !149)
!166 = !DILocation(line: 72, column: 30, scope: !149)
!167 = !DILocation(line: 72, column: 5, scope: !149)
!168 = !DILocation(line: 73, column: 5, scope: !149)
!169 = !DILocation(line: 83, column: 7, scope: !170)
!170 = distinct !DILexicalBlock(scope: !31, file: !1, line: 83, column: 7)
!171 = !DILocation(line: 83, column: 7, scope: !31)
!172 = !DILocation(line: 84, column: 32, scope: !173)
!173 = distinct !DILexicalBlock(scope: !170, file: !1, line: 83, column: 20)
!174 = !DILocation(line: 84, column: 5, scope: !173)
!175 = !DILocation(line: 85, column: 3, scope: !173)
!176 = !DILocation(line: 86, column: 1, scope: !31)
!177 = !DILocalVariable(name: "stream", arg: 1, scope: !100, file: !1, line: 160, type: !35)
!178 = !DILocation(line: 160, column: 45, scope: !100)
!179 = !DILocalVariable(name: "default_vt100", arg: 2, scope: !100, file: !1, line: 160, type: !34)
!180 = !DILocation(line: 160, column: 57, scope: !100)
!181 = !DILocalVariable(name: "default_tty", arg: 3, scope: !100, file: !1, line: 161, type: !34)
!182 = !DILocation(line: 161, column: 43, scope: !100)
!183 = !DILocalVariable(name: "clicolor_force", scope: !184, file: !1, line: 165, type: !97)
!184 = distinct !DILexicalBlock(scope: !100, file: !1, line: 164, column: 3)
!185 = !DILocation(line: 165, column: 17, scope: !184)
!186 = !DILocation(line: 165, column: 34, scope: !184)
!187 = !DILocation(line: 166, column: 9, scope: !188)
!188 = distinct !DILexicalBlock(scope: !184, file: !1, line: 166, column: 9)
!189 = !DILocation(line: 166, column: 24, scope: !188)
!190 = !DILocation(line: 166, column: 28, scope: !191)
!191 = !DILexicalBlockFile(scope: !188, file: !1, discriminator: 1)
!192 = !DILocation(line: 166, column: 27, scope: !191)
!193 = !DILocation(line: 166, column: 43, scope: !191)
!194 = !DILocation(line: 167, column: 16, scope: !188)
!195 = !DILocation(line: 167, column: 9, scope: !188)
!196 = !DILocation(line: 167, column: 37, scope: !188)
!197 = !DILocation(line: 166, column: 9, scope: !198)
!198 = !DILexicalBlockFile(scope: !184, file: !1, discriminator: 2)
!199 = !DILocation(line: 168, column: 7, scope: !200)
!200 = distinct !DILexicalBlock(scope: !188, file: !1, line: 167, column: 43)
!201 = !DILocalVariable(name: "emacs", scope: !202, file: !1, line: 176, type: !97)
!202 = distinct !DILexicalBlock(scope: !100, file: !1, line: 175, column: 3)
!203 = !DILocation(line: 176, column: 17, scope: !202)
!204 = !DILocation(line: 176, column: 25, scope: !202)
!205 = !DILocation(line: 177, column: 9, scope: !206)
!206 = distinct !DILexicalBlock(scope: !202, file: !1, line: 177, column: 9)
!207 = !DILocation(line: 177, column: 15, scope: !206)
!208 = !DILocation(line: 177, column: 19, scope: !209)
!209 = !DILexicalBlockFile(scope: !206, file: !1, discriminator: 1)
!210 = !DILocation(line: 177, column: 18, scope: !209)
!211 = !DILocation(line: 177, column: 25, scope: !209)
!212 = !DILocation(line: 177, column: 9, scope: !209)
!213 = !DILocation(line: 178, column: 7, scope: !214)
!214 = distinct !DILexicalBlock(scope: !206, file: !1, line: 177, column: 33)
!215 = !DILocation(line: 183, column: 8, scope: !216)
!216 = distinct !DILexicalBlock(scope: !100, file: !1, line: 183, column: 7)
!217 = !DILocation(line: 183, column: 7, scope: !100)
!218 = !DILocalVariable(name: "t", scope: !219, file: !1, line: 184, type: !220)
!219 = distinct !DILexicalBlock(scope: !216, file: !1, line: 183, column: 23)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!221 = !DILocation(line: 184, column: 18, scope: !219)
!222 = !DILocalVariable(name: "term", scope: !219, file: !1, line: 185, type: !97)
