; ModuleID = '/data/download/cmake/cmake-master/Source/kwsys/testSharedForward.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }


!531 = !DILocation(line: 519, column: 43, scope: !530)
!532 = !DILocation(line: 519, column: 3, scope: !533)
!533 = !DILexicalBlockFile(scope: !525, file: !21, discriminator: 3)
!534 = !DILocation(line: 520, column: 10, scope: !535)
!535 = distinct !DILexicalBlock(scope: !536, file: !21, line: 520, column: 9)
!536 = distinct !DILexicalBlock(scope: !524, file: !21, line: 519, column: 55)
!537 = !DILocation(line: 520, column: 9, scope: !535)
!538 = !DILocation(line: 520, column: 14, scope: !535)
!539 = !DILocation(line: 520, column: 21, scope: !535)
!540 = !DILocation(line: 520, column: 25, scope: !541)
!541 = !DILexicalBlockFile(scope: !535, file: !21, discriminator: 1)
!542 = !DILocation(line: 520, column: 24, scope: !541)
!543 = !DILocation(line: 520, column: 29, scope: !541)
!544 = !DILocation(line: 520, column: 9, scope: !541)
!545 = !DILocation(line: 521, column: 32, scope: !546)
!546 = distinct !DILexicalBlock(scope: !535, file: !21, line: 520, column: 38)
!547 = !DILocation(line: 521, column: 38, scope: !546)
!548 = !DILocation(line: 521, column: 36, scope: !546)
!549 = !DILocation(line: 521, column: 26, scope: !546)
!550 = !DILocation(line: 521, column: 24, scope: !546)
!551 = !DILocation(line: 522, column: 5, scope: !546)
!552 = !DILocation(line: 523, column: 3, scope: !536)
!553 = !DILocation(line: 519, column: 48, scope: !554)
!554 = !DILexicalBlockFile(scope: !524, file: !21, discriminator: 4)
!555 = !DILocation(line: 519, column: 3, scope: !554)
!556 = !DILocation(line: 526, column: 7, scope: !557)
!557 = distinct !DILexicalBlock(scope: !25, file: !21, line: 526, column: 7)
!558 = !DILocation(line: 526, column: 24, scope: !557)
!559 = !DILocation(line: 526, column: 7, scope: !25)
!560 = !DILocation(line: 528, column: 12, scope: !561)
!561 = distinct !DILexicalBlock(scope: !557, file: !21, line: 526, column: 29)
!562 = !DILocation(line: 528, column: 5, scope: !561)
!563 = !DILocation(line: 529, column: 3, scope: !561)
!564 = !DILocation(line: 529, column: 14, scope: !565)
!565 = !DILexicalBlockFile(scope: !566, file: !21, discriminator: 1)
!566 = distinct !DILexicalBlock(scope: !557, file: !21, line: 529, column: 14)
!567 = !DILocation(line: 529, column: 31, scope: !565)
!568 = !DILocation(line: 531, column: 12, scope: !569)
!569 = distinct !DILexicalBlock(scope: !566, file: !21, line: 529, column: 37)
!570 = !DILocation(line: 531, column: 5, scope: !569)
!571 = !DILocation(line: 532, column: 3, scope: !569)
!572 = !DILocation(line: 543, column: 13, scope: !573)
!573 = distinct !DILexicalBlock(scope: !566, file: !21, line: 541, column: 8)
!574 = !DILocation(line: 543, column: 21, scope: !573)
!575 = !DILocation(line: 543, column: 36, scope: !573)
!576 = !DILocation(line: 543, column: 28, scope: !573)
!577 = !DILocation(line: 543, column: 5, scope: !573)
!578 = !DILocation(line: 544, column: 12, scope: !573)
!579 = !DILocation(line: 544, column: 5, scope: !573)
!580 = !DILocation(line: 544, column: 30, scope: !573)
!581 = !DILocation(line: 546, column: 1, scope: !25)
!582 = !DILocalVariable(name: "f", arg: 1, scope: !28, file: !21, line: 549, type: !5)
!583 = !DILocation(line: 549, column: 59, scope: !28)
!584 = !DILocation(line: 561, column: 35, scope: !585)
!585 = distinct !DILexicalBlock(scope: !28, file: !21, line: 561, column: 7)
!586 = !DILocation(line: 561, column: 7, scope: !585)
!587 = !DILocation(line: 561, column: 70, scope: !585)
!588 = !DILocation(line: 561, column: 7, scope: !28)
!589 = !DILocation(line: 562, column: 5, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !21, line: 561, column: 76)
!591 = !DILocation(line: 564, column: 5, scope: !592)
!592 = distinct !DILexicalBlock(scope: !585, file: !21, line: 563, column: 10)
!593 = !DILocation(line: 566, column: 1, scope: !28)
!594 = !DILocalVariable(name: "in_path", arg: 1, scope: !34, file: !21, line: 410, type: !5)
!595 = !DILocation(line: 410, column: 54, scope: !34)
!596 = !DILocalVariable(name: "out_path", arg: 2, scope: !34, file: !21, line: 410, type: !14)
!597 = !DILocation(line: 410, column: 69, scope: !34)
!598 = !DILocation(line: 419, column: 19, scope: !34)
!599 = !DILocation(line: 419, column: 28, scope: !34)
!600 = !DILocation(line: 419, column: 10, scope: !34)
!601 = !DILocation(line: 419, column: 38, scope: !34)
!602 = !DILocation(line: 419, column: 3, scope: !34)
!603 = !DILocalVariable(name: "message", arg: 1, scope: !35, file: !21, line: 453, type: !14)
!604 = !DILocation(line: 453, column: 49, scope: !35)
!605 = !DILocation(line: 470, column: 10, scope: !35)
!606 = !DILocation(line: 470, column: 28, scope: !35)
!607 = !DILocation(line: 470, column: 19, scope: !608)
!608 = !DILexicalBlockFile(scope: !35, file: !21, discriminator: 1)
!609 = !DILocation(line: 470, column: 3, scope: !610)
!610 = !DILexicalBlockFile(scope: !35, file: !21, discriminator: 2)
!611 = !DILocation(line: 472, column: 1, scope: !35)
!612 = !DILocalVariable(name: "file1", arg: 1, scope: !38, file: !21, line: 423, type: !5)
!613 = !DILocation(line: 423, column: 54, scope: !38)
!614 = !DILocalVariable(name: "file2", arg: 2, scope: !38, file: !21, line: 423, type: !5)
!615 = !DILocation(line: 423, column: 73, scope: !38)
!616 = !DILocalVariable(name: "fs1", scope: !38, file: !21, line: 444, type: !617)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !618, line: 46, size: 1152, align: 64, elements: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!619 = !{!620, !623, !625, !627, !630, !632, !634, !635, !636, !639, !641, !643, !651, !652, !653}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !617, file: !618, line: 48, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !622, line: 124, baseType: !10)
!622 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !617, file: !618, line: 53, baseType: !624, size: 64, align: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !622, line: 127, baseType: !10)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !617, file: !618, line: 61, baseType: !626, size: 64, align: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !622, line: 130, baseType: !10)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !617, file: !618, line: 62, baseType: !628, size: 32, align: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !622, line: 129, baseType: !629)
!629 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !617, file: !618, line: 64, baseType: !631, size: 32, align: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !622, line: 125, baseType: !629)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !617, file: !618, line: 65, baseType: !633, size: 32, align: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !622, line: 126, baseType: !629)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !617, file: !618, line: 67, baseType: !11, size: 32, align: 32, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !617, file: !618, line: 69, baseType: !621, size: 64, align: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !617, file: !618, line: 74, baseType: !637, size: 64, align: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !622, line: 131, baseType: !638)
!638 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !617, file: !618, line: 78, baseType: !640, size: 64, align: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !622, line: 153, baseType: !638)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !617, file: !618, line: 80, baseType: !642, size: 64, align: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !622, line: 158, baseType: !638)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !617, file: !618, line: 91, baseType: !644, size: 128, align: 64, offset: 576)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !645, line: 120, size: 128, align: 64, elements: !646)
!645 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!646 = !{!647, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !644, file: !645, line: 122, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !622, line: 139, baseType: !638)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !644, file: !645, line: 123, baseType: !650, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !622, line: 175, baseType: !638)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !617, file: !618, line: 92, baseType: !644, size: 128, align: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !617, file: !618, line: 93, baseType: !644, size: 128, align: 64, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !617, file: !618, line: 106, baseType: !654, size: 192, align: 64, offset: 960)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, align: 64, elements: !168)
!655 = !DILocation(line: 444, column: 15, scope: !38)
!656 = !DILocalVariable(name: "fs2", scope: !38, file: !21, line: 444, type: !617)
!657 = !DILocation(line: 444, column: 20, scope: !38)
!658 = !DILocation(line: 445, column: 16, scope: !38)
!659 = !DILocation(line: 445, column: 11, scope: !38)
!660 = !DILocation(line: 445, column: 29, scope: !38)
!661 = !DILocation(line: 445, column: 34, scope: !38)
!662 = !DILocation(line: 445, column: 42, scope: !663)
!663 = !DILexicalBlockFile(scope: !38, file: !21, discriminator: 1)
!664 = !DILocation(line: 445, column: 37, scope: !663)
!665 = !DILocation(line: 445, column: 55, scope: !663)
!666 = !DILocation(line: 445, column: 60, scope: !663)
!667 = !DILocation(line: 446, column: 23, scope: !38)
!668 = !DILocation(line: 446, column: 18, scope: !38)
!669 = !DILocation(line: 446, column: 36, scope: !38)
!670 = !DILocation(line: 446, column: 31, scope: !38)
!671 = !DILocation(line: 446, column: 11, scope: !38)
!672 = !DILocation(line: 446, column: 64, scope: !38)
!673 = !DILocation(line: 446, column: 69, scope: !38)
!674 = !DILocation(line: 447, column: 23, scope: !38)
!675 = !DILocation(line: 447, column: 18, scope: !38)
!676 = !DILocation(line: 447, column: 36, scope: !38)
!677 = !DILocation(line: 447, column: 31, scope: !38)
!678 = !DILocation(line: 447, column: 11, scope: !38)
!679 = !DILocation(line: 447, column: 64, scope: !38)
!680 = !DILocation(line: 447, column: 69, scope: !38)
!681 = !DILocation(line: 448, column: 15, scope: !38)
!682 = !DILocation(line: 448, column: 30, scope: !38)
!683 = !DILocation(line: 448, column: 23, scope: !38)
!684 = !DILocation(line: 447, column: 69, scope: !663)
!685 = !DILocation(line: 445, column: 3, scope: !686)
!686 = !DILexicalBlockFile(scope: !38, file: !21, discriminator: 2)
!687 = !DILocalVariable(name: "self_path", arg: 1, scope: !41, file: !21, line: 635, type: !5)
!688 = !DILocation(line: 635, column: 54, scope: !41)
!689 = !DILocalVariable(name: "in_path", arg: 2, scope: !41, file: !21, line: 636, type: !5)
!690 = !DILocation(line: 636, column: 54, scope: !41)
!691 = !DILocalVariable(name: "result", arg: 3, scope: !41, file: !21, line: 636, type: !14)
!692 = !DILocation(line: 636, column: 69, scope: !41)
!693 = !DILocalVariable(name: "desc", arg: 4, scope: !41, file: !21, line: 637, type: !5)
!694 = !DILocation(line: 637, column: 54, scope: !41)
!695 = !DILocation(line: 640, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !41, file: !21, line: 640, column: 7)
!697 = !DILocation(line: 640, column: 18, scope: !696)
!698 = !DILocation(line: 640, column: 7, scope: !41)
!699 = !DILocation(line: 642, column: 12, scope: !700)
!700 = distinct !DILexicalBlock(scope: !696, file: !21, line: 640, column: 26)
!701 = !DILocation(line: 642, column: 20, scope: !700)
!702 = !DILocation(line: 642, column: 5, scope: !700)
!703 = !DILocation(line: 643, column: 3, scope: !700)
!704 = !DILocalVariable(name: "temp_path", scope: !705, file: !21, line: 652, type: !85)
!705 = distinct !DILexicalBlock(scope: !696, file: !21, line: 650, column: 8)
!706 = !DILocation(line: 652, column: 10, scope: !705)
!707 = !DILocation(line: 653, column: 12, scope: !705)
!708 = !DILocation(line: 653, column: 23, scope: !705)
!709 = !DILocation(line: 653, column: 5, scope: !705)
!710 = !DILocation(line: 654, column: 12, scope: !705)
!711 = !DILocation(line: 654, column: 5, scope: !705)
!712 = !DILocation(line: 655, column: 12, scope: !705)
!713 = !DILocation(line: 655, column: 23, scope: !705)
!714 = !DILocation(line: 655, column: 5, scope: !705)
!715 = !DILocation(line: 656, column: 40, scope: !716)
!716 = distinct !DILexicalBlock(scope: !705, file: !21, line: 656, column: 9)
!717 = !DILocation(line: 656, column: 51, scope: !716)
