; ModuleID = '/data/download/cmake/cmake-master/Source/kwsys/testProcess.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.cmsysProcess_s = type opaque
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [33 x i8] c"kwsysProcess_New returned NULL!\0A\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"run\00", align 1
@.str.2 = private unnamed_addr constant [25 x i8] c"Invalid test number %d.\0A\00", align 1
@main.states = private unnamed_addr constant [10 x i32] [i32 4, i32 4, i32 5, i32 2, i32 4, i32 5, i32 4, i32 4, i32 5, i32 2], align 16
@main.outputs = private unnamed_addr constant [10 x i32] [i32 1, i32 1, i32 1, i32 1, i32 1, i32 0, i32 1, i32 1, i32 1, i32 1], align 16

!981 = !DILocation(line: 271, column: 11, scope: !79)
!982 = !DILocation(line: 271, column: 3, scope: !79)
!983 = !DILocation(line: 272, column: 10, scope: !79)
!984 = !DILocation(line: 272, column: 3, scope: !79)
!985 = !DILocation(line: 273, column: 10, scope: !79)
!986 = !DILocation(line: 273, column: 3, scope: !79)
!987 = !DILocation(line: 274, column: 10, scope: !79)
!988 = !DILocation(line: 274, column: 3, scope: !79)
!989 = !DILocalVariable(name: "argc", arg: 1, scope: !80, file: !1, line: 319, type: !37)
!990 = !DILocation(line: 319, column: 23, scope: !80)
!991 = !DILocalVariable(name: "argv", arg: 2, scope: !80, file: !1, line: 319, type: !50)
!992 = !DILocation(line: 319, column: 41, scope: !80)
!993 = !DILocalVariable(name: "r", scope: !80, file: !1, line: 326, type: !37)
!994 = !DILocation(line: 326, column: 7, scope: !80)
!995 = !DILocalVariable(name: "cmd", scope: !80, file: !1, line: 327, type: !591)
!996 = !DILocation(line: 327, column: 15, scope: !80)
!997 = !DILocation(line: 328, column: 9, scope: !80)
!998 = !DILocation(line: 329, column: 12, scope: !80)
!999 = !DILocation(line: 329, column: 3, scope: !80)
!1000 = !DILocation(line: 329, column: 10, scope: !80)
!1001 = !DILocation(line: 330, column: 3, scope: !80)
!1002 = !DILocation(line: 330, column: 10, scope: !80)
!1003 = !DILocation(line: 331, column: 3, scope: !80)
!1004 = !DILocation(line: 331, column: 10, scope: !80)
!1005 = !DILocation(line: 332, column: 3, scope: !80)
!1006 = !DILocation(line: 332, column: 10, scope: !80)
!1007 = !DILocation(line: 333, column: 11, scope: !80)
!1008 = !DILocation(line: 333, column: 3, scope: !80)
!1009 = !DILocation(line: 334, column: 11, scope: !80)
!1010 = !DILocation(line: 334, column: 3, scope: !80)
!1011 = !DILocation(line: 335, column: 10, scope: !80)
!1012 = !DILocation(line: 335, column: 3, scope: !80)
!1013 = !DILocation(line: 336, column: 10, scope: !80)
!1014 = !DILocation(line: 336, column: 3, scope: !80)
!1015 = !DILocation(line: 338, column: 14, scope: !80)
!1016 = !DILocation(line: 338, column: 5, scope: !80)
!1017 = !DILocation(line: 337, column: 5, scope: !80)
!1018 = !DILocation(line: 340, column: 11, scope: !80)
!1019 = !DILocation(line: 340, column: 3, scope: !80)
!1020 = !DILocation(line: 341, column: 11, scope: !80)
!1021 = !DILocation(line: 341, column: 3, scope: !80)
!1022 = !DILocation(line: 342, column: 10, scope: !80)
!1023 = !DILocation(line: 342, column: 3, scope: !80)
!1024 = !DILocation(line: 343, column: 10, scope: !80)
!1025 = !DILocation(line: 343, column: 3, scope: !80)
!1026 = !DILocation(line: 344, column: 10, scope: !80)
!1027 = !DILocation(line: 344, column: 3, scope: !80)
!1028 = !DILocalVariable(name: "argc", arg: 1, scope: !81, file: !1, line: 226, type: !37)
!1029 = !DILocation(line: 226, column: 33, scope: !81)
!1030 = !DILocalVariable(name: "argv", arg: 2, scope: !81, file: !1, line: 226, type: !50)
!1031 = !DILocation(line: 226, column: 51, scope: !81)
!1032 = !DILocation(line: 228, column: 9, scope: !81)
!1033 = !DILocation(line: 229, column: 9, scope: !81)
!1034 = !DILocation(line: 230, column: 11, scope: !81)
!1035 = !DILocation(line: 230, column: 3, scope: !81)
!1036 = !DILocation(line: 231, column: 11, scope: !81)
!1037 = !DILocation(line: 231, column: 3, scope: !81)
!1038 = !DILocation(line: 232, column: 10, scope: !81)
!1039 = !DILocation(line: 232, column: 3, scope: !81)
!1040 = !DILocation(line: 233, column: 10, scope: !81)
!1041 = !DILocation(line: 233, column: 3, scope: !81)
!1042 = !DILocation(line: 238, column: 10, scope: !81)
!1043 = !DILocation(line: 238, column: 3, scope: !81)
!1044 = !DILocation(line: 239, column: 10, scope: !81)
!1045 = !DILocation(line: 239, column: 3, scope: !81)
!1046 = !DILocation(line: 240, column: 3, scope: !81)
!1047 = !DILocation(line: 241, column: 3, scope: !81)
!1048 = !DILocalVariable(name: "argc", arg: 1, scope: !82, file: !1, line: 288, type: !37)
!1049 = !DILocation(line: 288, column: 33, scope: !82)
!1050 = !DILocalVariable(name: "argv", arg: 2, scope: !82, file: !1, line: 288, type: !50)
!1051 = !DILocation(line: 288, column: 51, scope: !82)
!1052 = !DILocation(line: 291, column: 9, scope: !82)
!1053 = !DILocation(line: 292, column: 9, scope: !82)
!1054 = !DILocalVariable(name: "sa", scope: !82, file: !1, line: 298, type: !1055)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1056, line: 24, size: 1216, align: 64, elements: !1057)
!1056 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!1057 = !{!1058, !1134, !1143, !1144}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1055, file: !1056, line: 35, baseType: !1059, size: 64, align: 64)
!1059 = !DICompositeType(tag: DW_TAG_union_type, scope: !1055, file: !1056, line: 28, size: 64, align: 64, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1059, file: !1056, line: 31, baseType: !41, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1059, file: !1056, line: 33, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !37, !1066, !1100}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1068, line: 128, baseType: !1069)
!1068 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!1069 = !DICompositeType(tag: DW_TAG_structure_type, file: !1068, line: 62, size: 1024, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1069, file: !1068, line: 64, baseType: !37, size: 32, align: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1069, file: !1068, line: 65, baseType: !37, size: 32, align: 32, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1069, file: !1068, line: 67, baseType: !37, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1069, file: !1068, line: 127, baseType: !1075, size: 896, align: 64, offset: 128)
!1075 = !DICompositeType(tag: DW_TAG_union_type, scope: !1069, file: !1068, line: 69, size: 896, align: 64, elements: !1076)
!1076 = !{!1077, !1081, !1089, !1101, !1107, !1117, !1123, !1128}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1075, file: !1068, line: 71, baseType: !1078, size: 896, align: 32)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 896, align: 32, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 28)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1075, file: !1068, line: 78, baseType: !1082, size: 64, align: 32)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 74, size: 64, align: 32, elements: !1083)
!1083 = !{!1084, !1087}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1082, file: !1068, line: 76, baseType: !1085, size: 32, align: 32)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !1086, line: 133, baseType: !37)
!1086 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1082, file: !1068, line: 77, baseType: !1088, size: 32, align: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !1086, line: 125, baseType: !55)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1075, file: !1068, line: 86, baseType: !1090, size: 128, align: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 81, size: 128, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1090, file: !1068, line: 83, baseType: !37, size: 32, align: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1090, file: !1068, line: 84, baseType: !37, size: 32, align: 32, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1090, file: !1068, line: 85, baseType: !1095, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1068, line: 36, baseType: !1096)
!1096 = !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1068, line: 32, size: 64, align: 64, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1096, file: !1068, line: 34, baseType: !37, size: 32, align: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1096, file: !1068, line: 35, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1075, file: !1068, line: 94, baseType: !1102, size: 128, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 89, size: 128, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1102, file: !1068, line: 91, baseType: !1085, size: 32, align: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1102, file: !1068, line: 92, baseType: !1088, size: 32, align: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1102, file: !1068, line: 93, baseType: !1095, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1075, file: !1068, line: 104, baseType: !1108, size: 256, align: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 97, size: 256, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1116}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1108, file: !1068, line: 99, baseType: !1085, size: 32, align: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1108, file: !1068, line: 100, baseType: !1088, size: 32, align: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1108, file: !1068, line: 101, baseType: !37, size: 32, align: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1108, file: !1068, line: 102, baseType: !1114, size: 64, align: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !1068, line: 58, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !1086, line: 135, baseType: !603)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1108, file: !1068, line: 103, baseType: !1114, size: 64, align: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !1075, file: !1068, line: 111, baseType: !1118, size: 128, align: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 107, size: 128, align: 64, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !1118, file: !1068, line: 109, baseType: !1100, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !1118, file: !1068, line: 110, baseType: !1122, size: 16, align: 16, offset: 64)
!1122 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !1075, file: !1068, line: 118, baseType: !1124, size: 128, align: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 114, size: 128, align: 64, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !1124, file: !1068, line: 116, baseType: !603, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !1124, file: !1068, line: 117, baseType: !37, size: 32, align: 32, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !1075, file: !1068, line: 126, baseType: !1129, size: 128, align: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1075, file: !1068, line: 121, size: 128, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1129, file: !1068, line: 123, baseType: !1100, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1129, file: !1068, line: 124, baseType: !37, size: 32, align: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1129, file: !1068, line: 125, baseType: !55, size: 32, align: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !1055, file: !1056, line: 43, baseType: !1135, size: 1024, align: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !1136, line: 30, baseType: !1137)
!1136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/data/download/cmake/cmake-master/Source/kwsys")
!1137 = !DICompositeType(tag: DW_TAG_structure_type, file: !1136, line: 27, size: 1024, align: 64, elements: !1138)
!1138 = !{!1139}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !1137, file: !1136, line: 29, baseType: !1140, size: 1024, align: 64)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, align: 64, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 16)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !1055, file: !1056, line: 46, baseType: !37, size: 32, align: 32, offset: 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !1055, file: !1056, line: 49, baseType: !1145, size: 64, align: 64, offset: 1152)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null}
!1148 = !DILocation(line: 298, column: 20, scope: !82)
!1149 = !DILocation(line: 299, column: 3, scope: !82)
!1150 = !DILocation(line: 300, column: 6, scope: !82)
!1151 = !DILocation(line: 300, column: 17, scope: !82)
!1152 = !DILocation(line: 301, column: 19, scope: !82)
!1153 = !DILocation(line: 301, column: 3, scope: !82)
!1154 = !DILocation(line: 302, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !82, file: !1, line: 302, column: 7)
!1156 = !DILocation(line: 302, column: 33, scope: !1155)
!1157 = !DILocation(line: 302, column: 7, scope: !82)
!1158 = !DILocation(line: 303, column: 5, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 302, column: 38)
!1160 = !DILocation(line: 306, column: 11, scope: !82)
!1161 = !DILocation(line: 306, column: 3, scope: !82)
!1162 = !DILocation(line: 307, column: 11, scope: !82)
!1163 = !DILocation(line: 307, column: 3, scope: !82)
!1164 = !DILocation(line: 308, column: 10, scope: !82)
!1165 = !DILocation(line: 308, column: 3, scope: !82)
!1166 = !DILocation(line: 309, column: 10, scope: !82)
!1167 = !DILocation(line: 309, column: 3, scope: !82)
!1168 = !DILocation(line: 311, column: 3, scope: !82)
!1169 = !DILocation(line: 312, column: 11, scope: !82)
!1170 = !DILocation(line: 312, column: 3, scope: !82)
!1171 = !DILocation(line: 313, column: 11, scope: !82)
!1172 = !DILocation(line: 313, column: 3, scope: !82)
!1173 = !DILocation(line: 314, column: 10, scope: !82)
!1174 = !DILocation(line: 314, column: 3, scope: !82)
!1175 = !DILocation(line: 315, column: 10, scope: !82)
!1176 = !DILocation(line: 315, column: 3, scope: !82)
!1177 = !DILocation(line: 316, column: 3, scope: !82)
!1178 = !DILocation(line: 317, column: 1, scope: !82)
!1179 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !1, line: 347, type: !37)
!1180 = !DILocation(line: 347, column: 34, scope: !83)
!1181 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !1, line: 347, type: !50)
!1182 = !DILocation(line: 347, column: 52, scope: !83)
!1183 = !DILocation(line: 350, column: 9, scope: !83)
!1184 = !DILocation(line: 351, column: 9, scope: !83)
!1185 = !DILocation(line: 352, column: 11, scope: !83)
!1186 = !DILocation(line: 352, column: 3, scope: !83)
!1187 = !DILocation(line: 353, column: 11, scope: !83)
!1188 = !DILocation(line: 353, column: 3, scope: !83)
!1189 = !DILocation(line: 354, column: 10, scope: !83)
!1190 = !DILocation(line: 354, column: 3, scope: !83)
!1191 = !DILocation(line: 355, column: 10, scope: !83)
!1192 = !DILocation(line: 355, column: 3, scope: !83)
!1193 = !DILocation(line: 357, column: 3, scope: !83)
!1194 = !DILocation(line: 358, column: 11, scope: !83)
!1195 = !DILocation(line: 358, column: 3, scope: !83)
!1196 = !DILocation(line: 359, column: 11, scope: !83)
!1197 = !DILocation(line: 359, column: 3, scope: !83)
!1198 = !DILocation(line: 360, column: 10, scope: !83)
!1199 = !DILocation(line: 360, column: 3, scope: !83)
!1200 = !DILocation(line: 361, column: 10, scope: !83)
!1201 = !DILocation(line: 361, column: 3, scope: !83)
!1202 = !DILocation(line: 362, column: 3, scope: !83)
!1203 = !DILocalVariable(name: "sec", arg: 1, scope: !66, file: !1, line: 56, type: !55)
!1204 = !DILocation(line: 56, column: 44, scope: !66)
!1205 = !DILocation(line: 58, column: 9, scope: !66)
!1206 = !DILocation(line: 58, column: 3, scope: !66)
!1207 = !DILocation(line: 59, column: 1, scope: !66)
