; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibrhash/librhash/rhash.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rhash_hash_info = type { %struct.rhash_info*, i64, i64, void (i8*)*, void (i8*, i8*, i64)*, void (i8*, i8*)*, void (i8*)* }
%struct.rhash_info = type { i32, i32, i64, i8*, i8* }
%struct.rhash_context = type { i64, i32 }
%struct.rhash_context_ext = type { %struct.rhash_context, i32, i32, i32, i8*, i8*, i8*, [1 x %struct.rhash_vector_item] }
%struct.rhash_vector_item = type { %struct.rhash_hash_info*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@rhash_info_size = external global i32, align 4
@.str = private unnamed_addr constant [34 x i8] c"tail_bit_index < RHASH_HASH_COUNT\00", align 1
@.str.1 = private unnamed_addr constant [72 x i8] c"/data/download/cmake/cmake-master/Utilities/cmlibrhash/librhash/rhash.c\00", align 1
@__PRETTY_FUNCTION__.rhash_init = private unnamed_addr constant [31 x i8] c"rhash rhash_init(unsigned int)\00", align 1
@rhash_info_table = external global %struct.rhash_hash_info*, align 8
@.str.2 = private unnamed_addr constant [8 x i8] c"id != 0\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !97)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibrhash/librhash/rhash.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rhash_ids", file: !4, line: 21, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibrhash/librhash/rhash.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "RHASH_MD5", value: 1)
!7 = !DIEnumerator(name: "RHASH_SHA1", value: 2)
!8 = !DIEnumerator(name: "RHASH_SHA224", value: 4)
!9 = !DIEnumerator(name: "RHASH_SHA256", value: 8)
!10 = !DIEnumerator(name: "RHASH_SHA384", value: 16)
!11 = !DIEnumerator(name: "RHASH_SHA512", value: 32)
!12 = !DIEnumerator(name: "RHASH_SHA3_224", value: 64)
!13 = !DIEnumerator(name: "RHASH_SHA3_256", value: 128)
!14 = !DIEnumerator(name: "RHASH_SHA3_384", value: 256)
!15 = !DIEnumerator(name: "RHASH_SHA3_512", value: 512)
!16 = !DIEnumerator(name: "RHASH_ALL_HASHES", value: 1023)
!17 = !DIEnumerator(name: "RHASH_HASH_COUNT", value: 10)
!18 = !{!19, !35, !91, !84, !92, !96}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "rhash_context_ext", file: !21, line: 58, baseType: !22)
!21 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibrhash/librhash/algorithms.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "rhash_context_ext", file: !21, line: 49, size: 576, align: 64, elements: !23)
!23 = !{!24, !31, !32, !33, !34, !36, !37, !38}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !22, file: !21, line: 51, baseType: !25, size: 128, align: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "rhash_context", file: !4, line: 91, size: 128, align: 64, elements: !26)
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !25, file: !4, line: 94, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "hash_id", scope: !25, file: !4, line: 99, baseType: !30, size: 32, align: 32, offset: 64)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hash_vector_size", scope: !22, file: !21, line: 52, baseType: !30, size: 32, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !22, file: !21, line: 53, baseType: !30, size: 32, align: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !21, line: 54, baseType: !30, size: 32, align: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !22, file: !21, line: 55, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !22, file: !21, line: 55, baseType: !35, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "bt_ctx", scope: !22, file: !21, line: 56, baseType: !35, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !22, file: !21, line: 57, baseType: !39, size: 128, align: 64, offset: 448)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, align: 64, elements: !89)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "rhash_vector_item", file: !21, line: 44, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "rhash_vector_item", file: !21, line: 40, size: 128, align: 64, elements: !42)
!42 = !{!43, !88}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "hash_info", scope: !41, file: !21, line: 42, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "rhash_hash_info", file: !21, line: 26, size: 448, align: 64, elements: !46)
!46 = !{!47, !63, !64, !67, !72, !79, !86}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !45, file: !21, line: 28, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "rhash_info", file: !4, line: 151, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "rhash_info", file: !4, line: 141, size: 256, align: 64, elements: !51)
!51 = !{!52, !53, !54, !58, !62}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hash_id", scope: !50, file: !4, line: 144, baseType: !30, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !4, line: 146, baseType: !30, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "digest_size", scope: !50, file: !4, line: 148, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 62, baseType: !57)
!56 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!57 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !4, line: 149, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "magnet_name", scope: !50, file: !4, line: 150, baseType: !59, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !45, file: !21, line: 29, baseType: !55, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "digest_diff", scope: !45, file: !21, line: 30, baseType: !65, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 51, baseType: !66)
!66 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !45, file: !21, line: 31, baseType: !68, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinit_t", file: !21, line: 18, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !35}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !45, file: !21, line: 32, baseType: !73, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "pupdate_t", file: !21, line: 19, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !35, !77, !55}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !45, file: !21, line: 33, baseType: !80, size: 64, align: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "pfinal_t", file: !21, line: 20, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !35, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !45, file: !21, line: 34, baseType: !87, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcleanup_t", file: !21, line: 21, baseType: !69)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !41, file: !21, line: 43, baseType: !35, size: 64, align: 64, offset: 64)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "rhash_callback_t", file: !4, line: 111, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !35, !28}
!96 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!97 = !{!98, !102, !105, !110, !113, !114, !117, !120, !123, !126, !182, !185, !190, !193, !194, !197}
!98 = distinct !DISubprogram(name: "rhash_library_init", scope: !1, file: !1, line: 51, type: !99, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{null}
!101 = !{}
!102 = distinct !DISubprogram(name: "rhash_count", scope: !1, file: !1, line: 64, type: !103, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!103 = !DISubroutineType(types: !104)
!104 = !{!96}
!105 = distinct !DISubprogram(name: "rhash_init", scope: !1, file: !1, line: 79, type: !106, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !30}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "rhash", file: !4, line: 107, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!110 = distinct !DISubprogram(name: "rhash_free", scope: !1, file: !1, line: 176, type: !111, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !108}
!113 = distinct !DISubprogram(name: "rhash_reset", scope: !1, file: !1, line: 202, type: !111, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!114 = distinct !DISubprogram(name: "rhash_update", scope: !1, file: !1, line: 233, type: !115, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!115 = !DISubroutineType(types: !116)
!116 = !{!96, !108, !77, !55}
!117 = distinct !DISubprogram(name: "rhash_final", scope: !1, file: !1, line: 259, type: !118, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!118 = !DISubroutineType(types: !119)
!119 = !{!96, !108, !84}
!120 = distinct !DISubprogram(name: "rhash_set_callback", scope: !1, file: !1, line: 343, type: !121, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !108, !92, !35}
!123 = distinct !DISubprogram(name: "rhash_msg", scope: !1, file: !1, line: 361, type: !124, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!124 = !DISubroutineType(types: !125)
!125 = !{!96, !30, !77, !55, !84}
!126 = distinct !DISubprogram(name: "rhash_file_update", scope: !1, file: !1, line: 384, type: !127, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!127 = !DISubroutineType(types: !128)
!128 = !{!96, !108, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !131, line: 48, baseType: !132)
!131 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !133, line: 245, size: 1728, align: 64, elements: !134)
!133 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !155, !156, !157, !158, !161, !163, !165, !167, !170, !172, !173, !174, !175, !176, !177, !178}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !132, file: !133, line: 246, baseType: !96, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !132, file: !133, line: 251, baseType: !91, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !132, file: !133, line: 252, baseType: !91, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !132, file: !133, line: 253, baseType: !91, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !132, file: !133, line: 254, baseType: !91, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !132, file: !133, line: 255, baseType: !91, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !132, file: !133, line: 256, baseType: !91, size: 64, align: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !132, file: !133, line: 257, baseType: !91, size: 64, align: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !132, file: !133, line: 258, baseType: !91, size: 64, align: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !132, file: !133, line: 260, baseType: !91, size: 64, align: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !132, file: !133, line: 261, baseType: !91, size: 64, align: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !132, file: !133, line: 262, baseType: !91, size: 64, align: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !132, file: !133, line: 264, baseType: !148, size: 64, align: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !133, line: 160, size: 192, align: 64, elements: !150)
!150 = !{!151, !152, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !149, file: !133, line: 161, baseType: !148, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !149, file: !133, line: 162, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !149, file: !133, line: 166, baseType: !96, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !132, file: !133, line: 266, baseType: !153, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !132, file: !133, line: 268, baseType: !96, size: 32, align: 32, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !132, file: !133, line: 272, baseType: !96, size: 32, align: 32, offset: 928)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !132, file: !133, line: 274, baseType: !159, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !160, line: 131, baseType: !66)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibrhash")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !132, file: !133, line: 278, baseType: !162, size: 16, align: 16, offset: 1024)
!162 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !132, file: !133, line: 279, baseType: !164, size: 8, align: 8, offset: 1040)
!164 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !132, file: !133, line: 280, baseType: !166, size: 8, align: 8, offset: 1048)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, align: 8, elements: !89)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !132, file: !133, line: 284, baseType: !168, size: 64, align: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !133, line: 154, baseType: null)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !132, file: !133, line: 293, baseType: !171, size: 64, align: 64, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !160, line: 132, baseType: !66)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !132, file: !133, line: 302, baseType: !35, size: 64, align: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !132, file: !133, line: 303, baseType: !35, size: 64, align: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !132, file: !133, line: 304, baseType: !35, size: 64, align: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !132, file: !133, line: 305, baseType: !35, size: 64, align: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !132, file: !133, line: 306, baseType: !55, size: 64, align: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !132, file: !133, line: 308, baseType: !96, size: 32, align: 32, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !132, file: !133, line: 310, baseType: !179, size: 160, align: 8, offset: 1568)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 20)
!182 = distinct !DISubprogram(name: "rhash_file", scope: !1, file: !1, line: 434, type: !183, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!183 = !DISubroutineType(types: !184)
!184 = !{!96, !30, !59, !84}
!185 = distinct !DISubprogram(name: "rhash_info_by_id", scope: !1, file: !1, line: 502, type: !186, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !30}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!190 = distinct !DISubprogram(name: "rhash_get_digest_size", scope: !1, file: !1, line: 531, type: !191, isLocal: false, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!191 = !DISubroutineType(types: !192)
!192 = !{!96, !30}
!193 = distinct !DISubprogram(name: "rhash_get_hash_length", scope: !1, file: !1, line: 544, type: !191, isLocal: false, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!194 = distinct !DISubprogram(name: "rhash_get_name", scope: !1, file: !1, line: 557, type: !195, isLocal: false, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!195 = !DISubroutineType(types: !196)
!196 = !{!59, !30}
!197 = distinct !DISubprogram(name: "rhash_get_magnet_name", scope: !1, file: !1, line: 571, type: !195, isLocal: false, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: false, variables: !101)
!198 = !{i32 2, !"Dwarf Version", i32 4}
!199 = !{i32 2, !"Debug Info Version", i32 3}
!200 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!201 = !DILocation(line: 53, column: 2, scope: !98)
!202 = !DILocation(line: 57, column: 1, scope: !98)
!203 = !DILocation(line: 66, column: 9, scope: !102)
!204 = !DILocation(line: 66, column: 2, scope: !102)
!205 = !DILocalVariable(name: "hash_id", arg: 1, scope: !105, file: !1, line: 79, type: !30)
!206 = !DIExpression()
!207 = !DILocation(line: 79, column: 37, scope: !105)
!208 = !DILocalVariable(name: "tail_bit_index", scope: !105, file: !1, line: 81, type: !30)
!209 = !DILocation(line: 81, column: 11, scope: !105)
!210 = !DILocalVariable(name: "num", scope: !105, file: !1, line: 82, type: !30)
!211 = !DILocation(line: 82, column: 11, scope: !105)
!212 = !DILocalVariable(name: "rctx", scope: !105, file: !1, line: 83, type: !19)
!213 = !DILocation(line: 83, column: 21, scope: !105)
!214 = !DILocalVariable(name: "hash_size_sum", scope: !105, file: !1, line: 84, type: !55)
!215 = !DILocation(line: 84, column: 9, scope: !105)
!216 = !DILocalVariable(name: "i", scope: !105, file: !1, line: 86, type: !30)
!217 = !DILocation(line: 86, column: 11, scope: !105)
!218 = !DILocalVariable(name: "bit_index", scope: !105, file: !1, line: 86, type: !30)
!219 = !DILocation(line: 86, column: 14, scope: !105)
!220 = !DILocalVariable(name: "id", scope: !105, file: !1, line: 86, type: !30)
!221 = !DILocation(line: 86, column: 25, scope: !105)
!222 = !DILocalVariable(name: "info", scope: !105, file: !1, line: 87, type: !44)
!223 = !DILocation(line: 87, column: 26, scope: !105)
!224 = !DILocalVariable(name: "aligned_size", scope: !105, file: !1, line: 88, type: !55)
!225 = !DILocation(line: 88, column: 9, scope: !105)
!226 = !DILocalVariable(name: "phash_ctx", scope: !105, file: !1, line: 89, type: !91)
!227 = !DILocation(line: 89, column: 8, scope: !105)
!228 = !DILocation(line: 91, column: 10, scope: !105)
!229 = !DILocation(line: 92, column: 6, scope: !230)
