; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/fs-poll.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_stat_t = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, %struct.uv_timespec_t, %struct.uv_timespec_t, %struct.uv_timespec_t, %struct.uv_timespec_t }
%struct.uv_timespec_t = type { i64, i64 }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }

!66 = !DIEnumerator(name: "UV_FS_UNLINK", value: 17)
!67 = !DIEnumerator(name: "UV_FS_RMDIR", value: 18)
!68 = !DIEnumerator(name: "UV_FS_MKDIR", value: 19)
!69 = !DIEnumerator(name: "UV_FS_MKDTEMP", value: 20)
!70 = !DIEnumerator(name: "UV_FS_RENAME", value: 21)
!71 = !DIEnumerator(name: "UV_FS_SCANDIR", value: 22)
!72 = !DIEnumerator(name: "UV_FS_LINK", value: 23)
!73 = !DIEnumerator(name: "UV_FS_SYMLINK", value: 24)
!74 = !DIEnumerator(name: "UV_FS_READLINK", value: 25)
!75 = !DIEnumerator(name: "UV_FS_CHOWN", value: 26)
!76 = !DIEnumerator(name: "UV_FS_FCHOWN", value: 27)
!77 = !DIEnumerator(name: "UV_FS_REALPATH", value: 28)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 177, size: 32, align: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!80 = !DIEnumerator(name: "UV_E2BIG", value: -7)
!81 = !DIEnumerator(name: "UV_EACCES", value: -13)
!82 = !DIEnumerator(name: "UV_EADDRINUSE", value: -98)
!83 = !DIEnumerator(name: "UV_EADDRNOTAVAIL", value: -99)
!84 = !DIEnumerator(name: "UV_EAFNOSUPPORT", value: -97)
!85 = !DIEnumerator(name: "UV_EAGAIN", value: -11)
!86 = !DIEnumerator(name: "UV_EAI_ADDRFAMILY", value: -3000)
!87 = !DIEnumerator(name: "UV_EAI_AGAIN", value: -3001)
!88 = !DIEnumerator(name: "UV_EAI_BADFLAGS", value: -3002)
!89 = !DIEnumerator(name: "UV_EAI_BADHINTS", value: -3013)
!90 = !DIEnumerator(name: "UV_EAI_CANCELED", value: -3003)
!91 = !DIEnumerator(name: "UV_EAI_FAIL", value: -3004)
!92 = !DIEnumerator(name: "UV_EAI_FAMILY", value: -3005)
!93 = !DIEnumerator(name: "UV_EAI_MEMORY", value: -3006)
!94 = !DIEnumerator(name: "UV_EAI_NODATA", value: -3007)
!95 = !DIEnumerator(name: "UV_EAI_NONAME", value: -3008)
!96 = !DIEnumerator(name: "UV_EAI_OVERFLOW", value: -3009)
!97 = !DIEnumerator(name: "UV_EAI_PROTOCOL", value: -3014)
!98 = !DIEnumerator(name: "UV_EAI_SERVICE", value: -3010)
!99 = !DIEnumerator(name: "UV_EAI_SOCKTYPE", value: -3011)
!100 = !DIEnumerator(name: "UV_EALREADY", value: -114)
!101 = !DIEnumerator(name: "UV_EBADF", value: -9)
!102 = !DIEnumerator(name: "UV_EBUSY", value: -16)
!103 = !DIEnumerator(name: "UV_ECANCELED", value: -125)
!104 = !DIEnumerator(name: "UV_ECHARSET", value: -4080)
!105 = !DIEnumerator(name: "UV_ECONNABORTED", value: -103)
!106 = !DIEnumerator(name: "UV_ECONNREFUSED", value: -111)
!107 = !DIEnumerator(name: "UV_ECONNRESET", value: -104)
!108 = !DIEnumerator(name: "UV_EDESTADDRREQ", value: -89)
!109 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!110 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!111 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!112 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!113 = !DIEnumerator(name: "UV_EINTR", value: -4)
!114 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!115 = !DIEnumerator(name: "UV_EIO", value: -5)
!116 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!117 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!118 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!119 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!120 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!121 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!122 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!123 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!124 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!125 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!126 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!127 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!128 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!129 = !DIEnumerator(name: "UV_ENONET", value: -64)
!130 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!131 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!132 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!133 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!134 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!135 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!136 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!137 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!138 = !DIEnumerator(name: "UV_EPERM", value: -1)
!139 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!140 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!141 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!142 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!143 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!144 = !DIEnumerator(name: "UV_EROFS", value: -30)
!145 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!146 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!147 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!148 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!149 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!150 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!151 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!152 = !DIEnumerator(name: "UV_EOF", value: -4095)
!153 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!154 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!155 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!156 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!157 = !{!158, !364, !163, !368, !496}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !161)
!161 = !{!162, !164, !354, !355, !356, !357, !362, !363}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !4, line: 426, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !160, file: !4, line: 426, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !168)
!168 = !{!169, !170, !172, !176, !177, !178, !180, !182, !183, !184, !203, !204, !205, !206, !237, !269, !293, !294, !295, !296, !297, !298, !299, !303, !304, !305, !310, !313, !314, !316, !317, !350, !351, !352, !353}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !4, line: 1475, baseType: !163, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !167, file: !4, line: 1477, baseType: !171, size: 32, align: 32, offset: 64)
!171 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !167, file: !4, line: 1478, baseType: !173, size: 128, align: 64, offset: 128)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, align: 64, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !167, file: !4, line: 1479, baseType: !173, size: 128, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !167, file: !4, line: 1481, baseType: !171, size: 32, align: 32, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !4, line: 1482, baseType: !179, size: 64, align: 64, offset: 448)
!179 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !167, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 512)
!181 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !167, file: !4, line: 1482, baseType: !185, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !188, line: 87, baseType: !189)
!188 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !188, line: 89, size: 448, align: 64, elements: !190)
!190 = !{!191, !198, !199, !200, !201, !202}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !189, file: !188, line: 90, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !188, line: 84, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196, !197, !171}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !189, file: !188, line: 91, baseType: !173, size: 128, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !189, file: !188, line: 92, baseType: !173, size: 128, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !189, file: !188, line: 93, baseType: !171, size: 32, align: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !189, file: !188, line: 94, baseType: !171, size: 32, align: 32, offset: 352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !189, file: !188, line: 95, baseType: !181, size: 32, align: 32, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !167, file: !4, line: 1482, baseType: !171, size: 32, align: 32, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !167, file: !4, line: 1482, baseType: !171, size: 32, align: 32, offset: 928)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !167, file: !4, line: 1482, baseType: !207, size: 320, align: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !188, line: 129, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !209, line: 127, baseType: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!210 = !DICompositeType(tag: DW_TAG_union_type, file: !209, line: 90, size: 320, align: 64, elements: !211)
!211 = !{!212, !230, !235}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !210, file: !209, line: 124, baseType: !213, size: 320, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !209, line: 92, size: 320, align: 64, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !222, !223}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !213, file: !209, line: 94, baseType: !181, size: 32, align: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !213, file: !209, line: 95, baseType: !171, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !213, file: !209, line: 96, baseType: !181, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !213, file: !209, line: 98, baseType: !171, size: 32, align: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !213, file: !209, line: 102, baseType: !181, size: 32, align: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !213, file: !209, line: 104, baseType: !221, size: 16, align: 16, offset: 160)
!221 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !213, file: !209, line: 105, baseType: !221, size: 16, align: 16, offset: 176)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !213, file: !209, line: 106, baseType: !224, size: 128, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !209, line: 79, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !209, line: 75, size: 128, align: 64, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !225, file: !209, line: 77, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !225, file: !209, line: 78, baseType: !228, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !210, file: !209, line: 125, baseType: !231, size: 320, align: 8)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 320, align: 8, elements: !233)
!232 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!233 = !{!234}
!234 = !DISubrange(count: 40)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !210, file: !209, line: 126, baseType: !236, size: 64, align: 64)
!236 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !167, file: !4, line: 1482, baseType: !238, size: 1024, align: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !240)
!240 = !{!241, !242, !243, !245, !250, !251, !259, !260, !261, !267, !268}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !4, line: 768, baseType: !163, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !239, file: !4, line: 768, baseType: !165, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !239, file: !4, line: 768, baseType: !244, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !239, file: !4, line: 768, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !158}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !239, file: !4, line: 768, baseType: !173, size: 128, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !239, file: !4, line: 768, baseType: !252, size: 256, align: 64, offset: 384)
!252 = !DICompositeType(tag: DW_TAG_union_type, scope: !239, file: !4, line: 768, size: 256, align: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !252, file: !4, line: 768, baseType: !181, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !252, file: !4, line: 768, baseType: !256, size: 256, align: 64)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 256, align: 64, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !239, file: !4, line: 768, baseType: !158, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !239, file: !4, line: 768, baseType: !171, size: 32, align: 32, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !239, file: !4, line: 769, baseType: !262, size: 64, align: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !239, file: !4, line: 769, baseType: !173, size: 128, align: 64, offset: 832)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !239, file: !4, line: 769, baseType: !181, size: 32, align: 32, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !167, file: !4, line: 1482, baseType: !270, size: 448, align: 64, offset: 2432)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !188, line: 130, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !209, line: 213, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_union_type, file: !209, line: 173, size: 448, align: 64, elements: !273)
!273 = !{!274, !288, !292}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !272, file: !209, line: 192, baseType: !275, size: 448, align: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, scope: !272, file: !209, line: 176, size: 448, align: 64, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !275, file: !209, line: 178, baseType: !181, size: 32, align: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !275, file: !209, line: 179, baseType: !171, size: 32, align: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !275, file: !209, line: 180, baseType: !171, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !275, file: !209, line: 181, baseType: !171, size: 32, align: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !275, file: !209, line: 182, baseType: !171, size: 32, align: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !275, file: !209, line: 183, baseType: !171, size: 32, align: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !275, file: !209, line: 184, baseType: !181, size: 32, align: 32, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !275, file: !209, line: 185, baseType: !181, size: 32, align: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !275, file: !209, line: 186, baseType: !179, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !275, file: !209, line: 187, baseType: !179, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !275, file: !209, line: 190, baseType: !171, size: 32, align: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !272, file: !209, line: 211, baseType: !289, size: 448, align: 8)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 448, align: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 56)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !272, file: !209, line: 212, baseType: !236, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !167, file: !4, line: 1482, baseType: !158, size: 64, align: 64, offset: 2880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 2944)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 3072)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 3200)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 3328)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !167, file: !4, line: 1482, baseType: !173, size: 128, align: 64, offset: 3456)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !167, file: !4, line: 1482, baseType: !300, size: 64, align: 64, offset: 3584)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !167, file: !4, line: 1482, baseType: !187, size: 448, align: 64, offset: 3648)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !167, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 4096)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !167, file: !4, line: 1482, baseType: !306, size: 128, align: 64, offset: 4160)
!306 = !DICompositeType(tag: DW_TAG_structure_type, scope: !167, file: !4, line: 1482, size: 128, align: 64, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !306, file: !4, line: 1482, baseType: !163, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !306, file: !4, line: 1482, baseType: !171, size: 32, align: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !167, file: !4, line: 1482, baseType: !311, size: 64, align: 64, offset: 4288)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !312, line: 55, baseType: !179)
!312 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !167, file: !4, line: 1482, baseType: !311, size: 64, align: 64, offset: 4352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !167, file: !4, line: 1482, baseType: !315, size: 64, align: 32, offset: 4416)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, align: 32, elements: !174)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !167, file: !4, line: 1482, baseType: !187, size: 448, align: 64, offset: 4480)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !167, file: !4, line: 1482, baseType: !318, size: 1216, align: 64, offset: 4928)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !331, !332, !333, !339, !340, !348, !349}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !319, file: !4, line: 1326, baseType: !163, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !319, file: !4, line: 1326, baseType: !165, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !319, file: !4, line: 1326, baseType: !244, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !319, file: !4, line: 1326, baseType: !246, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !319, file: !4, line: 1326, baseType: !173, size: 128, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !319, file: !4, line: 1326, baseType: !327, size: 256, align: 64, offset: 384)
!327 = !DICompositeType(tag: DW_TAG_union_type, scope: !319, file: !4, line: 1326, size: 256, align: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !327, file: !4, line: 1326, baseType: !181, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !327, file: !4, line: 1326, baseType: !256, size: 256, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !319, file: !4, line: 1326, baseType: !158, size: 64, align: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !4, line: 1326, baseType: !171, size: 32, align: 32, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !319, file: !4, line: 1327, baseType: !334, size: 64, align: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338, !181}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !319, file: !4, line: 1328, baseType: !181, size: 32, align: 32, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !319, file: !4, line: 1329, baseType: !341, size: 256, align: 64, offset: 896)
!341 = !DICompositeType(tag: DW_TAG_structure_type, scope: !319, file: !4, line: 1329, size: 256, align: 64, elements: !342)
!342 = !{!343, !345, !346, !347}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !341, file: !4, line: 1329, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !341, file: !4, line: 1329, baseType: !344, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !341, file: !4, line: 1329, baseType: !344, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !341, file: !4, line: 1329, baseType: !181, size: 32, align: 32, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !319, file: !4, line: 1329, baseType: !171, size: 32, align: 32, offset: 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !319, file: !4, line: 1329, baseType: !171, size: 32, align: 32, offset: 1184)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !167, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 6144)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !167, file: !4, line: 1482, baseType: !187, size: 448, align: 64, offset: 6208)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !167, file: !4, line: 1482, baseType: !163, size: 64, align: 64, offset: 6656)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !167, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 6720)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !4, line: 426, baseType: !244, size: 32, align: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !160, file: !4, line: 426, baseType: !246, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !160, file: !4, line: 426, baseType: !173, size: 128, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !160, file: !4, line: 426, baseType: !358, size: 256, align: 64, offset: 384)
!358 = !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !4, line: 426, size: 256, align: 64, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !358, file: !4, line: 426, baseType: !181, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !358, file: !4, line: 426, baseType: !256, size: 256, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !160, file: !4, line: 426, baseType: !158, size: 64, align: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !160, file: !4, line: 426, baseType: !171, size: 32, align: 32, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !367, line: 21, baseType: !173)
!367 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_ctx", file: !1, line: 29, size: 6400, align: 64, elements: !370)
!370 = !{!371, !389, !390, !391, !392, !393, !424, !453, !531, !532}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "parent_handle", scope: !369, file: !1, line: 30, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_poll_t", file: !4, line: 219, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_poll_s", file: !4, line: 1308, size: 832, align: 64, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !386, !387, !388}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !4, line: 1309, baseType: !163, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !374, file: !4, line: 1309, baseType: !165, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !374, file: !4, line: 1309, baseType: !244, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !374, file: !4, line: 1309, baseType: !246, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !374, file: !4, line: 1309, baseType: !173, size: 128, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !374, file: !4, line: 1309, baseType: !382, size: 256, align: 64, offset: 384)
!382 = !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !4, line: 1309, size: 256, align: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !382, file: !4, line: 1309, baseType: !181, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !382, file: !4, line: 1309, baseType: !256, size: 256, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !374, file: !4, line: 1309, baseType: !158, size: 64, align: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !374, file: !4, line: 1309, baseType: !171, size: 32, align: 32, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "poll_ctx", scope: !374, file: !4, line: 1311, baseType: !163, size: 64, align: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "busy_polling", scope: !369, file: !1, line: 31, baseType: !181, size: 32, align: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !369, file: !1, line: 32, baseType: !171, size: 32, align: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !369, file: !1, line: 33, baseType: !311, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !369, file: !1, line: 34, baseType: !165, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "poll_cb", scope: !369, file: !1, line: 35, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_poll_cb", file: !4, line: 357, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !372, !181, !398, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stat_t", file: !4, line: 349, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 332, size: 1280, align: 64, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !421, !422, !423}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !401, file: !4, line: 333, baseType: !311, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !401, file: !4, line: 334, baseType: !311, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !401, file: !4, line: 335, baseType: !311, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !401, file: !4, line: 336, baseType: !311, size: 64, align: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !401, file: !4, line: 337, baseType: !311, size: 64, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !401, file: !4, line: 338, baseType: !311, size: 64, align: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !401, file: !4, line: 339, baseType: !311, size: 64, align: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !401, file: !4, line: 340, baseType: !311, size: 64, align: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !401, file: !4, line: 341, baseType: !311, size: 64, align: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !401, file: !4, line: 342, baseType: !311, size: 64, align: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !401, file: !4, line: 343, baseType: !311, size: 64, align: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !401, file: !4, line: 344, baseType: !311, size: 64, align: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !401, file: !4, line: 345, baseType: !416, size: 128, align: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timespec_t", file: !4, line: 329, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 326, size: 128, align: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !417, file: !4, line: 327, baseType: !236, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !417, file: !4, line: 328, baseType: !236, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !401, file: !4, line: 346, baseType: !416, size: 128, align: 64, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !401, file: !4, line: 347, baseType: !416, size: 128, align: 64, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtim", scope: !401, file: !4, line: 348, baseType: !416, size: 128, align: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "timer_handle", scope: !369, file: !1, line: 36, baseType: !425, size: 1216, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timer_t", file: !4, line: 212, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_timer_s", file: !4, line: 783, size: 1216, align: 64, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !438, !439, !440, !446, !450, !451, !452}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !4, line: 784, baseType: !163, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !426, file: !4, line: 784, baseType: !165, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !4, line: 784, baseType: !244, size: 32, align: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !426, file: !4, line: 784, baseType: !246, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !426, file: !4, line: 784, baseType: !173, size: 128, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !426, file: !4, line: 784, baseType: !434, size: 256, align: 64, offset: 384)
!434 = !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !4, line: 784, size: 256, align: 64, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !434, file: !4, line: 784, baseType: !181, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !434, file: !4, line: 784, baseType: !256, size: 256, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !426, file: !4, line: 784, baseType: !158, size: 64, align: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !426, file: !4, line: 784, baseType: !171, size: 32, align: 32, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cb", scope: !426, file: !4, line: 785, baseType: !441, size: 64, align: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timer_cb", file: !4, line: 308, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "heap_node", scope: !426, file: !4, line: 785, baseType: !447, size: 192, align: 64, offset: 832)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, align: 64, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 3)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !426, file: !4, line: 785, baseType: !311, size: 64, align: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !426, file: !4, line: 785, baseType: !311, size: 64, align: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "start_id", scope: !426, file: !4, line: 785, baseType: !311, size: 64, align: 64, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fs_req", scope: !369, file: !1, line: 37, baseType: !454, size: 3520, align: 64, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_t", file: !4, line: 230, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_s", file: !4, line: 1120, size: 3520, align: 64, elements: !456)
!456 = !{!457, !458, !460, !461, !462, !464, !465, !471, !476, !477, !480, !481, !482, !484, !485, !489, !490, !500, !503, !507, !511, !513, !514, !529}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !455, file: !4, line: 1121, baseType: !163, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !4, line: 1121, baseType: !459, size: 32, align: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !33)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !455, file: !4, line: 1121, baseType: !173, size: 128, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !455, file: !4, line: 1121, baseType: !256, size: 256, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fs_type", scope: !455, file: !4, line: 1122, baseType: !463, size: 32, align: 32, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_type", file: !4, line: 1117, baseType: !46)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !455, file: !4, line: 1123, baseType: !165, size: 64, align: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !455, file: !4, line: 1124, baseType: !466, size: 64, align: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_cb", file: !4, line: 315, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !455, file: !4, line: 1125, baseType: !472, size: 64, align: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !473, line: 102, baseType: !474)
!473 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !475, line: 172, baseType: !236)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !455, file: !4, line: 1126, baseType: !163, size: 64, align: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !455, file: !4, line: 1127, baseType: !478, size: 64, align: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "statbuf", scope: !455, file: !4, line: 1128, baseType: !400, size: 1280, align: 64, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "new_path", scope: !455, file: !4, line: 1129, baseType: !478, size: 64, align: 64, offset: 2176)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !455, file: !4, line: 1129, baseType: !483, size: 32, align: 32, offset: 2240)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_file", file: !188, line: 121, baseType: !181)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !4, line: 1129, baseType: !181, size: 32, align: 32, offset: 2272)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !455, file: !4, line: 1129, baseType: !486, size: 32, align: 32, offset: 2304)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !487, line: 70, baseType: !488)
!487 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !475, line: 129, baseType: !171)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !455, file: !4, line: 1129, baseType: !171, size: 32, align: 32, offset: 2336)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !455, file: !4, line: 1129, baseType: !491, size: 64, align: 64, offset: 2368)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !188, line: 119, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !188, line: 116, size: 128, align: 64, elements: !494)
!494 = !{!495, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !493, file: !188, line: 117, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !493, file: !188, line: 118, baseType: !498, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !499, line: 62, baseType: !179)
!499 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !455, file: !4, line: 1129, baseType: !501, size: 64, align: 64, offset: 2432)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !473, line: 92, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !475, line: 132, baseType: !236)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !455, file: !4, line: 1129, baseType: !504, size: 32, align: 32, offset: 2496)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_uid_t", file: !188, line: 139, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !487, line: 80, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !475, line: 125, baseType: !171)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !455, file: !4, line: 1129, baseType: !508, size: 32, align: 32, offset: 2528)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_gid_t", file: !188, line: 138, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !487, line: 65, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !475, line: 126, baseType: !171)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !455, file: !4, line: 1129, baseType: !512, size: 64, align: 64, offset: 2560)
!512 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !455, file: !4, line: 1129, baseType: !512, size: 64, align: 64, offset: 2624)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !455, file: !4, line: 1129, baseType: !515, size: 320, align: 64, offset: 2688)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__work", file: !516, line: 30, size: 320, align: 64, elements: !517)
!516 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-threadpool.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!517 = !{!518, !523, !527, !528}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !515, file: !516, line: 31, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !515, file: !516, line: 32, baseType: !524, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !522, !181}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !515, file: !516, line: 33, baseType: !196, size: 64, align: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !515, file: !516, line: 34, baseType: !173, size: 128, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !455, file: !4, line: 1129, baseType: !530, size: 512, align: 64, offset: 3008)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 512, align: 64, elements: !257)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "statbuf", scope: !369, file: !1, line: 38, baseType: !400, size: 1280, align: 64, offset: 5056)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !369, file: !1, line: 39, baseType: !533, size: 8, align: 8, offset: 6336)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 8, align: 8, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 1)
!536 = !{!537, !541, !544, !547, !551, !554, !555, !558, !559}
!537 = distinct !DISubprogram(name: "uv_fs_poll_init", scope: !1, file: !1, line: 50, type: !538, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!181, !165, !372}
!540 = !{}
!541 = distinct !DISubprogram(name: "uv_fs_poll_start", scope: !1, file: !1, line: 56, type: !542, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!542 = !DISubroutineType(types: !543)
!543 = !{!181, !372, !394, !478, !171}
!544 = distinct !DISubprogram(name: "uv_fs_poll_stop", scope: !1, file: !1, line: 104, type: !545, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!545 = !DISubroutineType(types: !546)
!546 = !{!181, !372}
!547 = distinct !DISubprogram(name: "uv_fs_poll_getpath", scope: !1, file: !1, line: 128, type: !548, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!548 = !DISubroutineType(types: !549)
!549 = !{!181, !372, !496, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!551 = distinct !DISubprogram(name: "uv__fs_poll_close", scope: !1, file: !1, line: 154, type: !552, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !372}
!554 = distinct !DISubprogram(name: "poll_cb", scope: !1, file: !1, line: 172, type: !468, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!555 = distinct !DISubprogram(name: "statbuf_eq", scope: !1, file: !1, line: 227, type: !556, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!556 = !DISubroutineType(types: !557)
!557 = !{!181, !398, !398}
!558 = distinct !DISubprogram(name: "timer_cb", scope: !1, file: !1, line: 159, type: !443, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!559 = distinct !DISubprogram(name: "timer_close_cb", scope: !1, file: !1, line: 222, type: !248, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, variables: !540)
!560 = !{!561}
!561 = !DIGlobalVariable(name: "zero_statbuf", scope: !0, file: !1, line: 47, type: !400, isLocal: true, isDefinition: true, variable: %struct.uv_stat_t* @zero_statbuf)
!562 = !{i32 2, !"Dwarf Version", i32 4}
!563 = !{i32 2, !"Debug Info Version", i32 3}
!564 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!565 = !DILocalVariable(name: "loop", arg: 1, scope: !537, file: !1, line: 50, type: !165)
!566 = !DIExpression()
!567 = !DILocation(line: 50, column: 32, scope: !537)
!568 = !DILocalVariable(name: "handle", arg: 2, scope: !537, file: !1, line: 50, type: !372)
!569 = !DILocation(line: 50, column: 52, scope: !537)
!570 = !DILocation(line: 51, column: 3, scope: !537)
!571 = !DILocation(line: 51, column: 3, scope: !572)
!572 = !DILexicalBlockFile(scope: !573, file: !1, discriminator: 1)
!573 = distinct !DILexicalBlock(scope: !537, file: !1, line: 51, column: 3)
!574 = !DILocation(line: 51, column: 3, scope: !575)
!575 = !DILexicalBlockFile(scope: !576, file: !1, discriminator: 2)
!576 = distinct !DILexicalBlock(scope: !573, file: !1, line: 51, column: 3)
!577 = !DILocation(line: 51, column: 3, scope: !578)
!578 = !DILexicalBlockFile(scope: !573, file: !1, discriminator: 3)
!579 = !DILocation(line: 52, column: 3, scope: !537)
