; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/threadpool.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.anon }
%struct.anon = type { i32, i32, i64, i64, i64, i8*, i32, i32 }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.2, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon.1 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }

!56 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!57 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!58 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!59 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!60 = !DIEnumerator(name: "UV_EINTR", value: -4)
!61 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!62 = !DIEnumerator(name: "UV_EIO", value: -5)
!63 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!64 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!65 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!66 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!67 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!68 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!69 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!70 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!71 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!72 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!73 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!74 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!75 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!76 = !DIEnumerator(name: "UV_ENONET", value: -64)
!77 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!78 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!79 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!80 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!81 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!82 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!83 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!84 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!85 = !DIEnumerator(name: "UV_EPERM", value: -1)
!86 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!87 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!88 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!89 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!90 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!91 = !DIEnumerator(name: "UV_EROFS", value: -30)
!92 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!93 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!94 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!95 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!96 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!97 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!98 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!99 = !DIEnumerator(name: "UV_EOF", value: -4095)
!100 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!101 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!102 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!103 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 193, size: 32, align: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!106 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!107 = !DIEnumerator(name: "UV_REQ", value: 1)
!108 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!109 = !DIEnumerator(name: "UV_WRITE", value: 3)
!110 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!111 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!112 = !DIEnumerator(name: "UV_FS", value: 6)
!113 = !DIEnumerator(name: "UV_WORK", value: 7)
!114 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!115 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!116 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1086, size: 32, align: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!119 = !DIEnumerator(name: "UV_FS_UNKNOWN", value: -1)
!120 = !DIEnumerator(name: "UV_FS_CUSTOM", value: 0)
!121 = !DIEnumerator(name: "UV_FS_OPEN", value: 1)
!122 = !DIEnumerator(name: "UV_FS_CLOSE", value: 2)
!123 = !DIEnumerator(name: "UV_FS_READ", value: 3)
!124 = !DIEnumerator(name: "UV_FS_WRITE", value: 4)
!125 = !DIEnumerator(name: "UV_FS_SENDFILE", value: 5)
!126 = !DIEnumerator(name: "UV_FS_STAT", value: 6)
!127 = !DIEnumerator(name: "UV_FS_LSTAT", value: 7)
!128 = !DIEnumerator(name: "UV_FS_FSTAT", value: 8)
!129 = !DIEnumerator(name: "UV_FS_FTRUNCATE", value: 9)
!130 = !DIEnumerator(name: "UV_FS_UTIME", value: 10)
!131 = !DIEnumerator(name: "UV_FS_FUTIME", value: 11)
!132 = !DIEnumerator(name: "UV_FS_ACCESS", value: 12)
!133 = !DIEnumerator(name: "UV_FS_CHMOD", value: 13)
!134 = !DIEnumerator(name: "UV_FS_FCHMOD", value: 14)
!135 = !DIEnumerator(name: "UV_FS_FSYNC", value: 15)
!136 = !DIEnumerator(name: "UV_FS_FDATASYNC", value: 16)
!137 = !DIEnumerator(name: "UV_FS_UNLINK", value: 17)
!138 = !DIEnumerator(name: "UV_FS_RMDIR", value: 18)
!139 = !DIEnumerator(name: "UV_FS_MKDIR", value: 19)
!140 = !DIEnumerator(name: "UV_FS_MKDTEMP", value: 20)
!141 = !DIEnumerator(name: "UV_FS_RENAME", value: 21)
!142 = !DIEnumerator(name: "UV_FS_SCANDIR", value: 22)
!143 = !DIEnumerator(name: "UV_FS_LINK", value: 23)
!144 = !DIEnumerator(name: "UV_FS_SYMLINK", value: 24)
!145 = !DIEnumerator(name: "UV_FS_READLINK", value: 25)
!146 = !DIEnumerator(name: "UV_FS_CHOWN", value: 26)
!147 = !DIEnumerator(name: "UV_FS_FCHOWN", value: 27)
!148 = !DIEnumerator(name: "UV_FS_REALPATH", value: 28)
!149 = !{!150, !356, !357, !361, !363, !155, !377, !463, !509, !543}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !153)
!153 = !{!154, !156, !158, !162, !163, !164, !166, !168, !169, !170, !189, !190, !191, !192, !223, !271, !295, !296, !297, !298, !299, !300, !301, !305, !306, !307, !312, !315, !316, !318, !319, !352, !353, !354, !355}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !4, line: 1475, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !152, file: !4, line: 1477, baseType: !157, size: 32, align: 32, offset: 64)
!157 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !152, file: !4, line: 1478, baseType: !159, size: 128, align: 64, offset: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 128, align: 64, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 2)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !152, file: !4, line: 1479, baseType: !159, size: 128, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !152, file: !4, line: 1481, baseType: !157, size: 32, align: 32, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !4, line: 1482, baseType: !165, size: 64, align: 64, offset: 448)
!165 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !152, file: !4, line: 1482, baseType: !167, size: 32, align: 32, offset: 512)
!167 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !152, file: !4, line: 1482, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !174, line: 87, baseType: !175)
!174 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !174, line: 89, size: 448, align: 64, elements: !176)
!176 = !{!177, !184, !185, !186, !187, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !175, file: !174, line: 90, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !174, line: 84, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !182, !183, !157}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !175, file: !174, line: 91, baseType: !159, size: 128, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !175, file: !174, line: 92, baseType: !159, size: 128, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !175, file: !174, line: 93, baseType: !157, size: 32, align: 32, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !175, file: !174, line: 94, baseType: !157, size: 32, align: 32, offset: 352)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !175, file: !174, line: 95, baseType: !167, size: 32, align: 32, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !152, file: !4, line: 1482, baseType: !157, size: 32, align: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !152, file: !4, line: 1482, baseType: !157, size: 32, align: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !152, file: !4, line: 1482, baseType: !193, size: 320, align: 64, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !174, line: 129, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !195, line: 127, baseType: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!196 = !DICompositeType(tag: DW_TAG_union_type, file: !195, line: 90, size: 320, align: 64, elements: !197)
!197 = !{!198, !216, !221}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !196, file: !195, line: 124, baseType: !199, size: 320, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !195, line: 92, size: 320, align: 64, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !208, !209}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !199, file: !195, line: 94, baseType: !167, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !199, file: !195, line: 95, baseType: !157, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !199, file: !195, line: 96, baseType: !167, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !199, file: !195, line: 98, baseType: !157, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !199, file: !195, line: 102, baseType: !167, size: 32, align: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !199, file: !195, line: 104, baseType: !207, size: 16, align: 16, offset: 160)
!207 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !199, file: !195, line: 105, baseType: !207, size: 16, align: 16, offset: 176)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !199, file: !195, line: 106, baseType: !210, size: 128, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !195, line: 79, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !195, line: 75, size: 128, align: 64, elements: !212)
!212 = !{!213, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !211, file: !195, line: 77, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !211, file: !195, line: 78, baseType: !214, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !196, file: !195, line: 125, baseType: !217, size: 320, align: 8)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 320, align: 8, elements: !219)
!218 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!219 = !{!220}
!220 = !DISubrange(count: 40)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !196, file: !195, line: 126, baseType: !222, size: 64, align: 64)
!222 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !152, file: !4, line: 1482, baseType: !224, size: 1024, align: 64, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !226)
!226 = !{!227, !228, !229, !231, !255, !256, !261, !262, !263, !269, !270}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !4, line: 768, baseType: !155, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !225, file: !4, line: 768, baseType: !150, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !4, line: 768, baseType: !230, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !225, file: !4, line: 768, baseType: !232, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !253, !254}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !4, line: 426, baseType: !155, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !238, file: !4, line: 426, baseType: !150, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !4, line: 426, baseType: !230, size: 32, align: 32, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !238, file: !4, line: 426, baseType: !232, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !238, file: !4, line: 426, baseType: !159, size: 128, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !238, file: !4, line: 426, baseType: !246, size: 256, align: 64, offset: 384)
!246 = !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !4, line: 426, size: 256, align: 64, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !246, file: !4, line: 426, baseType: !167, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !246, file: !4, line: 426, baseType: !250, size: 256, align: 64)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 256, align: 64, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 4)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !238, file: !4, line: 426, baseType: !236, size: 64, align: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !4, line: 426, baseType: !157, size: 32, align: 32, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !225, file: !4, line: 768, baseType: !159, size: 128, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !225, file: !4, line: 768, baseType: !257, size: 256, align: 64, offset: 384)
!257 = !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !4, line: 768, size: 256, align: 64, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !257, file: !4, line: 768, baseType: !167, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !257, file: !4, line: 768, baseType: !250, size: 256, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !225, file: !4, line: 768, baseType: !236, size: 64, align: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !4, line: 768, baseType: !157, size: 32, align: 32, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !225, file: !4, line: 769, baseType: !264, size: 64, align: 64, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !225, file: !4, line: 769, baseType: !159, size: 128, align: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !225, file: !4, line: 769, baseType: !167, size: 32, align: 32, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !152, file: !4, line: 1482, baseType: !272, size: 448, align: 64, offset: 2432)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !174, line: 130, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !195, line: 213, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_union_type, file: !195, line: 173, size: 448, align: 64, elements: !275)
!275 = !{!276, !290, !294}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !274, file: !195, line: 192, baseType: !277, size: 448, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !195, line: 176, size: 448, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !277, file: !195, line: 178, baseType: !167, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !277, file: !195, line: 179, baseType: !157, size: 32, align: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !277, file: !195, line: 180, baseType: !157, size: 32, align: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !277, file: !195, line: 181, baseType: !157, size: 32, align: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !277, file: !195, line: 182, baseType: !157, size: 32, align: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !277, file: !195, line: 183, baseType: !157, size: 32, align: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !277, file: !195, line: 184, baseType: !167, size: 32, align: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !277, file: !195, line: 185, baseType: !167, size: 32, align: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !277, file: !195, line: 186, baseType: !165, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !277, file: !195, line: 187, baseType: !165, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !277, file: !195, line: 190, baseType: !157, size: 32, align: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !274, file: !195, line: 211, baseType: !291, size: 448, align: 8)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 448, align: 8, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 56)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !274, file: !195, line: 212, baseType: !222, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !152, file: !4, line: 1482, baseType: !236, size: 64, align: 64, offset: 2880)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 2944)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 3072)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 3200)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 3328)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !152, file: !4, line: 1482, baseType: !159, size: 128, align: 64, offset: 3456)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !152, file: !4, line: 1482, baseType: !302, size: 64, align: 64, offset: 3584)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !152, file: !4, line: 1482, baseType: !173, size: 448, align: 64, offset: 3648)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !152, file: !4, line: 1482, baseType: !167, size: 32, align: 32, offset: 4096)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !152, file: !4, line: 1482, baseType: !308, size: 128, align: 64, offset: 4160)
!308 = !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !4, line: 1482, size: 128, align: 64, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !308, file: !4, line: 1482, baseType: !155, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !308, file: !4, line: 1482, baseType: !157, size: 32, align: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !152, file: !4, line: 1482, baseType: !313, size: 64, align: 64, offset: 4288)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !314, line: 55, baseType: !165)
!314 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !152, file: !4, line: 1482, baseType: !313, size: 64, align: 64, offset: 4352)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !152, file: !4, line: 1482, baseType: !317, size: 64, align: 32, offset: 4416)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, align: 32, elements: !160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !152, file: !4, line: 1482, baseType: !173, size: 448, align: 64, offset: 4480)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !152, file: !4, line: 1482, baseType: !320, size: 1216, align: 64, offset: 4928)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !333, !334, !335, !341, !342, !350, !351}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !4, line: 1326, baseType: !155, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !321, file: !4, line: 1326, baseType: !150, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !4, line: 1326, baseType: !230, size: 32, align: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !321, file: !4, line: 1326, baseType: !232, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !321, file: !4, line: 1326, baseType: !159, size: 128, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !321, file: !4, line: 1326, baseType: !329, size: 256, align: 64, offset: 384)
!329 = !DICompositeType(tag: DW_TAG_union_type, scope: !321, file: !4, line: 1326, size: 256, align: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !329, file: !4, line: 1326, baseType: !167, size: 32, align: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !329, file: !4, line: 1326, baseType: !250, size: 256, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !321, file: !4, line: 1326, baseType: !236, size: 64, align: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !4, line: 1326, baseType: !157, size: 32, align: 32, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !321, file: !4, line: 1327, baseType: !336, size: 64, align: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340, !167}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !321, file: !4, line: 1328, baseType: !167, size: 32, align: 32, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !321, file: !4, line: 1329, baseType: !343, size: 256, align: 64, offset: 896)
!343 = !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !4, line: 1329, size: 256, align: 64, elements: !344)
!344 = !{!345, !347, !348, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !343, file: !4, line: 1329, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !343, file: !4, line: 1329, baseType: !346, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !343, file: !4, line: 1329, baseType: !346, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !343, file: !4, line: 1329, baseType: !167, size: 32, align: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !321, file: !4, line: 1329, baseType: !157, size: 32, align: 32, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !321, file: !4, line: 1329, baseType: !157, size: 32, align: 32, offset: 1184)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !152, file: !4, line: 1482, baseType: !167, size: 32, align: 32, offset: 6144)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !152, file: !4, line: 1482, baseType: !173, size: 448, align: 64, offset: 6208)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !152, file: !4, line: 1482, baseType: !155, size: 64, align: 64, offset: 6656)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !152, file: !4, line: 1482, baseType: !167, size: 32, align: 32, offset: 6720)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !360, line: 21, baseType: !159)
!360 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__work", file: !365, line: 30, size: 320, align: 64, elements: !366)
!365 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-threadpool.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!366 = !{!367, !371, !375, !376}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !364, file: !365, line: 31, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !363}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !364, file: !365, line: 32, baseType: !372, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !363, !167}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !364, file: !365, line: 33, baseType: !182, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !364, file: !365, line: 34, baseType: !159, size: 128, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_t", file: !4, line: 230, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_s", file: !4, line: 1120, size: 3520, align: 64, elements: !380)
!380 = !{!381, !382, !384, !385, !386, !388, !389, !394, !399, !400, !403, !428, !429, !431, !432, !436, !437, !446, !449, !453, !457, !459, !460, !461}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !4, line: 1121, baseType: !155, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !4, line: 1121, baseType: !383, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !104)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !379, file: !4, line: 1121, baseType: !159, size: 128, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !379, file: !4, line: 1121, baseType: !250, size: 256, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fs_type", scope: !379, file: !4, line: 1122, baseType: !387, size: 32, align: 32, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_type", file: !4, line: 1117, baseType: !117)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !379, file: !4, line: 1123, baseType: !150, size: 64, align: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !379, file: !4, line: 1124, baseType: !390, size: 64, align: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_cb", file: !4, line: 315, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !377}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !379, file: !4, line: 1125, baseType: !395, size: 64, align: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !396, line: 102, baseType: !397)
!396 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !398, line: 172, baseType: !222)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !379, file: !4, line: 1126, baseType: !155, size: 64, align: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !379, file: !4, line: 1127, baseType: !401, size: 64, align: 64, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "statbuf", scope: !379, file: !4, line: 1128, baseType: !404, size: 1280, align: 64, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stat_t", file: !4, line: 349, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 332, size: 1280, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !425, !426, !427}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !405, file: !4, line: 333, baseType: !313, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !405, file: !4, line: 334, baseType: !313, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !405, file: !4, line: 335, baseType: !313, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !405, file: !4, line: 336, baseType: !313, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !405, file: !4, line: 337, baseType: !313, size: 64, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !405, file: !4, line: 338, baseType: !313, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !405, file: !4, line: 339, baseType: !313, size: 64, align: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !405, file: !4, line: 340, baseType: !313, size: 64, align: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !405, file: !4, line: 341, baseType: !313, size: 64, align: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !405, file: !4, line: 342, baseType: !313, size: 64, align: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !405, file: !4, line: 343, baseType: !313, size: 64, align: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !405, file: !4, line: 344, baseType: !313, size: 64, align: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !405, file: !4, line: 345, baseType: !420, size: 128, align: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timespec_t", file: !4, line: 329, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 326, size: 128, align: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !421, file: !4, line: 327, baseType: !222, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !421, file: !4, line: 328, baseType: !222, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !405, file: !4, line: 346, baseType: !420, size: 128, align: 64, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !405, file: !4, line: 347, baseType: !420, size: 128, align: 64, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtim", scope: !405, file: !4, line: 348, baseType: !420, size: 128, align: 64, offset: 1152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "new_path", scope: !379, file: !4, line: 1129, baseType: !401, size: 64, align: 64, offset: 2176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !379, file: !4, line: 1129, baseType: !430, size: 32, align: 32, offset: 2240)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_file", file: !174, line: 121, baseType: !167)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !4, line: 1129, baseType: !167, size: 32, align: 32, offset: 2272)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !379, file: !4, line: 1129, baseType: !433, size: 32, align: 32, offset: 2304)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !434, line: 70, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !398, line: 129, baseType: !157)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !379, file: !4, line: 1129, baseType: !157, size: 32, align: 32, offset: 2336)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !379, file: !4, line: 1129, baseType: !438, size: 64, align: 64, offset: 2368)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !174, line: 119, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !174, line: 116, size: 128, align: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !440, file: !174, line: 117, baseType: !356, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !440, file: !174, line: 118, baseType: !444, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !445, line: 62, baseType: !165)
!445 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !379, file: !4, line: 1129, baseType: !447, size: 64, align: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !396, line: 90, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !398, line: 131, baseType: !222)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !379, file: !4, line: 1129, baseType: !450, size: 32, align: 32, offset: 2496)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_uid_t", file: !174, line: 139, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !434, line: 80, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !398, line: 125, baseType: !157)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !379, file: !4, line: 1129, baseType: !454, size: 32, align: 32, offset: 2528)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_gid_t", file: !174, line: 138, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !434, line: 65, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !398, line: 126, baseType: !157)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !379, file: !4, line: 1129, baseType: !458, size: 64, align: 64, offset: 2560)
!458 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !379, file: !4, line: 1129, baseType: !458, size: 64, align: 64, offset: 2624)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !379, file: !4, line: 1129, baseType: !364, size: 320, align: 64, offset: 2688)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !379, file: !4, line: 1129, baseType: !462, size: 512, align: 64, offset: 3008)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 512, align: 64, elements: !251)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getaddrinfo_t", file: !4, line: 224, baseType: !465)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_getaddrinfo_s", file: !4, line: 804, size: 1280, align: 64, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !504, !505, !506, !507, !508}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !4, line: 805, baseType: !155, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !4, line: 805, baseType: !383, size: 32, align: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !465, file: !4, line: 805, baseType: !159, size: 128, align: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !465, file: !4, line: 805, baseType: !250, size: 256, align: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !465, file: !4, line: 807, baseType: !150, size: 64, align: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !465, file: !4, line: 809, baseType: !364, size: 320, align: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !465, file: !4, line: 809, baseType: !474, size: 64, align: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getaddrinfo_cb", file: !4, line: 318, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !463, !167, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !480, line: 567, size: 384, align: 64, elements: !481)
!480 = !DIFile(filename: "/usr/include/netdb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!481 = !{!482, !483, !484, !485, !486, !490, !502, !503}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !479, file: !480, line: 569, baseType: !167, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !479, file: !480, line: 570, baseType: !167, size: 32, align: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !479, file: !480, line: 571, baseType: !167, size: 32, align: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !479, file: !480, line: 572, baseType: !167, size: 32, align: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !479, file: !480, line: 573, baseType: !487, size: 32, align: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !488, line: 33, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !398, line: 189, baseType: !157)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !479, file: !480, line: 574, baseType: !491, size: 64, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !488, line: 149, size: 128, align: 16, elements: !493)
!493 = !{!494, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !492, file: !488, line: 151, baseType: !495, size: 16, align: 16)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !496, line: 28, baseType: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!497 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !492, file: !488, line: 152, baseType: !499, size: 112, align: 8, offset: 16)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 112, align: 8, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 14)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !479, file: !480, line: 575, baseType: !356, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !479, file: !480, line: 576, baseType: !478, size: 64, align: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hints", scope: !465, file: !4, line: 809, baseType: !478, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !465, file: !4, line: 809, baseType: !356, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !465, file: !4, line: 809, baseType: !356, size: 64, align: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "addrinfo", scope: !465, file: !4, line: 809, baseType: !478, size: 64, align: 64, offset: 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "retcode", scope: !465, file: !4, line: 809, baseType: !167, size: 32, align: 32, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getnameinfo_t", file: !4, line: 225, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_getnameinfo_s", file: !4, line: 827, size: 10560, align: 64, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !524, !533, !534, !538, !542}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !4, line: 828, baseType: !155, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !511, file: !4, line: 828, baseType: !383, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !511, file: !4, line: 828, baseType: !159, size: 128, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !511, file: !4, line: 828, baseType: !250, size: 256, align: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !511, file: !4, line: 830, baseType: !150, size: 64, align: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !511, file: !4, line: 832, baseType: !364, size: 320, align: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "getnameinfo_cb", scope: !511, file: !4, line: 832, baseType: !520, size: 64, align: 64, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getnameinfo_cb", file: !4, line: 321, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !509, !167, !401, !401}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !511, file: !4, line: 832, baseType: !525, size: 1024, align: 64, offset: 960)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !488, line: 162, size: 1024, align: 64, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !525, file: !488, line: 164, baseType: !495, size: 16, align: 16)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !525, file: !488, line: 165, baseType: !165, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !525, file: !488, line: 166, baseType: !530, size: 896, align: 8, offset: 128)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 896, align: 8, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 112)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !511, file: !4, line: 832, baseType: !167, size: 32, align: 32, offset: 1984)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !511, file: !4, line: 832, baseType: !535, size: 8200, align: 8, offset: 2016)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 8200, align: 8, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 1025)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !511, file: !4, line: 832, baseType: !539, size: 256, align: 8, offset: 10216)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 256, align: 8, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "retcode", scope: !511, file: !4, line: 832, baseType: !167, size: 32, align: 32, offset: 10496)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_work_t", file: !4, line: 231, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_work_s", file: !4, line: 970, size: 1024, align: 64, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !557, !562}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !545, file: !4, line: 971, baseType: !155, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !4, line: 971, baseType: !383, size: 32, align: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !545, file: !4, line: 971, baseType: !159, size: 128, align: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !545, file: !4, line: 971, baseType: !250, size: 256, align: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !545, file: !4, line: 972, baseType: !150, size: 64, align: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "work_cb", scope: !545, file: !4, line: 973, baseType: !553, size: 64, align: 64, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_work_cb", file: !4, line: 316, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !543}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "after_work_cb", scope: !545, file: !4, line: 974, baseType: !558, size: 64, align: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_after_work_cb", file: !4, line: 317, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !543, !167}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !545, file: !4, line: 975, baseType: !364, size: 320, align: 64, offset: 704)
!563 = !{!564, !566, !569, !570, !573, !584, !587, !588, !589, !590, !593, !594, !595, !596}
!564 = distinct !DISubprogram(name: "cleanup", scope: !1, file: !1, line: 105, type: !303, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!565 = !{}
!566 = distinct !DISubprogram(name: "uv__work_submit", scope: !1, file: !1, line: 189, type: !567, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !150, !363, !368, !372}
!569 = distinct !DISubprogram(name: "uv__work_done", scope: !1, file: !1, line: 227, type: !266, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!570 = distinct !DISubprogram(name: "uv_queue_work", scope: !1, file: !1, line: 270, type: !571, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!571 = !DISubroutineType(types: !572)
!572 = !{!167, !150, !543, !553, !558}
!573 = distinct !DISubprogram(name: "uv_cancel", scope: !1, file: !1, line: 286, type: !574, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!574 = !DISubroutineType(types: !575)
!575 = !{!167, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_t", file: !4, line: 223, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_req_s", file: !4, line: 388, size: 512, align: 64, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !578, file: !4, line: 389, baseType: !155, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !4, line: 389, baseType: !383, size: 32, align: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !578, file: !4, line: 389, baseType: !159, size: 128, align: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !578, file: !4, line: 389, baseType: !250, size: 256, align: 64, offset: 256)
!584 = distinct !DISubprogram(name: "post", scope: !1, file: !1, line: 95, type: !585, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !362}
!587 = distinct !DISubprogram(name: "init_once", scope: !1, file: !1, line: 176, type: !303, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!588 = distinct !DISubprogram(name: "reset_once", scope: !1, file: !1, line: 169, type: !303, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!589 = distinct !DISubprogram(name: "init_threads", scope: !1, file: !1, line: 130, type: !303, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!590 = distinct !DISubprogram(name: "worker", scope: !1, file: !1, line: 52, type: !591, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !155}
!593 = distinct !DISubprogram(name: "uv__cancelled", scope: !1, file: !1, line: 44, type: !369, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!594 = distinct !DISubprogram(name: "uv__queue_work", scope: !1, file: !1, line: 250, type: !369, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!595 = distinct !DISubprogram(name: "uv__queue_done", scope: !1, file: !1, line: 257, type: !373, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!596 = distinct !DISubprogram(name: "uv__work_cancel", scope: !1, file: !1, line: 201, type: !597, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, variables: !565)
!597 = !DISubroutineType(types: !598)
!598 = !{!167, !150, !576, !363}
!599 = !{!600, !623, !624, !625, !629, !631, !632, !634, !635, !636}
!600 = !DIGlobalVariable(name: "cond", scope: !0, file: !1, line: 33, type: !601, isLocal: true, isDefinition: true, variable: %union.pthread_cond_t* @cond)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_cond_t", file: !174, line: 132, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !195, line: 153, baseType: !603)
!603 = !DICompositeType(tag: DW_TAG_union_type, file: !195, line: 138, size: 384, align: 64, elements: !604)
!604 = !{!605, !617, !621}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !603, file: !195, line: 150, baseType: !606, size: 384, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !195, line: 140, size: 384, align: 64, elements: !607)
!607 = !{!608, !609, !610, !612, !613, !614, !615, !616}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !606, file: !195, line: 142, baseType: !167, size: 32, align: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !606, file: !195, line: 143, baseType: !157, size: 32, align: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !606, file: !195, line: 144, baseType: !611, size: 64, align: 64, offset: 64)
!611 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !606, file: !195, line: 145, baseType: !611, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !606, file: !195, line: 146, baseType: !611, size: 64, align: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !606, file: !195, line: 147, baseType: !155, size: 64, align: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !606, file: !195, line: 148, baseType: !157, size: 32, align: 32, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !606, file: !195, line: 149, baseType: !157, size: 32, align: 32, offset: 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !603, file: !195, line: 151, baseType: !618, size: 384, align: 8)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 384, align: 8, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 48)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !603, file: !195, line: 152, baseType: !622, size: 64, align: 64)
!622 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!623 = !DIGlobalVariable(name: "mutex", scope: !0, file: !1, line: 34, type: !193, isLocal: true, isDefinition: true, variable: %union.pthread_mutex_t* @mutex)
!624 = !DIGlobalVariable(name: "nthreads", scope: !0, file: !1, line: 36, type: !157, isLocal: true, isDefinition: true, variable: i32* @nthreads)
!625 = !DIGlobalVariable(name: "threads", scope: !0, file: !1, line: 37, type: !626, isLocal: true, isDefinition: true, variable: i64** @threads)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_thread_t", file: !174, line: 128, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !195, line: 60, baseType: !165)
!629 = !DIGlobalVariable(name: "default_threads", scope: !0, file: !1, line: 38, type: !630, isLocal: true, isDefinition: true, variable: [4 x i64]* @default_threads)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 256, align: 64, elements: !251)
!631 = !DIGlobalVariable(name: "exit_message", scope: !0, file: !1, line: 39, type: !359, isLocal: true, isDefinition: true, variable: [2 x i8*]* @exit_message)
!632 = !DIGlobalVariable(name: "initialized", scope: !0, file: !1, line: 41, type: !633, isLocal: true, isDefinition: true, variable: i32* @initialized)
!633 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!634 = !DIGlobalVariable(name: "wq", scope: !0, file: !1, line: 40, type: !359, isLocal: true, isDefinition: true, variable: [2 x i8*]* @wq)
!635 = !DIGlobalVariable(name: "idle_threads", scope: !0, file: !1, line: 35, type: !157, isLocal: true, isDefinition: true, variable: i32* @idle_threads)
!636 = !DIGlobalVariable(name: "once", scope: !0, file: !1, line: 32, type: !637, isLocal: true, isDefinition: true, variable: i32* @once)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_once_t", file: !174, line: 127, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !195, line: 167, baseType: !167)
!639 = !{i32 2, !"Dwarf Version", i32 4}
!640 = !{i32 2, !"Debug Info Version", i32 3}
!641 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!642 = !DILocalVariable(name: "i", scope: !564, file: !1, line: 106, type: !157)
!643 = !DIExpression()
!644 = !DILocation(line: 106, column: 16, scope: !564)
!645 = !DILocation(line: 108, column: 7, scope: !646)
!646 = distinct !DILexicalBlock(scope: !564, file: !1, line: 108, column: 7)
!647 = !DILocation(line: 108, column: 19, scope: !646)
!648 = !DILocation(line: 108, column: 7, scope: !564)
!649 = !DILocation(line: 109, column: 5, scope: !646)
!650 = !DILocation(line: 111, column: 3, scope: !564)
!651 = !DILocation(line: 113, column: 10, scope: !652)
!652 = distinct !DILexicalBlock(scope: !564, file: !1, line: 113, column: 3)
!653 = !DILocation(line: 113, column: 8, scope: !652)
!654 = !DILocation(line: 113, column: 15, scope: !655)
!655 = !DILexicalBlockFile(scope: !656, file: !1, discriminator: 1)
!656 = distinct !DILexicalBlock(scope: !652, file: !1, line: 113, column: 3)
!657 = !DILocation(line: 113, column: 19, scope: !655)
!658 = !DILocation(line: 113, column: 17, scope: !655)
!659 = !DILocation(line: 113, column: 3, scope: !655)
!660 = !DILocation(line: 114, column: 24, scope: !661)
!661 = distinct !DILexicalBlock(scope: !656, file: !1, line: 114, column: 9)
