; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv__allocator_t = type { i8* (i64)*, i8* (i8*, i64)*, i8* (i64, i64)*, void (i8*)* }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.2, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.1, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.1 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32 }
%union.anon.0 = type { [4 x i8*] }

!93 = !DIEnumerator(name: "UV_POLL", value: 8)
!94 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!95 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!96 = !DIEnumerator(name: "UV_STREAM", value: 11)
!97 = !DIEnumerator(name: "UV_TCP", value: 12)
!98 = !DIEnumerator(name: "UV_TIMER", value: 13)
!99 = !DIEnumerator(name: "UV_TTY", value: 14)
!100 = !DIEnumerator(name: "UV_UDP", value: 15)
!101 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!102 = !DIEnumerator(name: "UV_FILE", value: 17)
!103 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 193, size: 32, align: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!106 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!107 = !DIEnumerator(name: "UV_REQ", value: 1)
!108 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!109 = !DIEnumerator(name: "UV_WRITE", value: 3)
!110 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!111 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!112 = !DIEnumerator(name: "UV_FS", value: 6)
!113 = !DIEnumerator(name: "UV_WORK", value: 7)
!114 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!115 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!116 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 57, size: 32, align: 32, elements: !119)
!118 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!119 = !{!120, !121, !122, !123, !124}
!120 = !DIEnumerator(name: "UV__SIGNAL_ONE_SHOT", value: 524288)
!121 = !DIEnumerator(name: "UV__HANDLE_INTERNAL", value: 32768)
!122 = !DIEnumerator(name: "UV__HANDLE_ACTIVE", value: 16384)
!123 = !DIEnumerator(name: "UV__HANDLE_REF", value: 8192)
!124 = !DIEnumerator(name: "UV__HANDLE_CLOSING", value: 0)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1086, size: 32, align: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!127 = !DIEnumerator(name: "UV_FS_UNKNOWN", value: -1)
!128 = !DIEnumerator(name: "UV_FS_CUSTOM", value: 0)
!129 = !DIEnumerator(name: "UV_FS_OPEN", value: 1)
!130 = !DIEnumerator(name: "UV_FS_CLOSE", value: 2)
!131 = !DIEnumerator(name: "UV_FS_READ", value: 3)
!132 = !DIEnumerator(name: "UV_FS_WRITE", value: 4)
!133 = !DIEnumerator(name: "UV_FS_SENDFILE", value: 5)
!134 = !DIEnumerator(name: "UV_FS_STAT", value: 6)
!135 = !DIEnumerator(name: "UV_FS_LSTAT", value: 7)
!136 = !DIEnumerator(name: "UV_FS_FSTAT", value: 8)
!137 = !DIEnumerator(name: "UV_FS_FTRUNCATE", value: 9)
!138 = !DIEnumerator(name: "UV_FS_UTIME", value: 10)
!139 = !DIEnumerator(name: "UV_FS_FUTIME", value: 11)
!140 = !DIEnumerator(name: "UV_FS_ACCESS", value: 12)
!141 = !DIEnumerator(name: "UV_FS_CHMOD", value: 13)
!142 = !DIEnumerator(name: "UV_FS_FCHMOD", value: 14)
!143 = !DIEnumerator(name: "UV_FS_FSYNC", value: 15)
!144 = !DIEnumerator(name: "UV_FS_FDATASYNC", value: 16)
!145 = !DIEnumerator(name: "UV_FS_UNLINK", value: 17)
!146 = !DIEnumerator(name: "UV_FS_RMDIR", value: 18)
!147 = !DIEnumerator(name: "UV_FS_MKDIR", value: 19)
!148 = !DIEnumerator(name: "UV_FS_MKDTEMP", value: 20)
!149 = !DIEnumerator(name: "UV_FS_RENAME", value: 21)
!150 = !DIEnumerator(name: "UV_FS_SCANDIR", value: 22)
!151 = !DIEnumerator(name: "UV_FS_LINK", value: 23)
!152 = !DIEnumerator(name: "UV_FS_SYMLINK", value: 24)
!153 = !DIEnumerator(name: "UV_FS_READLINK", value: 25)
!154 = !DIEnumerator(name: "UV_FS_CHOWN", value: 26)
!155 = !DIEnumerator(name: "UV_FS_FCHOWN", value: 27)
!156 = !DIEnumerator(name: "UV_FS_REALPATH", value: 28)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1020, size: 32, align: 32, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166}
!159 = !DIEnumerator(name: "UV_DIRENT_UNKNOWN", value: 0)
!160 = !DIEnumerator(name: "UV_DIRENT_FILE", value: 1)
!161 = !DIEnumerator(name: "UV_DIRENT_DIR", value: 2)
!162 = !DIEnumerator(name: "UV_DIRENT_LINK", value: 3)
!163 = !DIEnumerator(name: "UV_DIRENT_FIFO", value: 4)
!164 = !DIEnumerator(name: "UV_DIRENT_SOCKET", value: 5)
!165 = !DIEnumerator(name: "UV_DIRENT_CHAR", value: 6)
!166 = !DIEnumerator(name: "UV_DIRENT_BLOCK", value: 7)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 239, size: 32, align: 32, elements: !168)
!168 = !{!169}
!169 = !DIEnumerator(name: "UV_LOOP_BLOCK_SIGNAL", value: 0)
!170 = !{!171, !172, !179, !181, !383, !384, !193}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !175, line: 21, baseType: !176)
!175 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 128, align: 64, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 2)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !184)
!184 = !{!185, !186, !373, !374, !375, !376, !381, !382}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !4, line: 426, baseType: !171, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !183, file: !4, line: 426, baseType: !187, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !190)
!190 = !{!191, !192, !194, !195, !196, !197, !199, !201, !202, !203, !222, !223, !224, !225, !256, !288, !312, !313, !314, !315, !316, !317, !318, !322, !323, !324, !329, !332, !333, !335, !336, !369, !370, !371, !372}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !189, file: !4, line: 1475, baseType: !171, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !189, file: !4, line: 1477, baseType: !193, size: 32, align: 32, offset: 64)
!193 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !189, file: !4, line: 1478, baseType: !176, size: 128, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !189, file: !4, line: 1479, baseType: !176, size: 128, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !189, file: !4, line: 1481, baseType: !193, size: 32, align: 32, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !4, line: 1482, baseType: !198, size: 64, align: 64, offset: 448)
!198 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !189, file: !4, line: 1482, baseType: !200, size: 32, align: 32, offset: 512)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !189, file: !4, line: 1482, baseType: !204, size: 64, align: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !207, line: 87, baseType: !208)
!207 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !207, line: 89, size: 448, align: 64, elements: !209)
!209 = !{!210, !217, !218, !219, !220, !221}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !208, file: !207, line: 90, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !207, line: 84, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215, !216, !193}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !208, file: !207, line: 91, baseType: !176, size: 128, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !208, file: !207, line: 92, baseType: !176, size: 128, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !208, file: !207, line: 93, baseType: !193, size: 32, align: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !208, file: !207, line: 94, baseType: !193, size: 32, align: 32, offset: 352)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !208, file: !207, line: 95, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !189, file: !4, line: 1482, baseType: !193, size: 32, align: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !189, file: !4, line: 1482, baseType: !193, size: 32, align: 32, offset: 928)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !189, file: !4, line: 1482, baseType: !226, size: 320, align: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !207, line: 129, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !228, line: 127, baseType: !229)
!228 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!229 = !DICompositeType(tag: DW_TAG_union_type, file: !228, line: 90, size: 320, align: 64, elements: !230)
!230 = !{!231, !249, !254}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !229, file: !228, line: 124, baseType: !232, size: 320, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !228, line: 92, size: 320, align: 64, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !241, !242}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !232, file: !228, line: 94, baseType: !200, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !232, file: !228, line: 95, baseType: !193, size: 32, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !232, file: !228, line: 96, baseType: !200, size: 32, align: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !232, file: !228, line: 98, baseType: !193, size: 32, align: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !232, file: !228, line: 102, baseType: !200, size: 32, align: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !232, file: !228, line: 104, baseType: !240, size: 16, align: 16, offset: 160)
!240 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !232, file: !228, line: 105, baseType: !240, size: 16, align: 16, offset: 176)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !232, file: !228, line: 106, baseType: !243, size: 128, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !228, line: 79, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !228, line: 75, size: 128, align: 64, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !244, file: !228, line: 77, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !244, file: !228, line: 78, baseType: !247, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !229, file: !228, line: 125, baseType: !250, size: 320, align: 8)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, align: 8, elements: !252)
!251 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!252 = !{!253}
!253 = !DISubrange(count: 40)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !229, file: !228, line: 126, baseType: !255, size: 64, align: 64)
!255 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !189, file: !4, line: 1482, baseType: !257, size: 1024, align: 64, offset: 1408)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !259)
!259 = !{!260, !261, !262, !264, !269, !270, !278, !279, !280, !286, !287}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !4, line: 768, baseType: !171, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !258, file: !4, line: 768, baseType: !187, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !4, line: 768, baseType: !263, size: 32, align: 32, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !83)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !258, file: !4, line: 768, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !181}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !258, file: !4, line: 768, baseType: !176, size: 128, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !258, file: !4, line: 768, baseType: !271, size: 256, align: 64, offset: 384)
!271 = !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !4, line: 768, size: 256, align: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !271, file: !4, line: 768, baseType: !200, size: 32, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !271, file: !4, line: 768, baseType: !275, size: 256, align: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 256, align: 64, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 4)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !258, file: !4, line: 768, baseType: !181, size: 64, align: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !4, line: 768, baseType: !193, size: 32, align: 32, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !258, file: !4, line: 769, baseType: !281, size: 64, align: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !258, file: !4, line: 769, baseType: !176, size: 128, align: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !258, file: !4, line: 769, baseType: !200, size: 32, align: 32, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !189, file: !4, line: 1482, baseType: !289, size: 448, align: 64, offset: 2432)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !207, line: 130, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !228, line: 213, baseType: !291)
!291 = !DICompositeType(tag: DW_TAG_union_type, file: !228, line: 173, size: 448, align: 64, elements: !292)
!292 = !{!293, !307, !311}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !291, file: !228, line: 192, baseType: !294, size: 448, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !228, line: 176, size: 448, align: 64, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !294, file: !228, line: 178, baseType: !200, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !294, file: !228, line: 179, baseType: !193, size: 32, align: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !294, file: !228, line: 180, baseType: !193, size: 32, align: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !294, file: !228, line: 181, baseType: !193, size: 32, align: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !294, file: !228, line: 182, baseType: !193, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !294, file: !228, line: 183, baseType: !193, size: 32, align: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !294, file: !228, line: 184, baseType: !200, size: 32, align: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !294, file: !228, line: 185, baseType: !200, size: 32, align: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !294, file: !228, line: 186, baseType: !198, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !294, file: !228, line: 187, baseType: !198, size: 64, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !294, file: !228, line: 190, baseType: !193, size: 32, align: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !291, file: !228, line: 211, baseType: !308, size: 448, align: 8)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 448, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 56)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !291, file: !228, line: 212, baseType: !255, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !189, file: !4, line: 1482, baseType: !181, size: 64, align: 64, offset: 2880)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 2944)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 3072)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 3200)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 3328)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !189, file: !4, line: 1482, baseType: !176, size: 128, align: 64, offset: 3456)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !189, file: !4, line: 1482, baseType: !319, size: 64, align: 64, offset: 3584)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !189, file: !4, line: 1482, baseType: !206, size: 448, align: 64, offset: 3648)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !189, file: !4, line: 1482, baseType: !200, size: 32, align: 32, offset: 4096)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !189, file: !4, line: 1482, baseType: !325, size: 128, align: 64, offset: 4160)
!325 = !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !4, line: 1482, size: 128, align: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !325, file: !4, line: 1482, baseType: !171, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !325, file: !4, line: 1482, baseType: !193, size: 32, align: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !189, file: !4, line: 1482, baseType: !330, size: 64, align: 64, offset: 4288)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !331, line: 55, baseType: !198)
!331 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !189, file: !4, line: 1482, baseType: !330, size: 64, align: 64, offset: 4352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !189, file: !4, line: 1482, baseType: !334, size: 64, align: 32, offset: 4416)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 64, align: 32, elements: !177)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !189, file: !4, line: 1482, baseType: !206, size: 448, align: 64, offset: 4480)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !189, file: !4, line: 1482, baseType: !337, size: 1216, align: 64, offset: 4928)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !350, !351, !352, !358, !359, !367, !368}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !4, line: 1326, baseType: !171, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !338, file: !4, line: 1326, baseType: !187, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !338, file: !4, line: 1326, baseType: !263, size: 32, align: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !338, file: !4, line: 1326, baseType: !265, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !338, file: !4, line: 1326, baseType: !176, size: 128, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !338, file: !4, line: 1326, baseType: !346, size: 256, align: 64, offset: 384)
!346 = !DICompositeType(tag: DW_TAG_union_type, scope: !338, file: !4, line: 1326, size: 256, align: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !346, file: !4, line: 1326, baseType: !200, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !346, file: !4, line: 1326, baseType: !275, size: 256, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !338, file: !4, line: 1326, baseType: !181, size: 64, align: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !338, file: !4, line: 1326, baseType: !193, size: 32, align: 32, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !338, file: !4, line: 1327, baseType: !353, size: 64, align: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357, !200}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !338, file: !4, line: 1328, baseType: !200, size: 32, align: 32, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !338, file: !4, line: 1329, baseType: !360, size: 256, align: 64, offset: 896)
!360 = !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !4, line: 1329, size: 256, align: 64, elements: !361)
!361 = !{!362, !364, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !360, file: !4, line: 1329, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !360, file: !4, line: 1329, baseType: !363, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !360, file: !4, line: 1329, baseType: !363, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !360, file: !4, line: 1329, baseType: !200, size: 32, align: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !338, file: !4, line: 1329, baseType: !193, size: 32, align: 32, offset: 1152)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !338, file: !4, line: 1329, baseType: !193, size: 32, align: 32, offset: 1184)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !189, file: !4, line: 1482, baseType: !200, size: 32, align: 32, offset: 6144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !189, file: !4, line: 1482, baseType: !206, size: 448, align: 64, offset: 6208)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !189, file: !4, line: 1482, baseType: !171, size: 64, align: 64, offset: 6656)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !189, file: !4, line: 1482, baseType: !200, size: 32, align: 32, offset: 6720)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, file: !4, line: 426, baseType: !263, size: 32, align: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !183, file: !4, line: 426, baseType: !265, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !183, file: !4, line: 426, baseType: !176, size: 128, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !183, file: !4, line: 426, baseType: !377, size: 256, align: 64, offset: 384)
!377 = !DICompositeType(tag: DW_TAG_union_type, scope: !183, file: !4, line: 426, size: 256, align: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !377, file: !4, line: 426, baseType: !200, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !377, file: !4, line: 426, baseType: !275, size: 256, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !183, file: !4, line: 426, baseType: !181, size: 64, align: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !183, file: !4, line: 426, baseType: !193, size: 32, align: 32, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !385, line: 62, baseType: !198)
!385 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!386 = !{!387, !393, !396, !399, !402, !405, !408, !419, !422, !426, !429, !437, !440, !441, !466, !491, !496, !501, !618, !648, !651, !684, !687, !690, !693, !700, !755, !756, !757, !758, !763, !766, !771, !774, !778, !779, !807, !891, !901, !905, !908, !909, !912, !913, !914, !917}
!387 = distinct !DISubprogram(name: "uv__strdup", scope: !1, file: !1, line: 54, type: !388, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!388 = !DISubroutineType(types: !389)
!389 = !{!383, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!392 = !{}
!393 = distinct !DISubprogram(name: "uv__strndup", scope: !1, file: !1, line: 62, type: !394, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!394 = !DISubroutineType(types: !395)
!395 = !{!383, !390, !384}
!396 = distinct !DISubprogram(name: "uv__malloc", scope: !1, file: !1, line: 74, type: !397, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!397 = !DISubroutineType(types: !398)
!398 = !{!171, !384}
!399 = distinct !DISubprogram(name: "uv__free", scope: !1, file: !1, line: 78, type: !400, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !171}
!402 = distinct !DISubprogram(name: "uv__calloc", scope: !1, file: !1, line: 89, type: !403, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!403 = !DISubroutineType(types: !404)
!404 = !{!171, !384, !384}
!405 = distinct !DISubprogram(name: "uv__realloc", scope: !1, file: !1, line: 93, type: !406, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!406 = !DISubroutineType(types: !407)
!407 = !{!171, !171, !384}
!408 = distinct !DISubprogram(name: "uv_replace_allocator", scope: !1, file: !1, line: 97, type: !409, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !411, !413, !415, !417}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_malloc_func", file: !4, line: 253, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_realloc_func", file: !4, line: 254, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_calloc_func", file: !4, line: 255, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_free_func", file: !4, line: 256, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!419 = distinct !DISubprogram(name: "uv_handle_size", scope: !1, file: !1, line: 116, type: !420, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!420 = !DISubroutineType(types: !421)
!421 = !{!384, !263}
!422 = distinct !DISubprogram(name: "uv_req_size", scope: !1, file: !1, line: 124, type: !423, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!423 = !DISubroutineType(types: !424)
!424 = !{!384, !425}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !104)
!426 = distinct !DISubprogram(name: "uv_loop_size", scope: !1, file: !1, line: 135, type: !427, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!427 = !DISubroutineType(types: !428)
!428 = !{!384}
!429 = distinct !DISubprogram(name: "uv_buf_init", scope: !1, file: !1, line: 140, type: !430, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!430 = !DISubroutineType(types: !431)
!431 = !{!432, !383, !193}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !207, line: 119, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !207, line: 116, size: 128, align: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !433, file: !207, line: 117, baseType: !383, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !433, file: !207, line: 118, baseType: !384, size: 64, align: 64, offset: 64)
!437 = distinct !DISubprogram(name: "uv_err_name", scope: !1, file: !1, line: 160, type: !438, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!438 = !DISubroutineType(types: !439)
!439 = !{!390, !200}
!440 = distinct !DISubprogram(name: "uv_strerror", scope: !1, file: !1, line: 170, type: !438, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!441 = distinct !DISubprogram(name: "uv_ip4_addr", scope: !1, file: !1, line: 179, type: !442, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!442 = !DISubroutineType(types: !443)
!443 = !{!200, !390, !200, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !446, line: 237, size: 128, align: 32, elements: !447)
!446 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!447 = !{!448, !452, !455, !461}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !445, file: !446, line: 239, baseType: !449, size: 16, align: 16)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !450, line: 28, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!451 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !445, file: !446, line: 240, baseType: !453, size: 16, align: 16, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !446, line: 117, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !331, line: 49, baseType: !451)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !445, file: !446, line: 241, baseType: !456, size: 32, align: 32, offset: 32)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !446, line: 31, size: 32, align: 32, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !456, file: !446, line: 33, baseType: !459, size: 32, align: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !446, line: 30, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !331, line: 51, baseType: !193)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !445, file: !446, line: 244, baseType: !462, size: 64, align: 8, offset: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 64, align: 8, elements: !464)
!463 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!464 = !{!465}
!465 = !DISubrange(count: 8)
!466 = distinct !DISubprogram(name: "uv_ip6_addr", scope: !1, file: !1, line: 187, type: !467, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!467 = !DISubroutineType(types: !468)
!468 = !{!200, !390, !200, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !446, line: 252, size: 224, align: 32, elements: !471)
!471 = !{!472, !473, !474, !475, !490}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !470, file: !446, line: 254, baseType: !449, size: 16, align: 16)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !470, file: !446, line: 255, baseType: !453, size: 16, align: 16, offset: 16)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !470, file: !446, line: 256, baseType: !460, size: 32, align: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !470, file: !446, line: 257, baseType: !476, size: 128, align: 32, offset: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !446, line: 209, size: 128, align: 32, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !476, file: !446, line: 218, baseType: !479, size: 128, align: 32)
!479 = !DICompositeType(tag: DW_TAG_union_type, scope: !476, file: !446, line: 211, size: 128, align: 32, elements: !480)
!480 = !{!481, !486, !488}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !479, file: !446, line: 213, baseType: !482, size: 128, align: 8)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 128, align: 8, elements: !484)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !331, line: 48, baseType: !463)
!484 = !{!485}
!485 = !DISubrange(count: 16)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !479, file: !446, line: 215, baseType: !487, size: 128, align: 16)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, align: 16, elements: !464)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !479, file: !446, line: 216, baseType: !489, size: 128, align: 32)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, align: 32, elements: !276)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !470, file: !446, line: 258, baseType: !460, size: 32, align: 32, offset: 192)
!491 = distinct !DISubprogram(name: "uv_ip4_name", scope: !1, file: !1, line: 219, type: !492, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!492 = !DISubroutineType(types: !493)
!493 = !{!200, !494, !383, !384}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!496 = distinct !DISubprogram(name: "uv_ip6_name", scope: !1, file: !1, line: 224, type: !497, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!497 = !DISubroutineType(types: !498)
!498 = !{!200, !499, !383, !384}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!501 = distinct !DISubprogram(name: "uv_tcp_bind", scope: !1, file: !1, line: 229, type: !502, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!502 = !DISubroutineType(types: !503)
!503 = !{!200, !504, !608, !193}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_tcp_t", file: !4, line: 207, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_tcp_s", file: !4, line: 516, size: 1984, align: 64, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !518, !519, !520, !521, !527, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !506, file: !4, line: 517, baseType: !171, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !506, file: !4, line: 517, baseType: !187, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !4, line: 517, baseType: !263, size: 32, align: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !506, file: !4, line: 517, baseType: !265, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !506, file: !4, line: 517, baseType: !176, size: 128, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !506, file: !4, line: 517, baseType: !514, size: 256, align: 64, offset: 384)
!514 = !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !4, line: 517, size: 256, align: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !514, file: !4, line: 517, baseType: !200, size: 32, align: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !514, file: !4, line: 517, baseType: !275, size: 256, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !506, file: !4, line: 517, baseType: !181, size: 64, align: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !506, file: !4, line: 517, baseType: !193, size: 32, align: 32, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !506, file: !4, line: 518, baseType: !384, size: 64, align: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !506, file: !4, line: 518, baseType: !522, size: 64, align: 64, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_alloc_cb", file: !4, line: 296, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !181, !384, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !506, file: !4, line: 518, baseType: !528, size: 64, align: 64, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_read_cb", file: !4, line: 299, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532, !593, !597}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stream_t", file: !4, line: 206, baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_stream_s", file: !4, line: 465, size: 1984, align: 64, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !546, !547, !548, !549, !550, !551, !567, !582, !583, !584, !585, !590, !591, !592}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !4, line: 466, baseType: !171, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !534, file: !4, line: 466, baseType: !187, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !534, file: !4, line: 466, baseType: !263, size: 32, align: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !534, file: !4, line: 466, baseType: !265, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !534, file: !4, line: 466, baseType: !176, size: 128, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !534, file: !4, line: 466, baseType: !542, size: 256, align: 64, offset: 384)
!542 = !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !4, line: 466, size: 256, align: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !542, file: !4, line: 466, baseType: !200, size: 32, align: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !542, file: !4, line: 466, baseType: !275, size: 256, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !534, file: !4, line: 466, baseType: !181, size: 64, align: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !534, file: !4, line: 466, baseType: !193, size: 32, align: 32, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !534, file: !4, line: 467, baseType: !384, size: 64, align: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !534, file: !4, line: 467, baseType: !522, size: 64, align: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !534, file: !4, line: 467, baseType: !528, size: 64, align: 64, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !534, file: !4, line: 467, baseType: !552, size: 64, align: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_t", file: !4, line: 228, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_connect_s", file: !4, line: 551, size: 768, align: 64, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !565, !566}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !4, line: 552, baseType: !171, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !554, file: !4, line: 552, baseType: !425, size: 32, align: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !554, file: !4, line: 552, baseType: !176, size: 128, align: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !554, file: !4, line: 552, baseType: !275, size: 256, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !554, file: !4, line: 553, baseType: !561, size: 64, align: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_cb", file: !4, line: 303, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !552, !200}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !554, file: !4, line: 554, baseType: !532, size: 64, align: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !554, file: !4, line: 555, baseType: !176, size: 128, align: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !534, file: !4, line: 467, baseType: !568, size: 64, align: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_t", file: !4, line: 226, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_shutdown_s", file: !4, line: 401, size: 640, align: 64, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !4, line: 402, baseType: !171, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !570, file: !4, line: 402, baseType: !425, size: 32, align: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !570, file: !4, line: 402, baseType: !176, size: 128, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !570, file: !4, line: 402, baseType: !275, size: 256, align: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !570, file: !4, line: 403, baseType: !532, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !570, file: !4, line: 404, baseType: !578, size: 64, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_cb", file: !4, line: 304, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !568, !200}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !534, file: !4, line: 467, baseType: !206, size: 448, align: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !534, file: !4, line: 467, baseType: !176, size: 128, align: 64, offset: 1536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !534, file: !4, line: 467, baseType: !176, size: 128, align: 64, offset: 1664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !534, file: !4, line: 467, baseType: !586, size: 64, align: 64, offset: 1792)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connection_cb", file: !4, line: 305, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !532, !200}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !534, file: !4, line: 467, baseType: !200, size: 32, align: 32, offset: 1856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !534, file: !4, line: 467, baseType: !200, size: 32, align: 32, offset: 1888)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !534, file: !4, line: 467, baseType: !171, size: 64, align: 64, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !594, line: 102, baseType: !595)
!594 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !596, line: 172, baseType: !255)
!596 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !506, file: !4, line: 518, baseType: !552, size: 64, align: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !506, file: !4, line: 518, baseType: !568, size: 64, align: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !506, file: !4, line: 518, baseType: !206, size: 448, align: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !506, file: !4, line: 518, baseType: !176, size: 128, align: 64, offset: 1536)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !506, file: !4, line: 518, baseType: !176, size: 128, align: 64, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !506, file: !4, line: 518, baseType: !586, size: 64, align: 64, offset: 1792)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !506, file: !4, line: 518, baseType: !200, size: 32, align: 32, offset: 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !506, file: !4, line: 518, baseType: !200, size: 32, align: 32, offset: 1888)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !506, file: !4, line: 518, baseType: !171, size: 64, align: 64, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !611, line: 149, size: 128, align: 16, elements: !612)
!611 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !610, file: !611, line: 151, baseType: !449, size: 16, align: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !610, file: !611, line: 152, baseType: !615, size: 112, align: 8, offset: 16)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 112, align: 8, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 14)
!618 = distinct !DISubprogram(name: "uv_udp_bind", scope: !1, file: !1, line: 248, type: !619, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!619 = !DISubroutineType(types: !620)
!620 = !{!200, !621, !608, !193}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_t", file: !4, line: 208, baseType: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_udp_s", file: !4, line: 590, size: 1728, align: 64, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !635, !636, !637, !638, !639, !640, !645, !646, !647}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !623, file: !4, line: 591, baseType: !171, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !623, file: !4, line: 591, baseType: !187, size: 64, align: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !4, line: 591, baseType: !263, size: 32, align: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !623, file: !4, line: 591, baseType: !265, size: 64, align: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !623, file: !4, line: 591, baseType: !176, size: 128, align: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !623, file: !4, line: 591, baseType: !631, size: 256, align: 64, offset: 384)
!631 = !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !4, line: 591, size: 256, align: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !631, file: !4, line: 591, baseType: !200, size: 32, align: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !631, file: !4, line: 591, baseType: !275, size: 256, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !623, file: !4, line: 591, baseType: !181, size: 64, align: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !623, file: !4, line: 591, baseType: !193, size: 32, align: 32, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_size", scope: !623, file: !4, line: 597, baseType: !384, size: 64, align: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_count", scope: !623, file: !4, line: 601, baseType: !384, size: 64, align: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !623, file: !4, line: 602, baseType: !522, size: 64, align: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "recv_cb", scope: !623, file: !4, line: 602, baseType: !641, size: 64, align: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_recv_cb", file: !4, line: 583, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !621, !593, !597, !608, !193}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !623, file: !4, line: 602, baseType: !206, size: 448, align: 64, offset: 1024)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !623, file: !4, line: 602, baseType: !176, size: 128, align: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !623, file: !4, line: 602, baseType: !176, size: 128, align: 64, offset: 1600)
!648 = distinct !DISubprogram(name: "uv_tcp_connect", scope: !1, file: !1, line: 267, type: !649, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!649 = !DISubroutineType(types: !650)
!650 = !{!200, !552, !504, !608, !561}
!651 = distinct !DISubprogram(name: "uv_udp_send", scope: !1, file: !1, line: 287, type: !652, isLocal: false, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!652 = !DISubroutineType(types: !653)
!653 = !{!200, !654, !621, !597, !193, !608, !664}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_send_t", file: !4, line: 229, baseType: !656)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_udp_send_s", file: !4, line: 606, size: 2560, align: 64, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !668, !669, !678, !679, !680, !681, !682}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !656, file: !4, line: 607, baseType: !171, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !4, line: 607, baseType: !425, size: 32, align: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !656, file: !4, line: 607, baseType: !176, size: 128, align: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !656, file: !4, line: 607, baseType: !275, size: 256, align: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !656, file: !4, line: 608, baseType: !621, size: 64, align: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !656, file: !4, line: 609, baseType: !664, size: 64, align: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_send_cb", file: !4, line: 582, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !654, !200}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !656, file: !4, line: 610, baseType: !176, size: 128, align: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !656, file: !4, line: 610, baseType: !670, size: 1024, align: 64, offset: 768)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !611, line: 162, size: 1024, align: 64, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !670, file: !611, line: 164, baseType: !449, size: 16, align: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !670, file: !611, line: 165, baseType: !198, size: 64, align: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !670, file: !611, line: 166, baseType: !675, size: 896, align: 8, offset: 128)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 896, align: 8, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !656, file: !4, line: 610, baseType: !193, size: 32, align: 32, offset: 1792)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !656, file: !4, line: 610, baseType: !526, size: 64, align: 64, offset: 1856)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !656, file: !4, line: 610, baseType: !593, size: 64, align: 64, offset: 1920)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "send_cb", scope: !656, file: !4, line: 610, baseType: !664, size: 64, align: 64, offset: 1984)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !656, file: !4, line: 610, baseType: !683, size: 512, align: 64, offset: 2048)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 512, align: 64, elements: !276)
!684 = distinct !DISubprogram(name: "uv_udp_try_send", scope: !1, file: !1, line: 309, type: !685, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!685 = !DISubroutineType(types: !686)
!686 = !{!200, !621, !597, !193, !608}
!687 = distinct !DISubprogram(name: "uv_udp_recv_start", scope: !1, file: !1, line: 329, type: !688, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!688 = !DISubroutineType(types: !689)
!689 = !{!200, !621, !522, !641}
!690 = distinct !DISubprogram(name: "uv_udp_recv_stop", scope: !1, file: !1, line: 339, type: !691, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!691 = !DISubroutineType(types: !692)
!692 = !{!200, !621}
!693 = distinct !DISubprogram(name: "uv_walk", scope: !1, file: !1, line: 347, type: !694, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !187, !696, !171}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_walk_cb", file: !4, line: 314, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !181, !171}
!700 = distinct !DISubprogram(name: "uv_print_all_handles", scope: !1, file: !1, line: 398, type: !701, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !187, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !594, line: 48, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !706, line: 245, size: 1728, align: 64, elements: !707)
!706 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !728, !729, !730, !731, !733, !734, !736, !740, !743, !745, !746, !747, !748, !749, !750, !751}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !705, file: !706, line: 246, baseType: !200, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !705, file: !706, line: 251, baseType: !383, size: 64, align: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !705, file: !706, line: 252, baseType: !383, size: 64, align: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !705, file: !706, line: 253, baseType: !383, size: 64, align: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !705, file: !706, line: 254, baseType: !383, size: 64, align: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !705, file: !706, line: 255, baseType: !383, size: 64, align: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !705, file: !706, line: 256, baseType: !383, size: 64, align: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !705, file: !706, line: 257, baseType: !383, size: 64, align: 64, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !705, file: !706, line: 258, baseType: !383, size: 64, align: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !705, file: !706, line: 260, baseType: !383, size: 64, align: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !705, file: !706, line: 261, baseType: !383, size: 64, align: 64, offset: 640)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !705, file: !706, line: 262, baseType: !383, size: 64, align: 64, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !705, file: !706, line: 264, baseType: !721, size: 64, align: 64, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !706, line: 160, size: 192, align: 64, elements: !723)
!723 = !{!724, !725, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !722, file: !706, line: 161, baseType: !721, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !722, file: !706, line: 162, baseType: !726, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !722, file: !706, line: 166, baseType: !200, size: 32, align: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !705, file: !706, line: 266, baseType: !726, size: 64, align: 64, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !705, file: !706, line: 268, baseType: !200, size: 32, align: 32, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !705, file: !706, line: 272, baseType: !200, size: 32, align: 32, offset: 928)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !705, file: !706, line: 274, baseType: !732, size: 64, align: 64, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !596, line: 131, baseType: !255)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !705, file: !706, line: 278, baseType: !451, size: 16, align: 16, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !705, file: !706, line: 279, baseType: !735, size: 8, align: 8, offset: 1040)
!735 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !705, file: !706, line: 280, baseType: !737, size: 8, align: 8, offset: 1048)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 8, align: 8, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 1)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !705, file: !706, line: 284, baseType: !741, size: 64, align: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !706, line: 154, baseType: null)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !705, file: !706, line: 293, baseType: !744, size: 64, align: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !596, line: 132, baseType: !255)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !705, file: !706, line: 302, baseType: !171, size: 64, align: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !705, file: !706, line: 303, baseType: !171, size: 64, align: 64, offset: 1280)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !705, file: !706, line: 304, baseType: !171, size: 64, align: 64, offset: 1344)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !705, file: !706, line: 305, baseType: !171, size: 64, align: 64, offset: 1408)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !705, file: !706, line: 306, baseType: !384, size: 64, align: 64, offset: 1472)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !705, file: !706, line: 308, baseType: !200, size: 32, align: 32, offset: 1536)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !705, file: !706, line: 310, baseType: !752, size: 160, align: 8, offset: 1568)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 160, align: 8, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 20)
!755 = distinct !DISubprogram(name: "uv_print_active_handles", scope: !1, file: !1, line: 403, type: !701, isLocal: false, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!756 = distinct !DISubprogram(name: "uv_ref", scope: !1, file: !1, line: 408, type: !267, isLocal: false, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!757 = distinct !DISubprogram(name: "uv_unref", scope: !1, file: !1, line: 413, type: !267, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!758 = distinct !DISubprogram(name: "uv_has_ref", scope: !1, file: !1, line: 418, type: !759, isLocal: false, isDefinition: true, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!759 = !DISubroutineType(types: !760)
!760 = !{!200, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!763 = distinct !DISubprogram(name: "uv_stop", scope: !1, file: !1, line: 423, type: !764, isLocal: false, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !187}
!766 = distinct !DISubprogram(name: "uv_now", scope: !1, file: !1, line: 428, type: !767, isLocal: false, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!767 = !DISubroutineType(types: !768)
!768 = !{!330, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!771 = distinct !DISubprogram(name: "uv__count_bufs", scope: !1, file: !1, line: 434, type: !772, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!772 = !DISubroutineType(types: !773)
!773 = !{!384, !597, !193}
!774 = distinct !DISubprogram(name: "uv_recv_buffer_size", scope: !1, file: !1, line: 445, type: !775, isLocal: false, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!775 = !DISubroutineType(types: !776)
!776 = !{!200, !181, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!778 = distinct !DISubprogram(name: "uv_send_buffer_size", scope: !1, file: !1, line: 449, type: !775, isLocal: false, isDefinition: true, scopeLine: 449, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!779 = distinct !DISubprogram(name: "uv_fs_event_getpath", scope: !1, file: !1, line: 453, type: !780, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!780 = !DISubroutineType(types: !781)
!781 = !{!200, !782, !383, !806}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_event_t", file: !4, line: 218, baseType: !784)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_event_s", file: !4, line: 1297, size: 1088, align: 64, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !796, !797, !798, !799, !804, !805}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !784, file: !4, line: 1298, baseType: !171, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !784, file: !4, line: 1298, baseType: !187, size: 64, align: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !784, file: !4, line: 1298, baseType: !263, size: 32, align: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !784, file: !4, line: 1298, baseType: !265, size: 64, align: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !784, file: !4, line: 1298, baseType: !176, size: 128, align: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !784, file: !4, line: 1298, baseType: !792, size: 256, align: 64, offset: 384)
!792 = !DICompositeType(tag: DW_TAG_union_type, scope: !784, file: !4, line: 1298, size: 256, align: 64, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !792, file: !4, line: 1298, baseType: !200, size: 32, align: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !792, file: !4, line: 1298, baseType: !275, size: 256, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !784, file: !4, line: 1298, baseType: !181, size: 64, align: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !784, file: !4, line: 1298, baseType: !193, size: 32, align: 32, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !784, file: !4, line: 1300, baseType: !383, size: 64, align: 64, offset: 768)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !784, file: !4, line: 1301, baseType: !800, size: 64, align: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_event_cb", file: !4, line: 352, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !782, !390, !200, !200}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !784, file: !4, line: 1301, baseType: !176, size: 128, align: 64, offset: 896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !784, file: !4, line: 1301, baseType: !200, size: 32, align: 32, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!807 = distinct !DISubprogram(name: "uv__fs_scandir_cleanup", scope: !1, file: !1, line: 496, type: !808, isLocal: false, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_t", file: !4, line: 230, baseType: !812)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_s", file: !4, line: 1120, size: 3520, align: 64, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !820, !821, !824, !825, !826, !827, !852, !853, !855, !856, !860, !861, !862, !864, !868, !872, !874, !875, !890}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !4, line: 1121, baseType: !171, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !812, file: !4, line: 1121, baseType: !425, size: 32, align: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !812, file: !4, line: 1121, baseType: !176, size: 128, align: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !812, file: !4, line: 1121, baseType: !275, size: 256, align: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fs_type", scope: !812, file: !4, line: 1122, baseType: !819, size: 32, align: 32, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_type", file: !4, line: 1117, baseType: !125)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !812, file: !4, line: 1123, baseType: !187, size: 64, align: 64, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !812, file: !4, line: 1124, baseType: !822, size: 64, align: 64, offset: 640)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_cb", file: !4, line: 315, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !812, file: !4, line: 1125, baseType: !593, size: 64, align: 64, offset: 704)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !812, file: !4, line: 1126, baseType: !171, size: 64, align: 64, offset: 768)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !812, file: !4, line: 1127, baseType: !390, size: 64, align: 64, offset: 832)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "statbuf", scope: !812, file: !4, line: 1128, baseType: !828, size: 1280, align: 64, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stat_t", file: !4, line: 349, baseType: !829)
!829 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 332, size: 1280, align: 64, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !849, !850, !851}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !829, file: !4, line: 333, baseType: !330, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !829, file: !4, line: 334, baseType: !330, size: 64, align: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !829, file: !4, line: 335, baseType: !330, size: 64, align: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !829, file: !4, line: 336, baseType: !330, size: 64, align: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !829, file: !4, line: 337, baseType: !330, size: 64, align: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !829, file: !4, line: 338, baseType: !330, size: 64, align: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !829, file: !4, line: 339, baseType: !330, size: 64, align: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !829, file: !4, line: 340, baseType: !330, size: 64, align: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !829, file: !4, line: 341, baseType: !330, size: 64, align: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !829, file: !4, line: 342, baseType: !330, size: 64, align: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !829, file: !4, line: 343, baseType: !330, size: 64, align: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !829, file: !4, line: 344, baseType: !330, size: 64, align: 64, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !829, file: !4, line: 345, baseType: !844, size: 128, align: 64, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timespec_t", file: !4, line: 329, baseType: !845)
!845 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 326, size: 128, align: 64, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !845, file: !4, line: 327, baseType: !255, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !845, file: !4, line: 328, baseType: !255, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !829, file: !4, line: 346, baseType: !844, size: 128, align: 64, offset: 896)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !829, file: !4, line: 347, baseType: !844, size: 128, align: 64, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtim", scope: !829, file: !4, line: 348, baseType: !844, size: 128, align: 64, offset: 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "new_path", scope: !812, file: !4, line: 1129, baseType: !390, size: 64, align: 64, offset: 2176)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !812, file: !4, line: 1129, baseType: !854, size: 32, align: 32, offset: 2240)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_file", file: !207, line: 121, baseType: !200)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !812, file: !4, line: 1129, baseType: !200, size: 32, align: 32, offset: 2272)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !812, file: !4, line: 1129, baseType: !857, size: 32, align: 32, offset: 2304)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !858, line: 70, baseType: !859)
!858 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !596, line: 129, baseType: !193)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !812, file: !4, line: 1129, baseType: !193, size: 32, align: 32, offset: 2336)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !812, file: !4, line: 1129, baseType: !526, size: 64, align: 64, offset: 2368)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !812, file: !4, line: 1129, baseType: !863, size: 64, align: 64, offset: 2432)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !594, line: 92, baseType: !744)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !812, file: !4, line: 1129, baseType: !865, size: 32, align: 32, offset: 2496)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_uid_t", file: !207, line: 139, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !858, line: 80, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !596, line: 125, baseType: !193)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !812, file: !4, line: 1129, baseType: !869, size: 32, align: 32, offset: 2528)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_gid_t", file: !207, line: 138, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !858, line: 65, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !596, line: 126, baseType: !193)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !812, file: !4, line: 1129, baseType: !873, size: 64, align: 64, offset: 2560)
!873 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !812, file: !4, line: 1129, baseType: !873, size: 64, align: 64, offset: 2624)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !812, file: !4, line: 1129, baseType: !876, size: 320, align: 64, offset: 2688)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__work", file: !877, line: 30, size: 320, align: 64, elements: !878)
!877 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-threadpool.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!878 = !{!879, !884, !888, !889}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !876, file: !877, line: 31, baseType: !880, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !876, file: !877, line: 32, baseType: !885, size: 64, align: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64, align: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !883, !200}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !876, file: !877, line: 33, baseType: !215, size: 64, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !876, file: !877, line: 34, baseType: !176, size: 128, align: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !812, file: !4, line: 1129, baseType: !683, size: 512, align: 64, offset: 3008)
!891 = distinct !DISubprogram(name: "uv_fs_scandir_next", scope: !1, file: !1, line: 512, type: !892, isLocal: false, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!892 = !DISubroutineType(types: !893)
!893 = !{!200, !810, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_dirent_t", file: !4, line: 236, baseType: !896)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_dirent_s", file: !4, line: 1031, size: 128, align: 64, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !896, file: !4, line: 1032, baseType: !390, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !896, file: !4, line: 1033, baseType: !900, size: 32, align: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_dirent_type_t", file: !4, line: 1029, baseType: !157)
!901 = distinct !DISubprogram(name: "uv_loop_configure", scope: !1, file: !1, line: 578, type: !902, isLocal: false, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!902 = !DISubroutineType(types: !903)
!903 = !{!200, !187, !904, null}
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_option", file: !4, line: 241, baseType: !167)
!905 = distinct !DISubprogram(name: "uv_default_loop", scope: !1, file: !1, line: 595, type: !906, isLocal: false, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!906 = !DISubroutineType(types: !907)
!907 = !{!187}
!908 = distinct !DISubprogram(name: "uv_loop_new", scope: !1, file: !1, line: 607, type: !906, isLocal: false, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!909 = distinct !DISubprogram(name: "uv_loop_close", scope: !1, file: !1, line: 623, type: !910, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!910 = !DISubroutineType(types: !911)
!911 = !{!200, !187}
!912 = distinct !DISubprogram(name: "uv_loop_delete", scope: !1, file: !1, line: 653, type: !764, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!913 = distinct !DISubprogram(name: "uv__unknown_err_code", scope: !1, file: !1, line: 148, type: !438, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!914 = distinct !DISubprogram(name: "uv__print_handles", scope: !1, file: !1, line: 366, type: !915, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !187, !200, !703}
!917 = distinct !DISubprogram(name: "uv__get_nbufs", scope: !1, file: !1, line: 478, type: !918, isLocal: true, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: false, variables: !392)
!918 = !DISubroutineType(types: !919)
!919 = !{!920, !810}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!921 = !{!922, !923, !924}
!922 = !DIGlobalVariable(name: "default_loop_struct", scope: !0, file: !1, line: 591, type: !188, isLocal: true, isDefinition: true, variable: %struct.uv_loop_s* @default_loop_struct)
!923 = !DIGlobalVariable(name: "default_loop_ptr", scope: !0, file: !1, line: 592, type: !187, isLocal: true, isDefinition: true, variable: %struct.uv_loop_s** @default_loop_ptr)
!924 = !DIGlobalVariable(name: "uv__allocator", scope: !0, file: !1, line: 47, type: !925, isLocal: true, isDefinition: true, variable: %struct.uv__allocator_t* @uv__allocator)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__allocator_t", file: !1, line: 45, baseType: !926)
!926 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 40, size: 256, align: 64, elements: !927)
!927 = !{!928, !929, !930, !931}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "local_malloc", scope: !926, file: !1, line: 41, baseType: !411, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "local_realloc", scope: !926, file: !1, line: 42, baseType: !413, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "local_calloc", scope: !926, file: !1, line: 43, baseType: !415, size: 64, align: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "local_free", scope: !926, file: !1, line: 44, baseType: !417, size: 64, align: 64, offset: 192)
!932 = !{i32 2, !"Dwarf Version", i32 4}
!933 = !{i32 2, !"Debug Info Version", i32 3}
!934 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!935 = !DILocalVariable(name: "s", arg: 1, scope: !387, file: !1, line: 54, type: !390)
!936 = !DIExpression()
!937 = !DILocation(line: 54, column: 30, scope: !387)
!938 = !DILocalVariable(name: "len", scope: !387, file: !1, line: 55, type: !384)
!939 = !DILocation(line: 55, column: 10, scope: !387)
!940 = !DILocation(line: 55, column: 23, scope: !387)
!941 = !DILocation(line: 55, column: 16, scope: !387)
!942 = !DILocation(line: 55, column: 26, scope: !387)
!943 = !DILocalVariable(name: "m", scope: !387, file: !1, line: 56, type: !383)
!944 = !DILocation(line: 56, column: 9, scope: !387)
!945 = !DILocation(line: 56, column: 24, scope: !387)
!946 = !DILocation(line: 56, column: 13, scope: !387)
!947 = !DILocation(line: 57, column: 7, scope: !948)
!948 = distinct !DILexicalBlock(scope: !387, file: !1, line: 57, column: 7)
!949 = !DILocation(line: 57, column: 9, scope: !948)
!950 = !DILocation(line: 57, column: 7, scope: !387)
!951 = !DILocation(line: 58, column: 5, scope: !948)
!952 = !DILocation(line: 59, column: 17, scope: !387)
!953 = !DILocation(line: 59, column: 20, scope: !387)
!954 = !DILocation(line: 59, column: 23, scope: !387)
!955 = !DILocation(line: 59, column: 10, scope: !387)
!956 = !DILocation(line: 59, column: 3, scope: !387)
!957 = !DILocation(line: 60, column: 1, scope: !387)
!958 = !DILocalVariable(name: "size", arg: 1, scope: !396, file: !1, line: 74, type: !384)
!959 = !DILocation(line: 74, column: 25, scope: !396)
!960 = !DILocation(line: 75, column: 24, scope: !396)
!961 = !DILocation(line: 75, column: 37, scope: !396)
!962 = !DILocation(line: 75, column: 10, scope: !396)
!963 = !DILocation(line: 75, column: 3, scope: !396)
!964 = !DILocalVariable(name: "s", arg: 1, scope: !393, file: !1, line: 62, type: !390)
!965 = !DILocation(line: 62, column: 31, scope: !393)
!966 = !DILocalVariable(name: "n", arg: 2, scope: !393, file: !1, line: 62, type: !384)
!967 = !DILocation(line: 62, column: 41, scope: !393)
!968 = !DILocalVariable(name: "m", scope: !393, file: !1, line: 63, type: !383)
!969 = !DILocation(line: 63, column: 9, scope: !393)
!970 = !DILocalVariable(name: "len", scope: !393, file: !1, line: 64, type: !384)
!971 = !DILocation(line: 64, column: 10, scope: !393)
!972 = !DILocation(line: 64, column: 23, scope: !393)
!973 = !DILocation(line: 64, column: 16, scope: !393)
!974 = !DILocation(line: 65, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !393, file: !1, line: 65, column: 7)
!976 = !DILocation(line: 65, column: 11, scope: !975)
!977 = !DILocation(line: 65, column: 9, scope: !975)
!978 = !DILocation(line: 65, column: 7, scope: !393)
!979 = !DILocation(line: 66, column: 11, scope: !975)
!980 = !DILocation(line: 66, column: 9, scope: !975)
!981 = !DILocation(line: 66, column: 5, scope: !975)
!982 = !DILocation(line: 67, column: 18, scope: !393)
!983 = !DILocation(line: 67, column: 22, scope: !393)
!984 = !DILocation(line: 67, column: 7, scope: !393)
!985 = !DILocation(line: 67, column: 5, scope: !393)
!986 = !DILocation(line: 68, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !393, file: !1, line: 68, column: 7)
!988 = !DILocation(line: 68, column: 9, scope: !987)
!989 = !DILocation(line: 68, column: 7, scope: !393)
!990 = !DILocation(line: 69, column: 5, scope: !987)
!991 = !DILocation(line: 70, column: 5, scope: !393)
!992 = !DILocation(line: 70, column: 3, scope: !393)
!993 = !DILocation(line: 70, column: 10, scope: !393)
!994 = !DILocation(line: 71, column: 17, scope: !393)
!995 = !DILocation(line: 71, column: 20, scope: !393)
!996 = !DILocation(line: 71, column: 23, scope: !393)
!997 = !DILocation(line: 71, column: 10, scope: !393)
!998 = !DILocation(line: 71, column: 3, scope: !393)
!999 = !DILocation(line: 72, column: 1, scope: !393)
!1000 = !DILocalVariable(name: "ptr", arg: 1, scope: !399, file: !1, line: 78, type: !171)
!1001 = !DILocation(line: 78, column: 21, scope: !399)
!1002 = !DILocalVariable(name: "saved_errno", scope: !399, file: !1, line: 79, type: !200)
!1003 = !DILocation(line: 79, column: 7, scope: !399)
!1004 = !DILocation(line: 84, column: 17, scope: !399)
!1005 = !DILocation(line: 84, column: 15, scope: !399)
!1006 = !DILocation(line: 85, column: 17, scope: !399)
!1007 = !DILocation(line: 85, column: 28, scope: !399)
!1008 = !DILocation(line: 85, column: 3, scope: !399)
!1009 = !DILocation(line: 86, column: 11, scope: !399)
!1010 = !DILocation(line: 86, column: 3, scope: !399)
!1011 = !DILocation(line: 86, column: 9, scope: !399)
!1012 = !DILocation(line: 87, column: 1, scope: !399)
!1013 = !DILocalVariable(name: "count", arg: 1, scope: !402, file: !1, line: 89, type: !384)
!1014 = !DILocation(line: 89, column: 25, scope: !402)
!1015 = !DILocalVariable(name: "size", arg: 2, scope: !402, file: !1, line: 89, type: !384)
!1016 = !DILocation(line: 89, column: 39, scope: !402)
!1017 = !DILocation(line: 90, column: 24, scope: !402)
!1018 = !DILocation(line: 90, column: 37, scope: !402)
!1019 = !DILocation(line: 90, column: 44, scope: !402)
!1020 = !DILocation(line: 90, column: 10, scope: !402)
!1021 = !DILocation(line: 90, column: 3, scope: !402)
!1022 = !DILocalVariable(name: "ptr", arg: 1, scope: !405, file: !1, line: 93, type: !171)
!1023 = !DILocation(line: 93, column: 25, scope: !405)
!1024 = !DILocalVariable(name: "size", arg: 2, scope: !405, file: !1, line: 93, type: !384)
!1025 = !DILocation(line: 93, column: 37, scope: !405)
!1026 = !DILocation(line: 94, column: 24, scope: !405)
!1027 = !DILocation(line: 94, column: 38, scope: !405)
!1028 = !DILocation(line: 94, column: 43, scope: !405)
!1029 = !DILocation(line: 94, column: 10, scope: !405)
!1030 = !DILocation(line: 94, column: 3, scope: !405)
!1031 = !DILocalVariable(name: "malloc_func", arg: 1, scope: !408, file: !1, line: 97, type: !411)
!1032 = !DILocation(line: 97, column: 41, scope: !408)
!1033 = !DILocalVariable(name: "realloc_func", arg: 2, scope: !408, file: !1, line: 98, type: !413)
!1034 = !DILocation(line: 98, column: 42, scope: !408)
!1035 = !DILocalVariable(name: "calloc_func", arg: 3, scope: !408, file: !1, line: 99, type: !415)
!1036 = !DILocation(line: 99, column: 41, scope: !408)
!1037 = !DILocalVariable(name: "free_func", arg: 4, scope: !408, file: !1, line: 100, type: !417)
!1038 = !DILocation(line: 100, column: 39, scope: !408)
!1039 = !DILocation(line: 101, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !408, file: !1, line: 101, column: 7)
!1041 = !DILocation(line: 101, column: 19, scope: !1040)
!1042 = !DILocation(line: 101, column: 27, scope: !1040)
!1043 = !DILocation(line: 101, column: 30, scope: !1044)
!1044 = !DILexicalBlockFile(scope: !1040, file: !1, discriminator: 1)
!1045 = !DILocation(line: 101, column: 43, scope: !1044)
!1046 = !DILocation(line: 101, column: 51, scope: !1044)
!1047 = !DILocation(line: 102, column: 7, scope: !1040)
!1048 = !DILocation(line: 102, column: 19, scope: !1040)
!1049 = !DILocation(line: 102, column: 27, scope: !1040)
!1050 = !DILocation(line: 102, column: 30, scope: !1044)
!1051 = !DILocation(line: 102, column: 40, scope: !1044)
!1052 = !DILocation(line: 101, column: 7, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !408, file: !1, discriminator: 2)
!1054 = !DILocation(line: 103, column: 5, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 102, column: 49)
!1056 = !DILocation(line: 106, column: 32, scope: !408)
!1057 = !DILocation(line: 106, column: 30, scope: !408)
!1058 = !DILocation(line: 107, column: 33, scope: !408)
!1059 = !DILocation(line: 107, column: 31, scope: !408)
!1060 = !DILocation(line: 108, column: 32, scope: !408)
!1061 = !DILocation(line: 108, column: 30, scope: !408)
!1062 = !DILocation(line: 109, column: 30, scope: !408)
!1063 = !DILocation(line: 109, column: 28, scope: !408)
!1064 = !DILocation(line: 111, column: 3, scope: !408)
!1065 = !DILocation(line: 112, column: 1, scope: !408)
!1066 = !DILocalVariable(name: "type", arg: 1, scope: !419, file: !1, line: 116, type: !263)
!1067 = !DILocation(line: 116, column: 38, scope: !419)
!1068 = !DILocation(line: 117, column: 11, scope: !419)
!1069 = !DILocation(line: 117, column: 3, scope: !419)
!1070 = !DILocation(line: 118, column: 5, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !419, file: !1, line: 117, column: 17)
!1072 = !DILocation(line: 118, column: 5, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1071, file: !1, discriminator: 1)
!1074 = !DILocation(line: 118, column: 5, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1071, file: !1, discriminator: 2)
!1076 = !DILocation(line: 118, column: 5, scope: !1077)
!1077 = !DILexicalBlockFile(scope: !1071, file: !1, discriminator: 3)
!1078 = !DILocation(line: 118, column: 5, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1071, file: !1, discriminator: 4)
!1080 = !DILocation(line: 118, column: 5, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1071, file: !1, discriminator: 5)
