; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmbzip2/blocksort.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [38 x i8] c"      %d work, %d block, ratio %5.2f\0A\00", align 1
@.str.1 = private unnamed_addr constant [54 x i8] c"    too repetitive; using fallback sorting algorithm\0A\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"        bucket sorting ...\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"        depth %6d has \00", align 1
@.str.4 = private unnamed_addr constant [24 x i8] c"%6d unresolved strings\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !129)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/blocksort.c", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!2 = !{}
!3 = !{!4, !8, !9, !10, !12, !5, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !6, line: 64, baseType: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!7 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !6, line: 60, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !6, line: 61, baseType: !13)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !6, line: 59, baseType: !11)
!15 = !{!16, !108, !111, !114, !115, !119, !122, !123, !126}
!16 = distinct !DISubprogram(name: "BZ2_blockSort", scope: !1, file: !1, line: 1031, type: !17, isLocal: false, isDefinition: true, scopeLine: 1032, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !6, line: 283, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 214, size: 446144, align: 64, elements: !22)
!22 = !{!23, !51, !52, !53, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !92, !96, !97, !101, !103, !104}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !21, file: !6, line: 216, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !26, line: 66, baseType: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!27 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 49, size: 640, align: 64, elements: !28)
!28 = !{!29, !32, !34, !35, !36, !37, !38, !39, !40, !42, !46, !50}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !27, file: !26, line: 50, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !27, file: !26, line: 51, baseType: !33, size: 32, align: 32, offset: 64)
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !27, file: !26, line: 52, baseType: !33, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !27, file: !26, line: 53, baseType: !33, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !27, file: !26, line: 55, baseType: !30, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !27, file: !26, line: 56, baseType: !33, size: 32, align: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !27, file: !26, line: 57, baseType: !33, size: 32, align: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !27, file: !26, line: 58, baseType: !33, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !27, file: !26, line: 60, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !27, file: !26, line: 62, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!41, !41, !13, !13}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !27, file: !26, line: 63, baseType: !47, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !41, !41}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !27, file: !26, line: 64, baseType: !41, size: 64, align: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !21, file: !6, line: 220, baseType: !12, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !21, file: !6, line: 221, baseType: !12, size: 32, align: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !21, file: !6, line: 224, baseType: !54, size: 32, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !6, line: 62, baseType: !33)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !21, file: !6, line: 227, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !21, file: !6, line: 228, baseType: !56, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !21, file: !6, line: 229, baseType: !56, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !21, file: !6, line: 230, baseType: !12, size: 32, align: 32, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, file: !6, line: 233, baseType: !56, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !21, file: !6, line: 234, baseType: !9, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !21, file: !6, line: 235, baseType: !4, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !21, file: !6, line: 236, baseType: !9, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !21, file: !6, line: 239, baseType: !12, size: 32, align: 32, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !21, file: !6, line: 242, baseType: !54, size: 32, align: 32, offset: 736)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !21, file: !6, line: 243, baseType: !12, size: 32, align: 32, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !21, file: !6, line: 244, baseType: !12, size: 32, align: 32, offset: 800)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !21, file: !6, line: 244, baseType: !12, size: 32, align: 32, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !21, file: !6, line: 247, baseType: !12, size: 32, align: 32, offset: 864)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !21, file: !6, line: 248, baseType: !12, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !21, file: !6, line: 249, baseType: !12, size: 32, align: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !21, file: !6, line: 250, baseType: !12, size: 32, align: 32, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !21, file: !6, line: 253, baseType: !12, size: 32, align: 32, offset: 992)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !21, file: !6, line: 254, baseType: !75, size: 2048, align: 8, offset: 1024)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !21, file: !6, line: 255, baseType: !79, size: 2048, align: 8, offset: 3072)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !76)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !21, file: !6, line: 258, baseType: !54, size: 32, align: 32, offset: 5120)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !21, file: !6, line: 259, baseType: !12, size: 32, align: 32, offset: 5152)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !21, file: !6, line: 262, baseType: !54, size: 32, align: 32, offset: 5184)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !21, file: !6, line: 263, baseType: !54, size: 32, align: 32, offset: 5216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !21, file: !6, line: 266, baseType: !12, size: 32, align: 32, offset: 5248)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !21, file: !6, line: 267, baseType: !12, size: 32, align: 32, offset: 5280)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !21, file: !6, line: 268, baseType: !12, size: 32, align: 32, offset: 5312)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !21, file: !6, line: 271, baseType: !12, size: 32, align: 32, offset: 5344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !21, file: !6, line: 272, baseType: !89, size: 8256, align: 32, offset: 5376)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8256, align: 32, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 258)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !21, file: !6, line: 273, baseType: !93, size: 144016, align: 8, offset: 13632)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 144016, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 18002)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !21, file: !6, line: 274, baseType: !93, size: 144016, align: 8, offset: 157648)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, file: !6, line: 276, baseType: !98, size: 12384, align: 8, offset: 301664)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 12384, align: 8, elements: !99)
!99 = !{!100, !91}
!100 = !DISubrange(count: 6)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !21, file: !6, line: 277, baseType: !102, size: 49536, align: 32, offset: 314048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 49536, align: 32, elements: !99)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !21, file: !6, line: 278, baseType: !102, size: 49536, align: 32, offset: 363584)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !21, file: !6, line: 280, baseType: !105, size: 33024, align: 32, offset: 413120)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 33024, align: 32, elements: !106)
!106 = !{!91, !107}
!107 = !DISubrange(count: 4)
!108 = distinct !DISubprogram(name: "fallbackSort", scope: !1, file: !1, line: 212, type: !109, isLocal: true, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !56, !56, !56, !12, !12}
!111 = distinct !DISubprogram(name: "fallbackQSort3", scope: !1, file: !1, line: 93, type: !112, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !56, !56, !12, !12}
!114 = distinct !DISubprogram(name: "fallbackSimpleSort", scope: !1, file: !1, line: 32, type: !112, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!115 = distinct !DISubprogram(name: "mainSort", scope: !1, file: !1, line: 751, type: !116, isLocal: true, isDefinition: true, scopeLine: 758, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !56, !9, !4, !56, !12, !12, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!119 = distinct !DISubprogram(name: "mainQSort3", scope: !1, file: !1, line: 621, type: !120, isLocal: true, isDefinition: true, scopeLine: 629, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !56, !9, !4, !12, !12, !12, !12, !118}
!122 = distinct !DISubprogram(name: "mainSimpleSort", scope: !1, file: !1, line: 485, type: !120, isLocal: true, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!123 = distinct !DISubprogram(name: "mainGtU", scope: !1, file: !1, line: 347, type: !124, isLocal: true, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!124 = !DISubroutineType(types: !125)
!125 = !{!14, !54, !54, !9, !4, !54, !118}
!126 = distinct !DISubprogram(name: "mmed3", scope: !1, file: !1, line: 583, type: !127, isLocal: true, isDefinition: true, scopeLine: 584, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!127 = !DISubroutineType(types: !128)
!128 = !{!10, !10, !10, !10}
!129 = !{!130}
!130 = !DIGlobalVariable(name: "incs", scope: !0, file: !1, line: 480, type: !131, isLocal: true, isDefinition: true, variable: [14 x i32]* @incs)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 448, align: 32, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 14)
!134 = !{i32 2, !"Dwarf Version", i32 4}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!137 = !DILocalVariable(name: "s", arg: 1, scope: !16, file: !1, line: 1031, type: !19)
!138 = !DIExpression()
!139 = !DILocation(line: 1031, column: 30, scope: !16)
!140 = !DILocalVariable(name: "ptr", scope: !16, file: !1, line: 1033, type: !56)
!141 = !DILocation(line: 1033, column: 12, scope: !16)
!142 = !DILocation(line: 1033, column: 21, scope: !16)
!143 = !DILocation(line: 1033, column: 24, scope: !16)
!144 = !DILocalVariable(name: "block", scope: !16, file: !1, line: 1034, type: !9)
!145 = !DILocation(line: 1034, column: 12, scope: !16)
!146 = !DILocation(line: 1034, column: 21, scope: !16)
!147 = !DILocation(line: 1034, column: 24, scope: !16)
!148 = !DILocalVariable(name: "ftab", scope: !16, file: !1, line: 1035, type: !56)
!149 = !DILocation(line: 1035, column: 12, scope: !16)
!150 = !DILocation(line: 1035, column: 21, scope: !16)
!151 = !DILocation(line: 1035, column: 24, scope: !16)
!152 = !DILocalVariable(name: "nblock", scope: !16, file: !1, line: 1036, type: !12)
!153 = !DILocation(line: 1036, column: 12, scope: !16)
