; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.DState = type { %struct.bz_stream*, i32, i8, i32, i8, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, [256 x i32], i32, [257 x i32], [257 x i32], i32*, i16*, i8*, i32, i32, i32, i32, i32, [256 x i8], [16 x i8], [256 x i8], [4096 x i8], [16 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !130, globals: !385)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib.c", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !24, !27, !30, !31, !28, !21, !103, !43, !26}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !22, line: 60, baseType: !23)
!22 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !22, line: 64, baseType: !26)
!26 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !22, line: 62, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !22, line: 59, baseType: !23)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "bzFile", file: !1, line: 904, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 895, size: 40832, align: 64, elements: !34)
!34 = !{!35, !97, !102, !104, !105, !128, !129}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !33, file: !1, line: 896, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 48, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !40, line: 245, size: 1728, align: 64, elements: !41)
!40 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!41 = !{!42, !44, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !65, !66, !67, !68, !72, !73, !75, !79, !82, !84, !85, !86, !87, !88, !92, !93}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !40, line: 246, baseType: !43, size: 32, align: 32)
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !39, file: !40, line: 251, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !39, file: !40, line: 252, baseType: !45, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !39, file: !40, line: 253, baseType: !45, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !39, file: !40, line: 254, baseType: !45, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !39, file: !40, line: 255, baseType: !45, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !39, file: !40, line: 256, baseType: !45, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !39, file: !40, line: 257, baseType: !45, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !39, file: !40, line: 258, baseType: !45, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !39, file: !40, line: 260, baseType: !45, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !39, file: !40, line: 261, baseType: !45, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !39, file: !40, line: 262, baseType: !45, size: 64, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !39, file: !40, line: 264, baseType: !58, size: 64, align: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !40, line: 160, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !59, file: !40, line: 161, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !59, file: !40, line: 162, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !59, file: !40, line: 166, baseType: !43, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !39, file: !40, line: 266, baseType: !63, size: 64, align: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !39, file: !40, line: 268, baseType: !43, size: 32, align: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !40, line: 272, baseType: !43, size: 32, align: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !39, file: !40, line: 274, baseType: !69, size: 64, align: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 131, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !39, file: !40, line: 278, baseType: !26, size: 16, align: 16, offset: 1024)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !39, file: !40, line: 279, baseType: !74, size: 8, align: 8, offset: 1040)
!74 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !39, file: !40, line: 280, baseType: !76, size: 8, align: 8, offset: 1048)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !40, line: 284, baseType: !80, size: 64, align: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !40, line: 154, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !40, line: 293, baseType: !83, size: 64, align: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 132, baseType: !71)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !39, file: !40, line: 302, baseType: !19, size: 64, align: 64, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !39, file: !40, line: 303, baseType: !19, size: 64, align: 64, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !39, file: !40, line: 304, baseType: !19, size: 64, align: 64, offset: 1344)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !39, file: !40, line: 305, baseType: !19, size: 64, align: 64, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !39, file: !40, line: 306, baseType: !89, size: 64, align: 64, offset: 1472)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 62, baseType: !91)
!90 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!91 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !39, file: !40, line: 308, baseType: !43, size: 32, align: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !39, file: !40, line: 310, baseType: !94, size: 160, align: 8, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !1, line: 897, baseType: !98, size: 40000, align: 8, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 40000, align: 8, elements: !100)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !22, line: 58, baseType: !46)
!100 = !{!101}
!101 = !DISubrange(count: 5000)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bufN", scope: !33, file: !1, line: 898, baseType: !103, size: 32, align: 32, offset: 40064)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !22, line: 61, baseType: !43)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !33, file: !1, line: 899, baseType: !30, size: 8, align: 8, offset: 40096)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !33, file: !1, line: 900, baseType: !106, size: 640, align: 64, offset: 40128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !107, line: 66, baseType: !108)
!107 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!108 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 49, size: 640, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !123, !127}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !108, file: !107, line: 50, baseType: !45, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !108, file: !107, line: 51, baseType: !29, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !108, file: !107, line: 52, baseType: !29, size: 32, align: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !108, file: !107, line: 53, baseType: !29, size: 32, align: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !108, file: !107, line: 55, baseType: !45, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !108, file: !107, line: 56, baseType: !29, size: 32, align: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !108, file: !107, line: 57, baseType: !29, size: 32, align: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !108, file: !107, line: 58, baseType: !29, size: 32, align: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !108, file: !107, line: 60, baseType: !19, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !108, file: !107, line: 62, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!19, !19, !43, !43}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !108, file: !107, line: 63, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !19, !19}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !108, file: !107, line: 64, baseType: !19, size: 64, align: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lastErr", scope: !33, file: !1, line: 901, baseType: !103, size: 32, align: 32, offset: 40768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "initialisedOk", scope: !33, file: !1, line: 902, baseType: !30, size: 8, align: 8, offset: 40800)
!130 = !{!131, !135, !139, !142, !145, !148, !152, !153, !154, !160, !163, !167, !170, !173, !176, !179, !183, !186, !189, !194, !197, !200, !203, !204, !207, !210, !213, !216, !219, !220, !283, !284, !287, !290, !291, !292, !293, !294, !378, !379, !382}
!131 = distinct !DISubprogram(name: "BZ2_bz__AssertH__fail", scope: !1, file: !1, line: 41, type: !132, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !43}
!134 = !{}
!135 = distinct !DISubprogram(name: "BZ2_bzCompressInit", scope: !1, file: !1, line: 150, type: !136, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!136 = !DISubroutineType(types: !137)
!137 = !{!43, !138, !43, !43, !43}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!139 = distinct !DISubprogram(name: "BZ2_bzCompress", scope: !1, file: !1, line: 409, type: !140, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!140 = !DISubroutineType(types: !141)
!141 = !{!43, !138, !43}
!142 = distinct !DISubprogram(name: "BZ2_bzCompressEnd", scope: !1, file: !1, line: 470, type: !143, isLocal: false, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!143 = !DISubroutineType(types: !144)
!144 = !{!43, !138}
!145 = distinct !DISubprogram(name: "BZ2_bzDecompressInit", scope: !1, file: !1, line: 494, type: !146, isLocal: false, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!146 = !DISubroutineType(types: !147)
!147 = !{!43, !138, !43, !43}
!148 = distinct !DISubprogram(name: "BZ2_indexIntoF", scope: !1, file: !1, line: 689, type: !149, isLocal: false, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!149 = !DISubroutineType(types: !150)
!150 = !{!103, !103, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!152 = distinct !DISubprogram(name: "BZ2_bzDecompress", scope: !1, file: !1, line: 810, type: !143, isLocal: false, isDefinition: true, scopeLine: 811, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!153 = distinct !DISubprogram(name: "BZ2_bzDecompressEnd", scope: !1, file: !1, line: 864, type: !143, isLocal: false, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!154 = distinct !DISubprogram(name: "BZ2_bzWriteOpen", scope: !1, file: !1, line: 918, type: !155, isLocal: false, isDefinition: true, scopeLine: 924, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !159, !36, !43, !43, !43}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BZFILE", file: !107, line: 137, baseType: null)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!160 = distinct !DISubprogram(name: "BZ2_bzWrite", scope: !1, file: !1, line: 966, type: !161, isLocal: false, isDefinition: true, scopeLine: 971, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !159, !157, !19, !43}
!163 = distinct !DISubprogram(name: "BZ2_bzWriteClose", scope: !1, file: !1, line: 1011, type: !164, isLocal: false, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !159, !157, !43, !166, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!167 = distinct !DISubprogram(name: "BZ2_bzWriteClose64", scope: !1, file: !1, line: 1023, type: !168, isLocal: false, isDefinition: true, scopeLine: 1031, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !159, !157, !43, !166, !166, !166, !166}
!170 = distinct !DISubprogram(name: "BZ2_bzReadOpen", scope: !1, file: !1, line: 1089, type: !171, isLocal: false, isDefinition: true, scopeLine: 1096, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!171 = !DISubroutineType(types: !172)
!172 = !{!157, !159, !36, !43, !43, !19, !43}
!173 = distinct !DISubprogram(name: "BZ2_bzReadClose", scope: !1, file: !1, line: 1145, type: !174, isLocal: false, isDefinition: true, scopeLine: 1146, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !159, !157}
!176 = distinct !DISubprogram(name: "BZ2_bzRead", scope: !1, file: !1, line: 1163, type: !177, isLocal: false, isDefinition: true, scopeLine: 1168, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!177 = !DISubroutineType(types: !178)
!178 = !{!43, !159, !157, !19, !43}
!179 = distinct !DISubprogram(name: "BZ2_bzReadGetUnused", scope: !1, file: !1, line: 1223, type: !180, isLocal: false, isDefinition: true, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !159, !157, !182, !159}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!183 = distinct !DISubprogram(name: "BZ2_bzBuffToBuffCompress", scope: !1, file: !1, line: 1249, type: !184, isLocal: false, isDefinition: true, scopeLine: 1257, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!184 = !DISubroutineType(types: !185)
!185 = !{!43, !45, !166, !45, !29, !43, !43, !43}
!186 = distinct !DISubprogram(name: "BZ2_bzBuffToBuffDecompress", scope: !1, file: !1, line: 1301, type: !187, isLocal: false, isDefinition: true, scopeLine: 1308, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!187 = !DISubroutineType(types: !188)
!188 = !{!43, !45, !166, !45, !29, !43, !43}
!189 = distinct !DISubprogram(name: "BZ2_bzlibVersion", scope: !1, file: !1, line: 1368, type: !190, isLocal: false, isDefinition: true, scopeLine: 1369, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!190 = !DISubroutineType(types: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!194 = distinct !DISubprogram(name: "BZ2_bzopen", scope: !1, file: !1, line: 1462, type: !195, isLocal: false, isDefinition: true, scopeLine: 1465, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!195 = !DISubroutineType(types: !196)
!196 = !{!157, !192, !192}
!197 = distinct !DISubprogram(name: "BZ2_bzdopen", scope: !1, file: !1, line: 1471, type: !198, isLocal: false, isDefinition: true, scopeLine: 1474, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!198 = !DISubroutineType(types: !199)
!199 = !{!157, !43, !192}
!200 = distinct !DISubprogram(name: "BZ2_bzread", scope: !1, file: !1, line: 1480, type: !201, isLocal: false, isDefinition: true, scopeLine: 1481, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!201 = !DISubroutineType(types: !202)
!202 = !{!43, !157, !19, !43}
!203 = distinct !DISubprogram(name: "BZ2_bzwrite", scope: !1, file: !1, line: 1494, type: !201, isLocal: false, isDefinition: true, scopeLine: 1495, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!204 = distinct !DISubprogram(name: "BZ2_bzflush", scope: !1, file: !1, line: 1508, type: !205, isLocal: false, isDefinition: true, scopeLine: 1509, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!205 = !DISubroutineType(types: !206)
!206 = !{!43, !157}
!207 = distinct !DISubprogram(name: "BZ2_bzclose", scope: !1, file: !1, line: 1517, type: !208, isLocal: false, isDefinition: true, scopeLine: 1518, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !157}
!210 = distinct !DISubprogram(name: "BZ2_bzerror", scope: !1, file: !1, line: 1562, type: !211, isLocal: false, isDefinition: true, scopeLine: 1563, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!211 = !DISubroutineType(types: !212)
!212 = !{!192, !157, !159}
!213 = distinct !DISubprogram(name: "bz_config_ok", scope: !1, file: !1, line: 91, type: !214, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!214 = !DISubroutineType(types: !215)
!215 = !{!43}
!216 = distinct !DISubprogram(name: "default_bzalloc", scope: !1, file: !1, line: 102, type: !217, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!217 = !DISubroutineType(types: !218)
!218 = !{!19, !19, !103, !103}
!219 = distinct !DISubprogram(name: "default_bzfree", scope: !1, file: !1, line: 110, type: !125, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!220 = distinct !DISubprogram(name: "init_RL", scope: !1, file: !1, line: 133, type: !221, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !22, line: 283, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 214, size: 446144, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !267, !271, !272, !276, !278, !279}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !225, file: !22, line: 216, baseType: !138, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !225, file: !22, line: 220, baseType: !103, size: 32, align: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !225, file: !22, line: 221, baseType: !103, size: 32, align: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !225, file: !22, line: 224, baseType: !28, size: 32, align: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !225, file: !22, line: 227, baseType: !27, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !225, file: !22, line: 228, baseType: !27, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !225, file: !22, line: 229, baseType: !27, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !225, file: !22, line: 230, baseType: !103, size: 32, align: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !225, file: !22, line: 233, baseType: !27, size: 64, align: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !225, file: !22, line: 234, baseType: !20, size: 64, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !225, file: !22, line: 235, baseType: !24, size: 64, align: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !225, file: !22, line: 236, baseType: !20, size: 64, align: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !225, file: !22, line: 239, baseType: !103, size: 32, align: 32, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !225, file: !22, line: 242, baseType: !28, size: 32, align: 32, offset: 736)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !225, file: !22, line: 243, baseType: !103, size: 32, align: 32, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !225, file: !22, line: 244, baseType: !103, size: 32, align: 32, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !225, file: !22, line: 244, baseType: !103, size: 32, align: 32, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !225, file: !22, line: 247, baseType: !103, size: 32, align: 32, offset: 864)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !225, file: !22, line: 248, baseType: !103, size: 32, align: 32, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !225, file: !22, line: 249, baseType: !103, size: 32, align: 32, offset: 928)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !225, file: !22, line: 250, baseType: !103, size: 32, align: 32, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !225, file: !22, line: 253, baseType: !103, size: 32, align: 32, offset: 992)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !225, file: !22, line: 254, baseType: !250, size: 2048, align: 8, offset: 1024)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, align: 8, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !225, file: !22, line: 255, baseType: !254, size: 2048, align: 8, offset: 3072)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, align: 8, elements: !251)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !225, file: !22, line: 258, baseType: !28, size: 32, align: 32, offset: 5120)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !225, file: !22, line: 259, baseType: !103, size: 32, align: 32, offset: 5152)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !225, file: !22, line: 262, baseType: !28, size: 32, align: 32, offset: 5184)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !225, file: !22, line: 263, baseType: !28, size: 32, align: 32, offset: 5216)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !225, file: !22, line: 266, baseType: !103, size: 32, align: 32, offset: 5248)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !225, file: !22, line: 267, baseType: !103, size: 32, align: 32, offset: 5280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !225, file: !22, line: 268, baseType: !103, size: 32, align: 32, offset: 5312)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !225, file: !22, line: 271, baseType: !103, size: 32, align: 32, offset: 5344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !225, file: !22, line: 272, baseType: !264, size: 8256, align: 32, offset: 5376)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8256, align: 32, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 258)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !225, file: !22, line: 273, baseType: !268, size: 144016, align: 8, offset: 13632)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 144016, align: 8, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 18002)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !225, file: !22, line: 274, baseType: !268, size: 144016, align: 8, offset: 157648)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !225, file: !22, line: 276, baseType: !273, size: 12384, align: 8, offset: 301664)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 12384, align: 8, elements: !274)
!274 = !{!275, !266}
!275 = !DISubrange(count: 6)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !225, file: !22, line: 277, baseType: !277, size: 49536, align: 32, offset: 314048)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 49536, align: 32, elements: !274)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !225, file: !22, line: 278, baseType: !277, size: 49536, align: 32, offset: 363584)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !225, file: !22, line: 280, baseType: !280, size: 33024, align: 32, offset: 413120)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 33024, align: 32, elements: !281)
!281 = !{!266, !282}
!282 = !DISubrange(count: 4)
!283 = distinct !DISubprogram(name: "prepare_new_block", scope: !1, file: !1, line: 119, type: !221, isLocal: true, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!284 = distinct !DISubprogram(name: "handle_compress", scope: !1, file: !1, line: 363, type: !285, isLocal: true, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!285 = !DISubroutineType(types: !286)
!286 = !{!30, !138}
!287 = distinct !DISubprogram(name: "copy_output_until_stop", scope: !1, file: !1, line: 336, type: !288, isLocal: true, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!288 = !DISubroutineType(types: !289)
!289 = !{!30, !223}
!290 = distinct !DISubprogram(name: "copy_input_until_stop", scope: !1, file: !1, line: 291, type: !288, isLocal: true, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!291 = distinct !DISubprogram(name: "add_pair_to_block", scope: !1, file: !1, line: 218, type: !221, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!292 = distinct !DISubprogram(name: "flush_RL", scope: !1, file: !1, line: 254, type: !221, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!293 = distinct !DISubprogram(name: "isempty_RL", scope: !1, file: !1, line: 141, type: !288, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!294 = distinct !DISubprogram(name: "unRLE_obuf_to_output_SMALL", scope: !1, file: !1, line: 708, type: !295, isLocal: true, isDefinition: true, scopeLine: 709, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!295 = !DISubroutineType(types: !296)
!296 = !{!30, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "DState", file: !22, line: 455, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 365, size: 513152, align: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !319, !320, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !343, !345, !346, !347, !348, !349, !350, !351, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !299, file: !22, line: 367, baseType: !138, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !22, line: 370, baseType: !103, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_ch", scope: !299, file: !22, line: 373, baseType: !21, size: 8, align: 8, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_len", scope: !299, file: !22, line: 374, baseType: !103, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "blockRandomised", scope: !299, file: !22, line: 375, baseType: !30, size: 8, align: 8, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !299, file: !22, line: 376, baseType: !103, size: 32, align: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !299, file: !22, line: 376, baseType: !103, size: 32, align: 32, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !299, file: !22, line: 379, baseType: !28, size: 32, align: 32, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !299, file: !22, line: 380, baseType: !103, size: 32, align: 32, offset: 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !299, file: !22, line: 383, baseType: !103, size: 32, align: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "smallDecompress", scope: !299, file: !22, line: 384, baseType: !30, size: 8, align: 8, offset: 352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "currBlockNo", scope: !299, file: !22, line: 385, baseType: !103, size: 32, align: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !299, file: !22, line: 386, baseType: !103, size: 32, align: 32, offset: 416)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !299, file: !22, line: 389, baseType: !103, size: 32, align: 32, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tPos", scope: !299, file: !22, line: 390, baseType: !28, size: 32, align: 32, offset: 480)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !299, file: !22, line: 391, baseType: !103, size: 32, align: 32, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "unzftab", scope: !299, file: !22, line: 392, baseType: !318, size: 8192, align: 32, offset: 544)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, align: 32, elements: !251)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nblock_used", scope: !299, file: !22, line: 393, baseType: !103, size: 32, align: 32, offset: 8736)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cftab", scope: !299, file: !22, line: 394, baseType: !321, size: 8224, align: 32, offset: 8768)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8224, align: 32, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 257)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cftabCopy", scope: !299, file: !22, line: 395, baseType: !321, size: 8224, align: 32, offset: 16992)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !299, file: !22, line: 398, baseType: !27, size: 64, align: 64, offset: 25216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ll16", scope: !299, file: !22, line: 401, baseType: !24, size: 64, align: 64, offset: 25280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ll4", scope: !299, file: !22, line: 402, baseType: !20, size: 64, align: 64, offset: 25344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "storedBlockCRC", scope: !299, file: !22, line: 405, baseType: !28, size: 32, align: 32, offset: 25408)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "storedCombinedCRC", scope: !299, file: !22, line: 406, baseType: !28, size: 32, align: 32, offset: 25440)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedBlockCRC", scope: !299, file: !22, line: 407, baseType: !28, size: 32, align: 32, offset: 25472)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedCombinedCRC", scope: !299, file: !22, line: 408, baseType: !28, size: 32, align: 32, offset: 25504)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !299, file: !22, line: 411, baseType: !103, size: 32, align: 32, offset: 25536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !299, file: !22, line: 412, baseType: !250, size: 2048, align: 8, offset: 25568)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "inUse16", scope: !299, file: !22, line: 413, baseType: !335, size: 128, align: 8, offset: 27616)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, align: 8, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "seqToUnseq", scope: !299, file: !22, line: 414, baseType: !254, size: 2048, align: 8, offset: 27744)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mtfa", scope: !299, file: !22, line: 417, baseType: !340, size: 32768, align: 8, offset: 29792)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32768, align: 8, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 4096)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mtfbase", scope: !299, file: !22, line: 418, baseType: !344, size: 512, align: 32, offset: 62560)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, align: 32, elements: !336)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !299, file: !22, line: 419, baseType: !268, size: 144016, align: 8, offset: 63072)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !299, file: !22, line: 420, baseType: !268, size: 144016, align: 8, offset: 207088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !299, file: !22, line: 421, baseType: !273, size: 12384, align: 8, offset: 351104)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !299, file: !22, line: 423, baseType: !277, size: 49536, align: 32, offset: 363488)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !299, file: !22, line: 424, baseType: !277, size: 49536, align: 32, offset: 413024)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !299, file: !22, line: 425, baseType: !277, size: 49536, align: 32, offset: 462560)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "minLens", scope: !299, file: !22, line: 426, baseType: !352, size: 192, align: 32, offset: 512096)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 192, align: 32, elements: !353)
!353 = !{!275}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "save_i", scope: !299, file: !22, line: 429, baseType: !103, size: 32, align: 32, offset: 512288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "save_j", scope: !299, file: !22, line: 430, baseType: !103, size: 32, align: 32, offset: 512320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "save_t", scope: !299, file: !22, line: 431, baseType: !103, size: 32, align: 32, offset: 512352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "save_alphaSize", scope: !299, file: !22, line: 432, baseType: !103, size: 32, align: 32, offset: 512384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "save_nGroups", scope: !299, file: !22, line: 433, baseType: !103, size: 32, align: 32, offset: 512416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "save_nSelectors", scope: !299, file: !22, line: 434, baseType: !103, size: 32, align: 32, offset: 512448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "save_EOB", scope: !299, file: !22, line: 435, baseType: !103, size: 32, align: 32, offset: 512480)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupNo", scope: !299, file: !22, line: 436, baseType: !103, size: 32, align: 32, offset: 512512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupPos", scope: !299, file: !22, line: 437, baseType: !103, size: 32, align: 32, offset: 512544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "save_nextSym", scope: !299, file: !22, line: 438, baseType: !103, size: 32, align: 32, offset: 512576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblockMAX", scope: !299, file: !22, line: 439, baseType: !103, size: 32, align: 32, offset: 512608)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblock", scope: !299, file: !22, line: 440, baseType: !103, size: 32, align: 32, offset: 512640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "save_es", scope: !299, file: !22, line: 441, baseType: !103, size: 32, align: 32, offset: 512672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "save_N", scope: !299, file: !22, line: 442, baseType: !103, size: 32, align: 32, offset: 512704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "save_curr", scope: !299, file: !22, line: 443, baseType: !103, size: 32, align: 32, offset: 512736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "save_zt", scope: !299, file: !22, line: 444, baseType: !103, size: 32, align: 32, offset: 512768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "save_zn", scope: !299, file: !22, line: 445, baseType: !103, size: 32, align: 32, offset: 512800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "save_zvec", scope: !299, file: !22, line: 446, baseType: !103, size: 32, align: 32, offset: 512832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "save_zj", scope: !299, file: !22, line: 447, baseType: !103, size: 32, align: 32, offset: 512864)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "save_gSel", scope: !299, file: !22, line: 448, baseType: !103, size: 32, align: 32, offset: 512896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "save_gMinlen", scope: !299, file: !22, line: 449, baseType: !103, size: 32, align: 32, offset: 512928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "save_gLimit", scope: !299, file: !22, line: 450, baseType: !151, size: 64, align: 64, offset: 512960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "save_gBase", scope: !299, file: !22, line: 451, baseType: !151, size: 64, align: 64, offset: 513024)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "save_gPerm", scope: !299, file: !22, line: 452, baseType: !151, size: 64, align: 64, offset: 513088)
!378 = distinct !DISubprogram(name: "unRLE_obuf_to_output_FAST", scope: !1, file: !1, line: 538, type: !295, isLocal: true, isDefinition: true, scopeLine: 539, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!379 = distinct !DISubprogram(name: "myfeof", scope: !1, file: !1, line: 908, type: !380, isLocal: true, isDefinition: true, scopeLine: 909, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!380 = !DISubroutineType(types: !381)
!381 = !{!30, !36}
!382 = distinct !DISubprogram(name: "bzopen_or_bzdopen", scope: !1, file: !1, line: 1385, type: !383, isLocal: true, isDefinition: true, scopeLine: 1390, flags: DIFlagPrototyped, isOptimized: false, variables: !134)
!383 = !DISubroutineType(types: !384)
!384 = !{!157, !192, !43, !192, !43}
!385 = !{!386}
!386 = !DIGlobalVariable(name: "bzerrorstrings", scope: !0, file: !1, line: 1542, type: !387, isLocal: true, isDefinition: true, variable: [16 x i8*]* @bzerrorstrings)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 1024, align: 64, elements: !336)
!388 = !{i32 2, !"Dwarf Version", i32 4}
!389 = !{i32 2, !"Debug Info Version", i32 3}
!390 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!391 = !DILocalVariable(name: "errcode", arg: 1, scope: !131, file: !1, line: 41, type: !43)
!392 = !DIExpression()
!393 = !DILocation(line: 41, column: 34, scope: !131)
!394 = !DILocation(line: 43, column: 12, scope: !131)
!395 = !DILocation(line: 52, column: 7, scope: !131)
!396 = !DILocation(line: 53, column: 7, scope: !131)
!397 = !DILocation(line: 43, column: 4, scope: !131)
!398 = !DILocation(line: 56, column: 8, scope: !399)
!399 = distinct !DILexicalBlock(scope: !131, file: !1, line: 56, column: 8)
!400 = !DILocation(line: 56, column: 16, scope: !399)
!401 = !DILocation(line: 56, column: 8, scope: !131)
!402 = !DILocation(line: 57, column: 12, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !1, line: 56, column: 25)
!404 = !DILocation(line: 57, column: 4, scope: !403)
!405 = !DILocation(line: 82, column: 4, scope: !403)
!406 = !DILocation(line: 84, column: 4, scope: !131)
!407 = !DILocation(line: 85, column: 1, scope: !131)
!408 = !DILocation(line: 1370, column: 4, scope: !189)
!409 = !DILocalVariable(name: "strm", arg: 1, scope: !135, file: !1, line: 151, type: !138)
!410 = !DILocation(line: 151, column: 34, scope: !135)
!411 = !DILocalVariable(name: "blockSize100k", arg: 2, scope: !135, file: !1, line: 152, type: !43)
!412 = !DILocation(line: 152, column: 33, scope: !135)
!413 = !DILocalVariable(name: "verbosity", arg: 3, scope: !135, file: !1, line: 153, type: !43)
!414 = !DILocation(line: 153, column: 33, scope: !135)
!415 = !DILocalVariable(name: "workFactor", arg: 4, scope: !135, file: !1, line: 154, type: !43)
!416 = !DILocation(line: 154, column: 33, scope: !135)
!417 = !DILocalVariable(name: "n", scope: !135, file: !1, line: 156, type: !103)
!418 = !DILocation(line: 156, column: 12, scope: !135)
!419 = !DILocalVariable(name: "s", scope: !135, file: !1, line: 157, type: !223)
!420 = !DILocation(line: 157, column: 12, scope: !135)
!421 = !DILocation(line: 159, column: 9, scope: !422)
!422 = distinct !DILexicalBlock(scope: !135, file: !1, line: 159, column: 8)
!423 = !DILocation(line: 159, column: 8, scope: !135)
!424 = !DILocation(line: 159, column: 25, scope: !425)
!425 = !DILexicalBlockFile(scope: !422, file: !1, discriminator: 1)
!426 = !DILocation(line: 161, column: 8, scope: !427)
!427 = distinct !DILexicalBlock(scope: !135, file: !1, line: 161, column: 8)
!428 = !DILocation(line: 161, column: 13, scope: !427)
!429 = !DILocation(line: 161, column: 21, scope: !427)
!430 = !DILocation(line: 162, column: 8, scope: !427)
!431 = !DILocation(line: 162, column: 22, scope: !427)
!432 = !DILocation(line: 162, column: 26, scope: !427)
!433 = !DILocation(line: 162, column: 29, scope: !434)
