; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmbzip2/compress.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [62 x i8] c"    block %d: crc = 0x%08x, combined CRC = 0x%08x, size = %d\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"    final combined CRC = 0x%08x\0A   \00", align 1
@.str.2 = private unnamed_addr constant [64 x i8] c"      %d in block, %d after MTF & 1-2 coding, %d+2 syms in use\0A\00", align 1
@.str.3 = private unnamed_addr constant [59 x i8] c"      initial group %d, [%d .. %d], has %d syms (%4.1f%%)\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !12)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/compress.c", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!2 = !{}
!3 = !{!4, !5, !8, !10, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !6, line: 60, baseType: !7)
!6 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib_private.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !6, line: 62, baseType: !9)
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !6, line: 59, baseType: !7)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !{!13, !108, !111, !114, !117, !120, !121, !122, !123}
!13 = distinct !DISubprogram(name: "BZ2_bsInitWrite", scope: !1, file: !1, line: 37, type: !14, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!14 = !DISubroutineType(types: !15)
!15 = !{null, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !6, line: 283, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 214, size: 446144, align: 64, elements: !19)
!19 = !{!20, !48, !50, !51, !52, !54, !55, !56, !57, !58, !59, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !92, !96, !97, !101, !103, !104}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !18, file: !6, line: 216, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !23, line: 66, baseType: !24)
!23 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmbzip2/bzlib.h", directory: "/data/download/cmake/cmake-master/Utilities/cmbzip2")
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 49, size: 640, align: 64, elements: !25)
!25 = !{!26, !29, !30, !31, !32, !33, !34, !35, !36, !38, !43, !47}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !24, file: !23, line: 50, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !24, file: !23, line: 51, baseType: !9, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !24, file: !23, line: 52, baseType: !9, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !24, file: !23, line: 53, baseType: !9, size: 32, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !24, file: !23, line: 55, baseType: !27, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !24, file: !23, line: 56, baseType: !9, size: 32, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !24, file: !23, line: 57, baseType: !9, size: 32, align: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !24, file: !23, line: 58, baseType: !9, size: 32, align: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !24, file: !23, line: 60, baseType: !37, size: 64, align: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !24, file: !23, line: 62, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!37, !37, !42, !42}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !24, file: !23, line: 63, baseType: !44, size: 64, align: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !37, !37}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !24, file: !23, line: 64, baseType: !37, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !18, file: !6, line: 220, baseType: !49, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !6, line: 61, baseType: !42)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !6, line: 221, baseType: !49, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !18, file: !6, line: 224, baseType: !8, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !18, file: !6, line: 227, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !18, file: !6, line: 228, baseType: !53, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !18, file: !6, line: 229, baseType: !53, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !18, file: !6, line: 230, baseType: !49, size: 32, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, file: !6, line: 233, baseType: !53, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !18, file: !6, line: 234, baseType: !4, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !18, file: !6, line: 235, baseType: !60, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !6, line: 64, baseType: !62)
!62 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !18, file: !6, line: 236, baseType: !4, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !18, file: !6, line: 239, baseType: !49, size: 32, align: 32, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !18, file: !6, line: 242, baseType: !8, size: 32, align: 32, offset: 736)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !18, file: !6, line: 243, baseType: !49, size: 32, align: 32, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !18, file: !6, line: 244, baseType: !49, size: 32, align: 32, offset: 800)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !18, file: !6, line: 244, baseType: !49, size: 32, align: 32, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !18, file: !6, line: 247, baseType: !49, size: 32, align: 32, offset: 864)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !18, file: !6, line: 248, baseType: !49, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !18, file: !6, line: 249, baseType: !49, size: 32, align: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !18, file: !6, line: 250, baseType: !49, size: 32, align: 32, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !18, file: !6, line: 253, baseType: !49, size: 32, align: 32, offset: 992)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !18, file: !6, line: 254, baseType: !75, size: 2048, align: 8, offset: 1024)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !18, file: !6, line: 255, baseType: !79, size: 2048, align: 8, offset: 3072)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 2048, align: 8, elements: !76)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !18, file: !6, line: 258, baseType: !8, size: 32, align: 32, offset: 5120)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !18, file: !6, line: 259, baseType: !49, size: 32, align: 32, offset: 5152)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !18, file: !6, line: 262, baseType: !8, size: 32, align: 32, offset: 5184)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !18, file: !6, line: 263, baseType: !8, size: 32, align: 32, offset: 5216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !18, file: !6, line: 266, baseType: !49, size: 32, align: 32, offset: 5248)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !18, file: !6, line: 267, baseType: !49, size: 32, align: 32, offset: 5280)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !18, file: !6, line: 268, baseType: !49, size: 32, align: 32, offset: 5312)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !18, file: !6, line: 271, baseType: !49, size: 32, align: 32, offset: 5344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !18, file: !6, line: 272, baseType: !89, size: 8256, align: 32, offset: 5376)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8256, align: 32, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 258)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !18, file: !6, line: 273, baseType: !93, size: 144016, align: 8, offset: 13632)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 144016, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 18002)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !18, file: !6, line: 274, baseType: !93, size: 144016, align: 8, offset: 157648)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !18, file: !6, line: 276, baseType: !98, size: 12384, align: 8, offset: 301664)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 12384, align: 8, elements: !99)
!99 = !{!100, !91}
!100 = !DISubrange(count: 6)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !18, file: !6, line: 277, baseType: !102, size: 49536, align: 32, offset: 314048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 49536, align: 32, elements: !99)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !18, file: !6, line: 278, baseType: !102, size: 49536, align: 32, offset: 363584)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !18, file: !6, line: 280, baseType: !105, size: 33024, align: 32, offset: 413120)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 33024, align: 32, elements: !106)
!106 = !{!91, !107}
!107 = !DISubrange(count: 4)
!108 = distinct !DISubprogram(name: "BZ2_compressBlock", scope: !1, file: !1, line: 602, type: !109, isLocal: false, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !16, !10}
!111 = distinct !DISubprogram(name: "bsPutUChar", scope: !1, file: !1, line: 94, type: !112, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !16, !5}
!114 = distinct !DISubprogram(name: "bsPutUInt32", scope: !1, file: !1, line: 83, type: !115, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !16, !8}
!117 = distinct !DISubprogram(name: "bsW", scope: !1, file: !1, line: 73, type: !118, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !16, !49, !8}
!120 = distinct !DISubprogram(name: "generateMTFValues", scope: !1, file: !1, line: 120, type: !14, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!121 = distinct !DISubprogram(name: "makeMaps_e", scope: !1, file: !1, line: 106, type: !14, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!122 = distinct !DISubprogram(name: "sendMTFValues", scope: !1, file: !1, line: 239, type: !14, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!123 = distinct !DISubprogram(name: "bsFinishWrite", scope: !1, file: !1, line: 46, type: !14, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!124 = !{i32 2, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!127 = !DILocalVariable(name: "s", arg: 1, scope: !13, file: !1, line: 37, type: !16)
!128 = !DIExpression()
!129 = !DILocation(line: 37, column: 32, scope: !13)
!130 = !DILocation(line: 39, column: 4, scope: !13)
!131 = !DILocation(line: 39, column: 7, scope: !13)
!132 = !DILocation(line: 39, column: 14, scope: !13)
!133 = !DILocation(line: 40, column: 4, scope: !13)
!134 = !DILocation(line: 40, column: 7, scope: !13)
!135 = !DILocation(line: 40, column: 14, scope: !13)
!136 = !DILocation(line: 41, column: 1, scope: !13)
!137 = !DILocalVariable(name: "s", arg: 1, scope: !108, file: !1, line: 602, type: !16)
!138 = !DILocation(line: 602, column: 34, scope: !108)
!139 = !DILocalVariable(name: "is_last_block", arg: 2, scope: !108, file: !1, line: 602, type: !10)
!140 = !DILocation(line: 602, column: 42, scope: !108)
!141 = !DILocation(line: 604, column: 8, scope: !142)
!142 = distinct !DILexicalBlock(scope: !108, file: !1, line: 604, column: 8)
!143 = !DILocation(line: 604, column: 11, scope: !142)
!144 = !DILocation(line: 604, column: 18, scope: !142)
!145 = !DILocation(line: 604, column: 8, scope: !108)
!146 = !DILocation(line: 606, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !1, line: 606, column: 7)
!148 = distinct !DILexicalBlock(scope: !142, file: !1, line: 604, column: 23)
!149 = !DILocation(line: 607, column: 25, scope: !148)
!150 = !DILocation(line: 607, column: 28, scope: !148)
!151 = !DILocation(line: 607, column: 40, scope: !148)
!152 = !DILocation(line: 607, column: 49, scope: !148)
!153 = !DILocation(line: 607, column: 52, scope: !148)
!154 = !DILocation(line: 607, column: 64, scope: !148)
