; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/async.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !33, subprograms: !249, globals: !277)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/async.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 184, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "UV_UNKNOWN_HANDLE", value: 0)
!7 = !DIEnumerator(name: "UV_ASYNC", value: 1)
!8 = !DIEnumerator(name: "UV_CHECK", value: 2)
!9 = !DIEnumerator(name: "UV_FS_EVENT", value: 3)
!10 = !DIEnumerator(name: "UV_FS_POLL", value: 4)
!11 = !DIEnumerator(name: "UV_HANDLE", value: 5)
!12 = !DIEnumerator(name: "UV_IDLE", value: 6)
!13 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!14 = !DIEnumerator(name: "UV_POLL", value: 8)
!15 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!16 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!17 = !DIEnumerator(name: "UV_STREAM", value: 11)
!18 = !DIEnumerator(name: "UV_TCP", value: 12)
!19 = !DIEnumerator(name: "UV_TIMER", value: 13)
!20 = !DIEnumerator(name: "UV_TTY", value: 14)
!21 = !DIEnumerator(name: "UV_UDP", value: 15)
!22 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!23 = !DIEnumerator(name: "UV_FILE", value: 17)
!24 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "UV__SIGNAL_ONE_SHOT", value: 524288)
!29 = !DIEnumerator(name: "UV__HANDLE_INTERNAL", value: 32768)
!30 = !DIEnumerator(name: "UV__HANDLE_ACTIVE", value: 16384)
!31 = !DIEnumerator(name: "UV__HANDLE_REF", value: 8192)
!32 = !DIEnumerator(name: "UV__HANDLE_CLOSING", value: 0)
!33 = !{!34, !240, !244, !246, !142, !248, !39}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !37)
!37 = !{!38, !40, !230, !231, !232, !233, !238, !239}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !4, line: 426, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !36, file: !4, line: 426, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !44)
!44 = !{!45, !46, !48, !52, !53, !54, !56, !58, !59, !60, !79, !80, !81, !82, !113, !145, !169, !170, !171, !172, !173, !174, !175, !179, !180, !181, !186, !189, !190, !192, !193, !226, !227, !228, !229}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !4, line: 1475, baseType: !39, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !43, file: !4, line: 1477, baseType: !47, size: 32, align: 32, offset: 64)
!47 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !43, file: !4, line: 1478, baseType: !49, size: 128, align: 64, offset: 128)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, align: 64, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 2)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !43, file: !4, line: 1479, baseType: !49, size: 128, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !43, file: !4, line: 1481, baseType: !47, size: 32, align: 32, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !43, file: !4, line: 1482, baseType: !55, size: 64, align: 64, offset: 448)
!55 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !43, file: !4, line: 1482, baseType: !57, size: 32, align: 32, offset: 512)
!57 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !43, file: !4, line: 1482, baseType: !61, size: 64, align: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !64, line: 87, baseType: !65)
!64 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !64, line: 89, size: 448, align: 64, elements: !66)
!66 = !{!67, !74, !75, !76, !77, !78}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !65, file: !64, line: 90, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !64, line: 84, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !73, !47}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !65, file: !64, line: 91, baseType: !49, size: 128, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !65, file: !64, line: 92, baseType: !49, size: 128, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !65, file: !64, line: 93, baseType: !47, size: 32, align: 32, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !65, file: !64, line: 94, baseType: !47, size: 32, align: 32, offset: 352)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !65, file: !64, line: 95, baseType: !57, size: 32, align: 32, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !43, file: !4, line: 1482, baseType: !47, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !43, file: !4, line: 1482, baseType: !47, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !43, file: !4, line: 1482, baseType: !83, size: 320, align: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !64, line: 129, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !85, line: 127, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!86 = !DICompositeType(tag: DW_TAG_union_type, file: !85, line: 90, size: 320, align: 64, elements: !87)
!87 = !{!88, !106, !111}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !86, file: !85, line: 124, baseType: !89, size: 320, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !85, line: 92, size: 320, align: 64, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !98, !99}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !89, file: !85, line: 94, baseType: !57, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !89, file: !85, line: 95, baseType: !47, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !89, file: !85, line: 96, baseType: !57, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !89, file: !85, line: 98, baseType: !47, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !89, file: !85, line: 102, baseType: !57, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !89, file: !85, line: 104, baseType: !97, size: 16, align: 16, offset: 160)
!97 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !89, file: !85, line: 105, baseType: !97, size: 16, align: 16, offset: 176)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !89, file: !85, line: 106, baseType: !100, size: 128, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !85, line: 79, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !85, line: 75, size: 128, align: 64, elements: !102)
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !101, file: !85, line: 77, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !101, file: !85, line: 78, baseType: !104, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !86, file: !85, line: 125, baseType: !107, size: 320, align: 8)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 320, align: 8, elements: !109)
!108 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!109 = !{!110}
!110 = !DISubrange(count: 40)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !86, file: !85, line: 126, baseType: !112, size: 64, align: 64)
!112 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !43, file: !4, line: 1482, baseType: !114, size: 1024, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !116)
!116 = !{!117, !118, !119, !121, !126, !127, !135, !136, !137, !143, !144}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !4, line: 768, baseType: !39, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !115, file: !4, line: 768, baseType: !41, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !4, line: 768, baseType: !120, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !115, file: !4, line: 768, baseType: !122, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !34}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !115, file: !4, line: 768, baseType: !49, size: 128, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !115, file: !4, line: 768, baseType: !128, size: 256, align: 64, offset: 384)
!128 = !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !4, line: 768, size: 256, align: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !128, file: !4, line: 768, baseType: !57, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !128, file: !4, line: 768, baseType: !132, size: 256, align: 64)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, align: 64, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 4)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !115, file: !4, line: 768, baseType: !34, size: 64, align: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !4, line: 768, baseType: !47, size: 32, align: 32, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !115, file: !4, line: 769, baseType: !138, size: 64, align: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !115, file: !4, line: 769, baseType: !49, size: 128, align: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !115, file: !4, line: 769, baseType: !57, size: 32, align: 32, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !43, file: !4, line: 1482, baseType: !146, size: 448, align: 64, offset: 2432)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !64, line: 130, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !85, line: 213, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_union_type, file: !85, line: 173, size: 448, align: 64, elements: !149)
!149 = !{!150, !164, !168}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !148, file: !85, line: 192, baseType: !151, size: 448, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !85, line: 176, size: 448, align: 64, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !151, file: !85, line: 178, baseType: !57, size: 32, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !151, file: !85, line: 179, baseType: !47, size: 32, align: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !151, file: !85, line: 180, baseType: !47, size: 32, align: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !151, file: !85, line: 181, baseType: !47, size: 32, align: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !151, file: !85, line: 182, baseType: !47, size: 32, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !151, file: !85, line: 183, baseType: !47, size: 32, align: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !151, file: !85, line: 184, baseType: !57, size: 32, align: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !151, file: !85, line: 185, baseType: !57, size: 32, align: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !151, file: !85, line: 186, baseType: !55, size: 64, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !151, file: !85, line: 187, baseType: !55, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !151, file: !85, line: 190, baseType: !47, size: 32, align: 32, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !148, file: !85, line: 211, baseType: !165, size: 448, align: 8)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 448, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 56)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !148, file: !85, line: 212, baseType: !112, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !43, file: !4, line: 1482, baseType: !34, size: 64, align: 64, offset: 2880)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 2944)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 3072)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 3200)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 3328)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !43, file: !4, line: 1482, baseType: !49, size: 128, align: 64, offset: 3456)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !43, file: !4, line: 1482, baseType: !176, size: 64, align: 64, offset: 3584)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !43, file: !4, line: 1482, baseType: !63, size: 448, align: 64, offset: 3648)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !43, file: !4, line: 1482, baseType: !57, size: 32, align: 32, offset: 4096)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !43, file: !4, line: 1482, baseType: !182, size: 128, align: 64, offset: 4160)
!182 = !DICompositeType(tag: DW_TAG_structure_type, scope: !43, file: !4, line: 1482, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !182, file: !4, line: 1482, baseType: !39, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !182, file: !4, line: 1482, baseType: !47, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !43, file: !4, line: 1482, baseType: !187, size: 64, align: 64, offset: 4288)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !188, line: 55, baseType: !55)
!188 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !43, file: !4, line: 1482, baseType: !187, size: 64, align: 64, offset: 4352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !43, file: !4, line: 1482, baseType: !191, size: 64, align: 32, offset: 4416)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, align: 32, elements: !50)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !43, file: !4, line: 1482, baseType: !63, size: 448, align: 64, offset: 4480)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !43, file: !4, line: 1482, baseType: !194, size: 1216, align: 64, offset: 4928)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !207, !208, !209, !215, !216, !224, !225}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !4, line: 1326, baseType: !39, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !195, file: !4, line: 1326, baseType: !41, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !4, line: 1326, baseType: !120, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !195, file: !4, line: 1326, baseType: !122, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !195, file: !4, line: 1326, baseType: !49, size: 128, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !195, file: !4, line: 1326, baseType: !203, size: 256, align: 64, offset: 384)
!203 = !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !4, line: 1326, size: 256, align: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !203, file: !4, line: 1326, baseType: !57, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !203, file: !4, line: 1326, baseType: !132, size: 256, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !195, file: !4, line: 1326, baseType: !34, size: 64, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !4, line: 1326, baseType: !47, size: 32, align: 32, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !195, file: !4, line: 1327, baseType: !210, size: 64, align: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !214, !57}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !195, file: !4, line: 1328, baseType: !57, size: 32, align: 32, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !195, file: !4, line: 1329, baseType: !217, size: 256, align: 64, offset: 896)
!217 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 1329, size: 256, align: 64, elements: !218)
!218 = !{!219, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !217, file: !4, line: 1329, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !217, file: !4, line: 1329, baseType: !220, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !217, file: !4, line: 1329, baseType: !220, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !217, file: !4, line: 1329, baseType: !57, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !195, file: !4, line: 1329, baseType: !47, size: 32, align: 32, offset: 1152)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !195, file: !4, line: 1329, baseType: !47, size: 32, align: 32, offset: 1184)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !43, file: !4, line: 1482, baseType: !57, size: 32, align: 32, offset: 6144)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !43, file: !4, line: 1482, baseType: !63, size: 448, align: 64, offset: 6208)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !43, file: !4, line: 1482, baseType: !39, size: 64, align: 64, offset: 6656)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !43, file: !4, line: 1482, baseType: !57, size: 32, align: 32, offset: 6720)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !4, line: 426, baseType: !120, size: 32, align: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !36, file: !4, line: 426, baseType: !122, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !36, file: !4, line: 426, baseType: !49, size: 128, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !36, file: !4, line: 426, baseType: !234, size: 256, align: 64, offset: 384)
!234 = !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !4, line: 426, size: 256, align: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !234, file: !4, line: 426, baseType: !57, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !234, file: !4, line: 426, baseType: !132, size: 256, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !36, file: !4, line: 426, baseType: !34, size: 64, align: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !4, line: 426, baseType: !47, size: 32, align: 32, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !243, line: 21, baseType: !49)
!243 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !57)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!249 = !{!250, !254, !257, !258, !261, !264, !269, !270, !271, !274}
!250 = distinct !DISubprogram(name: "uv_async_init", scope: !1, file: !1, line: 41, type: !251, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{!57, !41, !142, !138}
!253 = !{}
!254 = distinct !DISubprogram(name: "uv_async_send", scope: !1, file: !1, line: 59, type: !255, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!255 = !DISubroutineType(types: !256)
!256 = !{!57, !142}
!257 = distinct !DISubprogram(name: "uv__async_close", scope: !1, file: !1, line: 71, type: !140, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!258 = distinct !DISubprogram(name: "uv__async_fork", scope: !1, file: !1, line: 203, type: !259, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!259 = !DISubroutineType(types: !260)
!260 = !{!57, !41}
!261 = distinct !DISubprogram(name: "uv__async_stop", scope: !1, file: !1, line: 213, type: !262, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !41}
!264 = distinct !DISubprogram(name: "cmpxchgi", scope: !265, file: !265, line: 33, type: !266, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!265 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/atomic-ops.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!266 = !DISubroutineType(types: !267)
!267 = !{!57, !268, !57, !57}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!269 = distinct !DISubprogram(name: "uv__async_send", scope: !1, file: !1, line: 123, type: !262, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!270 = distinct !DISubprogram(name: "uv__async_start", scope: !1, file: !1, line: 157, type: !259, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!271 = distinct !DISubprogram(name: "uv__async_eventfd", scope: !1, file: !1, line: 229, type: !272, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!272 = !DISubroutineType(types: !273)
!273 = !{!57}
!274 = distinct !DISubprogram(name: "uv__async_io", scope: !1, file: !1, line: 77, type: !275, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, variables: !253)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !41, !62, !47}
!277 = !{!278, !280, !281}
!278 = !DIGlobalVariable(name: "val", scope: !269, file: !1, line: 135, type: !279, isLocal: true, isDefinition: true, variable: i64* @uv__async_send.val)
