; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/core.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.3, %struct.uv_handle_s*, i32 }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.0, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.anon.0 = type { i8*, i32 }

!230 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!231 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!232 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!233 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!234 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!235 = !DIEnumerator(name: "_SC_BASE", value: 134)
!236 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!237 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!238 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!239 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!240 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!241 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!242 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!243 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!244 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!245 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!246 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!247 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!248 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!249 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!250 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!251 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!252 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!253 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!254 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!255 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!256 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!257 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!258 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!259 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!260 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!261 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!262 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!263 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!264 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!265 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!266 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!267 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!268 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!269 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!270 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!271 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!272 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!273 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!274 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!275 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!276 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!277 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!278 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!279 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!280 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!281 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!282 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!283 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!284 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!285 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!286 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!287 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!288 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!289 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!290 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!291 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!292 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!293 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!294 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!295 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!296 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!297 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!298 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!299 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!300 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!301 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!302 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!303 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!304 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!305 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!306 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!307 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!308 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!309 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!310 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!311 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!312 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!313 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!314 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!315 = !{!316, !558, !639, !667, !706, !728, !750, !440, !772, !800, !825, !849, !871, !512, !321, !888, !890, !894, !539, !896, !907, !551, !329, !344}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_pipe_t", file: !9, line: 209, baseType: !318)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_pipe_s", file: !9, line: 692, size: 2112, align: 64, elements: !319)
!319 = !{!320, !322, !528, !529, !530, !531, !536, !537, !538, !541, !553, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !9, line: 693, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !318, file: !9, line: 693, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !9, line: 204, baseType: !325)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !9, line: 1473, size: 6784, align: 64, elements: !326)
!326 = !{!327, !328, !330, !334, !335, !336, !338, !340, !341, !342, !361, !362, !363, !364, !395, !443, !467, !468, !469, !470, !471, !472, !473, !477, !478, !479, !484, !487, !488, !490, !491, !524, !525, !526, !527}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !9, line: 1475, baseType: !321, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !325, file: !9, line: 1477, baseType: !329, size: 32, align: 32, offset: 64)
!329 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !325, file: !9, line: 1478, baseType: !331, size: 128, align: 64, offset: 128)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, align: 64, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 2)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !325, file: !9, line: 1479, baseType: !331, size: 128, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !325, file: !9, line: 1481, baseType: !329, size: 32, align: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !9, line: 1482, baseType: !337, size: 64, align: 64, offset: 448)
!337 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !325, file: !9, line: 1482, baseType: !339, size: 32, align: 32, offset: 512)
!339 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !325, file: !9, line: 1482, baseType: !343, size: 64, align: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !346, line: 87, baseType: !347)
!346 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !346, line: 89, size: 448, align: 64, elements: !348)
!348 = !{!349, !356, !357, !358, !359, !360}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !347, file: !346, line: 90, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !346, line: 84, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354, !355, !329}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !347, file: !346, line: 91, baseType: !331, size: 128, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !347, file: !346, line: 92, baseType: !331, size: 128, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !347, file: !346, line: 93, baseType: !329, size: 32, align: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !347, file: !346, line: 94, baseType: !329, size: 32, align: 32, offset: 352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !347, file: !346, line: 95, baseType: !339, size: 32, align: 32, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !325, file: !9, line: 1482, baseType: !329, size: 32, align: 32, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !325, file: !9, line: 1482, baseType: !329, size: 32, align: 32, offset: 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !325, file: !9, line: 1482, baseType: !365, size: 320, align: 64, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !346, line: 129, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !367, line: 127, baseType: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!368 = !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 90, size: 320, align: 64, elements: !369)
!369 = !{!370, !388, !393}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !368, file: !367, line: 124, baseType: !371, size: 320, align: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !367, line: 92, size: 320, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !371, file: !367, line: 94, baseType: !339, size: 32, align: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !371, file: !367, line: 95, baseType: !329, size: 32, align: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !371, file: !367, line: 96, baseType: !339, size: 32, align: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !371, file: !367, line: 98, baseType: !329, size: 32, align: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !371, file: !367, line: 102, baseType: !339, size: 32, align: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !371, file: !367, line: 104, baseType: !379, size: 16, align: 16, offset: 160)
!379 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !371, file: !367, line: 105, baseType: !379, size: 16, align: 16, offset: 176)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !371, file: !367, line: 106, baseType: !382, size: 128, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !367, line: 79, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !367, line: 75, size: 128, align: 64, elements: !384)
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !383, file: !367, line: 77, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !383, file: !367, line: 78, baseType: !386, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !368, file: !367, line: 125, baseType: !389, size: 320, align: 8)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 320, align: 8, elements: !391)
!390 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!391 = !{!392}
!392 = !DISubrange(count: 40)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !368, file: !367, line: 126, baseType: !394, size: 64, align: 64)
!394 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !325, file: !9, line: 1482, baseType: !396, size: 1024, align: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !9, line: 216, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !9, line: 767, size: 1024, align: 64, elements: !398)
!398 = !{!399, !400, !401, !403, !427, !428, !433, !434, !435, !441, !442}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !397, file: !9, line: 768, baseType: !321, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !397, file: !9, line: 768, baseType: !323, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !9, line: 768, baseType: !402, size: 32, align: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !9, line: 191, baseType: !8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !397, file: !9, line: 768, baseType: !404, size: 64, align: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !9, line: 306, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !9, line: 205, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !9, line: 425, size: 768, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !425, !426}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !9, line: 426, baseType: !321, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !410, file: !9, line: 426, baseType: !323, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !9, line: 426, baseType: !402, size: 32, align: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !410, file: !9, line: 426, baseType: !404, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !410, file: !9, line: 426, baseType: !331, size: 128, align: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !410, file: !9, line: 426, baseType: !418, size: 256, align: 64, offset: 384)
!418 = !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !9, line: 426, size: 256, align: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !418, file: !9, line: 426, baseType: !339, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !418, file: !9, line: 426, baseType: !422, size: 256, align: 64)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 256, align: 64, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 4)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !410, file: !9, line: 426, baseType: !408, size: 64, align: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !410, file: !9, line: 426, baseType: !329, size: 32, align: 32, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !397, file: !9, line: 768, baseType: !331, size: 128, align: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !397, file: !9, line: 768, baseType: !429, size: 256, align: 64, offset: 384)
!429 = !DICompositeType(tag: DW_TAG_union_type, scope: !397, file: !9, line: 768, size: 256, align: 64, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !429, file: !9, line: 768, baseType: !339, size: 32, align: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !429, file: !9, line: 768, baseType: !422, size: 256, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !397, file: !9, line: 768, baseType: !408, size: 64, align: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !9, line: 768, baseType: !329, size: 32, align: 32, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !397, file: !9, line: 769, baseType: !436, size: 64, align: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !9, line: 309, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !397, file: !9, line: 769, baseType: !331, size: 128, align: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !397, file: !9, line: 769, baseType: !339, size: 32, align: 32, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !325, file: !9, line: 1482, baseType: !444, size: 448, align: 64, offset: 2432)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !346, line: 130, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !367, line: 213, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_union_type, file: !367, line: 173, size: 448, align: 64, elements: !447)
!447 = !{!448, !462, !466}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !446, file: !367, line: 192, baseType: !449, size: 448, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !367, line: 176, size: 448, align: 64, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !449, file: !367, line: 178, baseType: !339, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !449, file: !367, line: 179, baseType: !329, size: 32, align: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !449, file: !367, line: 180, baseType: !329, size: 32, align: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !449, file: !367, line: 181, baseType: !329, size: 32, align: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !449, file: !367, line: 182, baseType: !329, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !449, file: !367, line: 183, baseType: !329, size: 32, align: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !449, file: !367, line: 184, baseType: !339, size: 32, align: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !449, file: !367, line: 185, baseType: !339, size: 32, align: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !449, file: !367, line: 186, baseType: !337, size: 64, align: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !449, file: !367, line: 187, baseType: !337, size: 64, align: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !449, file: !367, line: 190, baseType: !329, size: 32, align: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !446, file: !367, line: 211, baseType: !463, size: 448, align: 8)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 448, align: 8, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 56)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !446, file: !367, line: 212, baseType: !394, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !325, file: !9, line: 1482, baseType: !408, size: 64, align: 64, offset: 2880)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 2944)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 3072)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 3328)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !325, file: !9, line: 1482, baseType: !331, size: 128, align: 64, offset: 3456)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !325, file: !9, line: 1482, baseType: !474, size: 64, align: 64, offset: 3584)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !325, file: !9, line: 1482, baseType: !345, size: 448, align: 64, offset: 3648)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !325, file: !9, line: 1482, baseType: !339, size: 32, align: 32, offset: 4096)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !325, file: !9, line: 1482, baseType: !480, size: 128, align: 64, offset: 4160)
!480 = !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !9, line: 1482, size: 128, align: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !480, file: !9, line: 1482, baseType: !321, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !480, file: !9, line: 1482, baseType: !329, size: 32, align: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !325, file: !9, line: 1482, baseType: !485, size: 64, align: 64, offset: 4288)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !486, line: 55, baseType: !337)
!486 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !325, file: !9, line: 1482, baseType: !485, size: 64, align: 64, offset: 4352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !325, file: !9, line: 1482, baseType: !489, size: 64, align: 32, offset: 4416)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 64, align: 32, elements: !332)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !325, file: !9, line: 1482, baseType: !345, size: 448, align: 64, offset: 4480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !325, file: !9, line: 1482, baseType: !492, size: 1216, align: 64, offset: 4928)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !9, line: 220, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !9, line: 1325, size: 1216, align: 64, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !505, !506, !507, !513, !514, !522, !523}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !9, line: 1326, baseType: !321, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !493, file: !9, line: 1326, baseType: !323, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !9, line: 1326, baseType: !402, size: 32, align: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !493, file: !9, line: 1326, baseType: !404, size: 64, align: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !493, file: !9, line: 1326, baseType: !331, size: 128, align: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !493, file: !9, line: 1326, baseType: !501, size: 256, align: 64, offset: 384)
!501 = !DICompositeType(tag: DW_TAG_union_type, scope: !493, file: !9, line: 1326, size: 256, align: 64, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !501, file: !9, line: 1326, baseType: !339, size: 32, align: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !501, file: !9, line: 1326, baseType: !422, size: 256, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !493, file: !9, line: 1326, baseType: !408, size: 64, align: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !9, line: 1326, baseType: !329, size: 32, align: 32, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !493, file: !9, line: 1327, baseType: !508, size: 64, align: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !9, line: 362, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !512, !339}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !493, file: !9, line: 1328, baseType: !339, size: 32, align: 32, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !493, file: !9, line: 1329, baseType: !515, size: 256, align: 64, offset: 896)
!515 = !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !9, line: 1329, size: 256, align: 64, elements: !516)
!516 = !{!517, !519, !520, !521}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !515, file: !9, line: 1329, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !515, file: !9, line: 1329, baseType: !518, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !515, file: !9, line: 1329, baseType: !518, size: 64, align: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !515, file: !9, line: 1329, baseType: !339, size: 32, align: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !493, file: !9, line: 1329, baseType: !329, size: 32, align: 32, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !493, file: !9, line: 1329, baseType: !329, size: 32, align: 32, offset: 1184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !325, file: !9, line: 1482, baseType: !339, size: 32, align: 32, offset: 6144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !325, file: !9, line: 1482, baseType: !345, size: 448, align: 64, offset: 6208)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !325, file: !9, line: 1482, baseType: !321, size: 64, align: 64, offset: 6656)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !325, file: !9, line: 1482, baseType: !339, size: 32, align: 32, offset: 6720)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !318, file: !9, line: 693, baseType: !402, size: 32, align: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !318, file: !9, line: 693, baseType: !404, size: 64, align: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !318, file: !9, line: 693, baseType: !331, size: 128, align: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !318, file: !9, line: 693, baseType: !532, size: 256, align: 64, offset: 384)
!532 = !DICompositeType(tag: DW_TAG_union_type, scope: !318, file: !9, line: 693, size: 256, align: 64, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !532, file: !9, line: 693, baseType: !339, size: 32, align: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !532, file: !9, line: 693, baseType: !422, size: 256, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !318, file: !9, line: 693, baseType: !408, size: 64, align: 64, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !9, line: 693, baseType: !329, size: 32, align: 32, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !318, file: !9, line: 694, baseType: !539, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !540, line: 62, baseType: !337)
!540 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!541 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !318, file: !9, line: 694, baseType: !542, size: 64, align: 64, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_alloc_cb", file: !9, line: 296, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !408, !539, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !346, line: 119, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !346, line: 116, size: 128, align: 64, elements: !549)
!549 = !{!550, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !548, file: !346, line: 117, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !548, file: !346, line: 118, baseType: !539, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !318, file: !9, line: 694, baseType: !554, size: 64, align: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_read_cb", file: !9, line: 299, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558, !620, !624}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stream_t", file: !9, line: 206, baseType: !560)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_stream_s", file: !9, line: 465, size: 1984, align: 64, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !572, !573, !574, !575, !576, !577, !594, !609, !610, !611, !612, !617, !618, !619}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !9, line: 466, baseType: !321, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !560, file: !9, line: 466, baseType: !323, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !560, file: !9, line: 466, baseType: !402, size: 32, align: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !560, file: !9, line: 466, baseType: !404, size: 64, align: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !560, file: !9, line: 466, baseType: !331, size: 128, align: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !560, file: !9, line: 466, baseType: !568, size: 256, align: 64, offset: 384)
!568 = !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !9, line: 466, size: 256, align: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !568, file: !9, line: 466, baseType: !339, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !568, file: !9, line: 466, baseType: !422, size: 256, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !560, file: !9, line: 466, baseType: !408, size: 64, align: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !560, file: !9, line: 466, baseType: !329, size: 32, align: 32, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !560, file: !9, line: 467, baseType: !539, size: 64, align: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !560, file: !9, line: 467, baseType: !542, size: 64, align: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !560, file: !9, line: 467, baseType: !554, size: 64, align: 64, offset: 896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !560, file: !9, line: 467, baseType: !578, size: 64, align: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_t", file: !9, line: 228, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_connect_s", file: !9, line: 551, size: 768, align: 64, elements: !581)
!581 = !{!582, !583, !585, !586, !587, !592, !593}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !580, file: !9, line: 552, baseType: !321, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !9, line: 552, baseType: !584, size: 32, align: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !9, line: 200, baseType: !48)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !580, file: !9, line: 552, baseType: !331, size: 128, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !580, file: !9, line: 552, baseType: !422, size: 256, align: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !580, file: !9, line: 553, baseType: !588, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_cb", file: !9, line: 303, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !578, !339}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !580, file: !9, line: 554, baseType: !558, size: 64, align: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !580, file: !9, line: 555, baseType: !331, size: 128, align: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !560, file: !9, line: 467, baseType: !595, size: 64, align: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_t", file: !9, line: 226, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_shutdown_s", file: !9, line: 401, size: 640, align: 64, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !597, file: !9, line: 402, baseType: !321, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !9, line: 402, baseType: !584, size: 32, align: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !597, file: !9, line: 402, baseType: !331, size: 128, align: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !597, file: !9, line: 402, baseType: !422, size: 256, align: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !597, file: !9, line: 403, baseType: !558, size: 64, align: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !597, file: !9, line: 404, baseType: !605, size: 64, align: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_cb", file: !9, line: 304, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !595, !339}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !560, file: !9, line: 467, baseType: !345, size: 448, align: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !560, file: !9, line: 467, baseType: !331, size: 128, align: 64, offset: 1536)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !560, file: !9, line: 467, baseType: !331, size: 128, align: 64, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !560, file: !9, line: 467, baseType: !613, size: 64, align: 64, offset: 1792)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connection_cb", file: !9, line: 305, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !558, !339}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !560, file: !9, line: 467, baseType: !339, size: 32, align: 32, offset: 1856)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !560, file: !9, line: 467, baseType: !339, size: 32, align: 32, offset: 1888)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !560, file: !9, line: 467, baseType: !321, size: 64, align: 64, offset: 1920)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !621, line: 102, baseType: !622)
!621 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !623, line: 172, baseType: !394)
!623 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !318, file: !9, line: 694, baseType: !578, size: 64, align: 64, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !318, file: !9, line: 694, baseType: !595, size: 64, align: 64, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !318, file: !9, line: 694, baseType: !345, size: 448, align: 64, offset: 1088)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !318, file: !9, line: 694, baseType: !331, size: 128, align: 64, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !318, file: !9, line: 694, baseType: !331, size: 128, align: 64, offset: 1664)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !318, file: !9, line: 694, baseType: !613, size: 64, align: 64, offset: 1792)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !318, file: !9, line: 694, baseType: !339, size: 32, align: 32, offset: 1856)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !318, file: !9, line: 694, baseType: !339, size: 32, align: 32, offset: 1888)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !318, file: !9, line: 694, baseType: !321, size: 64, align: 64, offset: 1920)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ipc", scope: !318, file: !9, line: 695, baseType: !339, size: 32, align: 32, offset: 1984)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fname", scope: !318, file: !9, line: 696, baseType: !637, size: 64, align: 64, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_tcp_t", file: !9, line: 207, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_tcp_s", file: !9, line: 516, size: 1984, align: 64, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !641, file: !9, line: 517, baseType: !321, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !641, file: !9, line: 517, baseType: !323, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !9, line: 517, baseType: !402, size: 32, align: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !641, file: !9, line: 517, baseType: !404, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !641, file: !9, line: 517, baseType: !331, size: 128, align: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !641, file: !9, line: 517, baseType: !649, size: 256, align: 64, offset: 384)
!649 = !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !9, line: 517, size: 256, align: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !649, file: !9, line: 517, baseType: !339, size: 32, align: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !649, file: !9, line: 517, baseType: !422, size: 256, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !641, file: !9, line: 517, baseType: !408, size: 64, align: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !641, file: !9, line: 517, baseType: !329, size: 32, align: 32, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !641, file: !9, line: 518, baseType: !539, size: 64, align: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !641, file: !9, line: 518, baseType: !542, size: 64, align: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !641, file: !9, line: 518, baseType: !554, size: 64, align: 64, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !641, file: !9, line: 518, baseType: !578, size: 64, align: 64, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !641, file: !9, line: 518, baseType: !595, size: 64, align: 64, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !641, file: !9, line: 518, baseType: !345, size: 448, align: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !641, file: !9, line: 518, baseType: !331, size: 128, align: 64, offset: 1536)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !641, file: !9, line: 518, baseType: !331, size: 128, align: 64, offset: 1664)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !641, file: !9, line: 518, baseType: !613, size: 64, align: 64, offset: 1792)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !641, file: !9, line: 518, baseType: !339, size: 32, align: 32, offset: 1856)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !641, file: !9, line: 518, baseType: !339, size: 32, align: 32, offset: 1888)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !641, file: !9, line: 518, baseType: !321, size: 64, align: 64, offset: 1920)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_t", file: !9, line: 208, baseType: !669)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_udp_s", file: !9, line: 590, size: 1728, align: 64, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !681, !682, !683, !684, !685, !686, !703, !704, !705}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !669, file: !9, line: 591, baseType: !321, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !669, file: !9, line: 591, baseType: !323, size: 64, align: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !9, line: 591, baseType: !402, size: 32, align: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !669, file: !9, line: 591, baseType: !404, size: 64, align: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !669, file: !9, line: 591, baseType: !331, size: 128, align: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !669, file: !9, line: 591, baseType: !677, size: 256, align: 64, offset: 384)
!677 = !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !9, line: 591, size: 256, align: 64, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !677, file: !9, line: 591, baseType: !339, size: 32, align: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !677, file: !9, line: 591, baseType: !422, size: 256, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !669, file: !9, line: 591, baseType: !408, size: 64, align: 64, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !9, line: 591, baseType: !329, size: 32, align: 32, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_size", scope: !669, file: !9, line: 597, baseType: !539, size: 64, align: 64, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_count", scope: !669, file: !9, line: 601, baseType: !539, size: 64, align: 64, offset: 832)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !669, file: !9, line: 602, baseType: !542, size: 64, align: 64, offset: 896)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "recv_cb", scope: !669, file: !9, line: 602, baseType: !687, size: 64, align: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_recv_cb", file: !9, line: 583, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !667, !620, !624, !691, !329}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !87, line: 149, size: 128, align: 16, elements: !694)
!694 = !{!695, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !693, file: !87, line: 151, baseType: !696, size: 16, align: 16)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !697, line: 28, baseType: !698)
!697 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!698 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !693, file: !87, line: 152, baseType: !700, size: 112, align: 8, offset: 16)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 112, align: 8, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 14)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !669, file: !9, line: 602, baseType: !345, size: 448, align: 64, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !669, file: !9, line: 602, baseType: !331, size: 128, align: 64, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !669, file: !9, line: 602, baseType: !331, size: 128, align: 64, offset: 1600)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_prepare_t", file: !9, line: 213, baseType: !708)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_prepare_s", file: !9, line: 737, size: 960, align: 64, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !720, !721, !722, !727}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !708, file: !9, line: 738, baseType: !321, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !708, file: !9, line: 738, baseType: !323, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !708, file: !9, line: 738, baseType: !402, size: 32, align: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !708, file: !9, line: 738, baseType: !404, size: 64, align: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !708, file: !9, line: 738, baseType: !331, size: 128, align: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !708, file: !9, line: 738, baseType: !716, size: 256, align: 64, offset: 384)
!716 = !DICompositeType(tag: DW_TAG_union_type, scope: !708, file: !9, line: 738, size: 256, align: 64, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !716, file: !9, line: 738, baseType: !339, size: 32, align: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !716, file: !9, line: 738, baseType: !422, size: 256, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !708, file: !9, line: 738, baseType: !408, size: 64, align: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !708, file: !9, line: 738, baseType: !329, size: 32, align: 32, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_cb", scope: !708, file: !9, line: 739, baseType: !723, size: 64, align: 64, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_prepare_cb", file: !9, line: 310, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !706}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !708, file: !9, line: 739, baseType: !331, size: 128, align: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_check_t", file: !9, line: 214, baseType: !730)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_check_s", file: !9, line: 747, size: 960, align: 64, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !742, !743, !744, !749}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !730, file: !9, line: 748, baseType: !321, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !730, file: !9, line: 748, baseType: !323, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !730, file: !9, line: 748, baseType: !402, size: 32, align: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !730, file: !9, line: 748, baseType: !404, size: 64, align: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !730, file: !9, line: 748, baseType: !331, size: 128, align: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !730, file: !9, line: 748, baseType: !738, size: 256, align: 64, offset: 384)
!738 = !DICompositeType(tag: DW_TAG_union_type, scope: !730, file: !9, line: 748, size: 256, align: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !738, file: !9, line: 748, baseType: !339, size: 32, align: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !738, file: !9, line: 748, baseType: !422, size: 256, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !730, file: !9, line: 748, baseType: !408, size: 64, align: 64, offset: 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !730, file: !9, line: 748, baseType: !329, size: 32, align: 32, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "check_cb", scope: !730, file: !9, line: 749, baseType: !745, size: 64, align: 64, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_check_cb", file: !9, line: 311, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !728}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !730, file: !9, line: 749, baseType: !331, size: 128, align: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_idle_t", file: !9, line: 215, baseType: !752)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_idle_s", file: !9, line: 757, size: 960, align: 64, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !764, !765, !766, !771}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !752, file: !9, line: 758, baseType: !321, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !752, file: !9, line: 758, baseType: !323, size: 64, align: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !752, file: !9, line: 758, baseType: !402, size: 32, align: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !752, file: !9, line: 758, baseType: !404, size: 64, align: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !752, file: !9, line: 758, baseType: !331, size: 128, align: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !752, file: !9, line: 758, baseType: !760, size: 256, align: 64, offset: 384)
!760 = !DICompositeType(tag: DW_TAG_union_type, scope: !752, file: !9, line: 758, size: 256, align: 64, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !760, file: !9, line: 758, baseType: !339, size: 32, align: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !760, file: !9, line: 758, baseType: !422, size: 256, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !752, file: !9, line: 758, baseType: !408, size: 64, align: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !9, line: 758, baseType: !329, size: 32, align: 32, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "idle_cb", scope: !752, file: !9, line: 759, baseType: !767, size: 64, align: 64, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_idle_cb", file: !9, line: 312, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !750}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !752, file: !9, line: 759, baseType: !331, size: 128, align: 64, offset: 832)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timer_t", file: !9, line: 212, baseType: !774)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_timer_s", file: !9, line: 783, size: 1216, align: 64, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !786, !787, !788, !793, !797, !798, !799}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !774, file: !9, line: 784, baseType: !321, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !774, file: !9, line: 784, baseType: !323, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !9, line: 784, baseType: !402, size: 32, align: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !774, file: !9, line: 784, baseType: !404, size: 64, align: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !774, file: !9, line: 784, baseType: !331, size: 128, align: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !774, file: !9, line: 784, baseType: !782, size: 256, align: 64, offset: 384)
!782 = !DICompositeType(tag: DW_TAG_union_type, scope: !774, file: !9, line: 784, size: 256, align: 64, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !782, file: !9, line: 784, baseType: !339, size: 32, align: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !782, file: !9, line: 784, baseType: !422, size: 256, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !774, file: !9, line: 784, baseType: !408, size: 64, align: 64, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !774, file: !9, line: 784, baseType: !329, size: 32, align: 32, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cb", scope: !774, file: !9, line: 785, baseType: !789, size: 64, align: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timer_cb", file: !9, line: 308, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !772}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "heap_node", scope: !774, file: !9, line: 785, baseType: !794, size: 192, align: 64, offset: 832)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 192, align: 64, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 3)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !774, file: !9, line: 785, baseType: !485, size: 64, align: 64, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !774, file: !9, line: 785, baseType: !485, size: 64, align: 64, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "start_id", scope: !774, file: !9, line: 785, baseType: !485, size: 64, align: 64, offset: 1152)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_process_t", file: !9, line: 217, baseType: !802)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_process_s", file: !9, line: 953, size: 1088, align: 64, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !814, !815, !816, !822, !823, !824}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !9, line: 954, baseType: !321, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !802, file: !9, line: 954, baseType: !323, size: 64, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !802, file: !9, line: 954, baseType: !402, size: 32, align: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !802, file: !9, line: 954, baseType: !404, size: 64, align: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !802, file: !9, line: 954, baseType: !331, size: 128, align: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !802, file: !9, line: 954, baseType: !810, size: 256, align: 64, offset: 384)
!810 = !DICompositeType(tag: DW_TAG_union_type, scope: !802, file: !9, line: 954, size: 256, align: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !810, file: !9, line: 954, baseType: !339, size: 32, align: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !810, file: !9, line: 954, baseType: !422, size: 256, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !802, file: !9, line: 954, baseType: !408, size: 64, align: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !802, file: !9, line: 954, baseType: !329, size: 32, align: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "exit_cb", scope: !802, file: !9, line: 955, baseType: !817, size: 64, align: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_exit_cb", file: !9, line: 313, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !800, !821, !339}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !486, line: 40, baseType: !394)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !802, file: !9, line: 956, baseType: !339, size: 32, align: 32, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !802, file: !9, line: 957, baseType: !331, size: 128, align: 64, offset: 896)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !802, file: !9, line: 957, baseType: !339, size: 32, align: 32, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_event_t", file: !9, line: 218, baseType: !827)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_event_s", file: !9, line: 1297, size: 1088, align: 64, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !839, !840, !841, !842, !847, !848}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !827, file: !9, line: 1298, baseType: !321, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !827, file: !9, line: 1298, baseType: !323, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !827, file: !9, line: 1298, baseType: !402, size: 32, align: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !827, file: !9, line: 1298, baseType: !404, size: 64, align: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !827, file: !9, line: 1298, baseType: !331, size: 128, align: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !827, file: !9, line: 1298, baseType: !835, size: 256, align: 64, offset: 384)
!835 = !DICompositeType(tag: DW_TAG_union_type, scope: !827, file: !9, line: 1298, size: 256, align: 64, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !835, file: !9, line: 1298, baseType: !339, size: 32, align: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !835, file: !9, line: 1298, baseType: !422, size: 256, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !827, file: !9, line: 1298, baseType: !408, size: 64, align: 64, offset: 640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !827, file: !9, line: 1298, baseType: !329, size: 32, align: 32, offset: 704)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !827, file: !9, line: 1300, baseType: !551, size: 64, align: 64, offset: 768)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !827, file: !9, line: 1301, baseType: !843, size: 64, align: 64, offset: 832)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_event_cb", file: !9, line: 352, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !825, !637, !339, !339}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !827, file: !9, line: 1301, baseType: !331, size: 128, align: 64, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !827, file: !9, line: 1301, baseType: !339, size: 32, align: 32, offset: 1024)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_poll_t", file: !9, line: 211, baseType: !851)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_poll_s", file: !9, line: 717, size: 1280, align: 64, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !863, !864, !865, !870}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !851, file: !9, line: 718, baseType: !321, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !851, file: !9, line: 718, baseType: !323, size: 64, align: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !851, file: !9, line: 718, baseType: !402, size: 32, align: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !851, file: !9, line: 718, baseType: !404, size: 64, align: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !851, file: !9, line: 718, baseType: !331, size: 128, align: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !851, file: !9, line: 718, baseType: !859, size: 256, align: 64, offset: 384)
!859 = !DICompositeType(tag: DW_TAG_union_type, scope: !851, file: !9, line: 718, size: 256, align: 64, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !859, file: !9, line: 718, baseType: !339, size: 32, align: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !859, file: !9, line: 718, baseType: !422, size: 256, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !851, file: !9, line: 718, baseType: !408, size: 64, align: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !9, line: 718, baseType: !329, size: 32, align: 32, offset: 704)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "poll_cb", scope: !851, file: !9, line: 719, baseType: !866, size: 64, align: 64, offset: 768)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_poll_cb", file: !9, line: 307, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64, align: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !849, !339, !339}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !851, file: !9, line: 720, baseType: !345, size: 448, align: 64, offset: 832)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_poll_t", file: !9, line: 219, baseType: !873)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_poll_s", file: !9, line: 1308, size: 832, align: 64, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !885, !886, !887}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !873, file: !9, line: 1309, baseType: !321, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !873, file: !9, line: 1309, baseType: !323, size: 64, align: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !873, file: !9, line: 1309, baseType: !402, size: 32, align: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !873, file: !9, line: 1309, baseType: !404, size: 64, align: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !873, file: !9, line: 1309, baseType: !331, size: 128, align: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !873, file: !9, line: 1309, baseType: !881, size: 256, align: 64, offset: 384)
!881 = !DICompositeType(tag: DW_TAG_union_type, scope: !873, file: !9, line: 1309, size: 256, align: 64, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !881, file: !9, line: 1309, baseType: !339, size: 32, align: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !881, file: !9, line: 1309, baseType: !422, size: 256, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !873, file: !9, line: 1309, baseType: !408, size: 64, align: 64, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !873, file: !9, line: 1309, baseType: !329, size: 32, align: 32, offset: 704)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "poll_ctx", scope: !873, file: !9, line: 1311, baseType: !321, size: 64, align: 64, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !893, line: 21, baseType: !331)
!893 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !87, line: 242, size: 128, align: 64, elements: !898)
!898 = !{!899, !900, !901, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !897, file: !87, line: 244, baseType: !539, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !897, file: !87, line: 249, baseType: !339, size: 32, align: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !897, file: !87, line: 250, baseType: !339, size: 32, align: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !897, file: !87, line: 252, baseType: !903, offset: 128)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, align: 8, elements: !905)
!904 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!905 = !{!906}
!906 = !DISubrange(count: -1)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!908 = !{!909, !913, !916, !919, !920, !923, !928, !933, !934, !935, !939, !942, !943, !946, !1001, !1004, !1005, !1006, !1009, !1010, !1011, !1012, !1013, !1034, !1038, !1041, !1042, !1047, !1050, !1053, !1054, !1057, !1058, !1063, !1091, !1094, !1095, !1096, !1097, !1109, !1112, !1113, !1114, !1117, !1120, !1121, !1122, !1123, !1124, !1125, !1128, !1131}
!909 = distinct !DISubprogram(name: "uv_hrtime", scope: !1, file: !1, line: 95, type: !910, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!485}
!912 = !{}
!913 = distinct !DISubprogram(name: "uv_close", scope: !1, file: !1, line: 100, type: !914, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !408, !404}
!916 = distinct !DISubprogram(name: "uv__socket_sockopt", scope: !1, file: !1, line: 172, type: !917, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!917 = !DISubroutineType(types: !918)
!918 = !{!339, !408, !339, !907}
!919 = distinct !DISubprogram(name: "uv__make_close_pending", scope: !1, file: !1, line: 200, type: !406, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!920 = distinct !DISubprogram(name: "uv__getiovmax", scope: !1, file: !1, line: 207, type: !921, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!921 = !DISubroutineType(types: !922)
!922 = !{!339}
!923 = distinct !DISubprogram(name: "uv_is_closing", scope: !1, file: !1, line: 290, type: !924, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!924 = !DISubroutineType(types: !925)
!925 = !{!339, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!928 = distinct !DISubprogram(name: "uv_backend_fd", scope: !1, file: !1, line: 295, type: !929, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!929 = !DISubroutineType(types: !930)
!930 = !{!339, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!933 = distinct !DISubprogram(name: "uv_backend_timeout", scope: !1, file: !1, line: 300, type: !929, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!934 = distinct !DISubprogram(name: "uv_loop_alive", scope: !1, file: !1, line: 327, type: !929, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!935 = distinct !DISubprogram(name: "uv_run", scope: !1, file: !1, line: 332, type: !936, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!936 = !DISubroutineType(types: !937)
!937 = !{!339, !323, !938}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_run_mode", file: !9, line: 247, baseType: !61)
!939 = distinct !DISubprogram(name: "uv_update_time", scope: !1, file: !1, line: 384, type: !940, isLocal: false, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !323}
!942 = distinct !DISubprogram(name: "uv_is_active", scope: !1, file: !1, line: 389, type: !924, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!943 = distinct !DISubprogram(name: "uv__socket", scope: !1, file: !1, line: 395, type: !944, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!944 = !DISubroutineType(types: !945)
!945 = !{!339, !339, !339, !339}
!946 = distinct !DISubprogram(name: "uv__open_file", scope: !1, file: !1, line: 432, type: !947, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!947 = !DISubroutineType(types: !948)
!948 = !{!949, !637}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !621, line: 48, baseType: !951)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !952, line: 245, size: 1728, align: 64, elements: !953)
!952 = !DIFile(filename: "/usr/include/libio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !974, !975, !976, !977, !979, !980, !982, !986, !989, !991, !992, !993, !994, !995, !996, !997}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !951, file: !952, line: 246, baseType: !339, size: 32, align: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !951, file: !952, line: 251, baseType: !551, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !951, file: !952, line: 252, baseType: !551, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !951, file: !952, line: 253, baseType: !551, size: 64, align: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !951, file: !952, line: 254, baseType: !551, size: 64, align: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !951, file: !952, line: 255, baseType: !551, size: 64, align: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !951, file: !952, line: 256, baseType: !551, size: 64, align: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !951, file: !952, line: 257, baseType: !551, size: 64, align: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !951, file: !952, line: 258, baseType: !551, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !951, file: !952, line: 260, baseType: !551, size: 64, align: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !951, file: !952, line: 261, baseType: !551, size: 64, align: 64, offset: 640)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !951, file: !952, line: 262, baseType: !551, size: 64, align: 64, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !951, file: !952, line: 264, baseType: !967, size: 64, align: 64, offset: 768)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !952, line: 160, size: 192, align: 64, elements: !969)
!969 = !{!970, !971, !973}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !968, file: !952, line: 161, baseType: !967, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !968, file: !952, line: 162, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !968, file: !952, line: 166, baseType: !339, size: 32, align: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !951, file: !952, line: 266, baseType: !972, size: 64, align: 64, offset: 832)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !951, file: !952, line: 268, baseType: !339, size: 32, align: 32, offset: 896)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !951, file: !952, line: 272, baseType: !339, size: 32, align: 32, offset: 928)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !951, file: !952, line: 274, baseType: !978, size: 64, align: 64, offset: 960)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !623, line: 131, baseType: !394)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !951, file: !952, line: 278, baseType: !698, size: 16, align: 16, offset: 1024)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !951, file: !952, line: 279, baseType: !981, size: 8, align: 8, offset: 1040)
!981 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !951, file: !952, line: 280, baseType: !983, size: 8, align: 8, offset: 1048)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 8, align: 8, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 1)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !951, file: !952, line: 284, baseType: !987, size: 64, align: 64, offset: 1088)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !952, line: 154, baseType: null)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !951, file: !952, line: 293, baseType: !990, size: 64, align: 64, offset: 1152)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !623, line: 132, baseType: !394)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !951, file: !952, line: 302, baseType: !321, size: 64, align: 64, offset: 1216)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !951, file: !952, line: 303, baseType: !321, size: 64, align: 64, offset: 1280)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !951, file: !952, line: 304, baseType: !321, size: 64, align: 64, offset: 1344)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !951, file: !952, line: 305, baseType: !321, size: 64, align: 64, offset: 1408)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !951, file: !952, line: 306, baseType: !539, size: 64, align: 64, offset: 1472)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !951, file: !952, line: 308, baseType: !339, size: 32, align: 32, offset: 1536)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !951, file: !952, line: 310, baseType: !998, size: 160, align: 8, offset: 1568)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 160, align: 8, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 20)
!1001 = distinct !DISubprogram(name: "uv__accept", scope: !1, file: !1, line: 448, type: !1002, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!339, !339}
!1004 = distinct !DISubprogram(name: "uv__close_nocheckstdio", scope: !1, file: !1, line: 499, type: !1002, isLocal: false, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1005 = distinct !DISubprogram(name: "uv__close", scope: !1, file: !1, line: 518, type: !1002, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1006 = distinct !DISubprogram(name: "uv__nonblock_ioctl", scope: !1, file: !1, line: 527, type: !1007, isLocal: false, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!339, !339, !339}
!1009 = distinct !DISubprogram(name: "uv__cloexec_ioctl", scope: !1, file: !1, line: 541, type: !1007, isLocal: false, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1010 = distinct !DISubprogram(name: "uv__nonblock_fcntl", scope: !1, file: !1, line: 555, type: !1007, isLocal: false, isDefinition: true, scopeLine: 555, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1011 = distinct !DISubprogram(name: "uv__cloexec_fcntl", scope: !1, file: !1, line: 586, type: !1007, isLocal: false, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1012 = distinct !DISubprogram(name: "uv__dup", scope: !1, file: !1, line: 620, type: !1002, isLocal: false, isDefinition: true, scopeLine: 620, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1013 = distinct !DISubprogram(name: "uv__recvmsg", scope: !1, file: !1, line: 638, type: !1014, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!620, !339, !1016, !339}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !87, line: 224, size: 448, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1023, !1030, !1031, !1032, !1033}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !1017, file: !87, line: 226, baseType: !321, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !1017, file: !87, line: 227, baseType: !1021, size: 32, align: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !87, line: 33, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !623, line: 189, baseType: !329)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !1017, file: !87, line: 229, baseType: !1024, size: 64, align: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !1026, line: 43, size: 128, align: 64, elements: !1027)
!1026 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !1025, file: !1026, line: 45, baseType: !321, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !1025, file: !1026, line: 46, baseType: !539, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !1017, file: !87, line: 230, baseType: !539, size: 64, align: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !1017, file: !87, line: 232, baseType: !321, size: 64, align: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !1017, file: !87, line: 233, baseType: !539, size: 64, align: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !1017, file: !87, line: 238, baseType: !339, size: 32, align: 32, offset: 384)
!1034 = distinct !DISubprogram(name: "uv_cwd", scope: !1, file: !1, line: 676, type: !1035, isLocal: false, isDefinition: true, scopeLine: 676, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!339, !551, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!1038 = distinct !DISubprogram(name: "uv_chdir", scope: !1, file: !1, line: 693, type: !1039, isLocal: false, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!339, !637}
!1041 = distinct !DISubprogram(name: "uv_disable_stdio_inheritance", scope: !1, file: !1, line: 701, type: !475, isLocal: false, isDefinition: true, scopeLine: 701, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1042 = distinct !DISubprogram(name: "uv_fileno", scope: !1, file: !1, line: 713, type: !1043, isLocal: false, isDefinition: true, scopeLine: 713, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!339, !926, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_os_fd_t", file: !346, line: 123, baseType: !339)
!1047 = distinct !DISubprogram(name: "uv__io_init", scope: !1, file: !1, line: 811, type: !1048, isLocal: false, isDefinition: true, scopeLine: 811, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !344, !350, !339}
!1050 = distinct !DISubprogram(name: "uv__io_start", scope: !1, file: !1, line: 828, type: !1051, isLocal: false, isDefinition: true, scopeLine: 828, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !323, !344, !329}
!1053 = distinct !DISubprogram(name: "uv__io_stop", scope: !1, file: !1, line: 856, type: !1051, isLocal: false, isDefinition: true, scopeLine: 856, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1054 = distinct !DISubprogram(name: "uv__io_close", scope: !1, file: !1, line: 888, type: !1055, isLocal: false, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{null, !323, !344}
!1057 = distinct !DISubprogram(name: "uv__io_feed", scope: !1, file: !1, line: 897, type: !1055, isLocal: false, isDefinition: true, scopeLine: 897, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1058 = distinct !DISubprogram(name: "uv__io_active", scope: !1, file: !1, line: 903, type: !1059, isLocal: false, isDefinition: true, scopeLine: 903, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!339, !1061, !329}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!1063 = distinct !DISubprogram(name: "uv_getrusage", scope: !1, file: !1, line: 910, type: !1064, isLocal: false, isDefinition: true, scopeLine: 910, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!339, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rusage_t", file: !9, line: 1064, baseType: !1068)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1047, size: 1152, align: 64, elements: !1069)
!1069 = !{!1070, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !1068, file: !9, line: 1048, baseType: !1071, size: 128, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timeval_t", file: !9, line: 1045, baseType: !1072)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1042, size: 128, align: 64, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1072, file: !9, line: 1043, baseType: !394, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1072, file: !9, line: 1044, baseType: !394, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !1068, file: !9, line: 1049, baseType: !1071, size: 128, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !1068, file: !9, line: 1050, baseType: !485, size: 64, align: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !1068, file: !9, line: 1051, baseType: !485, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !1068, file: !9, line: 1052, baseType: !485, size: 64, align: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !1068, file: !9, line: 1053, baseType: !485, size: 64, align: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !1068, file: !9, line: 1054, baseType: !485, size: 64, align: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !1068, file: !9, line: 1055, baseType: !485, size: 64, align: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !1068, file: !9, line: 1056, baseType: !485, size: 64, align: 64, offset: 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !1068, file: !9, line: 1057, baseType: !485, size: 64, align: 64, offset: 704)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !1068, file: !9, line: 1058, baseType: !485, size: 64, align: 64, offset: 768)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !1068, file: !9, line: 1059, baseType: !485, size: 64, align: 64, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !1068, file: !9, line: 1060, baseType: !485, size: 64, align: 64, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !1068, file: !9, line: 1061, baseType: !485, size: 64, align: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !1068, file: !9, line: 1062, baseType: !485, size: 64, align: 64, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !1068, file: !9, line: 1063, baseType: !485, size: 64, align: 64, offset: 1088)
!1091 = distinct !DISubprogram(name: "uv__open_cloexec", scope: !1, file: !1, line: 943, type: !1092, isLocal: false, isDefinition: true, scopeLine: 943, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!339, !637, !339}
!1094 = distinct !DISubprogram(name: "uv__dup2_cloexec", scope: !1, file: !1, line: 977, type: !1007, isLocal: false, isDefinition: true, scopeLine: 977, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1095 = distinct !DISubprogram(name: "uv_os_homedir", scope: !1, file: !1, line: 1029, type: !1035, isLocal: false, isDefinition: true, scopeLine: 1029, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1096 = distinct !DISubprogram(name: "uv_os_tmpdir", scope: !1, file: !1, line: 1078, type: !1035, isLocal: false, isDefinition: true, scopeLine: 1078, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1097 = distinct !DISubprogram(name: "uv__getpwuid_r", scope: !1, file: !1, line: 1129, type: !1098, isLocal: false, isDefinition: true, scopeLine: 1129, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!339, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_passwd_t", file: !9, line: 237, baseType: !1102)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_passwd_s", file: !9, line: 1012, size: 320, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !1102, file: !9, line: 1013, baseType: !551, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1102, file: !9, line: 1014, baseType: !394, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !1102, file: !9, line: 1015, baseType: !394, size: 64, align: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !1102, file: !9, line: 1016, baseType: !551, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "homedir", scope: !1102, file: !9, line: 1017, baseType: !551, size: 64, align: 64, offset: 256)
!1109 = distinct !DISubprogram(name: "uv_os_free_passwd", scope: !1, file: !1, line: 1218, type: !1110, isLocal: false, isDefinition: true, scopeLine: 1218, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !1100}
!1112 = distinct !DISubprogram(name: "uv_os_get_passwd", scope: !1, file: !1, line: 1234, type: !1098, isLocal: false, isDefinition: true, scopeLine: 1234, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1113 = distinct !DISubprogram(name: "uv_translate_sys_error", scope: !1, file: !1, line: 1239, type: !1002, isLocal: false, isDefinition: true, scopeLine: 1239, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1114 = distinct !DISubprogram(name: "uv_os_getenv", scope: !1, file: !1, line: 1245, type: !1115, isLocal: false, isDefinition: true, scopeLine: 1245, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!339, !637, !551, !1037}
!1117 = distinct !DISubprogram(name: "uv_os_setenv", scope: !1, file: !1, line: 1271, type: !1118, isLocal: false, isDefinition: true, scopeLine: 1271, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!339, !637, !637}
!1120 = distinct !DISubprogram(name: "uv_os_unsetenv", scope: !1, file: !1, line: 1282, type: !1039, isLocal: false, isDefinition: true, scopeLine: 1282, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
!1121 = distinct !DISubprogram(name: "uv__loop_alive", scope: !1, file: !1, line: 320, type: !929, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, variables: !912)
