; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/fs.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!16 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!17 = !DIEnumerator(name: "UV_STREAM", value: 11)
!18 = !DIEnumerator(name: "UV_TCP", value: 12)
!19 = !DIEnumerator(name: "UV_TIMER", value: 13)
!20 = !DIEnumerator(name: "UV_TTY", value: 14)
!21 = !DIEnumerator(name: "UV_UDP", value: 15)
!22 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!23 = !DIEnumerator(name: "UV_FILE", value: 17)
!24 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 193, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!27 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!28 = !DIEnumerator(name: "UV_REQ", value: 1)
!29 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!30 = !DIEnumerator(name: "UV_WRITE", value: 3)
!31 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!32 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!33 = !DIEnumerator(name: "UV_FS", value: 6)
!34 = !DIEnumerator(name: "UV_WORK", value: 7)
!35 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!36 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!37 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1086, size: 32, align: 32, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!40 = !DIEnumerator(name: "UV_FS_UNKNOWN", value: -1)
!41 = !DIEnumerator(name: "UV_FS_CUSTOM", value: 0)
!42 = !DIEnumerator(name: "UV_FS_OPEN", value: 1)
!43 = !DIEnumerator(name: "UV_FS_CLOSE", value: 2)
!44 = !DIEnumerator(name: "UV_FS_READ", value: 3)
!45 = !DIEnumerator(name: "UV_FS_WRITE", value: 4)
!46 = !DIEnumerator(name: "UV_FS_SENDFILE", value: 5)
!47 = !DIEnumerator(name: "UV_FS_STAT", value: 6)
!48 = !DIEnumerator(name: "UV_FS_LSTAT", value: 7)
!49 = !DIEnumerator(name: "UV_FS_FSTAT", value: 8)
!50 = !DIEnumerator(name: "UV_FS_FTRUNCATE", value: 9)
!51 = !DIEnumerator(name: "UV_FS_UTIME", value: 10)
!52 = !DIEnumerator(name: "UV_FS_FUTIME", value: 11)
!53 = !DIEnumerator(name: "UV_FS_ACCESS", value: 12)
!54 = !DIEnumerator(name: "UV_FS_CHMOD", value: 13)
!55 = !DIEnumerator(name: "UV_FS_FCHMOD", value: 14)
!56 = !DIEnumerator(name: "UV_FS_FSYNC", value: 15)
!57 = !DIEnumerator(name: "UV_FS_FDATASYNC", value: 16)
!58 = !DIEnumerator(name: "UV_FS_UNLINK", value: 17)
!59 = !DIEnumerator(name: "UV_FS_RMDIR", value: 18)
!60 = !DIEnumerator(name: "UV_FS_MKDIR", value: 19)
!61 = !DIEnumerator(name: "UV_FS_MKDTEMP", value: 20)
!62 = !DIEnumerator(name: "UV_FS_RENAME", value: 21)
!63 = !DIEnumerator(name: "UV_FS_SCANDIR", value: 22)
!64 = !DIEnumerator(name: "UV_FS_LINK", value: 23)
!65 = !DIEnumerator(name: "UV_FS_SYMLINK", value: 24)
!66 = !DIEnumerator(name: "UV_FS_READLINK", value: 25)
!67 = !DIEnumerator(name: "UV_FS_CHOWN", value: 26)
!68 = !DIEnumerator(name: "UV_FS_FCHOWN", value: 27)
!69 = !DIEnumerator(name: "UV_FS_REALPATH", value: 28)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 24, size: 32, align: 32, elements: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!73 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!74 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!75 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!76 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!77 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!78 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!79 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!80 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!81 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!82 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!83 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!84 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!85 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!86 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!87 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!88 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!89 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!90 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!91 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!92 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!93 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!94 = !{!95, !96, !103, !105, !373, !276, !133, !408, !375}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !99, line: 21, baseType: !100)
!99 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, align: 64, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 2)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_t", file: !4, line: 230, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_s", file: !4, line: 1120, size: 3520, align: 64, elements: !108)
!108 = !{!109, !110, !112, !113, !117, !119, !319, !324, !329, !330, !333, !358, !359, !361, !362, !366, !367, !377, !380, !384, !388, !390, !391, !406}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !4, line: 1121, baseType: !95, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !4, line: 1121, baseType: !111, size: 32, align: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !25)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !107, file: !4, line: 1121, baseType: !100, size: 128, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !107, file: !4, line: 1121, baseType: !114, size: 256, align: 64, offset: 256)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, align: 64, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 4)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fs_type", scope: !107, file: !4, line: 1122, baseType: !118, size: 32, align: 32, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_type", file: !4, line: 1117, baseType: !38)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !107, file: !4, line: 1123, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !123)
!123 = !{!124, !125, !127, !128, !129, !130, !132, !134, !135, !136, !155, !156, !157, !158, !189, !234, !258, !259, !260, !261, !262, !263, !264, !268, !269, !270, !275, !278, !279, !281, !282, !315, !316, !317, !318}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !4, line: 1475, baseType: !95, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !122, file: !4, line: 1477, baseType: !126, size: 32, align: 32, offset: 64)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !122, file: !4, line: 1478, baseType: !100, size: 128, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !122, file: !4, line: 1479, baseType: !100, size: 128, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !122, file: !4, line: 1481, baseType: !126, size: 32, align: 32, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !122, file: !4, line: 1482, baseType: !131, size: 64, align: 64, offset: 448)
!131 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !122, file: !4, line: 1482, baseType: !133, size: 32, align: 32, offset: 512)
!133 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !122, file: !4, line: 1482, baseType: !137, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !140, line: 87, baseType: !141)
!140 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !140, line: 89, size: 448, align: 64, elements: !142)
!142 = !{!143, !150, !151, !152, !153, !154}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !141, file: !140, line: 90, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !140, line: 84, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !149, !126}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !141, file: !140, line: 91, baseType: !100, size: 128, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !141, file: !140, line: 92, baseType: !100, size: 128, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !141, file: !140, line: 93, baseType: !126, size: 32, align: 32, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !141, file: !140, line: 94, baseType: !126, size: 32, align: 32, offset: 352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !141, file: !140, line: 95, baseType: !133, size: 32, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !122, file: !4, line: 1482, baseType: !126, size: 32, align: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !122, file: !4, line: 1482, baseType: !126, size: 32, align: 32, offset: 928)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !122, file: !4, line: 1482, baseType: !159, size: 320, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !140, line: 129, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !161, line: 127, baseType: !162)
!161 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!162 = !DICompositeType(tag: DW_TAG_union_type, file: !161, line: 90, size: 320, align: 64, elements: !163)
!163 = !{!164, !182, !187}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !162, file: !161, line: 124, baseType: !165, size: 320, align: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !161, line: 92, size: 320, align: 64, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !174, !175}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !165, file: !161, line: 94, baseType: !133, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !165, file: !161, line: 95, baseType: !126, size: 32, align: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !165, file: !161, line: 96, baseType: !133, size: 32, align: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !165, file: !161, line: 98, baseType: !126, size: 32, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !165, file: !161, line: 102, baseType: !133, size: 32, align: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !165, file: !161, line: 104, baseType: !173, size: 16, align: 16, offset: 160)
!173 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !165, file: !161, line: 105, baseType: !173, size: 16, align: 16, offset: 176)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !165, file: !161, line: 106, baseType: !176, size: 128, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !161, line: 79, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !161, line: 75, size: 128, align: 64, elements: !178)
!178 = !{!179, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !177, file: !161, line: 77, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !177, file: !161, line: 78, baseType: !180, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !162, file: !161, line: 125, baseType: !183, size: 320, align: 8)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 320, align: 8, elements: !185)
!184 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!185 = !{!186}
!186 = !DISubrange(count: 40)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !162, file: !161, line: 126, baseType: !188, size: 64, align: 64)
!188 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !122, file: !4, line: 1482, baseType: !190, size: 1024, align: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !192)
!192 = !{!193, !194, !195, !197, !218, !219, !224, !225, !226, !232, !233}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !4, line: 768, baseType: !95, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !191, file: !4, line: 768, baseType: !120, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !4, line: 768, baseType: !196, size: 32, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !191, file: !4, line: 768, baseType: !198, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !216, !217}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !4, line: 426, baseType: !95, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !204, file: !4, line: 426, baseType: !120, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !4, line: 426, baseType: !196, size: 32, align: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !204, file: !4, line: 426, baseType: !198, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !204, file: !4, line: 426, baseType: !100, size: 128, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !204, file: !4, line: 426, baseType: !212, size: 256, align: 64, offset: 384)
!212 = !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !4, line: 426, size: 256, align: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !212, file: !4, line: 426, baseType: !133, size: 32, align: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !212, file: !4, line: 426, baseType: !114, size: 256, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !204, file: !4, line: 426, baseType: !202, size: 64, align: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !4, line: 426, baseType: !126, size: 32, align: 32, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !191, file: !4, line: 768, baseType: !100, size: 128, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !191, file: !4, line: 768, baseType: !220, size: 256, align: 64, offset: 384)
!220 = !DICompositeType(tag: DW_TAG_union_type, scope: !191, file: !4, line: 768, size: 256, align: 64, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !220, file: !4, line: 768, baseType: !133, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !220, file: !4, line: 768, baseType: !114, size: 256, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !191, file: !4, line: 768, baseType: !202, size: 64, align: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !191, file: !4, line: 768, baseType: !126, size: 32, align: 32, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !191, file: !4, line: 769, baseType: !227, size: 64, align: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !191, file: !4, line: 769, baseType: !100, size: 128, align: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !191, file: !4, line: 769, baseType: !133, size: 32, align: 32, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !122, file: !4, line: 1482, baseType: !235, size: 448, align: 64, offset: 2432)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !140, line: 130, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !161, line: 213, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_union_type, file: !161, line: 173, size: 448, align: 64, elements: !238)
!238 = !{!239, !253, !257}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !237, file: !161, line: 192, baseType: !240, size: 448, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !161, line: 176, size: 448, align: 64, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !240, file: !161, line: 178, baseType: !133, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !240, file: !161, line: 179, baseType: !126, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !240, file: !161, line: 180, baseType: !126, size: 32, align: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !240, file: !161, line: 181, baseType: !126, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !240, file: !161, line: 182, baseType: !126, size: 32, align: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !240, file: !161, line: 183, baseType: !126, size: 32, align: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !240, file: !161, line: 184, baseType: !133, size: 32, align: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !240, file: !161, line: 185, baseType: !133, size: 32, align: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !240, file: !161, line: 186, baseType: !131, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !240, file: !161, line: 187, baseType: !131, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !240, file: !161, line: 190, baseType: !126, size: 32, align: 32, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !237, file: !161, line: 211, baseType: !254, size: 448, align: 8)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 448, align: 8, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 56)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !237, file: !161, line: 212, baseType: !188, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !122, file: !4, line: 1482, baseType: !202, size: 64, align: 64, offset: 2880)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 2944)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 3072)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 3200)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 3328)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !122, file: !4, line: 1482, baseType: !100, size: 128, align: 64, offset: 3456)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !122, file: !4, line: 1482, baseType: !265, size: 64, align: 64, offset: 3584)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !122, file: !4, line: 1482, baseType: !139, size: 448, align: 64, offset: 3648)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !122, file: !4, line: 1482, baseType: !133, size: 32, align: 32, offset: 4096)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !122, file: !4, line: 1482, baseType: !271, size: 128, align: 64, offset: 4160)
!271 = !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !4, line: 1482, size: 128, align: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !271, file: !4, line: 1482, baseType: !95, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !271, file: !4, line: 1482, baseType: !126, size: 32, align: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !122, file: !4, line: 1482, baseType: !276, size: 64, align: 64, offset: 4288)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !277, line: 55, baseType: !131)
!277 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !122, file: !4, line: 1482, baseType: !276, size: 64, align: 64, offset: 4352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !122, file: !4, line: 1482, baseType: !280, size: 64, align: 32, offset: 4416)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, align: 32, elements: !101)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !122, file: !4, line: 1482, baseType: !139, size: 448, align: 64, offset: 4480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !122, file: !4, line: 1482, baseType: !283, size: 1216, align: 64, offset: 4928)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !284)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !296, !297, !298, !304, !305, !313, !314}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !4, line: 1326, baseType: !95, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !284, file: !4, line: 1326, baseType: !120, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !4, line: 1326, baseType: !196, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !284, file: !4, line: 1326, baseType: !198, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !284, file: !4, line: 1326, baseType: !100, size: 128, align: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !284, file: !4, line: 1326, baseType: !292, size: 256, align: 64, offset: 384)
!292 = !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !4, line: 1326, size: 256, align: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !292, file: !4, line: 1326, baseType: !133, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !292, file: !4, line: 1326, baseType: !114, size: 256, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !284, file: !4, line: 1326, baseType: !202, size: 64, align: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !284, file: !4, line: 1326, baseType: !126, size: 32, align: 32, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !284, file: !4, line: 1327, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !303, !133}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !284, file: !4, line: 1328, baseType: !133, size: 32, align: 32, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !284, file: !4, line: 1329, baseType: !306, size: 256, align: 64, offset: 896)
!306 = !DICompositeType(tag: DW_TAG_structure_type, scope: !284, file: !4, line: 1329, size: 256, align: 64, elements: !307)
!307 = !{!308, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !306, file: !4, line: 1329, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !306, file: !4, line: 1329, baseType: !309, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !306, file: !4, line: 1329, baseType: !309, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !306, file: !4, line: 1329, baseType: !133, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !284, file: !4, line: 1329, baseType: !126, size: 32, align: 32, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !284, file: !4, line: 1329, baseType: !126, size: 32, align: 32, offset: 1184)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !122, file: !4, line: 1482, baseType: !133, size: 32, align: 32, offset: 6144)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !122, file: !4, line: 1482, baseType: !139, size: 448, align: 64, offset: 6208)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !122, file: !4, line: 1482, baseType: !95, size: 64, align: 64, offset: 6656)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !122, file: !4, line: 1482, baseType: !133, size: 32, align: 32, offset: 6720)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !107, file: !4, line: 1124, baseType: !320, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_cb", file: !4, line: 315, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !105}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !107, file: !4, line: 1125, baseType: !325, size: 64, align: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !326, line: 102, baseType: !327)
!326 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !328, line: 172, baseType: !188)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !107, file: !4, line: 1126, baseType: !95, size: 64, align: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !107, file: !4, line: 1127, baseType: !331, size: 64, align: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "statbuf", scope: !107, file: !4, line: 1128, baseType: !334, size: 1280, align: 64, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stat_t", file: !4, line: 349, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 332, size: 1280, align: 64, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !355, !356, !357}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !335, file: !4, line: 333, baseType: !276, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !335, file: !4, line: 334, baseType: !276, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !335, file: !4, line: 335, baseType: !276, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !335, file: !4, line: 336, baseType: !276, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !335, file: !4, line: 337, baseType: !276, size: 64, align: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !335, file: !4, line: 338, baseType: !276, size: 64, align: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !335, file: !4, line: 339, baseType: !276, size: 64, align: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !335, file: !4, line: 340, baseType: !276, size: 64, align: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !335, file: !4, line: 341, baseType: !276, size: 64, align: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !335, file: !4, line: 342, baseType: !276, size: 64, align: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !335, file: !4, line: 343, baseType: !276, size: 64, align: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !335, file: !4, line: 344, baseType: !276, size: 64, align: 64, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !335, file: !4, line: 345, baseType: !350, size: 128, align: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_timespec_t", file: !4, line: 329, baseType: !351)
!351 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 326, size: 128, align: 64, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !351, file: !4, line: 327, baseType: !188, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !351, file: !4, line: 328, baseType: !188, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !335, file: !4, line: 346, baseType: !350, size: 128, align: 64, offset: 896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !335, file: !4, line: 347, baseType: !350, size: 128, align: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtim", scope: !335, file: !4, line: 348, baseType: !350, size: 128, align: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "new_path", scope: !107, file: !4, line: 1129, baseType: !331, size: 64, align: 64, offset: 2176)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !107, file: !4, line: 1129, baseType: !360, size: 32, align: 32, offset: 2240)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_file", file: !140, line: 121, baseType: !133)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !4, line: 1129, baseType: !133, size: 32, align: 32, offset: 2272)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !107, file: !4, line: 1129, baseType: !363, size: 32, align: 32, offset: 2304)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !364, line: 70, baseType: !365)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !328, line: 129, baseType: !126)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !107, file: !4, line: 1129, baseType: !126, size: 32, align: 32, offset: 2336)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !107, file: !4, line: 1129, baseType: !368, size: 64, align: 64, offset: 2368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !140, line: 119, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !140, line: 116, size: 128, align: 64, elements: !371)
!371 = !{!372, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !370, file: !140, line: 117, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !370, file: !140, line: 118, baseType: !375, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !376, line: 62, baseType: !131)
!376 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!377 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !107, file: !4, line: 1129, baseType: !378, size: 64, align: 64, offset: 2432)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !326, line: 92, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !328, line: 132, baseType: !188)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !107, file: !4, line: 1129, baseType: !381, size: 32, align: 32, offset: 2496)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_uid_t", file: !140, line: 139, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !364, line: 80, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !328, line: 125, baseType: !126)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !107, file: !4, line: 1129, baseType: !385, size: 32, align: 32, offset: 2528)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_gid_t", file: !140, line: 138, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !364, line: 65, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !328, line: 126, baseType: !126)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !107, file: !4, line: 1129, baseType: !389, size: 64, align: 64, offset: 2560)
!389 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !107, file: !4, line: 1129, baseType: !389, size: 64, align: 64, offset: 2624)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !107, file: !4, line: 1129, baseType: !392, size: 320, align: 64, offset: 2688)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__work", file: !393, line: 30, size: 320, align: 64, elements: !394)
!393 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-threadpool.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!394 = !{!395, !400, !404, !405}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !392, file: !393, line: 31, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !392, file: !393, line: 32, baseType: !401, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !399, !133}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !392, file: !393, line: 33, baseType: !148, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !392, file: !393, line: 34, baseType: !100, size: 128, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !107, file: !4, line: 1129, baseType: !407, size: 512, align: 64, offset: 3008)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 512, align: 64, elements: !115)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !410, line: 43, size: 128, align: 64, elements: !411)
!410 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !409, file: !410, line: 45, baseType: !95, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !409, file: !410, line: 46, baseType: !375, size: 64, align: 64, offset: 64)
!414 = !{!415, !419, !420, !423, !426, !429, !432, !433, !434, !435, !439, !442, !445, !448, !449, !450, !453, !458, !459, !460, !461, !462, !463, !466, !467, !470, !471, !474, !475, !476, !477, !480, !484, !522, !523, !524, !527, !528, !529, !534, !535, !536, !556, !560, !561, !564, !565, !566, !567, !568, !569, !570}
!415 = distinct !DISubprogram(name: "uv_fs_access", scope: !1, file: !1, line: 1016, type: !416, isLocal: false, isDefinition: true, scopeLine: 1020, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{!133, !120, !105, !331, !133, !320}
!418 = !{}
!419 = distinct !DISubprogram(name: "uv_fs_chmod", scope: !1, file: !1, line: 1028, type: !416, isLocal: false, isDefinition: true, scopeLine: 1032, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!420 = distinct !DISubprogram(name: "uv_fs_chown", scope: !1, file: !1, line: 1040, type: !421, isLocal: false, isDefinition: true, scopeLine: 1045, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!421 = !DISubroutineType(types: !422)
!422 = !{!133, !120, !105, !331, !381, !385, !320}
!423 = distinct !DISubprogram(name: "uv_fs_close", scope: !1, file: !1, line: 1054, type: !424, isLocal: false, isDefinition: true, scopeLine: 1054, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!424 = !DISubroutineType(types: !425)
!425 = !{!133, !120, !105, !360, !320}
!426 = distinct !DISubprogram(name: "uv_fs_fchmod", scope: !1, file: !1, line: 1061, type: !427, isLocal: false, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!427 = !DISubroutineType(types: !428)
!428 = !{!133, !120, !105, !360, !133, !320}
!429 = distinct !DISubprogram(name: "uv_fs_fchown", scope: !1, file: !1, line: 1073, type: !430, isLocal: false, isDefinition: true, scopeLine: 1078, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!430 = !DISubroutineType(types: !431)
!431 = !{!133, !120, !105, !360, !381, !385, !320}
!432 = distinct !DISubprogram(name: "uv_fs_fdatasync", scope: !1, file: !1, line: 1087, type: !424, isLocal: false, isDefinition: true, scopeLine: 1087, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!433 = distinct !DISubprogram(name: "uv_fs_fstat", scope: !1, file: !1, line: 1094, type: !424, isLocal: false, isDefinition: true, scopeLine: 1094, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!434 = distinct !DISubprogram(name: "uv_fs_fsync", scope: !1, file: !1, line: 1101, type: !424, isLocal: false, isDefinition: true, scopeLine: 1101, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!435 = distinct !DISubprogram(name: "uv_fs_ftruncate", scope: !1, file: !1, line: 1108, type: !436, isLocal: false, isDefinition: true, scopeLine: 1112, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!436 = !DISubroutineType(types: !437)
!437 = !{!133, !120, !105, !360, !438, !320}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !277, line: 40, baseType: !188)
!439 = distinct !DISubprogram(name: "uv_fs_futime", scope: !1, file: !1, line: 1120, type: !440, isLocal: false, isDefinition: true, scopeLine: 1125, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!440 = !DISubroutineType(types: !441)
!441 = !{!133, !120, !105, !360, !389, !389, !320}
!442 = distinct !DISubprogram(name: "uv_fs_lstat", scope: !1, file: !1, line: 1134, type: !443, isLocal: false, isDefinition: true, scopeLine: 1134, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!443 = !DISubroutineType(types: !444)
!444 = !{!133, !120, !105, !331, !320}
!445 = distinct !DISubprogram(name: "uv_fs_link", scope: !1, file: !1, line: 1141, type: !446, isLocal: false, isDefinition: true, scopeLine: 1145, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!446 = !DISubroutineType(types: !447)
!447 = !{!133, !120, !105, !331, !331, !320}
!448 = distinct !DISubprogram(name: "uv_fs_mkdir", scope: !1, file: !1, line: 1152, type: !416, isLocal: false, isDefinition: true, scopeLine: 1156, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!449 = distinct !DISubprogram(name: "uv_fs_mkdtemp", scope: !1, file: !1, line: 1164, type: !443, isLocal: false, isDefinition: true, scopeLine: 1167, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!450 = distinct !DISubprogram(name: "uv_fs_open", scope: !1, file: !1, line: 1179, type: !451, isLocal: false, isDefinition: true, scopeLine: 1184, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!451 = !DISubroutineType(types: !452)
!452 = !{!133, !120, !105, !331, !133, !133, !320}
!453 = distinct !DISubprogram(name: "uv_fs_read", scope: !1, file: !1, line: 1193, type: !454, isLocal: false, isDefinition: true, scopeLine: 1198, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!454 = !DISubroutineType(types: !455)
!455 = !{!133, !120, !105, !360, !456, !126, !438, !320}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!458 = distinct !DISubprogram(name: "uv_fs_scandir", scope: !1, file: !1, line: 1223, type: !416, isLocal: false, isDefinition: true, scopeLine: 1227, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!459 = distinct !DISubprogram(name: "uv_fs_readlink", scope: !1, file: !1, line: 1235, type: !443, isLocal: false, isDefinition: true, scopeLine: 1238, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!460 = distinct !DISubprogram(name: "uv_fs_realpath", scope: !1, file: !1, line: 1245, type: !443, isLocal: false, isDefinition: true, scopeLine: 1248, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!461 = distinct !DISubprogram(name: "uv_fs_rename", scope: !1, file: !1, line: 1255, type: !446, isLocal: false, isDefinition: true, scopeLine: 1259, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!462 = distinct !DISubprogram(name: "uv_fs_rmdir", scope: !1, file: !1, line: 1266, type: !443, isLocal: false, isDefinition: true, scopeLine: 1266, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!463 = distinct !DISubprogram(name: "uv_fs_sendfile", scope: !1, file: !1, line: 1273, type: !464, isLocal: false, isDefinition: true, scopeLine: 1279, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!464 = !DISubroutineType(types: !465)
!465 = !{!133, !120, !105, !360, !360, !438, !375, !320}
!466 = distinct !DISubprogram(name: "uv_fs_stat", scope: !1, file: !1, line: 1289, type: !443, isLocal: false, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!467 = distinct !DISubprogram(name: "uv_fs_symlink", scope: !1, file: !1, line: 1296, type: !468, isLocal: false, isDefinition: true, scopeLine: 1301, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!468 = !DISubroutineType(types: !469)
!469 = !{!133, !120, !105, !331, !331, !133, !320}
!470 = distinct !DISubprogram(name: "uv_fs_unlink", scope: !1, file: !1, line: 1309, type: !443, isLocal: false, isDefinition: true, scopeLine: 1309, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!471 = distinct !DISubprogram(name: "uv_fs_utime", scope: !1, file: !1, line: 1316, type: !472, isLocal: false, isDefinition: true, scopeLine: 1321, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!472 = !DISubroutineType(types: !473)
!473 = !{!133, !120, !105, !331, !389, !389, !320}
!474 = distinct !DISubprogram(name: "uv_fs_write", scope: !1, file: !1, line: 1330, type: !454, isLocal: false, isDefinition: true, scopeLine: 1336, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!475 = distinct !DISubprogram(name: "uv_fs_req_cleanup", scope: !1, file: !1, line: 1361, type: !322, isLocal: false, isDefinition: true, scopeLine: 1361, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!476 = distinct !DISubprogram(name: "uv__fs_work", scope: !1, file: !1, line: 938, type: !397, isLocal: true, isDefinition: true, scopeLine: 938, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!477 = distinct !DISubprogram(name: "uv__fs_fdatasync", scope: !1, file: !1, line: 129, type: !478, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!478 = !DISubroutineType(types: !479)
!479 = !{!325, !105}
!480 = distinct !DISubprogram(name: "uv__fs_fstat", scope: !1, file: !1, line: 880, type: !481, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!481 = !DISubroutineType(types: !482)
!482 = !{!133, !133, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!484 = distinct !DISubprogram(name: "uv__to_stat", scope: !1, file: !1, line: 779, type: !485, isLocal: true, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487, !483}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !489, line: 46, size: 1152, align: 64, elements: !490)
!489 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!490 = !{!491, !493, !495, !497, !498, !499, !500, !501, !502, !504, !506, !508, !516, !517, !518}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !488, file: !489, line: 48, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !328, line: 124, baseType: !131)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !488, file: !489, line: 53, baseType: !494, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !328, line: 127, baseType: !131)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !488, file: !489, line: 61, baseType: !496, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !328, line: 130, baseType: !131)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !488, file: !489, line: 62, baseType: !365, size: 32, align: 32, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !488, file: !489, line: 64, baseType: !383, size: 32, align: 32, offset: 224)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !488, file: !489, line: 65, baseType: !387, size: 32, align: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !488, file: !489, line: 67, baseType: !133, size: 32, align: 32, offset: 288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !488, file: !489, line: 69, baseType: !492, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !488, file: !489, line: 74, baseType: !503, size: 64, align: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !328, line: 131, baseType: !188)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !488, file: !489, line: 78, baseType: !505, size: 64, align: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !328, line: 153, baseType: !188)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !488, file: !489, line: 80, baseType: !507, size: 64, align: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !328, line: 158, baseType: !188)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !488, file: !489, line: 91, baseType: !509, size: 128, align: 64, offset: 576)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !510, line: 120, size: 128, align: 64, elements: !511)
!510 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!511 = !{!512, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !509, file: !510, line: 122, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !328, line: 139, baseType: !188)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !509, file: !510, line: 123, baseType: !515, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !328, line: 175, baseType: !188)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !488, file: !489, line: 92, baseType: !509, size: 128, align: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !488, file: !489, line: 93, baseType: !509, size: 128, align: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !488, file: !489, line: 106, baseType: !519, size: 192, align: 64, offset: 960)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 192, align: 64, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 3)
!522 = distinct !DISubprogram(name: "uv__fs_fsync", scope: !1, file: !1, line: 145, type: !478, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!523 = distinct !DISubprogram(name: "uv__fs_futime", scope: !1, file: !1, line: 155, type: !478, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!524 = distinct !DISubprogram(name: "uv__fs_lstat", scope: !1, file: !1, line: 868, type: !525, isLocal: true, isDefinition: true, scopeLine: 868, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!525 = !DISubroutineType(types: !526)
!526 = !{!133, !331, !483}
!527 = distinct !DISubprogram(name: "uv__fs_mkdtemp", scope: !1, file: !1, line: 258, type: !478, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!528 = distinct !DISubprogram(name: "uv__fs_open", scope: !1, file: !1, line: 263, type: !478, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!529 = distinct !DISubprogram(name: "uv__fs_buf_iter", scope: !1, file: !1, line: 893, type: !530, isLocal: true, isDefinition: true, scopeLine: 893, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!530 = !DISubroutineType(types: !531)
!531 = !{!325, !105, !532}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__fs_buf_iter_processor", file: !1, line: 892, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!534 = distinct !DISubprogram(name: "uv__fs_read", scope: !1, file: !1, line: 301, type: !478, isLocal: true, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!535 = distinct !DISubprogram(name: "uv__fs_scandir", scope: !1, file: !1, line: 391, type: !478, isLocal: true, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!536 = distinct !DISubprogram(name: "uv__fs_scandir_filter", scope: !1, file: !1, line: 381, type: !537, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!537 = !DISubroutineType(types: !538)
!538 = !{!133, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__dirent_t", file: !140, line: 141, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !543, line: 22, size: 2240, align: 64, elements: !544)
!543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!544 = !{!545, !547, !548, !550, !552}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !542, file: !543, line: 28, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !328, line: 128, baseType: !131)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !542, file: !543, line: 29, baseType: !379, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !542, file: !543, line: 31, baseType: !549, size: 16, align: 16, offset: 128)
!549 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !542, file: !543, line: 32, baseType: !551, size: 8, align: 8, offset: 144)
!551 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !542, file: !543, line: 33, baseType: !553, size: 2048, align: 8, offset: 152)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 2048, align: 8, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 256)
!556 = distinct !DISubprogram(name: "uv__fs_scandir_sort", scope: !1, file: !1, line: 386, type: !557, isLocal: true, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!557 = !DISubroutineType(types: !558)
!558 = !{!133, !559, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!560 = distinct !DISubprogram(name: "uv__fs_readlink", scope: !1, file: !1, line: 433, type: !478, isLocal: true, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!561 = distinct !DISubprogram(name: "uv__fs_pathmax_size", scope: !1, file: !1, line: 417, type: !562, isLocal: true, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!562 = !DISubroutineType(types: !563)
!563 = !{!325, !331}
!564 = distinct !DISubprogram(name: "uv__fs_realpath", scope: !1, file: !1, line: 458, type: !478, isLocal: true, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!565 = distinct !DISubprogram(name: "uv__fs_sendfile", scope: !1, file: !1, line: 594, type: !478, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!566 = distinct !DISubprogram(name: "uv__fs_sendfile_emul", scope: !1, file: !1, line: 480, type: !478, isLocal: true, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!567 = distinct !DISubprogram(name: "uv__fs_stat", scope: !1, file: !1, line: 856, type: !525, isLocal: true, isDefinition: true, scopeLine: 856, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!568 = distinct !DISubprogram(name: "uv__fs_utime", scope: !1, file: !1, line: 693, type: !478, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!569 = distinct !DISubprogram(name: "uv__fs_write", scope: !1, file: !1, line: 701, type: !478, isLocal: true, isDefinition: true, scopeLine: 701, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!570 = distinct !DISubprogram(name: "uv__fs_done", scope: !1, file: !1, line: 1001, type: !402, isLocal: true, isDefinition: true, scopeLine: 1001, flags: DIFlagPrototyped, isOptimized: false, variables: !418)
!571 = !{!572, !573, !574, !575}
!572 = !DIGlobalVariable(name: "no_utimesat", scope: !523, file: !1, line: 160, type: !133, isLocal: true, isDefinition: true, variable: i32* @uv__fs_futime.no_utimesat)
!573 = !DIGlobalVariable(name: "no_cloexec_support", scope: !528, file: !1, line: 264, type: !133, isLocal: true, isDefinition: true, variable: i32* @uv__fs_open.no_cloexec_support)
!574 = !DIGlobalVariable(name: "no_preadv", scope: !534, file: !1, line: 303, type: !133, isLocal: true, isDefinition: true, variable: i32* @uv__fs_read.no_preadv)
!575 = !DIGlobalVariable(name: "no_pwritev", scope: !569, file: !1, line: 703, type: !133, isLocal: true, isDefinition: true, variable: i32* @uv__fs_write.no_pwritev)
!576 = !{i32 2, !"Dwarf Version", i32 4}
!577 = !{i32 2, !"Debug Info Version", i32 3}
!578 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!579 = !DILocalVariable(name: "loop", arg: 1, scope: !415, file: !1, line: 1016, type: !120)
!580 = !DIExpression()
!581 = !DILocation(line: 1016, column: 29, scope: !415)
!582 = !DILocalVariable(name: "req", arg: 2, scope: !415, file: !1, line: 1017, type: !105)
!583 = !DILocation(line: 1017, column: 27, scope: !415)
!584 = !DILocalVariable(name: "path", arg: 3, scope: !415, file: !1, line: 1018, type: !331)
!585 = !DILocation(line: 1018, column: 30, scope: !415)
!586 = !DILocalVariable(name: "flags", arg: 4, scope: !415, file: !1, line: 1019, type: !133)
!587 = !DILocation(line: 1019, column: 22, scope: !415)
!588 = !DILocalVariable(name: "cb", arg: 5, scope: !415, file: !1, line: 1020, type: !320)
!589 = !DILocation(line: 1020, column: 27, scope: !415)
!590 = !DILocation(line: 1021, column: 3, scope: !415)
!591 = !DILocation(line: 1021, column: 3, scope: !592)
!592 = !DILexicalBlockFile(scope: !593, file: !1, discriminator: 1)
!593 = distinct !DILexicalBlock(scope: !415, file: !1, line: 1021, column: 3)
!594 = !DILocation(line: 1021, column: 3, scope: !595)
!595 = !DILexicalBlockFile(scope: !596, file: !1, discriminator: 2)
!596 = distinct !DILexicalBlock(scope: !593, file: !1, line: 1021, column: 3)
!597 = !DILocation(line: 1021, column: 3, scope: !598)
!598 = !DILexicalBlockFile(scope: !599, file: !1, discriminator: 3)
!599 = distinct !DILexicalBlock(scope: !596, file: !1, line: 1021, column: 3)
!600 = !DILocation(line: 1021, column: 3, scope: !601)
!601 = !DILexicalBlockFile(scope: !602, file: !1, discriminator: 4)
!602 = distinct !DILexicalBlock(scope: !599, file: !1, line: 1021, column: 3)
!603 = !DILocation(line: 1021, column: 3, scope: !604)
!604 = !DILexicalBlockFile(scope: !599, file: !1, discriminator: 5)
!605 = !DILocation(line: 1021, column: 3, scope: !606)
!606 = !DILexicalBlockFile(scope: !607, file: !1, discriminator: 6)
!607 = distinct !DILexicalBlock(scope: !599, file: !1, line: 1021, column: 3)
!608 = !DILocation(line: 1021, column: 3, scope: !609)
!609 = !DILexicalBlockFile(scope: !610, file: !1, discriminator: 7)
!610 = distinct !DILexicalBlock(scope: !607, file: !1, line: 1021, column: 3)
!611 = !DILocation(line: 1021, column: 3, scope: !612)
!612 = !DILexicalBlockFile(scope: !607, file: !1, discriminator: 8)
!613 = !DILocation(line: 1021, column: 3, scope: !614)
!614 = !DILexicalBlockFile(scope: !599, file: !1, discriminator: 9)
!615 = !DILocation(line: 1021, column: 3, scope: !616)
!616 = !DILexicalBlockFile(scope: !599, file: !1, discriminator: 10)
!617 = !DILocation(line: 1021, column: 3, scope: !618)
!618 = !DILexicalBlockFile(scope: !593, file: !1, discriminator: 11)
!619 = !DILocation(line: 1022, column: 3, scope: !415)
!620 = !DILocation(line: 1022, column: 3, scope: !621)
!621 = !DILexicalBlockFile(scope: !622, file: !1, discriminator: 1)
!622 = distinct !DILexicalBlock(scope: !415, file: !1, line: 1022, column: 3)
!623 = !DILocation(line: 1022, column: 3, scope: !624)
!624 = !DILexicalBlockFile(scope: !622, file: !1, discriminator: 2)
!625 = !DILocation(line: 1022, column: 3, scope: !626)
!626 = !DILexicalBlockFile(scope: !622, file: !1, discriminator: 3)
!627 = !DILocation(line: 1022, column: 3, scope: !628)
!628 = !DILexicalBlockFile(scope: !622, file: !1, discriminator: 4)
!629 = !DILocation(line: 1022, column: 3, scope: !630)
!630 = !DILexicalBlockFile(scope: !631, file: !1, discriminator: 5)
!631 = distinct !DILexicalBlock(scope: !622, file: !1, line: 1022, column: 3)
!632 = !DILocation(line: 1022, column: 3, scope: !633)
!633 = !DILexicalBlockFile(scope: !634, file: !1, discriminator: 6)
!634 = distinct !DILexicalBlock(scope: !631, file: !1, line: 1022, column: 3)
!635 = !DILocation(line: 1022, column: 3, scope: !636)
!636 = !DILexicalBlockFile(scope: !637, file: !1, discriminator: 7)
!637 = distinct !DILexicalBlock(scope: !631, file: !1, line: 1022, column: 3)
!638 = !DILocation(line: 1022, column: 3, scope: !639)
!639 = !DILexicalBlockFile(scope: !640, file: !1, discriminator: 8)
!640 = distinct !DILexicalBlock(scope: !641, file: !1, line: 1022, column: 3)
!641 = distinct !DILexicalBlock(scope: !637, file: !1, line: 1022, column: 3)
!642 = !DILocation(line: 1022, column: 3, scope: !643)
!643 = !DILexicalBlockFile(scope: !644, file: !1, discriminator: 9)
!644 = distinct !DILexicalBlock(scope: !640, file: !1, line: 1022, column: 3)
!645 = !DILocation(line: 1022, column: 3, scope: !646)
!646 = !DILexicalBlockFile(scope: !644, file: !1, discriminator: 10)
!647 = !DILocation(line: 1022, column: 3, scope: !648)
!648 = !DILexicalBlockFile(scope: !644, file: !1, discriminator: 11)
!649 = !DILocation(line: 1022, column: 3, scope: !650)
!650 = !DILexicalBlockFile(scope: !644, file: !1, discriminator: 12)
!651 = !DILocation(line: 1022, column: 3, scope: !652)
!652 = !DILexicalBlockFile(scope: !644, file: !1, discriminator: 13)
!653 = !DILocation(line: 1022, column: 3, scope: !654)
!654 = !DILexicalBlockFile(scope: !655, file: !1, discriminator: 14)
!655 = distinct !DILexicalBlock(scope: !644, file: !1, line: 1022, column: 3)
!656 = !DILocation(line: 1022, column: 3, scope: !657)
!657 = !DILexicalBlockFile(scope: !644, file: !1, discriminator: 15)
!658 = !DILocation(line: 1022, column: 3, scope: !659)
!659 = !DILexicalBlockFile(scope: !640, file: !1, discriminator: 16)
!660 = !DILocation(line: 1022, column: 3, scope: !661)
!661 = !DILexicalBlockFile(scope: !622, file: !1, discriminator: 17)
!662 = !DILocation(line: 1023, column: 16, scope: !415)
!663 = !DILocation(line: 1023, column: 3, scope: !415)
!664 = !DILocation(line: 1023, column: 8, scope: !415)
!665 = !DILocation(line: 1023, column: 14, scope: !415)
!666 = !DILocation(line: 1024, column: 3, scope: !415)
!667 = !DILocation(line: 1024, column: 3, scope: !668)
!668 = !DILexicalBlockFile(scope: !669, file: !1, discriminator: 1)
!669 = distinct !DILexicalBlock(scope: !670, file: !1, line: 1024, column: 3)
!670 = distinct !DILexicalBlock(scope: !415, file: !1, line: 1024, column: 3)
!671 = !DILocation(line: 1024, column: 3, scope: !672)
!672 = !DILexicalBlockFile(scope: !673, file: !1, discriminator: 2)
!673 = distinct !DILexicalBlock(scope: !669, file: !1, line: 1024, column: 3)
!674 = !DILocation(line: 1024, column: 3, scope: !675)
!675 = !DILexicalBlockFile(scope: !676, file: !1, discriminator: 3)
!676 = distinct !DILexicalBlock(scope: !669, file: !1, line: 1024, column: 3)
!677 = !DILocation(line: 1025, column: 1, scope: !415)
!678 = !DILocalVariable(name: "w", arg: 1, scope: !476, file: !1, line: 938, type: !399)
!679 = !DILocation(line: 938, column: 42, scope: !476)
!680 = !DILocalVariable(name: "retry_on_eintr", scope: !476, file: !1, line: 939, type: !133)
!681 = !DILocation(line: 939, column: 7, scope: !476)
!682 = !DILocalVariable(name: "req", scope: !476, file: !1, line: 940, type: !105)
!683 = !DILocation(line: 940, column: 12, scope: !476)
!684 = !DILocalVariable(name: "r", scope: !476, file: !1, line: 941, type: !325)
!685 = !DILocation(line: 941, column: 11, scope: !476)
!686 = !DILocation(line: 943, column: 9, scope: !476)
!687 = !DILocation(line: 943, column: 7, scope: !476)
!688 = !DILocation(line: 944, column: 22, scope: !476)
!689 = !DILocation(line: 944, column: 27, scope: !476)
!690 = !DILocation(line: 944, column: 35, scope: !476)
!691 = !DILocation(line: 944, column: 20, scope: !476)
!692 = !DILocation(line: 944, column: 18, scope: !476)
!693 = !DILocation(line: 946, column: 3, scope: !476)
!694 = !DILocation(line: 947, column: 5, scope: !695)
!695 = distinct !DILexicalBlock(scope: !476, file: !1, line: 946, column: 6)
!696 = !DILocation(line: 947, column: 11, scope: !695)
!697 = !DILocation(line: 954, column: 13, scope: !695)
!698 = !DILocation(line: 954, column: 18, scope: !695)
!699 = !DILocation(line: 954, column: 5, scope: !695)
!700 = !DILocation(line: 955, column: 5, scope: !701)
!701 = distinct !DILexicalBlock(scope: !695, file: !1, line: 954, column: 27)
!702 = !DILocation(line: 956, column: 5, scope: !701)
!703 = !DILocation(line: 957, column: 5, scope: !701)
!704 = !DILocation(line: 958, column: 5, scope: !701)
!705 = !DILocation(line: 959, column: 5, scope: !701)
!706 = !DILocation(line: 960, column: 5, scope: !701)
!707 = !DILocation(line: 961, column: 5, scope: !701)
!708 = !DILocation(line: 962, column: 5, scope: !701)
!709 = !DILocation(line: 963, column: 5, scope: !701)
!710 = !DILocation(line: 964, column: 5, scope: !701)
!711 = !DILocation(line: 965, column: 5, scope: !701)
!712 = !DILocation(line: 966, column: 5, scope: !701)
!713 = !DILocation(line: 967, column: 5, scope: !701)
!714 = !DILocation(line: 968, column: 5, scope: !701)
!715 = !DILocation(line: 969, column: 5, scope: !701)
!716 = !DILocation(line: 970, column: 5, scope: !701)
!717 = !DILocation(line: 971, column: 5, scope: !701)
!718 = !DILocation(line: 972, column: 5, scope: !701)
!719 = !DILocation(line: 973, column: 5, scope: !701)
!720 = !DILocation(line: 974, column: 5, scope: !701)
!721 = !DILocation(line: 975, column: 5, scope: !701)
!722 = !DILocation(line: 976, column: 5, scope: !701)
!723 = !DILocation(line: 977, column: 5, scope: !701)
!724 = !DILocation(line: 978, column: 5, scope: !701)
!725 = !DILocation(line: 979, column: 5, scope: !701)
!726 = !DILocation(line: 980, column: 5, scope: !701)
!727 = !DILocation(line: 981, column: 5, scope: !701)
!728 = !DILocation(line: 982, column: 5, scope: !701)
!729 = !DILocation(line: 983, column: 14, scope: !701)
!730 = !DILocation(line: 986, column: 3, scope: !695)
!731 = !DILocation(line: 986, column: 12, scope: !732)
!732 = !DILexicalBlockFile(scope: !476, file: !1, discriminator: 1)
!733 = !DILocation(line: 986, column: 14, scope: !732)
!734 = !DILocation(line: 986, column: 20, scope: !732)
!735 = !DILocation(line: 986, column: 23, scope: !736)
!736 = !DILexicalBlockFile(scope: !476, file: !1, discriminator: 2)
!737 = !DILocation(line: 986, column: 29, scope: !736)
!738 = !DILocation(line: 986, column: 38, scope: !736)
!739 = !DILocation(line: 986, column: 41, scope: !740)
!740 = !DILexicalBlockFile(scope: !476, file: !1, discriminator: 3)
!741 = !DILocation(line: 986, column: 38, scope: !740)
!742 = !DILocation(line: 986, column: 3, scope: !743)
!743 = !DILexicalBlockFile(scope: !695, file: !1, discriminator: 4)
!744 = !DILocation(line: 988, column: 7, scope: !745)
!745 = distinct !DILexicalBlock(scope: !476, file: !1, line: 988, column: 7)
!746 = !DILocation(line: 988, column: 9, scope: !745)
!747 = !DILocation(line: 988, column: 7, scope: !476)
!748 = !DILocation(line: 989, column: 20, scope: !745)
!749 = !DILocation(line: 989, column: 19, scope: !745)
!750 = !DILocation(line: 989, column: 5, scope: !745)
!751 = !DILocation(line: 989, column: 10, scope: !745)
!752 = !DILocation(line: 989, column: 17, scope: !745)
!753 = !DILocation(line: 991, column: 19, scope: !745)
!754 = !DILocation(line: 991, column: 5, scope: !745)
!755 = !DILocation(line: 991, column: 10, scope: !745)
!756 = !DILocation(line: 991, column: 17, scope: !745)
!757 = !DILocation(line: 993, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !476, file: !1, line: 993, column: 7)
!759 = !DILocation(line: 993, column: 9, scope: !758)
!760 = !DILocation(line: 993, column: 14, scope: !758)
!761 = !DILocation(line: 993, column: 18, scope: !762)
!762 = !DILexicalBlockFile(scope: !758, file: !1, discriminator: 1)
!763 = !DILocation(line: 993, column: 23, scope: !762)
!764 = !DILocation(line: 993, column: 31, scope: !762)
!765 = !DILocation(line: 993, column: 45, scope: !762)
!766 = !DILocation(line: 994, column: 18, scope: !758)
!767 = !DILocation(line: 994, column: 23, scope: !758)
!768 = !DILocation(line: 994, column: 31, scope: !758)
!769 = !DILocation(line: 994, column: 46, scope: !758)
!770 = !DILocation(line: 995, column: 18, scope: !758)
!771 = !DILocation(line: 995, column: 23, scope: !758)
!772 = !DILocation(line: 995, column: 31, scope: !758)
!773 = !DILocation(line: 993, column: 7, scope: !736)
!774 = !DILocation(line: 996, column: 17, scope: !775)
!775 = distinct !DILexicalBlock(scope: !758, file: !1, line: 995, column: 48)
!776 = !DILocation(line: 996, column: 22, scope: !775)
!777 = !DILocation(line: 996, column: 16, scope: !775)
!778 = !DILocation(line: 996, column: 5, scope: !775)
!779 = !DILocation(line: 996, column: 10, scope: !775)
!780 = !DILocation(line: 996, column: 14, scope: !775)
!781 = !DILocation(line: 997, column: 3, scope: !775)
!782 = !DILocation(line: 998, column: 1, scope: !476)
!783 = !DILocalVariable(name: "w", arg: 1, scope: !570, file: !1, line: 1001, type: !399)
!784 = !DILocation(line: 1001, column: 42, scope: !570)
!785 = !DILocalVariable(name: "status", arg: 2, scope: !570, file: !1, line: 1001, type: !133)
!786 = !DILocation(line: 1001, column: 49, scope: !570)
!787 = !DILocalVariable(name: "req", scope: !570, file: !1, line: 1002, type: !105)
!788 = !DILocation(line: 1002, column: 12, scope: !570)
!789 = !DILocation(line: 1004, column: 9, scope: !570)
!790 = !DILocation(line: 1004, column: 7, scope: !570)
!791 = !DILocation(line: 1005, column: 3, scope: !570)
!792 = !DILocation(line: 1005, column: 3, scope: !793)
!793 = !DILexicalBlockFile(scope: !794, file: !1, discriminator: 1)
!794 = distinct !DILexicalBlock(scope: !570, file: !1, line: 1005, column: 3)
!795 = !DILocation(line: 1005, column: 3, scope: !796)
!796 = !DILexicalBlockFile(scope: !794, file: !1, discriminator: 2)
!797 = !DILocation(line: 1005, column: 3, scope: !798)
!798 = !DILexicalBlockFile(scope: !794, file: !1, discriminator: 3)
!799 = !DILocation(line: 1005, column: 3, scope: !800)
!800 = !DILexicalBlockFile(scope: !794, file: !1, discriminator: 4)
!801 = !DILocation(line: 1005, column: 3, scope: !802)
!802 = !DILexicalBlockFile(scope: !794, file: !1, discriminator: 5)
!803 = !DILocation(line: 1005, column: 3, scope: !804)
!804 = !DILexicalBlockFile(scope: !805, file: !1, discriminator: 6)
!805 = distinct !DILexicalBlock(scope: !794, file: !1, line: 1005, column: 3)
!806 = !DILocation(line: 1005, column: 3, scope: !807)
!807 = !DILexicalBlockFile(scope: !794, file: !1, discriminator: 7)
!808 = !DILocation(line: 1007, column: 7, scope: !809)
!809 = distinct !DILexicalBlock(scope: !570, file: !1, line: 1007, column: 7)
!810 = !DILocation(line: 1007, column: 14, scope: !809)
!811 = !DILocation(line: 1007, column: 7, scope: !570)
!812 = !DILocation(line: 1008, column: 5, scope: !813)
!813 = distinct !DILexicalBlock(scope: !809, file: !1, line: 1007, column: 29)
!814 = !DILocation(line: 1008, column: 5, scope: !815)
!815 = !DILexicalBlockFile(scope: !813, file: !1, discriminator: 1)
!816 = !DILocation(line: 1008, column: 5, scope: !817)
!817 = !DILexicalBlockFile(scope: !813, file: !1, discriminator: 2)
!818 = !DILocation(line: 1008, column: 5, scope: !819)
!819 = !DILexicalBlockFile(scope: !813, file: !1, discriminator: 3)
!820 = !DILocation(line: 1009, column: 5, scope: !813)
!821 = !DILocation(line: 1009, column: 10, scope: !813)
!822 = !DILocation(line: 1009, column: 17, scope: !813)
!823 = !DILocation(line: 1010, column: 3, scope: !813)
!824 = !DILocation(line: 1012, column: 3, scope: !570)
!825 = !DILocation(line: 1012, column: 8, scope: !570)
!826 = !DILocation(line: 1012, column: 11, scope: !570)
!827 = !DILocation(line: 1013, column: 1, scope: !570)
!828 = !DILocalVariable(name: "loop", arg: 1, scope: !419, file: !1, line: 1028, type: !120)
!829 = !DILocation(line: 1028, column: 28, scope: !419)
!830 = !DILocalVariable(name: "req", arg: 2, scope: !419, file: !1, line: 1029, type: !105)
!831 = !DILocation(line: 1029, column: 26, scope: !419)
!832 = !DILocalVariable(name: "path", arg: 3, scope: !419, file: !1, line: 1030, type: !331)
!833 = !DILocation(line: 1030, column: 29, scope: !419)
!834 = !DILocalVariable(name: "mode", arg: 4, scope: !419, file: !1, line: 1031, type: !133)
!835 = !DILocation(line: 1031, column: 21, scope: !419)
!836 = !DILocalVariable(name: "cb", arg: 5, scope: !419, file: !1, line: 1032, type: !320)
!837 = !DILocation(line: 1032, column: 26, scope: !419)
!838 = !DILocation(line: 1033, column: 3, scope: !419)
!839 = !DILocation(line: 1033, column: 3, scope: !840)
!840 = !DILexicalBlockFile(scope: !841, file: !1, discriminator: 1)
!841 = distinct !DILexicalBlock(scope: !419, file: !1, line: 1033, column: 3)
!842 = !DILocation(line: 1033, column: 3, scope: !843)
!843 = !DILexicalBlockFile(scope: !844, file: !1, discriminator: 2)
!844 = distinct !DILexicalBlock(scope: !841, file: !1, line: 1033, column: 3)
!845 = !DILocation(line: 1033, column: 3, scope: !846)
!846 = !DILexicalBlockFile(scope: !847, file: !1, discriminator: 3)
!847 = distinct !DILexicalBlock(scope: !844, file: !1, line: 1033, column: 3)
!848 = !DILocation(line: 1033, column: 3, scope: !849)
!849 = !DILexicalBlockFile(scope: !850, file: !1, discriminator: 4)
!850 = distinct !DILexicalBlock(scope: !847, file: !1, line: 1033, column: 3)
!851 = !DILocation(line: 1033, column: 3, scope: !852)
!852 = !DILexicalBlockFile(scope: !847, file: !1, discriminator: 5)
!853 = !DILocation(line: 1033, column: 3, scope: !854)
!854 = !DILexicalBlockFile(scope: !855, file: !1, discriminator: 6)
!855 = distinct !DILexicalBlock(scope: !847, file: !1, line: 1033, column: 3)
!856 = !DILocation(line: 1033, column: 3, scope: !857)
!857 = !DILexicalBlockFile(scope: !858, file: !1, discriminator: 7)
!858 = distinct !DILexicalBlock(scope: !855, file: !1, line: 1033, column: 3)
!859 = !DILocation(line: 1033, column: 3, scope: !860)
!860 = !DILexicalBlockFile(scope: !855, file: !1, discriminator: 8)
!861 = !DILocation(line: 1033, column: 3, scope: !862)
!862 = !DILexicalBlockFile(scope: !847, file: !1, discriminator: 9)
!863 = !DILocation(line: 1033, column: 3, scope: !864)
!864 = !DILexicalBlockFile(scope: !847, file: !1, discriminator: 10)
!865 = !DILocation(line: 1033, column: 3, scope: !866)
!866 = !DILexicalBlockFile(scope: !841, file: !1, discriminator: 11)
!867 = !DILocation(line: 1034, column: 3, scope: !419)
!868 = !DILocation(line: 1034, column: 3, scope: !869)
!869 = !DILexicalBlockFile(scope: !870, file: !1, discriminator: 1)
!870 = distinct !DILexicalBlock(scope: !419, file: !1, line: 1034, column: 3)
!871 = !DILocation(line: 1034, column: 3, scope: !872)
!872 = !DILexicalBlockFile(scope: !870, file: !1, discriminator: 2)
!873 = !DILocation(line: 1034, column: 3, scope: !874)
!874 = !DILexicalBlockFile(scope: !870, file: !1, discriminator: 3)
!875 = !DILocation(line: 1034, column: 3, scope: !876)
!876 = !DILexicalBlockFile(scope: !870, file: !1, discriminator: 4)
!877 = !DILocation(line: 1034, column: 3, scope: !878)
!878 = !DILexicalBlockFile(scope: !879, file: !1, discriminator: 5)
!879 = distinct !DILexicalBlock(scope: !870, file: !1, line: 1034, column: 3)
!880 = !DILocation(line: 1034, column: 3, scope: !881)
!881 = !DILexicalBlockFile(scope: !882, file: !1, discriminator: 6)
!882 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1034, column: 3)
!883 = !DILocation(line: 1034, column: 3, scope: !884)
!884 = !DILexicalBlockFile(scope: !885, file: !1, discriminator: 7)
!885 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1034, column: 3)
!886 = !DILocation(line: 1034, column: 3, scope: !887)
!887 = !DILexicalBlockFile(scope: !888, file: !1, discriminator: 8)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 1034, column: 3)
!889 = distinct !DILexicalBlock(scope: !885, file: !1, line: 1034, column: 3)
!890 = !DILocation(line: 1034, column: 3, scope: !891)
!891 = !DILexicalBlockFile(scope: !892, file: !1, discriminator: 9)
!892 = distinct !DILexicalBlock(scope: !888, file: !1, line: 1034, column: 3)
!893 = !DILocation(line: 1034, column: 3, scope: !894)
!894 = !DILexicalBlockFile(scope: !892, file: !1, discriminator: 10)
!895 = !DILocation(line: 1034, column: 3, scope: !896)
!896 = !DILexicalBlockFile(scope: !892, file: !1, discriminator: 11)
!897 = !DILocation(line: 1034, column: 3, scope: !898)
!898 = !DILexicalBlockFile(scope: !892, file: !1, discriminator: 12)
!899 = !DILocation(line: 1034, column: 3, scope: !900)
!900 = !DILexicalBlockFile(scope: !892, file: !1, discriminator: 13)
!901 = !DILocation(line: 1034, column: 3, scope: !902)
!902 = !DILexicalBlockFile(scope: !903, file: !1, discriminator: 14)
!903 = distinct !DILexicalBlock(scope: !892, file: !1, line: 1034, column: 3)
!904 = !DILocation(line: 1034, column: 3, scope: !905)
!905 = !DILexicalBlockFile(scope: !892, file: !1, discriminator: 15)
!906 = !DILocation(line: 1034, column: 3, scope: !907)
!907 = !DILexicalBlockFile(scope: !888, file: !1, discriminator: 16)
!908 = !DILocation(line: 1034, column: 3, scope: !909)
!909 = !DILexicalBlockFile(scope: !870, file: !1, discriminator: 17)
!910 = !DILocation(line: 1035, column: 15, scope: !419)
!911 = !DILocation(line: 1035, column: 3, scope: !419)
!912 = !DILocation(line: 1035, column: 8, scope: !419)
!913 = !DILocation(line: 1035, column: 13, scope: !419)
!914 = !DILocation(line: 1036, column: 3, scope: !419)
!915 = !DILocation(line: 1036, column: 3, scope: !916)
!916 = !DILexicalBlockFile(scope: !917, file: !1, discriminator: 1)
!917 = distinct !DILexicalBlock(scope: !918, file: !1, line: 1036, column: 3)
!918 = distinct !DILexicalBlock(scope: !419, file: !1, line: 1036, column: 3)
!919 = !DILocation(line: 1036, column: 3, scope: !920)
!920 = !DILexicalBlockFile(scope: !921, file: !1, discriminator: 2)
!921 = distinct !DILexicalBlock(scope: !917, file: !1, line: 1036, column: 3)
!922 = !DILocation(line: 1036, column: 3, scope: !923)
!923 = !DILexicalBlockFile(scope: !924, file: !1, discriminator: 3)
!924 = distinct !DILexicalBlock(scope: !917, file: !1, line: 1036, column: 3)
!925 = !DILocation(line: 1037, column: 1, scope: !419)
!926 = !DILocalVariable(name: "loop", arg: 1, scope: !420, file: !1, line: 1040, type: !120)
!927 = !DILocation(line: 1040, column: 28, scope: !420)
!928 = !DILocalVariable(name: "req", arg: 2, scope: !420, file: !1, line: 1041, type: !105)
!929 = !DILocation(line: 1041, column: 26, scope: !420)
!930 = !DILocalVariable(name: "path", arg: 3, scope: !420, file: !1, line: 1042, type: !331)
!931 = !DILocation(line: 1042, column: 29, scope: !420)
!932 = !DILocalVariable(name: "uid", arg: 4, scope: !420, file: !1, line: 1043, type: !381)
!933 = !DILocation(line: 1043, column: 26, scope: !420)
!934 = !DILocalVariable(name: "gid", arg: 5, scope: !420, file: !1, line: 1044, type: !385)
!935 = !DILocation(line: 1044, column: 26, scope: !420)
!936 = !DILocalVariable(name: "cb", arg: 6, scope: !420, file: !1, line: 1045, type: !320)
!937 = !DILocation(line: 1045, column: 26, scope: !420)
!938 = !DILocation(line: 1046, column: 3, scope: !420)
!939 = !DILocation(line: 1046, column: 3, scope: !940)
!940 = !DILexicalBlockFile(scope: !941, file: !1, discriminator: 1)
!941 = distinct !DILexicalBlock(scope: !420, file: !1, line: 1046, column: 3)
!942 = !DILocation(line: 1046, column: 3, scope: !943)
!943 = !DILexicalBlockFile(scope: !944, file: !1, discriminator: 2)
!944 = distinct !DILexicalBlock(scope: !941, file: !1, line: 1046, column: 3)
!945 = !DILocation(line: 1046, column: 3, scope: !946)
!946 = !DILexicalBlockFile(scope: !947, file: !1, discriminator: 3)
!947 = distinct !DILexicalBlock(scope: !944, file: !1, line: 1046, column: 3)
!948 = !DILocation(line: 1046, column: 3, scope: !949)
!949 = !DILexicalBlockFile(scope: !950, file: !1, discriminator: 4)
!950 = distinct !DILexicalBlock(scope: !947, file: !1, line: 1046, column: 3)
!951 = !DILocation(line: 1046, column: 3, scope: !952)
!952 = !DILexicalBlockFile(scope: !947, file: !1, discriminator: 5)
!953 = !DILocation(line: 1046, column: 3, scope: !954)
!954 = !DILexicalBlockFile(scope: !955, file: !1, discriminator: 6)
!955 = distinct !DILexicalBlock(scope: !947, file: !1, line: 1046, column: 3)
!956 = !DILocation(line: 1046, column: 3, scope: !957)
!957 = !DILexicalBlockFile(scope: !958, file: !1, discriminator: 7)
!958 = distinct !DILexicalBlock(scope: !955, file: !1, line: 1046, column: 3)
!959 = !DILocation(line: 1046, column: 3, scope: !960)
!960 = !DILexicalBlockFile(scope: !955, file: !1, discriminator: 8)
!961 = !DILocation(line: 1046, column: 3, scope: !962)
!962 = !DILexicalBlockFile(scope: !947, file: !1, discriminator: 9)
!963 = !DILocation(line: 1046, column: 3, scope: !964)
!964 = !DILexicalBlockFile(scope: !947, file: !1, discriminator: 10)
!965 = !DILocation(line: 1046, column: 3, scope: !966)
!966 = !DILexicalBlockFile(scope: !941, file: !1, discriminator: 11)
!967 = !DILocation(line: 1047, column: 3, scope: !420)
!968 = !DILocation(line: 1047, column: 3, scope: !969)
!969 = !DILexicalBlockFile(scope: !970, file: !1, discriminator: 1)
!970 = distinct !DILexicalBlock(scope: !420, file: !1, line: 1047, column: 3)
!971 = !DILocation(line: 1047, column: 3, scope: !972)
!972 = !DILexicalBlockFile(scope: !970, file: !1, discriminator: 2)
!973 = !DILocation(line: 1047, column: 3, scope: !974)
!974 = !DILexicalBlockFile(scope: !970, file: !1, discriminator: 3)
!975 = !DILocation(line: 1047, column: 3, scope: !976)
!976 = !DILexicalBlockFile(scope: !970, file: !1, discriminator: 4)
!977 = !DILocation(line: 1047, column: 3, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !1, discriminator: 5)
!979 = distinct !DILexicalBlock(scope: !970, file: !1, line: 1047, column: 3)
!980 = !DILocation(line: 1047, column: 3, scope: !981)
!981 = !DILexicalBlockFile(scope: !982, file: !1, discriminator: 6)
!982 = distinct !DILexicalBlock(scope: !979, file: !1, line: 1047, column: 3)
!983 = !DILocation(line: 1047, column: 3, scope: !984)
!984 = !DILexicalBlockFile(scope: !985, file: !1, discriminator: 7)
!985 = distinct !DILexicalBlock(scope: !979, file: !1, line: 1047, column: 3)
!986 = !DILocation(line: 1047, column: 3, scope: !987)
!987 = !DILexicalBlockFile(scope: !988, file: !1, discriminator: 8)
!988 = distinct !DILexicalBlock(scope: !989, file: !1, line: 1047, column: 3)
!989 = distinct !DILexicalBlock(scope: !985, file: !1, line: 1047, column: 3)
!990 = !DILocation(line: 1047, column: 3, scope: !991)
!991 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 9)
!992 = distinct !DILexicalBlock(scope: !988, file: !1, line: 1047, column: 3)
!993 = !DILocation(line: 1047, column: 3, scope: !994)
!994 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 10)
!995 = !DILocation(line: 1047, column: 3, scope: !996)
!996 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 11)
!997 = !DILocation(line: 1047, column: 3, scope: !998)
!998 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 12)
!999 = !DILocation(line: 1047, column: 3, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 13)
!1001 = !DILocation(line: 1047, column: 3, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !1003, file: !1, discriminator: 14)
!1003 = distinct !DILexicalBlock(scope: !992, file: !1, line: 1047, column: 3)
!1004 = !DILocation(line: 1047, column: 3, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 15)
!1006 = !DILocation(line: 1047, column: 3, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !988, file: !1, discriminator: 16)
!1008 = !DILocation(line: 1047, column: 3, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !970, file: !1, discriminator: 17)
!1010 = !DILocation(line: 1048, column: 14, scope: !420)
!1011 = !DILocation(line: 1048, column: 3, scope: !420)
!1012 = !DILocation(line: 1048, column: 8, scope: !420)
!1013 = !DILocation(line: 1048, column: 12, scope: !420)
!1014 = !DILocation(line: 1049, column: 14, scope: !420)
!1015 = !DILocation(line: 1049, column: 3, scope: !420)
!1016 = !DILocation(line: 1049, column: 8, scope: !420)
!1017 = !DILocation(line: 1049, column: 12, scope: !420)
!1018 = !DILocation(line: 1050, column: 3, scope: !420)
!1019 = !DILocation(line: 1050, column: 3, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !1021, file: !1, discriminator: 1)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !1, line: 1050, column: 3)
!1022 = distinct !DILexicalBlock(scope: !420, file: !1, line: 1050, column: 3)
!1023 = !DILocation(line: 1050, column: 3, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1025, file: !1, discriminator: 2)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !1, line: 1050, column: 3)
!1026 = !DILocation(line: 1050, column: 3, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !1028, file: !1, discriminator: 3)
!1028 = distinct !DILexicalBlock(scope: !1021, file: !1, line: 1050, column: 3)
!1029 = !DILocation(line: 1051, column: 1, scope: !420)
!1030 = !DILocalVariable(name: "loop", arg: 1, scope: !423, file: !1, line: 1054, type: !120)
!1031 = !DILocation(line: 1054, column: 28, scope: !423)
!1032 = !DILocalVariable(name: "req", arg: 2, scope: !423, file: !1, line: 1054, type: !105)
!1033 = !DILocation(line: 1054, column: 43, scope: !423)
!1034 = !DILocalVariable(name: "file", arg: 3, scope: !423, file: !1, line: 1054, type: !360)
!1035 = !DILocation(line: 1054, column: 56, scope: !423)
!1036 = !DILocalVariable(name: "cb", arg: 4, scope: !423, file: !1, line: 1054, type: !320)
!1037 = !DILocation(line: 1054, column: 71, scope: !423)
!1038 = !DILocation(line: 1055, column: 3, scope: !423)
!1039 = !DILocation(line: 1055, column: 3, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1041, file: !1, discriminator: 1)
!1041 = distinct !DILexicalBlock(scope: !423, file: !1, line: 1055, column: 3)
!1042 = !DILocation(line: 1055, column: 3, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !1044, file: !1, discriminator: 2)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 1055, column: 3)
!1045 = !DILocation(line: 1055, column: 3, scope: !1046)
!1046 = !DILexicalBlockFile(scope: !1047, file: !1, discriminator: 3)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 1055, column: 3)
!1048 = !DILocation(line: 1055, column: 3, scope: !1049)
!1049 = !DILexicalBlockFile(scope: !1050, file: !1, discriminator: 4)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 1055, column: 3)
!1051 = !DILocation(line: 1055, column: 3, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1047, file: !1, discriminator: 5)
!1053 = !DILocation(line: 1055, column: 3, scope: !1054)
!1054 = !DILexicalBlockFile(scope: !1055, file: !1, discriminator: 6)
!1055 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 1055, column: 3)
!1056 = !DILocation(line: 1055, column: 3, scope: !1057)
!1057 = !DILexicalBlockFile(scope: !1058, file: !1, discriminator: 7)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 1055, column: 3)
!1059 = !DILocation(line: 1055, column: 3, scope: !1060)
!1060 = !DILexicalBlockFile(scope: !1055, file: !1, discriminator: 8)
!1061 = !DILocation(line: 1055, column: 3, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1047, file: !1, discriminator: 9)
!1063 = !DILocation(line: 1055, column: 3, scope: !1064)
!1064 = !DILexicalBlockFile(scope: !1047, file: !1, discriminator: 10)
!1065 = !DILocation(line: 1055, column: 3, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1041, file: !1, discriminator: 11)
!1067 = !DILocation(line: 1056, column: 15, scope: !423)
!1068 = !DILocation(line: 1056, column: 3, scope: !423)
!1069 = !DILocation(line: 1056, column: 8, scope: !423)
!1070 = !DILocation(line: 1056, column: 13, scope: !423)
!1071 = !DILocation(line: 1057, column: 3, scope: !423)
!1072 = !DILocation(line: 1057, column: 3, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1074, file: !1, discriminator: 1)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !1, line: 1057, column: 3)
!1075 = distinct !DILexicalBlock(scope: !423, file: !1, line: 1057, column: 3)
!1076 = !DILocation(line: 1057, column: 3, scope: !1077)
!1077 = !DILexicalBlockFile(scope: !1078, file: !1, discriminator: 2)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 1057, column: 3)
!1079 = !DILocation(line: 1057, column: 3, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1081, file: !1, discriminator: 3)
!1081 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 1057, column: 3)
!1082 = !DILocation(line: 1058, column: 1, scope: !423)
!1083 = !DILocalVariable(name: "loop", arg: 1, scope: !426, file: !1, line: 1061, type: !120)
!1084 = !DILocation(line: 1061, column: 29, scope: !426)
!1085 = !DILocalVariable(name: "req", arg: 2, scope: !426, file: !1, line: 1062, type: !105)
!1086 = !DILocation(line: 1062, column: 27, scope: !426)
!1087 = !DILocalVariable(name: "file", arg: 3, scope: !426, file: !1, line: 1063, type: !360)
!1088 = !DILocation(line: 1063, column: 26, scope: !426)
!1089 = !DILocalVariable(name: "mode", arg: 4, scope: !426, file: !1, line: 1064, type: !133)
!1090 = !DILocation(line: 1064, column: 22, scope: !426)
!1091 = !DILocalVariable(name: "cb", arg: 5, scope: !426, file: !1, line: 1065, type: !320)
!1092 = !DILocation(line: 1065, column: 27, scope: !426)
!1093 = !DILocation(line: 1066, column: 3, scope: !426)
!1094 = !DILocation(line: 1066, column: 3, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1096, file: !1, discriminator: 1)
!1096 = distinct !DILexicalBlock(scope: !426, file: !1, line: 1066, column: 3)
!1097 = !DILocation(line: 1066, column: 3, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !1099, file: !1, discriminator: 2)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 1066, column: 3)
!1100 = !DILocation(line: 1066, column: 3, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1102, file: !1, discriminator: 3)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !1, line: 1066, column: 3)
!1103 = !DILocation(line: 1066, column: 3, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1105, file: !1, discriminator: 4)
!1105 = distinct !DILexicalBlock(scope: !1102, file: !1, line: 1066, column: 3)
!1106 = !DILocation(line: 1066, column: 3, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1102, file: !1, discriminator: 5)
!1108 = !DILocation(line: 1066, column: 3, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1110, file: !1, discriminator: 6)
!1110 = distinct !DILexicalBlock(scope: !1102, file: !1, line: 1066, column: 3)
!1111 = !DILocation(line: 1066, column: 3, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1113, file: !1, discriminator: 7)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !1, line: 1066, column: 3)
!1114 = !DILocation(line: 1066, column: 3, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1110, file: !1, discriminator: 8)
!1116 = !DILocation(line: 1066, column: 3, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1102, file: !1, discriminator: 9)
!1118 = !DILocation(line: 1066, column: 3, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1102, file: !1, discriminator: 10)
!1120 = !DILocation(line: 1066, column: 3, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1096, file: !1, discriminator: 11)
!1122 = !DILocation(line: 1067, column: 15, scope: !426)
!1123 = !DILocation(line: 1067, column: 3, scope: !426)
!1124 = !DILocation(line: 1067, column: 8, scope: !426)
!1125 = !DILocation(line: 1067, column: 13, scope: !426)
!1126 = !DILocation(line: 1068, column: 15, scope: !426)
!1127 = !DILocation(line: 1068, column: 3, scope: !426)
!1128 = !DILocation(line: 1068, column: 8, scope: !426)
!1129 = !DILocation(line: 1068, column: 13, scope: !426)
!1130 = !DILocation(line: 1069, column: 3, scope: !426)
!1131 = !DILocation(line: 1069, column: 3, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1133, file: !1, discriminator: 1)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !1, line: 1069, column: 3)
!1134 = distinct !DILexicalBlock(scope: !426, file: !1, line: 1069, column: 3)
!1135 = !DILocation(line: 1069, column: 3, scope: !1136)
!1136 = !DILexicalBlockFile(scope: !1137, file: !1, discriminator: 2)
!1137 = distinct !DILexicalBlock(scope: !1133, file: !1, line: 1069, column: 3)
!1138 = !DILocation(line: 1069, column: 3, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1140, file: !1, discriminator: 3)
!1140 = distinct !DILexicalBlock(scope: !1133, file: !1, line: 1069, column: 3)
!1141 = !DILocation(line: 1070, column: 1, scope: !426)
!1142 = !DILocalVariable(name: "loop", arg: 1, scope: !429, file: !1, line: 1073, type: !120)
!1143 = !DILocation(line: 1073, column: 29, scope: !429)
!1144 = !DILocalVariable(name: "req", arg: 2, scope: !429, file: !1, line: 1074, type: !105)
!1145 = !DILocation(line: 1074, column: 27, scope: !429)
!1146 = !DILocalVariable(name: "file", arg: 3, scope: !429, file: !1, line: 1075, type: !360)
!1147 = !DILocation(line: 1075, column: 26, scope: !429)
!1148 = !DILocalVariable(name: "uid", arg: 4, scope: !429, file: !1, line: 1076, type: !381)
!1149 = !DILocation(line: 1076, column: 27, scope: !429)
!1150 = !DILocalVariable(name: "gid", arg: 5, scope: !429, file: !1, line: 1077, type: !385)
!1151 = !DILocation(line: 1077, column: 27, scope: !429)
!1152 = !DILocalVariable(name: "cb", arg: 6, scope: !429, file: !1, line: 1078, type: !320)
!1153 = !DILocation(line: 1078, column: 27, scope: !429)
!1154 = !DILocation(line: 1079, column: 3, scope: !429)
!1155 = !DILocation(line: 1079, column: 3, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1157, file: !1, discriminator: 1)
