; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/getaddrinfo.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!29 = !DIEnumerator(name: "UV_ECANCELED", value: -125)
!30 = !DIEnumerator(name: "UV_ECHARSET", value: -4080)
!31 = !DIEnumerator(name: "UV_ECONNABORTED", value: -103)
!32 = !DIEnumerator(name: "UV_ECONNREFUSED", value: -111)
!33 = !DIEnumerator(name: "UV_ECONNRESET", value: -104)
!34 = !DIEnumerator(name: "UV_EDESTADDRREQ", value: -89)
!35 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!36 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!37 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!38 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!39 = !DIEnumerator(name: "UV_EINTR", value: -4)
!40 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!41 = !DIEnumerator(name: "UV_EIO", value: -5)
!42 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!43 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!44 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!45 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!46 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!47 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!48 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!49 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!50 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!51 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!52 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!53 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!54 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!55 = !DIEnumerator(name: "UV_ENONET", value: -64)
!56 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!57 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!58 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!59 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!60 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!61 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!62 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!63 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!64 = !DIEnumerator(name: "UV_EPERM", value: -1)
!65 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!66 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!67 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!68 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!69 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!70 = !DIEnumerator(name: "UV_EROFS", value: -30)
!71 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!72 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!73 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!74 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!75 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!76 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!77 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!78 = !DIEnumerator(name: "UV_EOF", value: -4095)
!79 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!80 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!81 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!82 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 184, size: 32, align: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!85 = !DIEnumerator(name: "UV_UNKNOWN_HANDLE", value: 0)
!86 = !DIEnumerator(name: "UV_ASYNC", value: 1)
!87 = !DIEnumerator(name: "UV_CHECK", value: 2)
!88 = !DIEnumerator(name: "UV_FS_EVENT", value: 3)
!89 = !DIEnumerator(name: "UV_FS_POLL", value: 4)
!90 = !DIEnumerator(name: "UV_HANDLE", value: 5)
!91 = !DIEnumerator(name: "UV_IDLE", value: 6)
!92 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!93 = !DIEnumerator(name: "UV_POLL", value: 8)
!94 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!95 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!96 = !DIEnumerator(name: "UV_STREAM", value: 11)
!97 = !DIEnumerator(name: "UV_TCP", value: 12)
!98 = !DIEnumerator(name: "UV_TIMER", value: 13)
!99 = !DIEnumerator(name: "UV_TTY", value: 14)
!100 = !DIEnumerator(name: "UV_UDP", value: 15)
!101 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!102 = !DIEnumerator(name: "UV_FILE", value: 17)
!103 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 193, size: 32, align: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!106 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!107 = !DIEnumerator(name: "UV_REQ", value: 1)
!108 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!109 = !DIEnumerator(name: "UV_WRITE", value: 3)
!110 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!111 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!112 = !DIEnumerator(name: "UV_FS", value: 6)
!113 = !DIEnumerator(name: "UV_WORK", value: 7)
!114 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!115 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!116 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!117 = !{!118, !119, !126, !384, !391}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !122, line: 21, baseType: !123)
!122 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, align: 64, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 2)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getaddrinfo_t", file: !4, line: 224, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_getaddrinfo_s", file: !4, line: 804, size: 1280, align: 64, elements: !129)
!129 = !{!130, !131, !133, !134, !138, !338, !353, !386, !387, !388, !389, !390}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !4, line: 805, baseType: !118, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !4, line: 805, baseType: !132, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !104)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !128, file: !4, line: 805, baseType: !123, size: 128, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !128, file: !4, line: 805, baseType: !135, size: 256, align: 64, offset: 256)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 256, align: 64, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 4)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !128, file: !4, line: 807, baseType: !139, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !142)
!142 = !{!143, !144, !146, !147, !148, !149, !151, !153, !154, !155, !174, !175, !176, !177, !208, !253, !277, !278, !279, !280, !281, !282, !283, !287, !288, !289, !294, !297, !298, !300, !301, !334, !335, !336, !337}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !4, line: 1475, baseType: !118, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !141, file: !4, line: 1477, baseType: !145, size: 32, align: 32, offset: 64)
!145 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !141, file: !4, line: 1478, baseType: !123, size: 128, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !141, file: !4, line: 1479, baseType: !123, size: 128, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !141, file: !4, line: 1481, baseType: !145, size: 32, align: 32, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !141, file: !4, line: 1482, baseType: !150, size: 64, align: 64, offset: 448)
!150 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !141, file: !4, line: 1482, baseType: !152, size: 32, align: 32, offset: 512)
!152 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !141, file: !4, line: 1482, baseType: !156, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !159, line: 87, baseType: !160)
!159 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !159, line: 89, size: 448, align: 64, elements: !161)
!161 = !{!162, !169, !170, !171, !172, !173}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !160, file: !159, line: 90, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !159, line: 84, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167, !168, !145}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !160, file: !159, line: 91, baseType: !123, size: 128, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !160, file: !159, line: 92, baseType: !123, size: 128, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !160, file: !159, line: 93, baseType: !145, size: 32, align: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !160, file: !159, line: 94, baseType: !145, size: 32, align: 32, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !160, file: !159, line: 95, baseType: !152, size: 32, align: 32, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !141, file: !4, line: 1482, baseType: !145, size: 32, align: 32, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !141, file: !4, line: 1482, baseType: !145, size: 32, align: 32, offset: 928)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !141, file: !4, line: 1482, baseType: !178, size: 320, align: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !159, line: 129, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !180, line: 127, baseType: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!181 = !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 90, size: 320, align: 64, elements: !182)
!182 = !{!183, !201, !206}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !181, file: !180, line: 124, baseType: !184, size: 320, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !180, line: 92, size: 320, align: 64, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !193, !194}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !184, file: !180, line: 94, baseType: !152, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !184, file: !180, line: 95, baseType: !145, size: 32, align: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !184, file: !180, line: 96, baseType: !152, size: 32, align: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !184, file: !180, line: 98, baseType: !145, size: 32, align: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !184, file: !180, line: 102, baseType: !152, size: 32, align: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !184, file: !180, line: 104, baseType: !192, size: 16, align: 16, offset: 160)
!192 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !184, file: !180, line: 105, baseType: !192, size: 16, align: 16, offset: 176)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !184, file: !180, line: 106, baseType: !195, size: 128, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !180, line: 79, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !180, line: 75, size: 128, align: 64, elements: !197)
!197 = !{!198, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !196, file: !180, line: 77, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !196, file: !180, line: 78, baseType: !199, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !181, file: !180, line: 125, baseType: !202, size: 320, align: 8)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, align: 8, elements: !204)
!203 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!204 = !{!205}
!205 = !DISubrange(count: 40)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !181, file: !180, line: 126, baseType: !207, size: 64, align: 64)
!207 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !141, file: !4, line: 1482, baseType: !209, size: 1024, align: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !211)
!211 = !{!212, !213, !214, !216, !237, !238, !243, !244, !245, !251, !252}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !4, line: 768, baseType: !118, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !210, file: !4, line: 768, baseType: !139, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !4, line: 768, baseType: !215, size: 32, align: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !83)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !210, file: !4, line: 768, baseType: !217, size: 64, align: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !235, !236}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !223, file: !4, line: 426, baseType: !118, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !223, file: !4, line: 426, baseType: !139, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !4, line: 426, baseType: !215, size: 32, align: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !223, file: !4, line: 426, baseType: !217, size: 64, align: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !223, file: !4, line: 426, baseType: !123, size: 128, align: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !223, file: !4, line: 426, baseType: !231, size: 256, align: 64, offset: 384)
!231 = !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !4, line: 426, size: 256, align: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !231, file: !4, line: 426, baseType: !152, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !231, file: !4, line: 426, baseType: !135, size: 256, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !223, file: !4, line: 426, baseType: !221, size: 64, align: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !4, line: 426, baseType: !145, size: 32, align: 32, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !210, file: !4, line: 768, baseType: !123, size: 128, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !210, file: !4, line: 768, baseType: !239, size: 256, align: 64, offset: 384)
!239 = !DICompositeType(tag: DW_TAG_union_type, scope: !210, file: !4, line: 768, size: 256, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !239, file: !4, line: 768, baseType: !152, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !239, file: !4, line: 768, baseType: !135, size: 256, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !210, file: !4, line: 768, baseType: !221, size: 64, align: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !210, file: !4, line: 768, baseType: !145, size: 32, align: 32, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !210, file: !4, line: 769, baseType: !246, size: 64, align: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !210, file: !4, line: 769, baseType: !123, size: 128, align: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !210, file: !4, line: 769, baseType: !152, size: 32, align: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !141, file: !4, line: 1482, baseType: !254, size: 448, align: 64, offset: 2432)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !159, line: 130, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !180, line: 213, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 173, size: 448, align: 64, elements: !257)
!257 = !{!258, !272, !276}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !256, file: !180, line: 192, baseType: !259, size: 448, align: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, scope: !256, file: !180, line: 176, size: 448, align: 64, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !259, file: !180, line: 178, baseType: !152, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !259, file: !180, line: 179, baseType: !145, size: 32, align: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !259, file: !180, line: 180, baseType: !145, size: 32, align: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !259, file: !180, line: 181, baseType: !145, size: 32, align: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !259, file: !180, line: 182, baseType: !145, size: 32, align: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !259, file: !180, line: 183, baseType: !145, size: 32, align: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !259, file: !180, line: 184, baseType: !152, size: 32, align: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !259, file: !180, line: 185, baseType: !152, size: 32, align: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !259, file: !180, line: 186, baseType: !150, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !259, file: !180, line: 187, baseType: !150, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !259, file: !180, line: 190, baseType: !145, size: 32, align: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !256, file: !180, line: 211, baseType: !273, size: 448, align: 8)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 448, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 56)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !256, file: !180, line: 212, baseType: !207, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !141, file: !4, line: 1482, baseType: !221, size: 64, align: 64, offset: 2880)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 2944)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 3072)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 3200)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 3328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !141, file: !4, line: 1482, baseType: !123, size: 128, align: 64, offset: 3456)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !141, file: !4, line: 1482, baseType: !284, size: 64, align: 64, offset: 3584)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !141, file: !4, line: 1482, baseType: !158, size: 448, align: 64, offset: 3648)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !141, file: !4, line: 1482, baseType: !152, size: 32, align: 32, offset: 4096)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !141, file: !4, line: 1482, baseType: !290, size: 128, align: 64, offset: 4160)
!290 = !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !4, line: 1482, size: 128, align: 64, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !290, file: !4, line: 1482, baseType: !118, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !290, file: !4, line: 1482, baseType: !145, size: 32, align: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !141, file: !4, line: 1482, baseType: !295, size: 64, align: 64, offset: 4288)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !296, line: 55, baseType: !150)
!296 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !141, file: !4, line: 1482, baseType: !295, size: 64, align: 64, offset: 4352)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !141, file: !4, line: 1482, baseType: !299, size: 64, align: 32, offset: 4416)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, align: 32, elements: !124)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !141, file: !4, line: 1482, baseType: !158, size: 448, align: 64, offset: 4480)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !141, file: !4, line: 1482, baseType: !302, size: 1216, align: 64, offset: 4928)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310, !315, !316, !317, !323, !324, !332, !333}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !4, line: 1326, baseType: !118, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !303, file: !4, line: 1326, baseType: !139, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !4, line: 1326, baseType: !215, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !303, file: !4, line: 1326, baseType: !217, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !303, file: !4, line: 1326, baseType: !123, size: 128, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !303, file: !4, line: 1326, baseType: !311, size: 256, align: 64, offset: 384)
!311 = !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !4, line: 1326, size: 256, align: 64, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !311, file: !4, line: 1326, baseType: !152, size: 32, align: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !311, file: !4, line: 1326, baseType: !135, size: 256, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !303, file: !4, line: 1326, baseType: !221, size: 64, align: 64, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !4, line: 1326, baseType: !145, size: 32, align: 32, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !303, file: !4, line: 1327, baseType: !318, size: 64, align: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322, !152}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !303, file: !4, line: 1328, baseType: !152, size: 32, align: 32, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !303, file: !4, line: 1329, baseType: !325, size: 256, align: 64, offset: 896)
!325 = !DICompositeType(tag: DW_TAG_structure_type, scope: !303, file: !4, line: 1329, size: 256, align: 64, elements: !326)
!326 = !{!327, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !325, file: !4, line: 1329, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !325, file: !4, line: 1329, baseType: !328, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !325, file: !4, line: 1329, baseType: !328, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !325, file: !4, line: 1329, baseType: !152, size: 32, align: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !303, file: !4, line: 1329, baseType: !145, size: 32, align: 32, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !303, file: !4, line: 1329, baseType: !145, size: 32, align: 32, offset: 1184)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !141, file: !4, line: 1482, baseType: !152, size: 32, align: 32, offset: 6144)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !141, file: !4, line: 1482, baseType: !158, size: 448, align: 64, offset: 6208)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !141, file: !4, line: 1482, baseType: !118, size: 64, align: 64, offset: 6656)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !141, file: !4, line: 1482, baseType: !152, size: 32, align: 32, offset: 6720)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !128, file: !4, line: 809, baseType: !339, size: 320, align: 64, offset: 576)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__work", file: !340, line: 30, size: 320, align: 64, elements: !341)
!340 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-threadpool.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!341 = !{!342, !347, !351, !352}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !339, file: !340, line: 31, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !339, file: !340, line: 32, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !346, !152}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !339, file: !340, line: 33, baseType: !167, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !339, file: !340, line: 34, baseType: !123, size: 128, align: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !128, file: !4, line: 809, baseType: !354, size: 64, align: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getaddrinfo_cb", file: !4, line: 318, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !126, !152, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !360, line: 567, size: 384, align: 64, elements: !361)
!360 = !DIFile(filename: "/usr/include/netdb.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!361 = !{!362, !363, !364, !365, !366, !371, !383, !385}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !359, file: !360, line: 569, baseType: !152, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !359, file: !360, line: 570, baseType: !152, size: 32, align: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !359, file: !360, line: 571, baseType: !152, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !359, file: !360, line: 572, baseType: !152, size: 32, align: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !359, file: !360, line: 573, baseType: !367, size: 32, align: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !368, line: 33, baseType: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !370, line: 189, baseType: !145)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !359, file: !360, line: 574, baseType: !372, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !368, line: 149, size: 128, align: 16, elements: !374)
!374 = !{!375, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !373, file: !368, line: 151, baseType: !376, size: 16, align: 16)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !377, line: 28, baseType: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!378 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !373, file: !368, line: 152, baseType: !380, size: 112, align: 8, offset: 16)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 112, align: 8, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 14)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !359, file: !360, line: 575, baseType: !384, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !359, file: !360, line: 576, baseType: !358, size: 64, align: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hints", scope: !128, file: !4, line: 809, baseType: !358, size: 64, align: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !128, file: !4, line: 809, baseType: !384, size: 64, align: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !128, file: !4, line: 809, baseType: !384, size: 64, align: 64, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "addrinfo", scope: !128, file: !4, line: 809, baseType: !358, size: 64, align: 64, offset: 1152)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "retcode", scope: !128, file: !4, line: 809, baseType: !152, size: 32, align: 32, offset: 1216)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!393 = !{!394, !398, !405, !408, !409}
!394 = distinct !DISubprogram(name: "uv__getaddrinfo_translate_error", scope: !1, file: !1, line: 40, type: !395, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, variables: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!152, !152}
!397 = !{}
!398 = distinct !DISubprogram(name: "uv_getaddrinfo", scope: !1, file: !1, line: 137, type: !399, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, variables: !397)
!399 = !DISubroutineType(types: !400)
!400 = !{!152, !139, !126, !354, !401, !401, !403}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!405 = distinct !DISubprogram(name: "uv_freeaddrinfo", scope: !1, file: !1, line: 199, type: !406, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false, variables: !397)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !358}
!408 = distinct !DISubprogram(name: "uv__getaddrinfo_work", scope: !1, file: !1, line: 97, type: !344, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, variables: !397)
!409 = distinct !DISubprogram(name: "uv__getaddrinfo_done", scope: !1, file: !1, line: 107, type: !349, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, variables: !397)
!410 = !{i32 2, !"Dwarf Version", i32 4}
!411 = !{i32 2, !"Debug Info Version", i32 3}
!412 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!413 = !DILocalVariable(name: "sys_err", arg: 1, scope: !394, file: !1, line: 40, type: !152)
!414 = !DIExpression()
!415 = !DILocation(line: 40, column: 41, scope: !394)
!416 = !DILocation(line: 41, column: 11, scope: !394)
!417 = !DILocation(line: 41, column: 3, scope: !394)
!418 = !DILocation(line: 42, column: 11, scope: !419)
!419 = distinct !DILexicalBlock(scope: !394, file: !1, line: 41, column: 20)
!420 = !DILocation(line: 44, column: 24, scope: !419)
!421 = !DILocation(line: 47, column: 19, scope: !419)
!422 = !DILocation(line: 50, column: 22, scope: !419)
!423 = !DILocation(line: 56, column: 22, scope: !419)
!424 = !DILocation(line: 59, column: 18, scope: !419)
!425 = !DILocation(line: 62, column: 20, scope: !419)
!426 = !DILocation(line: 65, column: 20, scope: !419)
!427 = !DILocation(line: 68, column: 20, scope: !419)
!428 = !DILocation(line: 72, column: 20, scope: !419)
!429 = !DILocation(line: 76, column: 22, scope: !419)
!430 = !DILocation(line: 82, column: 21, scope: !419)
!431 = !DILocation(line: 85, column: 22, scope: !419)
!432 = !DILocation(line: 88, column: 28, scope: !419)
!433 = !DILocation(line: 88, column: 27, scope: !419)
!434 = !DILocation(line: 88, column: 20, scope: !419)
!435 = !DILocation(line: 91, column: 3, scope: !394)
!436 = !DILocation(line: 94, column: 1, scope: !394)
!437 = !DILocalVariable(name: "loop", arg: 1, scope: !398, file: !1, line: 137, type: !139)
!438 = !DILocation(line: 137, column: 31, scope: !398)
!439 = !DILocalVariable(name: "req", arg: 2, scope: !398, file: !1, line: 138, type: !126)
!440 = !DILocation(line: 138, column: 38, scope: !398)
!441 = !DILocalVariable(name: "cb", arg: 3, scope: !398, file: !1, line: 139, type: !354)
!442 = !DILocation(line: 139, column: 38, scope: !398)
!443 = !DILocalVariable(name: "hostname", arg: 4, scope: !398, file: !1, line: 140, type: !401)
!444 = !DILocation(line: 140, column: 32, scope: !398)
