; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/getnameinfo.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 193, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!27 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!28 = !DIEnumerator(name: "UV_REQ", value: 1)
!29 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!30 = !DIEnumerator(name: "UV_WRITE", value: 3)
!31 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!32 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!33 = !DIEnumerator(name: "UV_FS", value: 6)
!34 = !DIEnumerator(name: "UV_WORK", value: 7)
!35 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!36 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!37 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 177, size: 32, align: 32, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!40 = !DIEnumerator(name: "UV_E2BIG", value: -7)
!41 = !DIEnumerator(name: "UV_EACCES", value: -13)
!42 = !DIEnumerator(name: "UV_EADDRINUSE", value: -98)
!43 = !DIEnumerator(name: "UV_EADDRNOTAVAIL", value: -99)
!44 = !DIEnumerator(name: "UV_EAFNOSUPPORT", value: -97)
!45 = !DIEnumerator(name: "UV_EAGAIN", value: -11)
!46 = !DIEnumerator(name: "UV_EAI_ADDRFAMILY", value: -3000)
!47 = !DIEnumerator(name: "UV_EAI_AGAIN", value: -3001)
!48 = !DIEnumerator(name: "UV_EAI_BADFLAGS", value: -3002)
!49 = !DIEnumerator(name: "UV_EAI_BADHINTS", value: -3013)
!50 = !DIEnumerator(name: "UV_EAI_CANCELED", value: -3003)
!51 = !DIEnumerator(name: "UV_EAI_FAIL", value: -3004)
!52 = !DIEnumerator(name: "UV_EAI_FAMILY", value: -3005)
!53 = !DIEnumerator(name: "UV_EAI_MEMORY", value: -3006)
!54 = !DIEnumerator(name: "UV_EAI_NODATA", value: -3007)
!55 = !DIEnumerator(name: "UV_EAI_NONAME", value: -3008)
!56 = !DIEnumerator(name: "UV_EAI_OVERFLOW", value: -3009)
!57 = !DIEnumerator(name: "UV_EAI_PROTOCOL", value: -3014)
!58 = !DIEnumerator(name: "UV_EAI_SERVICE", value: -3010)
!59 = !DIEnumerator(name: "UV_EAI_SOCKTYPE", value: -3011)
!60 = !DIEnumerator(name: "UV_EALREADY", value: -114)
!61 = !DIEnumerator(name: "UV_EBADF", value: -9)
!62 = !DIEnumerator(name: "UV_EBUSY", value: -16)
!63 = !DIEnumerator(name: "UV_ECANCELED", value: -125)
!64 = !DIEnumerator(name: "UV_ECHARSET", value: -4080)
!65 = !DIEnumerator(name: "UV_ECONNABORTED", value: -103)
!66 = !DIEnumerator(name: "UV_ECONNREFUSED", value: -111)
!67 = !DIEnumerator(name: "UV_ECONNRESET", value: -104)
!68 = !DIEnumerator(name: "UV_EDESTADDRREQ", value: -89)
!69 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!70 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!71 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!72 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!73 = !DIEnumerator(name: "UV_EINTR", value: -4)
!74 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!75 = !DIEnumerator(name: "UV_EIO", value: -5)
!76 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!77 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!78 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!79 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!80 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!81 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!82 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!83 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!84 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!85 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!86 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!87 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!88 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!89 = !DIEnumerator(name: "UV_ENONET", value: -64)
!90 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!91 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!92 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!93 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!94 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!95 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!96 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!97 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!98 = !DIEnumerator(name: "UV_EPERM", value: -1)
!99 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!100 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!101 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!102 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!103 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!104 = !DIEnumerator(name: "UV_EROFS", value: -30)
!105 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!106 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!107 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!108 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!109 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!110 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!111 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!112 = !DIEnumerator(name: "UV_EOF", value: -4095)
!113 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!114 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!115 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!116 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!117 = !{!118, !119, !134, !138, !391, !392, !400}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_t", file: !4, line: 223, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_req_s", file: !4, line: 388, size: 512, align: 64, elements: !122)
!122 = !{!123, !124, !126, !130}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !4, line: 389, baseType: !118, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !4, line: 389, baseType: !125, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !25)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !121, file: !4, line: 389, baseType: !127, size: 128, align: 64, offset: 128)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, align: 64, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 2)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !121, file: !4, line: 389, baseType: !131, size: 256, align: 64, offset: 256)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 256, align: 64, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 4)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !137, line: 21, baseType: !127)
!137 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getnameinfo_t", file: !4, line: 225, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_getnameinfo_s", file: !4, line: 827, size: 10560, align: 64, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !346, !361, !368, !381, !382, !386, !390}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !4, line: 828, baseType: !118, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !4, line: 828, baseType: !125, size: 32, align: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !140, file: !4, line: 828, baseType: !127, size: 128, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !140, file: !4, line: 828, baseType: !131, size: 256, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !140, file: !4, line: 830, baseType: !147, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !150)
!150 = !{!151, !152, !154, !155, !156, !157, !159, !161, !162, !163, !182, !183, !184, !185, !216, !261, !285, !286, !287, !288, !289, !290, !291, !295, !296, !297, !302, !305, !306, !308, !309, !342, !343, !344, !345}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !4, line: 1475, baseType: !118, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !149, file: !4, line: 1477, baseType: !153, size: 32, align: 32, offset: 64)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !149, file: !4, line: 1478, baseType: !127, size: 128, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !149, file: !4, line: 1479, baseType: !127, size: 128, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !149, file: !4, line: 1481, baseType: !153, size: 32, align: 32, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !149, file: !4, line: 1482, baseType: !158, size: 64, align: 64, offset: 448)
!158 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !149, file: !4, line: 1482, baseType: !160, size: 32, align: 32, offset: 512)
!160 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !149, file: !4, line: 1482, baseType: !164, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !167, line: 87, baseType: !168)
!167 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !167, line: 89, size: 448, align: 64, elements: !169)
!169 = !{!170, !177, !178, !179, !180, !181}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !168, file: !167, line: 90, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !167, line: 84, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175, !176, !153}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !168, file: !167, line: 91, baseType: !127, size: 128, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !168, file: !167, line: 92, baseType: !127, size: 128, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !168, file: !167, line: 93, baseType: !153, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !168, file: !167, line: 94, baseType: !153, size: 32, align: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !168, file: !167, line: 95, baseType: !160, size: 32, align: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !149, file: !4, line: 1482, baseType: !153, size: 32, align: 32, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !149, file: !4, line: 1482, baseType: !153, size: 32, align: 32, offset: 928)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !149, file: !4, line: 1482, baseType: !186, size: 320, align: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !167, line: 129, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !188, line: 127, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!189 = !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 90, size: 320, align: 64, elements: !190)
!190 = !{!191, !209, !214}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !189, file: !188, line: 124, baseType: !192, size: 320, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !188, line: 92, size: 320, align: 64, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !192, file: !188, line: 94, baseType: !160, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !192, file: !188, line: 95, baseType: !153, size: 32, align: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !192, file: !188, line: 96, baseType: !160, size: 32, align: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !192, file: !188, line: 98, baseType: !153, size: 32, align: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !192, file: !188, line: 102, baseType: !160, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !192, file: !188, line: 104, baseType: !200, size: 16, align: 16, offset: 160)
!200 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !192, file: !188, line: 105, baseType: !200, size: 16, align: 16, offset: 176)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !192, file: !188, line: 106, baseType: !203, size: 128, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !188, line: 79, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !188, line: 75, size: 128, align: 64, elements: !205)
!205 = !{!206, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !204, file: !188, line: 77, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !204, file: !188, line: 78, baseType: !207, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !189, file: !188, line: 125, baseType: !210, size: 320, align: 8)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 320, align: 8, elements: !212)
!211 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!212 = !{!213}
!213 = !DISubrange(count: 40)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !189, file: !188, line: 126, baseType: !215, size: 64, align: 64)
!215 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !149, file: !4, line: 1482, baseType: !217, size: 1024, align: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !219)
!219 = !{!220, !221, !222, !224, !245, !246, !251, !252, !253, !259, !260}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !4, line: 768, baseType: !118, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !218, file: !4, line: 768, baseType: !147, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, file: !4, line: 768, baseType: !223, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !218, file: !4, line: 768, baseType: !225, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !243, !244}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !4, line: 426, baseType: !118, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !231, file: !4, line: 426, baseType: !147, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !4, line: 426, baseType: !223, size: 32, align: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !231, file: !4, line: 426, baseType: !225, size: 64, align: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !231, file: !4, line: 426, baseType: !127, size: 128, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !231, file: !4, line: 426, baseType: !239, size: 256, align: 64, offset: 384)
!239 = !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !4, line: 426, size: 256, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !239, file: !4, line: 426, baseType: !160, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !239, file: !4, line: 426, baseType: !131, size: 256, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !231, file: !4, line: 426, baseType: !229, size: 64, align: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !231, file: !4, line: 426, baseType: !153, size: 32, align: 32, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !218, file: !4, line: 768, baseType: !127, size: 128, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !218, file: !4, line: 768, baseType: !247, size: 256, align: 64, offset: 384)
!247 = !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !4, line: 768, size: 256, align: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !247, file: !4, line: 768, baseType: !160, size: 32, align: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !247, file: !4, line: 768, baseType: !131, size: 256, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !218, file: !4, line: 768, baseType: !229, size: 64, align: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !218, file: !4, line: 768, baseType: !153, size: 32, align: 32, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !218, file: !4, line: 769, baseType: !254, size: 64, align: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !218, file: !4, line: 769, baseType: !127, size: 128, align: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !218, file: !4, line: 769, baseType: !160, size: 32, align: 32, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !149, file: !4, line: 1482, baseType: !262, size: 448, align: 64, offset: 2432)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !167, line: 130, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !188, line: 213, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_union_type, file: !188, line: 173, size: 448, align: 64, elements: !265)
!265 = !{!266, !280, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !264, file: !188, line: 192, baseType: !267, size: 448, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, scope: !264, file: !188, line: 176, size: 448, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !267, file: !188, line: 178, baseType: !160, size: 32, align: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !267, file: !188, line: 179, baseType: !153, size: 32, align: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !267, file: !188, line: 180, baseType: !153, size: 32, align: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !267, file: !188, line: 181, baseType: !153, size: 32, align: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !267, file: !188, line: 182, baseType: !153, size: 32, align: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !267, file: !188, line: 183, baseType: !153, size: 32, align: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !267, file: !188, line: 184, baseType: !160, size: 32, align: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !267, file: !188, line: 185, baseType: !160, size: 32, align: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !267, file: !188, line: 186, baseType: !158, size: 64, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !267, file: !188, line: 187, baseType: !158, size: 64, align: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !267, file: !188, line: 190, baseType: !153, size: 32, align: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !264, file: !188, line: 211, baseType: !281, size: 448, align: 8)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 448, align: 8, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 56)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !264, file: !188, line: 212, baseType: !215, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !149, file: !4, line: 1482, baseType: !229, size: 64, align: 64, offset: 2880)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 2944)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 3072)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 3200)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 3328)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !149, file: !4, line: 1482, baseType: !127, size: 128, align: 64, offset: 3456)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !149, file: !4, line: 1482, baseType: !292, size: 64, align: 64, offset: 3584)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !149, file: !4, line: 1482, baseType: !166, size: 448, align: 64, offset: 3648)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !149, file: !4, line: 1482, baseType: !160, size: 32, align: 32, offset: 4096)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !149, file: !4, line: 1482, baseType: !298, size: 128, align: 64, offset: 4160)
!298 = !DICompositeType(tag: DW_TAG_structure_type, scope: !149, file: !4, line: 1482, size: 128, align: 64, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !298, file: !4, line: 1482, baseType: !118, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !298, file: !4, line: 1482, baseType: !153, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !149, file: !4, line: 1482, baseType: !303, size: 64, align: 64, offset: 4288)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !304, line: 55, baseType: !158)
!304 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !149, file: !4, line: 1482, baseType: !303, size: 64, align: 64, offset: 4352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !149, file: !4, line: 1482, baseType: !307, size: 64, align: 32, offset: 4416)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, align: 32, elements: !128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !149, file: !4, line: 1482, baseType: !166, size: 448, align: 64, offset: 4480)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !149, file: !4, line: 1482, baseType: !310, size: 1216, align: 64, offset: 4928)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !311)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !323, !324, !325, !331, !332, !340, !341}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !311, file: !4, line: 1326, baseType: !118, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !311, file: !4, line: 1326, baseType: !147, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !4, line: 1326, baseType: !223, size: 32, align: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !311, file: !4, line: 1326, baseType: !225, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !311, file: !4, line: 1326, baseType: !127, size: 128, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !311, file: !4, line: 1326, baseType: !319, size: 256, align: 64, offset: 384)
!319 = !DICompositeType(tag: DW_TAG_union_type, scope: !311, file: !4, line: 1326, size: 256, align: 64, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !319, file: !4, line: 1326, baseType: !160, size: 32, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !319, file: !4, line: 1326, baseType: !131, size: 256, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !311, file: !4, line: 1326, baseType: !229, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !4, line: 1326, baseType: !153, size: 32, align: 32, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !311, file: !4, line: 1327, baseType: !326, size: 64, align: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !330, !160}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !311, file: !4, line: 1328, baseType: !160, size: 32, align: 32, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !311, file: !4, line: 1329, baseType: !333, size: 256, align: 64, offset: 896)
!333 = !DICompositeType(tag: DW_TAG_structure_type, scope: !311, file: !4, line: 1329, size: 256, align: 64, elements: !334)
!334 = !{!335, !337, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !333, file: !4, line: 1329, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !333, file: !4, line: 1329, baseType: !336, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !333, file: !4, line: 1329, baseType: !336, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !333, file: !4, line: 1329, baseType: !160, size: 32, align: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !311, file: !4, line: 1329, baseType: !153, size: 32, align: 32, offset: 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !311, file: !4, line: 1329, baseType: !153, size: 32, align: 32, offset: 1184)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !149, file: !4, line: 1482, baseType: !160, size: 32, align: 32, offset: 6144)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !149, file: !4, line: 1482, baseType: !166, size: 448, align: 64, offset: 6208)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !149, file: !4, line: 1482, baseType: !118, size: 64, align: 64, offset: 6656)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !149, file: !4, line: 1482, baseType: !160, size: 32, align: 32, offset: 6720)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "work_req", scope: !140, file: !4, line: 832, baseType: !347, size: 320, align: 64, offset: 576)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__work", file: !348, line: 30, size: 320, align: 64, elements: !349)
!348 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-threadpool.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!349 = !{!350, !355, !359, !360}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !347, file: !348, line: 31, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !347, file: !348, line: 32, baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !354, !160}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !347, file: !348, line: 33, baseType: !175, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !347, file: !348, line: 34, baseType: !127, size: 128, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "getnameinfo_cb", scope: !140, file: !4, line: 832, baseType: !362, size: 64, align: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_getnameinfo_cb", file: !4, line: 321, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !138, !160, !366, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !140, file: !4, line: 832, baseType: !369, size: 1024, align: 64, offset: 960)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !370, line: 162, size: 1024, align: 64, elements: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!371 = !{!372, !376, !377}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !369, file: !370, line: 164, baseType: !373, size: 16, align: 16)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !374, line: 28, baseType: !375)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!375 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !369, file: !370, line: 165, baseType: !158, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !369, file: !370, line: 166, baseType: !378, size: 896, align: 8, offset: 128)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 896, align: 8, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 112)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !4, line: 832, baseType: !160, size: 32, align: 32, offset: 1984)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !140, file: !4, line: 832, baseType: !383, size: 8200, align: 8, offset: 2016)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 8200, align: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 1025)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !140, file: !4, line: 832, baseType: !387, size: 256, align: 8, offset: 10216)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 256, align: 8, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "retcode", scope: !140, file: !4, line: 832, baseType: !160, size: 32, align: 32, offset: 10496)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !370, line: 149, size: 128, align: 16, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !393, file: !370, line: 151, baseType: !373, size: 16, align: 16)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !393, file: !370, line: 152, baseType: !397, size: 112, align: 8, offset: 16)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 112, align: 8, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 14)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!402 = !{!403, !409, !410}
!403 = distinct !DISubprogram(name: "uv_getnameinfo", scope: !1, file: !1, line: 81, type: !404, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, variables: !408)
!404 = !DISubroutineType(types: !405)
!405 = !{!160, !147, !138, !362, !406, !160}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!408 = !{}
!409 = distinct !DISubprogram(name: "uv__getnameinfo_work", scope: !1, file: !1, line: 31, type: !352, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, variables: !408)
!410 = distinct !DISubprogram(name: "uv__getnameinfo_done", scope: !1, file: !1, line: 55, type: !357, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, variables: !408)
!411 = !{i32 2, !"Dwarf Version", i32 4}
!412 = !{i32 2, !"Debug Info Version", i32 3}
!413 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!414 = !DILocalVariable(name: "loop", arg: 1, scope: !403, file: !1, line: 81, type: !147)
!415 = !DIExpression()
!416 = !DILocation(line: 81, column: 31, scope: !403)
!417 = !DILocalVariable(name: "req", arg: 2, scope: !403, file: !1, line: 82, type: !138)
!418 = !DILocation(line: 82, column: 38, scope: !403)
!419 = !DILocalVariable(name: "getnameinfo_cb", arg: 3, scope: !403, file: !1, line: 83, type: !362)
!420 = !DILocation(line: 83, column: 38, scope: !403)
!421 = !DILocalVariable(name: "addr", arg: 4, scope: !403, file: !1, line: 84, type: !406)
!422 = !DILocation(line: 84, column: 43, scope: !403)
!423 = !DILocalVariable(name: "flags", arg: 5, scope: !403, file: !1, line: 85, type: !160)
!424 = !DILocation(line: 85, column: 24, scope: !403)
!425 = !DILocation(line: 86, column: 7, scope: !426)
!426 = distinct !DILexicalBlock(scope: !403, file: !1, line: 86, column: 7)
!427 = !DILocation(line: 86, column: 11, scope: !426)
!428 = !DILocation(line: 86, column: 19, scope: !426)
!429 = !DILocation(line: 86, column: 22, scope: !430)
!430 = !DILexicalBlockFile(scope: !426, file: !1, discriminator: 1)
!431 = !DILocation(line: 86, column: 27, scope: !430)
!432 = !DILocation(line: 86, column: 7, scope: !430)
!433 = !DILocation(line: 87, column: 5, scope: !426)
!434 = !DILocation(line: 89, column: 7, scope: !435)
!435 = distinct !DILexicalBlock(scope: !403, file: !1, line: 89, column: 7)
!436 = !DILocation(line: 89, column: 13, scope: !435)
!437 = !DILocation(line: 89, column: 23, scope: !435)
!438 = !DILocation(line: 89, column: 7, scope: !403)
!439 = !DILocation(line: 90, column: 13, scope: !440)
!440 = distinct !DILexicalBlock(scope: !435, file: !1, line: 89, column: 35)
!441 = !DILocation(line: 90, column: 18, scope: !440)
!442 = !DILocation(line: 90, column: 5, scope: !440)
!443 = !DILocation(line: 91, column: 12, scope: !440)
!444 = !DILocation(line: 93, column: 3, scope: !440)
!445 = !DILocation(line: 93, column: 14, scope: !446)
!446 = !DILexicalBlockFile(scope: !447, file: !1, discriminator: 1)
!447 = distinct !DILexicalBlock(scope: !435, file: !1, line: 93, column: 14)
!448 = !DILocation(line: 93, column: 20, scope: !446)
!449 = !DILocation(line: 93, column: 30, scope: !446)
!450 = !DILocation(line: 94, column: 13, scope: !451)
!451 = distinct !DILexicalBlock(scope: !447, file: !1, line: 93, column: 43)
!452 = !DILocation(line: 94, column: 18, scope: !451)
!453 = !DILocation(line: 94, column: 5, scope: !451)
!454 = !DILocation(line: 95, column: 12, scope: !451)
