; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/linux-syscalls.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sockaddr = type { i16, [14 x i8] }
%struct.uv__epoll_event = type <{ i32, i64 }>
%struct.uv__mmsghdr = type { %struct.msghdr, i32 }
%struct.msghdr = type { i8*, i32, %struct.iovec*, i64, i8*, i64, i32 }
%struct.iovec = type { i8*, i64 }
%struct.timespec = type { i64, i64 }

; Function Attrs: nounwind uwtable
define i32 @uv__accept4(i32 %fd, %struct.sockaddr* %addr, i32* %addrlen, i32 %flags) #0 !dbg !6 {
entry:
  %fd.addr = alloca i32, align 4
  %addr.addr = alloca %struct.sockaddr*, align 8
  %addrlen.addr = alloca i32*, align 8
  %flags.addr = alloca i32, align 4
  store i32 %fd, i32* %fd.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %fd.addr, metadata !132, metadata !133), !dbg !134
  store %struct.sockaddr* %addr, %struct.sockaddr** %addr.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.sockaddr** %addr.addr, metadata !135, metadata !133), !dbg !136
  store i32* %addrlen, i32** %addrlen.addr, align 8
  call void @llvm.dbg.declare(metadata i32** %addrlen.addr, metadata !137, metadata !133), !dbg !138
  store i32 %flags, i32* %flags.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %flags.addr, metadata !139, metadata !133), !dbg !140
  %0 = load i32, i32* %fd.addr, align 4, !dbg !141

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/linux-syscalls.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!5 = !{!6, !28, !31, !34, !37, !38, !51, !54, !57, !60, !61, !66, !70, !74, !100, !111, !116, !125, !126}
!6 = distinct !DISubprogram(name: "uv__accept4", scope: !1, file: !1, line: 241, type: !7, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !10, !23, !9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !12, line: 149, size: 128, align: 16, elements: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!13 = !{!14, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !11, file: !12, line: 151, baseType: !15, size: 16, align: 16)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !16, line: 28, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!17 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !11, file: !12, line: 152, baseType: !19, size: 112, align: 8, offset: 16)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, align: 8, elements: !21)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !{!22}
!22 = !DISubrange(count: 14)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !12, line: 33, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !26, line: 189, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = distinct !DISubprogram(name: "uv__eventfd", scope: !1, file: !1, line: 270, type: !29, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{!9, !27}
!31 = distinct !DISubprogram(name: "uv__eventfd2", scope: !1, file: !1, line: 279, type: !32, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!32 = !DISubroutineType(types: !33)
!33 = !{!9, !27, !9}
!34 = distinct !DISubprogram(name: "uv__epoll_create", scope: !1, file: !1, line: 288, type: !35, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!9, !9}
!37 = distinct !DISubprogram(name: "uv__epoll_create1", scope: !1, file: !1, line: 297, type: !35, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!38 = distinct !DISubprogram(name: "uv__epoll_ctl", scope: !1, file: !1, line: 306, type: !39, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!9, !9, !9, !9, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__epoll_event", file: !43, line: 90, size: 96, align: 8, elements: !44)
!43 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/linux-syscalls.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !42, file: !43, line: 91, baseType: !46, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 51, baseType: !27)
!47 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !42, file: !43, line: 92, baseType: !49, size: 64, align: 64, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 55, baseType: !50)
!50 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!51 = distinct !DISubprogram(name: "uv__epoll_wait", scope: !1, file: !1, line: 315, type: !52, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!52 = !DISubroutineType(types: !53)
!53 = !{!9, !9, !41, !9, !9}
!54 = distinct !DISubprogram(name: "uv__epoll_pwait", scope: !1, file: !1, line: 333, type: !55, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!55 = !DISubroutineType(types: !56)
!56 = !{!9, !9, !41, !9, !9, !49}
!57 = distinct !DISubprogram(name: "uv__inotify_init", scope: !1, file: !1, line: 358, type: !58, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!58 = !DISubroutineType(types: !59)
!59 = !{!9}
!60 = distinct !DISubprogram(name: "uv__inotify_init1", scope: !1, file: !1, line: 367, type: !35, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!61 = distinct !DISubprogram(name: "uv__inotify_add_watch", scope: !1, file: !1, line: 376, type: !62, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!62 = !DISubroutineType(types: !63)
!63 = !{!9, !9, !64, !46}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!66 = distinct !DISubprogram(name: "uv__inotify_rm_watch", scope: !1, file: !1, line: 385, type: !67, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!67 = !DISubroutineType(types: !68)
!68 = !{!9, !9, !69}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !47, line: 38, baseType: !9)
!70 = distinct !DISubprogram(name: "uv__pipe2", scope: !1, file: !1, line: 394, type: !71, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!71 = !DISubroutineType(types: !72)
!72 = !{!9, !73, !9}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!74 = distinct !DISubprogram(name: "uv__sendmmsg", scope: !1, file: !1, line: 409, type: !75, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!75 = !DISubroutineType(types: !76)
!76 = !{!9, !9, !77, !27, !27}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__mmsghdr", file: !43, line: 109, size: 512, align: 64, elements: !79)
!79 = !{!80, !99}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "msg_hdr", scope: !78, file: !43, line: 110, baseType: !81, size: 448, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !12, line: 224, size: 448, align: 64, elements: !82)
!82 = !{!83, !85, !86, !95, !96, !97, !98}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !81, file: !12, line: 226, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !81, file: !12, line: 227, baseType: !24, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !81, file: !12, line: 229, baseType: !87, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !89, line: 43, size: 128, align: 64, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !88, file: !89, line: 45, baseType: !84, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !88, file: !89, line: 46, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 62, baseType: !50)
!94 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !81, file: !12, line: 230, baseType: !93, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !81, file: !12, line: 232, baseType: !84, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !81, file: !12, line: 233, baseType: !93, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !81, file: !12, line: 238, baseType: !9, size: 32, align: 32, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !78, file: !43, line: 111, baseType: !27, size: 32, align: 32, offset: 448)
!100 = distinct !DISubprogram(name: "uv__recvmmsg", scope: !1, file: !1, line: 421, type: !101, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!101 = !DISubroutineType(types: !102)
!102 = !{!9, !9, !77, !27, !27, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !105, line: 120, size: 128, align: 64, elements: !106)
!105 = !DIFile(filename: "/usr/include/time.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!106 = !{!107, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !104, file: !105, line: 122, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !26, line: 139, baseType: !4)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !104, file: !105, line: 123, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !26, line: 175, baseType: !4)
!111 = distinct !DISubprogram(name: "uv__utimesat", scope: !1, file: !1, line: 434, type: !112, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!112 = !DISubroutineType(types: !113)
!113 = !{!9, !9, !64, !114, !9}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!116 = distinct !DISubprogram(name: "uv__preadv", scope: !1, file: !1, line: 447, type: !117, isLocal: false, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !9, !122, !9, !124}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !120, line: 109, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !26, line: 172, baseType: !4)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !47, line: 40, baseType: !4)
!125 = distinct !DISubprogram(name: "uv__pwritev", scope: !1, file: !1, line: 456, type: !117, isLocal: false, isDefinition: true, scopeLine: 456, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!126 = distinct !DISubprogram(name: "uv__dup3", scope: !1, file: !1, line: 465, type: !127, isLocal: false, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!127 = !DISubroutineType(types: !128)
!128 = !{!9, !9, !9, !9}
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!132 = !DILocalVariable(name: "fd", arg: 1, scope: !6, file: !1, line: 241, type: !9)
!133 = !DIExpression()
!134 = !DILocation(line: 241, column: 21, scope: !6)
!135 = !DILocalVariable(name: "addr", arg: 2, scope: !6, file: !1, line: 241, type: !10)
!136 = !DILocation(line: 241, column: 42, scope: !6)
!137 = !DILocalVariable(name: "addrlen", arg: 3, scope: !6, file: !1, line: 241, type: !23)
!138 = !DILocation(line: 241, column: 59, scope: !6)
!139 = !DILocalVariable(name: "flags", arg: 4, scope: !6, file: !1, line: 241, type: !9)
!140 = !DILocation(line: 241, column: 72, scope: !6)
!141 = !DILocation(line: 263, column: 32, scope: !6)
!142 = !DILocation(line: 263, column: 36, scope: !6)
!143 = !DILocation(line: 263, column: 42, scope: !6)
!144 = !DILocation(line: 263, column: 51, scope: !6)
!145 = !DILocation(line: 263, column: 10, scope: !6)
!146 = !DILocation(line: 263, column: 3, scope: !6)
!147 = !DILocalVariable(name: "count", arg: 1, scope: !28, file: !1, line: 270, type: !27)
!148 = !DILocation(line: 270, column: 30, scope: !28)
!149 = !DILocation(line: 272, column: 32, scope: !28)
!150 = !DILocation(line: 272, column: 10, scope: !28)
!151 = !DILocation(line: 272, column: 3, scope: !28)
!152 = !DILocalVariable(name: "count", arg: 1, scope: !31, file: !1, line: 279, type: !27)
!153 = !DILocation(line: 279, column: 31, scope: !31)
!154 = !DILocalVariable(name: "flags", arg: 2, scope: !31, file: !1, line: 279, type: !9)
!155 = !DILocation(line: 279, column: 42, scope: !31)
!156 = !DILocation(line: 281, column: 33, scope: !31)
!157 = !DILocation(line: 281, column: 40, scope: !31)
!158 = !DILocation(line: 281, column: 10, scope: !31)
!159 = !DILocation(line: 281, column: 3, scope: !31)
!160 = !DILocalVariable(name: "size", arg: 1, scope: !34, file: !1, line: 288, type: !9)
!161 = !DILocation(line: 288, column: 26, scope: !34)
