; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/linux-inotify.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !37, subprograms: !306)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/linux-inotify.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!2 = !{!3, !25, !33}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 184, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "UV_UNKNOWN_HANDLE", value: 0)
!7 = !DIEnumerator(name: "UV_ASYNC", value: 1)
!8 = !DIEnumerator(name: "UV_CHECK", value: 2)
!9 = !DIEnumerator(name: "UV_FS_EVENT", value: 3)
!10 = !DIEnumerator(name: "UV_FS_POLL", value: 4)
!11 = !DIEnumerator(name: "UV_HANDLE", value: 5)
!12 = !DIEnumerator(name: "UV_IDLE", value: 6)
!13 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!14 = !DIEnumerator(name: "UV_POLL", value: 8)
!15 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!16 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!17 = !DIEnumerator(name: "UV_STREAM", value: 11)
!18 = !DIEnumerator(name: "UV_TCP", value: 12)
!19 = !DIEnumerator(name: "UV_TIMER", value: 13)
!20 = !DIEnumerator(name: "UV_TTY", value: 14)
!21 = !DIEnumerator(name: "UV_UDP", value: 15)
!22 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!23 = !DIEnumerator(name: "UV_FILE", value: 17)
!24 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "UV__SIGNAL_ONE_SHOT", value: 524288)
!29 = !DIEnumerator(name: "UV__HANDLE_INTERNAL", value: 32768)
!30 = !DIEnumerator(name: "UV__HANDLE_ACTIVE", value: 16384)
!31 = !DIEnumerator(name: "UV__HANDLE_REF", value: 8192)
!32 = !DIEnumerator(name: "UV__HANDLE_CLOSING", value: 0)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uv_fs_event", file: !4, line: 1291, size: 32, align: 32, elements: !34)
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "UV_RENAME", value: 1)
!36 = !DIEnumerator(name: "UV_CHANGE", value: 2)
!37 = !{!38, !39, !46, !67, !69, !64, !155, !295, !291}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !42, line: 21, baseType: !43)
!42 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, align: 64, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 2)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "watcher_root", file: !1, line: 43, size: 64, align: 64, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rbh_root", scope: !47, file: !1, line: 44, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "watcher_list", file: !1, line: 35, size: 576, align: 64, elements: !52)
!52 = !{!53, !61, !62, !63, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !51, file: !1, line: 36, baseType: !54, size: 256, align: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !1, line: 36, size: 256, align: 64, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !54, file: !1, line: 36, baseType: !50, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !54, file: !1, line: 36, baseType: !50, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !54, file: !1, line: 36, baseType: !50, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !54, file: !1, line: 36, baseType: !60, size: 32, align: 32, offset: 192)
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !51, file: !1, line: 37, baseType: !41, size: 128, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "iterating", scope: !51, file: !1, line: 38, baseType: !60, size: 32, align: 32, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !51, file: !1, line: 39, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !51, file: !1, line: 40, baseType: !60, size: 32, align: 32, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_event_t", file: !4, line: 218, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_fs_event_s", file: !4, line: 1297, size: 1088, align: 64, elements: !72)
!72 = !{!73, !74, !275, !276, !277, !278, !283, !284, !285, !286, !293, !294}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !4, line: 1298, baseType: !38, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !71, file: !4, line: 1298, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !78)
!78 = !{!79, !80, !82, !83, !84, !85, !87, !88, !89, !90, !109, !110, !111, !112, !142, !190, !214, !215, !216, !217, !218, !219, !220, !224, !225, !226, !231, !234, !235, !237, !238, !271, !272, !273, !274}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !4, line: 1475, baseType: !38, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !77, file: !4, line: 1477, baseType: !81, size: 32, align: 32, offset: 64)
!81 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !77, file: !4, line: 1478, baseType: !43, size: 128, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !77, file: !4, line: 1479, baseType: !43, size: 128, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !77, file: !4, line: 1481, baseType: !81, size: 32, align: 32, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !4, line: 1482, baseType: !86, size: 64, align: 64, offset: 448)
!86 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !77, file: !4, line: 1482, baseType: !60, size: 32, align: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !77, file: !4, line: 1482, baseType: !91, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !94, line: 87, baseType: !95)
!94 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !94, line: 89, size: 448, align: 64, elements: !96)
!96 = !{!97, !104, !105, !106, !107, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !95, file: !94, line: 90, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !94, line: 84, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !102, !103, !81}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !95, file: !94, line: 91, baseType: !43, size: 128, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !95, file: !94, line: 92, baseType: !43, size: 128, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !95, file: !94, line: 93, baseType: !81, size: 32, align: 32, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !95, file: !94, line: 94, baseType: !81, size: 32, align: 32, offset: 352)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !95, file: !94, line: 95, baseType: !60, size: 32, align: 32, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !77, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !77, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !77, file: !4, line: 1482, baseType: !113, size: 320, align: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !94, line: 129, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !115, line: 127, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!116 = !DICompositeType(tag: DW_TAG_union_type, file: !115, line: 90, size: 320, align: 64, elements: !117)
!117 = !{!118, !136, !140}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !116, file: !115, line: 124, baseType: !119, size: 320, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !115, line: 92, size: 320, align: 64, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !128, !129}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !119, file: !115, line: 94, baseType: !60, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !119, file: !115, line: 95, baseType: !81, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !119, file: !115, line: 96, baseType: !60, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !119, file: !115, line: 98, baseType: !81, size: 32, align: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !119, file: !115, line: 102, baseType: !60, size: 32, align: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !119, file: !115, line: 104, baseType: !127, size: 16, align: 16, offset: 160)
!127 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !119, file: !115, line: 105, baseType: !127, size: 16, align: 16, offset: 176)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !119, file: !115, line: 106, baseType: !130, size: 128, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !115, line: 79, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !115, line: 75, size: 128, align: 64, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !131, file: !115, line: 77, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !131, file: !115, line: 78, baseType: !134, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !116, file: !115, line: 125, baseType: !137, size: 320, align: 8)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 320, align: 8, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 40)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !116, file: !115, line: 126, baseType: !141, size: 64, align: 64)
!141 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !77, file: !4, line: 1482, baseType: !143, size: 1024, align: 64, offset: 1408)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !145)
!145 = !{!146, !147, !148, !150, !174, !175, !180, !181, !182, !188, !189}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !4, line: 768, baseType: !38, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !144, file: !4, line: 768, baseType: !75, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !4, line: 768, baseType: !149, size: 32, align: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !144, file: !4, line: 768, baseType: !151, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !172, !173}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !4, line: 426, baseType: !38, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !157, file: !4, line: 426, baseType: !75, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !4, line: 426, baseType: !149, size: 32, align: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !157, file: !4, line: 426, baseType: !151, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !157, file: !4, line: 426, baseType: !43, size: 128, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !157, file: !4, line: 426, baseType: !165, size: 256, align: 64, offset: 384)
!165 = !DICompositeType(tag: DW_TAG_union_type, scope: !157, file: !4, line: 426, size: 256, align: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !165, file: !4, line: 426, baseType: !60, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !165, file: !4, line: 426, baseType: !169, size: 256, align: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, align: 64, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 4)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !157, file: !4, line: 426, baseType: !155, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !4, line: 426, baseType: !81, size: 32, align: 32, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !144, file: !4, line: 768, baseType: !43, size: 128, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !144, file: !4, line: 768, baseType: !176, size: 256, align: 64, offset: 384)
!176 = !DICompositeType(tag: DW_TAG_union_type, scope: !144, file: !4, line: 768, size: 256, align: 64, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !176, file: !4, line: 768, baseType: !60, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !176, file: !4, line: 768, baseType: !169, size: 256, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !144, file: !4, line: 768, baseType: !155, size: 64, align: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !4, line: 768, baseType: !81, size: 32, align: 32, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !144, file: !4, line: 769, baseType: !183, size: 64, align: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !144, file: !4, line: 769, baseType: !43, size: 128, align: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !144, file: !4, line: 769, baseType: !60, size: 32, align: 32, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !77, file: !4, line: 1482, baseType: !191, size: 448, align: 64, offset: 2432)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !94, line: 130, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !115, line: 213, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_union_type, file: !115, line: 173, size: 448, align: 64, elements: !194)
!194 = !{!195, !209, !213}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !193, file: !115, line: 192, baseType: !196, size: 448, align: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !115, line: 176, size: 448, align: 64, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !196, file: !115, line: 178, baseType: !60, size: 32, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !196, file: !115, line: 179, baseType: !81, size: 32, align: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !196, file: !115, line: 180, baseType: !81, size: 32, align: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !196, file: !115, line: 181, baseType: !81, size: 32, align: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !196, file: !115, line: 182, baseType: !81, size: 32, align: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !196, file: !115, line: 183, baseType: !81, size: 32, align: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !196, file: !115, line: 184, baseType: !60, size: 32, align: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !196, file: !115, line: 185, baseType: !60, size: 32, align: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !196, file: !115, line: 186, baseType: !86, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !196, file: !115, line: 187, baseType: !86, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !196, file: !115, line: 190, baseType: !81, size: 32, align: 32, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !193, file: !115, line: 211, baseType: !210, size: 448, align: 8)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 448, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 56)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !193, file: !115, line: 212, baseType: !141, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !77, file: !4, line: 1482, baseType: !155, size: 64, align: 64, offset: 2880)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 2944)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 3072)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 3200)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 3328)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !77, file: !4, line: 1482, baseType: !43, size: 128, align: 64, offset: 3456)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !77, file: !4, line: 1482, baseType: !221, size: 64, align: 64, offset: 3584)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !77, file: !4, line: 1482, baseType: !93, size: 448, align: 64, offset: 3648)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !77, file: !4, line: 1482, baseType: !60, size: 32, align: 32, offset: 4096)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !77, file: !4, line: 1482, baseType: !227, size: 128, align: 64, offset: 4160)
!227 = !DICompositeType(tag: DW_TAG_structure_type, scope: !77, file: !4, line: 1482, size: 128, align: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !227, file: !4, line: 1482, baseType: !38, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !227, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !77, file: !4, line: 1482, baseType: !232, size: 64, align: 64, offset: 4288)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !233, line: 55, baseType: !86)
!233 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !77, file: !4, line: 1482, baseType: !232, size: 64, align: 64, offset: 4352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !77, file: !4, line: 1482, baseType: !236, size: 64, align: 32, offset: 4416)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, align: 32, elements: !44)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !77, file: !4, line: 1482, baseType: !93, size: 448, align: 64, offset: 4480)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !77, file: !4, line: 1482, baseType: !239, size: 1216, align: 64, offset: 4928)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !252, !253, !254, !260, !261, !269, !270}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !4, line: 1326, baseType: !38, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !240, file: !4, line: 1326, baseType: !75, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !4, line: 1326, baseType: !149, size: 32, align: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !240, file: !4, line: 1326, baseType: !151, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !240, file: !4, line: 1326, baseType: !43, size: 128, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !240, file: !4, line: 1326, baseType: !248, size: 256, align: 64, offset: 384)
!248 = !DICompositeType(tag: DW_TAG_union_type, scope: !240, file: !4, line: 1326, size: 256, align: 64, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !248, file: !4, line: 1326, baseType: !60, size: 32, align: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !248, file: !4, line: 1326, baseType: !169, size: 256, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !240, file: !4, line: 1326, baseType: !155, size: 64, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !240, file: !4, line: 1326, baseType: !81, size: 32, align: 32, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !240, file: !4, line: 1327, baseType: !255, size: 64, align: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259, !60}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !240, file: !4, line: 1328, baseType: !60, size: 32, align: 32, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !240, file: !4, line: 1329, baseType: !262, size: 256, align: 64, offset: 896)
!262 = !DICompositeType(tag: DW_TAG_structure_type, scope: !240, file: !4, line: 1329, size: 256, align: 64, elements: !263)
!263 = !{!264, !266, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !262, file: !4, line: 1329, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !262, file: !4, line: 1329, baseType: !265, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !262, file: !4, line: 1329, baseType: !265, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !262, file: !4, line: 1329, baseType: !60, size: 32, align: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !240, file: !4, line: 1329, baseType: !81, size: 32, align: 32, offset: 1152)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !240, file: !4, line: 1329, baseType: !81, size: 32, align: 32, offset: 1184)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !77, file: !4, line: 1482, baseType: !60, size: 32, align: 32, offset: 6144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !77, file: !4, line: 1482, baseType: !93, size: 448, align: 64, offset: 6208)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !77, file: !4, line: 1482, baseType: !38, size: 64, align: 64, offset: 6656)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !77, file: !4, line: 1482, baseType: !60, size: 32, align: 32, offset: 6720)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !4, line: 1298, baseType: !149, size: 32, align: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !71, file: !4, line: 1298, baseType: !151, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !71, file: !4, line: 1298, baseType: !43, size: 128, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !71, file: !4, line: 1298, baseType: !279, size: 256, align: 64, offset: 384)
!279 = !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !4, line: 1298, size: 256, align: 64, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !279, file: !4, line: 1298, baseType: !60, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !4, line: 1298, baseType: !169, size: 256, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !71, file: !4, line: 1298, baseType: !155, size: 64, align: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !71, file: !4, line: 1298, baseType: !81, size: 32, align: 32, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !71, file: !4, line: 1300, baseType: !64, size: 64, align: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !71, file: !4, line: 1301, baseType: !287, size: 64, align: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_fs_event_cb", file: !4, line: 352, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !69, !291, !60, !60}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !71, file: !4, line: 1301, baseType: !43, size: 128, align: 64, offset: 896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !71, file: !4, line: 1301, baseType: !60, size: 32, align: 32, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__inotify_event", file: !298, line: 101, size: 128, align: 32, elements: !299)
!298 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/linux-syscalls.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!299 = !{!300, !302, !304, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !297, file: !298, line: 102, baseType: !301, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !233, line: 38, baseType: !60)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !297, file: !298, line: 103, baseType: !303, size: 32, align: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !233, line: 51, baseType: !81)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !297, file: !298, line: 104, baseType: !303, size: 32, align: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !297, file: !298, line: 105, baseType: !303, size: 32, align: 32, offset: 96)
!306 = !{!307, !311, !314, !317, !320, !323, !326, !329, !332, !335, !338, !341, !344, !347, !351, !354, !355, !360, !361}
!307 = distinct !DISubprogram(name: "uv__inotify_fork", scope: !1, file: !1, line: 113, type: !308, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!308 = !DISubroutineType(types: !309)
!309 = !{!60, !75, !38}
!310 = !{}
!311 = distinct !DISubprogram(name: "uv_fs_event_init", scope: !1, file: !1, line: 270, type: !312, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!312 = !DISubroutineType(types: !313)
!313 = !{!60, !75, !69}
!314 = distinct !DISubprogram(name: "uv_fs_event_start", scope: !1, file: !1, line: 276, type: !315, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!315 = !DISubroutineType(types: !316)
!316 = !{!60, !69, !287, !291, !81}
!317 = distinct !DISubprogram(name: "uv_fs_event_stop", scope: !1, file: !1, line: 330, type: !318, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!318 = !DISubroutineType(types: !319)
!319 = !{!60, !69}
!320 = distinct !DISubprogram(name: "uv__fs_event_close", scope: !1, file: !1, line: 350, type: !321, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !69}
!323 = distinct !DISubprogram(name: "watcher_root_RB_MINMAX", scope: !1, file: !1, line: 57, type: !324, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!324 = !DISubroutineType(types: !325)
!325 = !{!50, !46, !60}
!326 = distinct !DISubprogram(name: "watcher_root_RB_NEXT", scope: !1, file: !1, line: 57, type: !327, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!327 = !DISubroutineType(types: !328)
!328 = !{!50, !50}
!329 = distinct !DISubprogram(name: "maybe_free_watcher_list", scope: !1, file: !1, line: 184, type: !330, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !50, !75}
!332 = distinct !DISubprogram(name: "watcher_root_RB_REMOVE", scope: !1, file: !1, line: 57, type: !333, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!333 = !DISubroutineType(types: !334)
!334 = !{!50, !46, !50}
!335 = distinct !DISubprogram(name: "watcher_root_RB_REMOVE_COLOR", scope: !1, file: !1, line: 57, type: !336, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !46, !50, !50}
!338 = distinct !DISubprogram(name: "init_inotify", scope: !1, file: !1, line: 95, type: !339, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!339 = !DISubroutineType(types: !340)
!340 = !{!60, !75}
!341 = distinct !DISubprogram(name: "new_inotify_fd", scope: !1, file: !1, line: 67, type: !342, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!342 = !DISubroutineType(types: !343)
!343 = !{!60}
!344 = distinct !DISubprogram(name: "uv__inotify_read", scope: !1, file: !1, line: 194, type: !345, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, variables: !310)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !75, !92, !81}
