; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/loop.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!38 = !DIEnumerator(name: "UV_E2BIG", value: -7)
!39 = !DIEnumerator(name: "UV_EACCES", value: -13)
!40 = !DIEnumerator(name: "UV_EADDRINUSE", value: -98)
!41 = !DIEnumerator(name: "UV_EADDRNOTAVAIL", value: -99)
!42 = !DIEnumerator(name: "UV_EAFNOSUPPORT", value: -97)
!43 = !DIEnumerator(name: "UV_EAGAIN", value: -11)
!44 = !DIEnumerator(name: "UV_EAI_ADDRFAMILY", value: -3000)
!45 = !DIEnumerator(name: "UV_EAI_AGAIN", value: -3001)
!46 = !DIEnumerator(name: "UV_EAI_BADFLAGS", value: -3002)
!47 = !DIEnumerator(name: "UV_EAI_BADHINTS", value: -3013)
!48 = !DIEnumerator(name: "UV_EAI_CANCELED", value: -3003)
!49 = !DIEnumerator(name: "UV_EAI_FAIL", value: -3004)
!50 = !DIEnumerator(name: "UV_EAI_FAMILY", value: -3005)
!51 = !DIEnumerator(name: "UV_EAI_MEMORY", value: -3006)
!52 = !DIEnumerator(name: "UV_EAI_NODATA", value: -3007)
!53 = !DIEnumerator(name: "UV_EAI_NONAME", value: -3008)
!54 = !DIEnumerator(name: "UV_EAI_OVERFLOW", value: -3009)
!55 = !DIEnumerator(name: "UV_EAI_PROTOCOL", value: -3014)
!56 = !DIEnumerator(name: "UV_EAI_SERVICE", value: -3010)
!57 = !DIEnumerator(name: "UV_EAI_SOCKTYPE", value: -3011)
!58 = !DIEnumerator(name: "UV_EALREADY", value: -114)
!59 = !DIEnumerator(name: "UV_EBADF", value: -9)
!60 = !DIEnumerator(name: "UV_EBUSY", value: -16)
!61 = !DIEnumerator(name: "UV_ECANCELED", value: -125)
!62 = !DIEnumerator(name: "UV_ECHARSET", value: -4080)
!63 = !DIEnumerator(name: "UV_ECONNABORTED", value: -103)
!64 = !DIEnumerator(name: "UV_ECONNREFUSED", value: -111)
!65 = !DIEnumerator(name: "UV_ECONNRESET", value: -104)
!66 = !DIEnumerator(name: "UV_EDESTADDRREQ", value: -89)
!67 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!68 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!69 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!70 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!71 = !DIEnumerator(name: "UV_EINTR", value: -4)
!72 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!73 = !DIEnumerator(name: "UV_EIO", value: -5)
!74 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!75 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!76 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!77 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!78 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!79 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!80 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!81 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!82 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!83 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!84 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!85 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!86 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!87 = !DIEnumerator(name: "UV_ENONET", value: -64)
!88 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!89 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!90 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!91 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!92 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!93 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!94 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!95 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!96 = !DIEnumerator(name: "UV_EPERM", value: -1)
!97 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!98 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!99 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!100 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!101 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!102 = !DIEnumerator(name: "UV_EROFS", value: -30)
!103 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!104 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!105 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!106 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!107 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!108 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!109 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!110 = !DIEnumerator(name: "UV_EOF", value: -4095)
!111 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!112 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!113 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!114 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 144, size: 32, align: 32, elements: !117)
!116 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/internal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!117 = !{!118}
!118 = !DIEnumerator(name: "UV_LOOP_BLOCK_SIGPROF", value: 1)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 148, size: 32, align: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIEnumerator(name: "UV_CLOCK_PRECISE", value: 0)
!122 = !DIEnumerator(name: "UV_CLOCK_FAST", value: 1)
!123 = !{!124, !137, !142, !145}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "heap", file: !126, line: 40, size: 128, align: 64, elements: !127)
!126 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/heap-inl.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!127 = !{!128, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !125, file: !126, line: 41, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "heap_node", file: !126, line: 27, size: 192, align: 64, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !130, file: !126, line: 28, baseType: !129, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !130, file: !126, line: 29, baseType: !129, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !130, file: !126, line: 30, baseType: !129, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !125, file: !126, line: 42, baseType: !136, size: 32, align: 32, offset: 64)
!136 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !140, line: 21, baseType: !141)
!140 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, align: 64, elements: !143)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!143 = !{!144}
!144 = !DISubrange(count: 2)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!147 = !{!148, !353, !354, !357, !368, !371}
!148 = distinct !DISubprogram(name: "uv_loop_init", scope: !1, file: !1, line: 30, type: !149, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, variables: !352)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !152}
!151 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !163, !164, !165, !166, !185, !186, !187, !188, !219, !267, !291, !292, !293, !294, !295, !296, !297, !301, !302, !303, !308, !311, !312, !314, !315, !348, !349, !350, !351}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !4, line: 1475, baseType: !142, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !154, file: !4, line: 1477, baseType: !136, size: 32, align: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !154, file: !4, line: 1478, baseType: !141, size: 128, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !154, file: !4, line: 1479, baseType: !141, size: 128, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !154, file: !4, line: 1481, baseType: !136, size: 32, align: 32, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !4, line: 1482, baseType: !162, size: 64, align: 64, offset: 448)
!162 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !154, file: !4, line: 1482, baseType: !151, size: 32, align: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !154, file: !4, line: 1482, baseType: !167, size: 64, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !170, line: 87, baseType: !171)
!170 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !170, line: 89, size: 448, align: 64, elements: !172)
!172 = !{!173, !180, !181, !182, !183, !184}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !171, file: !170, line: 90, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !170, line: 84, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !179, !136}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !171, file: !170, line: 91, baseType: !141, size: 128, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !171, file: !170, line: 92, baseType: !141, size: 128, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !171, file: !170, line: 93, baseType: !136, size: 32, align: 32, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !171, file: !170, line: 94, baseType: !136, size: 32, align: 32, offset: 352)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !171, file: !170, line: 95, baseType: !151, size: 32, align: 32, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !154, file: !4, line: 1482, baseType: !136, size: 32, align: 32, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !154, file: !4, line: 1482, baseType: !136, size: 32, align: 32, offset: 928)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !154, file: !4, line: 1482, baseType: !189, size: 320, align: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !170, line: 129, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !191, line: 127, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!192 = !DICompositeType(tag: DW_TAG_union_type, file: !191, line: 90, size: 320, align: 64, elements: !193)
!193 = !{!194, !212, !217}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !192, file: !191, line: 124, baseType: !195, size: 320, align: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !191, line: 92, size: 320, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !204, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !195, file: !191, line: 94, baseType: !151, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !195, file: !191, line: 95, baseType: !136, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !195, file: !191, line: 96, baseType: !151, size: 32, align: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !195, file: !191, line: 98, baseType: !136, size: 32, align: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !195, file: !191, line: 102, baseType: !151, size: 32, align: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !195, file: !191, line: 104, baseType: !203, size: 16, align: 16, offset: 160)
!203 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !195, file: !191, line: 105, baseType: !203, size: 16, align: 16, offset: 176)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !195, file: !191, line: 106, baseType: !206, size: 128, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !191, line: 79, baseType: !207)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !191, line: 75, size: 128, align: 64, elements: !208)
!208 = !{!209, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !207, file: !191, line: 77, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !207, file: !191, line: 78, baseType: !210, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !192, file: !191, line: 125, baseType: !213, size: 320, align: 8)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 320, align: 8, elements: !215)
!214 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!215 = !{!216}
!216 = !DISubrange(count: 40)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !192, file: !191, line: 126, baseType: !218, size: 64, align: 64)
!218 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !154, file: !4, line: 1482, baseType: !220, size: 1024, align: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !222)
!222 = !{!223, !224, !225, !227, !251, !252, !257, !258, !259, !265, !266}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !4, line: 768, baseType: !142, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !221, file: !4, line: 768, baseType: !152, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !4, line: 768, baseType: !226, size: 32, align: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !221, file: !4, line: 768, baseType: !228, size: 64, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !249, !250}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !4, line: 426, baseType: !142, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !234, file: !4, line: 426, baseType: !152, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !4, line: 426, baseType: !226, size: 32, align: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !234, file: !4, line: 426, baseType: !228, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !234, file: !4, line: 426, baseType: !141, size: 128, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !234, file: !4, line: 426, baseType: !242, size: 256, align: 64, offset: 384)
!242 = !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !4, line: 426, size: 256, align: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !242, file: !4, line: 426, baseType: !151, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !242, file: !4, line: 426, baseType: !246, size: 256, align: 64)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 256, align: 64, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 4)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !234, file: !4, line: 426, baseType: !232, size: 64, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !234, file: !4, line: 426, baseType: !136, size: 32, align: 32, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !221, file: !4, line: 768, baseType: !141, size: 128, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !221, file: !4, line: 768, baseType: !253, size: 256, align: 64, offset: 384)
!253 = !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !4, line: 768, size: 256, align: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !253, file: !4, line: 768, baseType: !151, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !253, file: !4, line: 768, baseType: !246, size: 256, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !221, file: !4, line: 768, baseType: !232, size: 64, align: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !221, file: !4, line: 768, baseType: !136, size: 32, align: 32, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !221, file: !4, line: 769, baseType: !260, size: 64, align: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !221, file: !4, line: 769, baseType: !141, size: 128, align: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !221, file: !4, line: 769, baseType: !151, size: 32, align: 32, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !154, file: !4, line: 1482, baseType: !268, size: 448, align: 64, offset: 2432)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !170, line: 130, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !191, line: 213, baseType: !270)
!270 = !DICompositeType(tag: DW_TAG_union_type, file: !191, line: 173, size: 448, align: 64, elements: !271)
!271 = !{!272, !286, !290}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !270, file: !191, line: 192, baseType: !273, size: 448, align: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, scope: !270, file: !191, line: 176, size: 448, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !273, file: !191, line: 178, baseType: !151, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !273, file: !191, line: 179, baseType: !136, size: 32, align: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !273, file: !191, line: 180, baseType: !136, size: 32, align: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !273, file: !191, line: 181, baseType: !136, size: 32, align: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !273, file: !191, line: 182, baseType: !136, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !273, file: !191, line: 183, baseType: !136, size: 32, align: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !273, file: !191, line: 184, baseType: !151, size: 32, align: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !273, file: !191, line: 185, baseType: !151, size: 32, align: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !273, file: !191, line: 186, baseType: !162, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !273, file: !191, line: 187, baseType: !162, size: 64, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !273, file: !191, line: 190, baseType: !136, size: 32, align: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !270, file: !191, line: 211, baseType: !287, size: 448, align: 8)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 448, align: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 56)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !270, file: !191, line: 212, baseType: !218, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !154, file: !4, line: 1482, baseType: !232, size: 64, align: 64, offset: 2880)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 2944)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 3072)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 3200)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 3328)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !154, file: !4, line: 1482, baseType: !141, size: 128, align: 64, offset: 3456)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !154, file: !4, line: 1482, baseType: !298, size: 64, align: 64, offset: 3584)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !154, file: !4, line: 1482, baseType: !169, size: 448, align: 64, offset: 3648)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !154, file: !4, line: 1482, baseType: !151, size: 32, align: 32, offset: 4096)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !154, file: !4, line: 1482, baseType: !304, size: 128, align: 64, offset: 4160)
!304 = !DICompositeType(tag: DW_TAG_structure_type, scope: !154, file: !4, line: 1482, size: 128, align: 64, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !304, file: !4, line: 1482, baseType: !142, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !304, file: !4, line: 1482, baseType: !136, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !154, file: !4, line: 1482, baseType: !309, size: 64, align: 64, offset: 4288)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !310, line: 55, baseType: !162)
!310 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !154, file: !4, line: 1482, baseType: !309, size: 64, align: 64, offset: 4352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !154, file: !4, line: 1482, baseType: !313, size: 64, align: 32, offset: 4416)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, align: 32, elements: !143)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !154, file: !4, line: 1482, baseType: !169, size: 448, align: 64, offset: 4480)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !154, file: !4, line: 1482, baseType: !316, size: 1216, align: 64, offset: 4928)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !329, !330, !331, !337, !338, !346, !347}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !4, line: 1326, baseType: !142, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !317, file: !4, line: 1326, baseType: !152, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !4, line: 1326, baseType: !226, size: 32, align: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !317, file: !4, line: 1326, baseType: !228, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !317, file: !4, line: 1326, baseType: !141, size: 128, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !317, file: !4, line: 1326, baseType: !325, size: 256, align: 64, offset: 384)
!325 = !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !4, line: 1326, size: 256, align: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !325, file: !4, line: 1326, baseType: !151, size: 32, align: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !325, file: !4, line: 1326, baseType: !246, size: 256, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !317, file: !4, line: 1326, baseType: !232, size: 64, align: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !4, line: 1326, baseType: !136, size: 32, align: 32, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !317, file: !4, line: 1327, baseType: !332, size: 64, align: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336, !151}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !317, file: !4, line: 1328, baseType: !151, size: 32, align: 32, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !317, file: !4, line: 1329, baseType: !339, size: 256, align: 64, offset: 896)
!339 = !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !4, line: 1329, size: 256, align: 64, elements: !340)
!340 = !{!341, !343, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !339, file: !4, line: 1329, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !339, file: !4, line: 1329, baseType: !342, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !339, file: !4, line: 1329, baseType: !342, size: 64, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !339, file: !4, line: 1329, baseType: !151, size: 32, align: 32, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !317, file: !4, line: 1329, baseType: !136, size: 32, align: 32, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !317, file: !4, line: 1329, baseType: !136, size: 32, align: 32, offset: 1184)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !154, file: !4, line: 1482, baseType: !151, size: 32, align: 32, offset: 6144)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !154, file: !4, line: 1482, baseType: !169, size: 448, align: 64, offset: 6208)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !154, file: !4, line: 1482, baseType: !142, size: 64, align: 64, offset: 6656)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !154, file: !4, line: 1482, baseType: !151, size: 32, align: 32, offset: 6720)
!352 = !{}
!353 = distinct !DISubprogram(name: "uv_loop_fork", scope: !1, file: !1, line: 112, type: !149, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, variables: !352)
!354 = distinct !DISubprogram(name: "uv__loop_close", scope: !1, file: !1, line: 145, type: !355, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !352)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !152}
!357 = distinct !DISubprogram(name: "uv__loop_configure", scope: !1, file: !1, line: 184, type: !358, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, variables: !352)
!358 = !DISubroutineType(types: !359)
!359 = !{!151, !152, !360, !361}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_option", file: !4, line: 241, baseType: !33)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 181, size: 192, align: 64, elements: !363)
!363 = !{!364, !365, !366, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !362, file: !1, line: 181, baseType: !136, size: 32, align: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !362, file: !1, line: 181, baseType: !136, size: 32, align: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !362, file: !1, line: 181, baseType: !142, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !362, file: !1, line: 181, baseType: !142, size: 64, align: 64, offset: 128)
!368 = distinct !DISubprogram(name: "heap_init", scope: !126, file: !126, line: 62, type: !369, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, variables: !352)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !124}
!371 = distinct !DISubprogram(name: "uv__update_time", scope: !116, file: !116, line: 306, type: !355, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, variables: !352)
!372 = !{i32 2, !"Dwarf Version", i32 4}
!373 = !{i32 2, !"Debug Info Version", i32 3}
!374 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!375 = !DILocalVariable(name: "loop", arg: 1, scope: !148, file: !1, line: 30, type: !152)
!376 = !DIExpression()
!377 = !DILocation(line: 30, column: 29, scope: !148)
!378 = !DILocalVariable(name: "saved_data", scope: !148, file: !1, line: 31, type: !142)
!379 = !DILocation(line: 31, column: 9, scope: !148)
!380 = !DILocalVariable(name: "err", scope: !148, file: !1, line: 32, type: !151)
!381 = !DILocation(line: 32, column: 7, scope: !148)
!382 = !DILocation(line: 34, column: 3, scope: !148)
!383 = !DILocation(line: 36, column: 16, scope: !148)
!384 = !DILocation(line: 36, column: 22, scope: !148)
!385 = !DILocation(line: 36, column: 14, scope: !148)
!386 = !DILocation(line: 37, column: 10, scope: !148)
!387 = !DILocation(line: 37, column: 3, scope: !148)
!388 = !DILocation(line: 38, column: 16, scope: !148)
!389 = !DILocation(line: 38, column: 3, scope: !148)
!390 = !DILocation(line: 38, column: 9, scope: !148)
!391 = !DILocation(line: 38, column: 14, scope: !148)
!392 = !DILocation(line: 40, column: 29, scope: !148)
!393 = !DILocation(line: 40, column: 35, scope: !148)
!394 = !DILocation(line: 40, column: 13, scope: !148)
!395 = !DILocation(line: 40, column: 3, scope: !148)
!396 = !DILocation(line: 41, column: 3, scope: !148)
!397 = !DILocation(line: 41, column: 3, scope: !398)
!398 = !DILexicalBlockFile(scope: !399, file: !1, discriminator: 1)
!399 = distinct !DILexicalBlock(scope: !148, file: !1, line: 41, column: 3)
!400 = !DILocation(line: 42, column: 3, scope: !148)
!401 = !DILocation(line: 42, column: 3, scope: !402)
!402 = !DILexicalBlockFile(scope: !403, file: !1, discriminator: 1)
!403 = distinct !DILexicalBlock(scope: !148, file: !1, line: 42, column: 3)
!404 = !DILocation(line: 43, column: 3, scope: !148)
!405 = !DILocation(line: 43, column: 3, scope: !406)
!406 = !DILexicalBlockFile(scope: !407, file: !1, discriminator: 1)
!407 = distinct !DILexicalBlock(scope: !148, file: !1, line: 43, column: 3)
!408 = !DILocation(line: 44, column: 3, scope: !148)
!409 = !DILocation(line: 44, column: 3, scope: !410)
!410 = !DILexicalBlockFile(scope: !411, file: !1, discriminator: 1)
!411 = distinct !DILexicalBlock(scope: !148, file: !1, line: 44, column: 3)
!412 = !DILocation(line: 45, column: 3, scope: !148)
!413 = !DILocation(line: 45, column: 3, scope: !414)
!414 = !DILexicalBlockFile(scope: !415, file: !1, discriminator: 1)
!415 = distinct !DILexicalBlock(scope: !148, file: !1, line: 45, column: 3)
!416 = !DILocation(line: 46, column: 3, scope: !148)
!417 = !DILocation(line: 46, column: 3, scope: !418)
!418 = !DILexicalBlockFile(scope: !419, file: !1, discriminator: 1)
!419 = distinct !DILexicalBlock(scope: !148, file: !1, line: 46, column: 3)
!420 = !DILocation(line: 47, column: 3, scope: !148)
!421 = !DILocation(line: 47, column: 3, scope: !422)
!422 = !DILexicalBlockFile(scope: !423, file: !1, discriminator: 1)
!423 = distinct !DILexicalBlock(scope: !148, file: !1, line: 47, column: 3)
!424 = !DILocation(line: 49, column: 3, scope: !148)
!425 = !DILocation(line: 49, column: 9, scope: !148)
!426 = !DILocation(line: 49, column: 14, scope: !148)
!427 = !DILocation(line: 50, column: 3, scope: !148)
!428 = !DILocation(line: 50, column: 9, scope: !148)
