; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/poll.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !57, subprograms: !291)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/poll.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!2 = !{!3, !25, !33, !52}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 184, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "UV_UNKNOWN_HANDLE", value: 0)
!7 = !DIEnumerator(name: "UV_ASYNC", value: 1)
!8 = !DIEnumerator(name: "UV_CHECK", value: 2)
!9 = !DIEnumerator(name: "UV_FS_EVENT", value: 3)
!10 = !DIEnumerator(name: "UV_FS_POLL", value: 4)
!11 = !DIEnumerator(name: "UV_HANDLE", value: 5)
!12 = !DIEnumerator(name: "UV_IDLE", value: 6)
!13 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!14 = !DIEnumerator(name: "UV_POLL", value: 8)
!15 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!16 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!17 = !DIEnumerator(name: "UV_STREAM", value: 11)
!18 = !DIEnumerator(name: "UV_TCP", value: 12)
!19 = !DIEnumerator(name: "UV_TIMER", value: 13)
!20 = !DIEnumerator(name: "UV_TTY", value: 14)
!21 = !DIEnumerator(name: "UV_UDP", value: 15)
!22 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!23 = !DIEnumerator(name: "UV_FILE", value: 17)
!24 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "UV__SIGNAL_ONE_SHOT", value: 524288)
!29 = !DIEnumerator(name: "UV__HANDLE_INTERNAL", value: 32768)
!30 = !DIEnumerator(name: "UV__HANDLE_ACTIVE", value: 16384)
!31 = !DIEnumerator(name: "UV__HANDLE_REF", value: 8192)
!32 = !DIEnumerator(name: "UV__HANDLE_CLOSING", value: 0)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 124, size: 32, align: 32, elements: !35)
!34 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/internal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!36 = !DIEnumerator(name: "UV_CLOSING", value: 1)
!37 = !DIEnumerator(name: "UV_CLOSED", value: 2)
!38 = !DIEnumerator(name: "UV_STREAM_READING", value: 4)
!39 = !DIEnumerator(name: "UV_STREAM_SHUTTING", value: 8)
!40 = !DIEnumerator(name: "UV_STREAM_SHUT", value: 16)
!41 = !DIEnumerator(name: "UV_STREAM_READABLE", value: 32)
!42 = !DIEnumerator(name: "UV_STREAM_WRITABLE", value: 64)
!43 = !DIEnumerator(name: "UV_STREAM_BLOCKING", value: 128)
!44 = !DIEnumerator(name: "UV_STREAM_READ_PARTIAL", value: 256)
!45 = !DIEnumerator(name: "UV_STREAM_READ_EOF", value: 512)
!46 = !DIEnumerator(name: "UV_TCP_NODELAY", value: 1024)
!47 = !DIEnumerator(name: "UV_TCP_KEEPALIVE", value: 2048)
!48 = !DIEnumerator(name: "UV_TCP_SINGLE_ACCEPT", value: 4096)
!49 = !DIEnumerator(name: "UV_HANDLE_IPV6", value: 65536)
!50 = !DIEnumerator(name: "UV_UDP_PROCESSING", value: 131072)
!51 = !DIEnumerator(name: "UV_HANDLE_BOUND", value: 262144)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uv_poll_event", file: !4, line: 723, size: 32, align: 32, elements: !53)
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "UV_READABLE", value: 1)
!55 = !DIEnumerator(name: "UV_WRITABLE", value: 2)
!56 = !DIEnumerator(name: "UV_DISCONNECT", value: 4)
!57 = !{!58, !264, !268, !290}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !61)
!61 = !{!62, !64, !254, !255, !256, !257, !262, !263}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !4, line: 426, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !60, file: !4, line: 426, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !68)
!68 = !{!69, !70, !72, !76, !77, !78, !80, !82, !83, !84, !103, !104, !105, !106, !137, !169, !193, !194, !195, !196, !197, !198, !199, !203, !204, !205, !210, !213, !214, !216, !217, !250, !251, !252, !253}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !4, line: 1475, baseType: !63, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !67, file: !4, line: 1477, baseType: !71, size: 32, align: 32, offset: 64)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !67, file: !4, line: 1478, baseType: !73, size: 128, align: 64, offset: 128)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, align: 64, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 2)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !67, file: !4, line: 1479, baseType: !73, size: 128, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !67, file: !4, line: 1481, baseType: !71, size: 32, align: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !4, line: 1482, baseType: !79, size: 64, align: 64, offset: 448)
!79 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !67, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 512)
!81 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !67, file: !4, line: 1482, baseType: !85, size: 64, align: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !88, line: 87, baseType: !89)
!88 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !88, line: 89, size: 448, align: 64, elements: !90)
!90 = !{!91, !98, !99, !100, !101, !102}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !89, file: !88, line: 90, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !88, line: 84, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96, !97, !71}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !89, file: !88, line: 91, baseType: !73, size: 128, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !89, file: !88, line: 92, baseType: !73, size: 128, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !89, file: !88, line: 93, baseType: !71, size: 32, align: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !89, file: !88, line: 94, baseType: !71, size: 32, align: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !89, file: !88, line: 95, baseType: !81, size: 32, align: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !67, file: !4, line: 1482, baseType: !71, size: 32, align: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !67, file: !4, line: 1482, baseType: !71, size: 32, align: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !67, file: !4, line: 1482, baseType: !107, size: 320, align: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !88, line: 129, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !109, line: 127, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!110 = !DICompositeType(tag: DW_TAG_union_type, file: !109, line: 90, size: 320, align: 64, elements: !111)
!111 = !{!112, !130, !135}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !110, file: !109, line: 124, baseType: !113, size: 320, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !109, line: 92, size: 320, align: 64, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !122, !123}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !113, file: !109, line: 94, baseType: !81, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !113, file: !109, line: 95, baseType: !71, size: 32, align: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !113, file: !109, line: 96, baseType: !81, size: 32, align: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !113, file: !109, line: 98, baseType: !71, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !113, file: !109, line: 102, baseType: !81, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !113, file: !109, line: 104, baseType: !121, size: 16, align: 16, offset: 160)
!121 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !113, file: !109, line: 105, baseType: !121, size: 16, align: 16, offset: 176)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !113, file: !109, line: 106, baseType: !124, size: 128, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !109, line: 79, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !109, line: 75, size: 128, align: 64, elements: !126)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !125, file: !109, line: 77, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !125, file: !109, line: 78, baseType: !128, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !110, file: !109, line: 125, baseType: !131, size: 320, align: 8)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 320, align: 8, elements: !133)
!132 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!133 = !{!134}
!134 = !DISubrange(count: 40)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !110, file: !109, line: 126, baseType: !136, size: 64, align: 64)
!136 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !67, file: !4, line: 1482, baseType: !138, size: 1024, align: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !140)
!140 = !{!141, !142, !143, !145, !150, !151, !159, !160, !161, !167, !168}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !4, line: 768, baseType: !63, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !139, file: !4, line: 768, baseType: !65, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !4, line: 768, baseType: !144, size: 32, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !139, file: !4, line: 768, baseType: !146, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !58}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !139, file: !4, line: 768, baseType: !73, size: 128, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !139, file: !4, line: 768, baseType: !152, size: 256, align: 64, offset: 384)
!152 = !DICompositeType(tag: DW_TAG_union_type, scope: !139, file: !4, line: 768, size: 256, align: 64, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !152, file: !4, line: 768, baseType: !81, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !152, file: !4, line: 768, baseType: !156, size: 256, align: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 256, align: 64, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 4)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !139, file: !4, line: 768, baseType: !58, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !139, file: !4, line: 768, baseType: !71, size: 32, align: 32, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !139, file: !4, line: 769, baseType: !162, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !139, file: !4, line: 769, baseType: !73, size: 128, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !139, file: !4, line: 769, baseType: !81, size: 32, align: 32, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !67, file: !4, line: 1482, baseType: !170, size: 448, align: 64, offset: 2432)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !88, line: 130, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !109, line: 213, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_union_type, file: !109, line: 173, size: 448, align: 64, elements: !173)
!173 = !{!174, !188, !192}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !172, file: !109, line: 192, baseType: !175, size: 448, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, scope: !172, file: !109, line: 176, size: 448, align: 64, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !175, file: !109, line: 178, baseType: !81, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !175, file: !109, line: 179, baseType: !71, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !175, file: !109, line: 180, baseType: !71, size: 32, align: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !175, file: !109, line: 181, baseType: !71, size: 32, align: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !175, file: !109, line: 182, baseType: !71, size: 32, align: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !175, file: !109, line: 183, baseType: !71, size: 32, align: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !175, file: !109, line: 184, baseType: !81, size: 32, align: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !175, file: !109, line: 185, baseType: !81, size: 32, align: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !175, file: !109, line: 186, baseType: !79, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !175, file: !109, line: 187, baseType: !79, size: 64, align: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !175, file: !109, line: 190, baseType: !71, size: 32, align: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !172, file: !109, line: 211, baseType: !189, size: 448, align: 8)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 448, align: 8, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 56)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !172, file: !109, line: 212, baseType: !136, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !67, file: !4, line: 1482, baseType: !58, size: 64, align: 64, offset: 2880)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 2944)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 3072)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 3200)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 3328)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !67, file: !4, line: 1482, baseType: !73, size: 128, align: 64, offset: 3456)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !67, file: !4, line: 1482, baseType: !200, size: 64, align: 64, offset: 3584)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !67, file: !4, line: 1482, baseType: !87, size: 448, align: 64, offset: 3648)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !67, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 4096)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !67, file: !4, line: 1482, baseType: !206, size: 128, align: 64, offset: 4160)
!206 = !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !4, line: 1482, size: 128, align: 64, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !206, file: !4, line: 1482, baseType: !63, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !206, file: !4, line: 1482, baseType: !71, size: 32, align: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !67, file: !4, line: 1482, baseType: !211, size: 64, align: 64, offset: 4288)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !212, line: 55, baseType: !79)
!212 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !67, file: !4, line: 1482, baseType: !211, size: 64, align: 64, offset: 4352)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !67, file: !4, line: 1482, baseType: !215, size: 64, align: 32, offset: 4416)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, align: 32, elements: !74)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !67, file: !4, line: 1482, baseType: !87, size: 448, align: 64, offset: 4480)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !67, file: !4, line: 1482, baseType: !218, size: 1216, align: 64, offset: 4928)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226, !231, !232, !233, !239, !240, !248, !249}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !219, file: !4, line: 1326, baseType: !63, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !219, file: !4, line: 1326, baseType: !65, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !4, line: 1326, baseType: !144, size: 32, align: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !219, file: !4, line: 1326, baseType: !146, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !219, file: !4, line: 1326, baseType: !73, size: 128, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !219, file: !4, line: 1326, baseType: !227, size: 256, align: 64, offset: 384)
!227 = !DICompositeType(tag: DW_TAG_union_type, scope: !219, file: !4, line: 1326, size: 256, align: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !227, file: !4, line: 1326, baseType: !81, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !227, file: !4, line: 1326, baseType: !156, size: 256, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !219, file: !4, line: 1326, baseType: !58, size: 64, align: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !219, file: !4, line: 1326, baseType: !71, size: 32, align: 32, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !219, file: !4, line: 1327, baseType: !234, size: 64, align: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !238, !81}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !219, file: !4, line: 1328, baseType: !81, size: 32, align: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !219, file: !4, line: 1329, baseType: !241, size: 256, align: 64, offset: 896)
!241 = !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !4, line: 1329, size: 256, align: 64, elements: !242)
!242 = !{!243, !245, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !241, file: !4, line: 1329, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !241, file: !4, line: 1329, baseType: !244, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !241, file: !4, line: 1329, baseType: !244, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !241, file: !4, line: 1329, baseType: !81, size: 32, align: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !219, file: !4, line: 1329, baseType: !71, size: 32, align: 32, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !219, file: !4, line: 1329, baseType: !71, size: 32, align: 32, offset: 1184)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !67, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 6144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !67, file: !4, line: 1482, baseType: !87, size: 448, align: 64, offset: 6208)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !67, file: !4, line: 1482, baseType: !63, size: 64, align: 64, offset: 6656)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !67, file: !4, line: 1482, baseType: !81, size: 32, align: 32, offset: 6720)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !4, line: 426, baseType: !144, size: 32, align: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !60, file: !4, line: 426, baseType: !146, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !60, file: !4, line: 426, baseType: !73, size: 128, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !60, file: !4, line: 426, baseType: !258, size: 256, align: 64, offset: 384)
!258 = !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !4, line: 426, size: 256, align: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !258, file: !4, line: 426, baseType: !81, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !258, file: !4, line: 426, baseType: !156, size: 256, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !60, file: !4, line: 426, baseType: !58, size: 64, align: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !4, line: 426, baseType: !71, size: 32, align: 32, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !267, line: 21, baseType: !73)
!267 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_poll_t", file: !4, line: 211, baseType: !270)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_poll_s", file: !4, line: 717, size: 1280, align: 64, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !282, !283, !284, !289}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !4, line: 718, baseType: !63, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !270, file: !4, line: 718, baseType: !65, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !4, line: 718, baseType: !144, size: 32, align: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !270, file: !4, line: 718, baseType: !146, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !270, file: !4, line: 718, baseType: !73, size: 128, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !270, file: !4, line: 718, baseType: !278, size: 256, align: 64, offset: 384)
!278 = !DICompositeType(tag: DW_TAG_union_type, scope: !270, file: !4, line: 718, size: 256, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !278, file: !4, line: 718, baseType: !81, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !278, file: !4, line: 718, baseType: !156, size: 256, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !270, file: !4, line: 718, baseType: !58, size: 64, align: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !4, line: 718, baseType: !71, size: 32, align: 32, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "poll_cb", scope: !270, file: !4, line: 719, baseType: !285, size: 64, align: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_poll_cb", file: !4, line: 307, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !268, !81, !81}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !270, file: !4, line: 720, baseType: !87, size: 448, align: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!291 = !{!292, !296, !300, !303, !306, !309, !312}
!292 = distinct !DISubprogram(name: "uv_poll_init", scope: !1, file: !1, line: 55, type: !293, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!81, !65, !268, !81}
!295 = !{}
!296 = distinct !DISubprogram(name: "uv_poll_init_socket", scope: !1, file: !1, line: 80, type: !297, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!297 = !DISubroutineType(types: !298)
!298 = !{!81, !65, !268, !299}
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_os_sock_t", file: !88, line: 122, baseType: !81)
!300 = distinct !DISubprogram(name: "uv_poll_stop", scope: !1, file: !1, line: 94, type: !301, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!301 = !DISubroutineType(types: !302)
!302 = !{!81, !268}
!303 = distinct !DISubprogram(name: "uv_poll_start", scope: !1, file: !1, line: 101, type: !304, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!304 = !DISubroutineType(types: !305)
!305 = !{!81, !268, !81, !285}
!306 = distinct !DISubprogram(name: "uv__poll_close", scope: !1, file: !1, line: 128, type: !307, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !268}
!309 = distinct !DISubprogram(name: "uv__poll_io", scope: !1, file: !1, line: 30, type: !310, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !65, !86, !71}
!312 = distinct !DISubprogram(name: "uv__poll_stop", scope: !1, file: !1, line: 86, type: !307, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, variables: !295)
!313 = !{i32 2, !"Dwarf Version", i32 4}
!314 = !{i32 2, !"Debug Info Version", i32 3}
!315 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!316 = !DILocalVariable(name: "loop", arg: 1, scope: !292, file: !1, line: 55, type: !65)
!317 = !DIExpression()
!318 = !DILocation(line: 55, column: 29, scope: !292)
!319 = !DILocalVariable(name: "handle", arg: 2, scope: !292, file: !1, line: 55, type: !268)
!320 = !DILocation(line: 55, column: 46, scope: !292)
!321 = !DILocalVariable(name: "fd", arg: 3, scope: !292, file: !1, line: 55, type: !81)
!322 = !DILocation(line: 55, column: 58, scope: !292)
!323 = !DILocalVariable(name: "err", scope: !292, file: !1, line: 56, type: !81)
!324 = !DILocation(line: 56, column: 7, scope: !292)
!325 = !DILocation(line: 58, column: 25, scope: !292)
!326 = !DILocation(line: 58, column: 31, scope: !292)
!327 = !DILocation(line: 58, column: 9, scope: !292)
!328 = !DILocation(line: 58, column: 7, scope: !292)
!329 = !DILocation(line: 59, column: 7, scope: !330)
!330 = distinct !DILexicalBlock(scope: !292, file: !1, line: 59, column: 7)
!331 = !DILocation(line: 59, column: 7, scope: !292)
!332 = !DILocation(line: 60, column: 12, scope: !330)
!333 = !DILocation(line: 60, column: 5, scope: !330)
!334 = !DILocation(line: 65, column: 22, scope: !292)
!335 = !DILocation(line: 65, column: 9, scope: !292)
!336 = !DILocation(line: 65, column: 7, scope: !292)
!337 = !DILocation(line: 66, column: 7, scope: !338)
!338 = distinct !DILexicalBlock(scope: !292, file: !1, line: 66, column: 7)
!339 = !DILocation(line: 66, column: 11, scope: !338)
!340 = !DILocation(line: 66, column: 7, scope: !292)
!341 = !DILocation(line: 68, column: 32, scope: !342)
!342 = distinct !DILexicalBlock(scope: !338, file: !1, line: 67, column: 9)
