; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/process.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!6 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!7 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!8 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!9 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!10 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!11 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!12 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!13 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!14 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 184, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!18 = !DIEnumerator(name: "UV_UNKNOWN_HANDLE", value: 0)
!19 = !DIEnumerator(name: "UV_ASYNC", value: 1)
!20 = !DIEnumerator(name: "UV_CHECK", value: 2)
!21 = !DIEnumerator(name: "UV_FS_EVENT", value: 3)
!22 = !DIEnumerator(name: "UV_FS_POLL", value: 4)
!23 = !DIEnumerator(name: "UV_HANDLE", value: 5)
!24 = !DIEnumerator(name: "UV_IDLE", value: 6)
!25 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!26 = !DIEnumerator(name: "UV_POLL", value: 8)
!27 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!28 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!29 = !DIEnumerator(name: "UV_STREAM", value: 11)
!30 = !DIEnumerator(name: "UV_TCP", value: 12)
!31 = !DIEnumerator(name: "UV_TIMER", value: 13)
!32 = !DIEnumerator(name: "UV_TTY", value: 14)
!33 = !DIEnumerator(name: "UV_UDP", value: 15)
!34 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!35 = !DIEnumerator(name: "UV_FILE", value: 17)
!36 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 843, size: 32, align: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !44}
!39 = !DIEnumerator(name: "UV_IGNORE", value: 0)
!40 = !DIEnumerator(name: "UV_CREATE_PIPE", value: 1)
!41 = !DIEnumerator(name: "UV_INHERIT_FD", value: 2)
!42 = !DIEnumerator(name: "UV_INHERIT_STREAM", value: 4)
!43 = !DIEnumerator(name: "UV_READABLE_PIPE", value: 16)
!44 = !DIEnumerator(name: "UV_WRITABLE_PIPE", value: 32)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 193, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!47 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!48 = !DIEnumerator(name: "UV_REQ", value: 1)
!49 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!50 = !DIEnumerator(name: "UV_WRITE", value: 3)
!51 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!52 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!53 = !DIEnumerator(name: "UV_FS", value: 6)
!54 = !DIEnumerator(name: "UV_WORK", value: 7)
!55 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!56 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!57 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uv_process_flags", file: !16, line: 915, size: 32, align: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIEnumerator(name: "UV_PROCESS_SETUID", value: 1)
!61 = !DIEnumerator(name: "UV_PROCESS_SETGID", value: 2)
!62 = !DIEnumerator(name: "UV_PROCESS_WINDOWS_VERBATIM_ARGUMENTS", value: 4)
!63 = !DIEnumerator(name: "UV_PROCESS_DETACHED", value: 8)
!64 = !DIEnumerator(name: "UV_PROCESS_WINDOWS_HIDE", value: 16)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 57, size: 32, align: 32, elements: !67)
!66 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!67 = !{!68, !69, !70, !71, !72}
!68 = !DIEnumerator(name: "UV__SIGNAL_ONE_SHOT", value: 524288)
!69 = !DIEnumerator(name: "UV__HANDLE_INTERNAL", value: 32768)
!70 = !DIEnumerator(name: "UV__HANDLE_ACTIVE", value: 16384)
!71 = !DIEnumerator(name: "UV__HANDLE_REF", value: 8192)
!72 = !DIEnumerator(name: "UV__HANDLE_CLOSING", value: 0)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 124, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/internal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!76 = !DIEnumerator(name: "UV_CLOSING", value: 1)
!77 = !DIEnumerator(name: "UV_CLOSED", value: 2)
!78 = !DIEnumerator(name: "UV_STREAM_READING", value: 4)
!79 = !DIEnumerator(name: "UV_STREAM_SHUTTING", value: 8)
!80 = !DIEnumerator(name: "UV_STREAM_SHUT", value: 16)
!81 = !DIEnumerator(name: "UV_STREAM_READABLE", value: 32)
!82 = !DIEnumerator(name: "UV_STREAM_WRITABLE", value: 64)
!83 = !DIEnumerator(name: "UV_STREAM_BLOCKING", value: 128)
!84 = !DIEnumerator(name: "UV_STREAM_READ_PARTIAL", value: 256)
!85 = !DIEnumerator(name: "UV_STREAM_READ_EOF", value: 512)
!86 = !DIEnumerator(name: "UV_TCP_NODELAY", value: 1024)
!87 = !DIEnumerator(name: "UV_TCP_KEEPALIVE", value: 2048)
!88 = !DIEnumerator(name: "UV_TCP_SINGLE_ACCEPT", value: 4096)
!89 = !DIEnumerator(name: "UV_HANDLE_IPV6", value: 65536)
!90 = !DIEnumerator(name: "UV_UDP_PROCESSING", value: 131072)
!91 = !DIEnumerator(name: "UV_HANDLE_BOUND", value: 262144)
!92 = !{!93, !94, !299, !303, !305, !330, !331, !332, !367}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !16, line: 205, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !16, line: 425, size: 768, align: 64, elements: !97)
!97 = !{!98, !99, !289, !290, !291, !292, !297, !298}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !16, line: 426, baseType: !93, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !96, file: !16, line: 426, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !16, line: 204, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !16, line: 1473, size: 6784, align: 64, elements: !103)
!103 = !{!104, !105, !107, !111, !112, !113, !115, !117, !118, !119, !138, !139, !140, !141, !172, !204, !228, !229, !230, !231, !232, !233, !234, !238, !239, !240, !245, !248, !249, !251, !252, !285, !286, !287, !288}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !16, line: 1475, baseType: !93, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !102, file: !16, line: 1477, baseType: !106, size: 32, align: 32, offset: 64)
!106 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !102, file: !16, line: 1478, baseType: !108, size: 128, align: 64, offset: 128)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, align: 64, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 2)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !102, file: !16, line: 1479, baseType: !108, size: 128, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !102, file: !16, line: 1481, baseType: !106, size: 32, align: 32, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !102, file: !16, line: 1482, baseType: !114, size: 64, align: 64, offset: 448)
!114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !102, file: !16, line: 1482, baseType: !116, size: 32, align: 32, offset: 512)
!116 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !102, file: !16, line: 1482, baseType: !120, size: 64, align: 64, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !123, line: 87, baseType: !124)
!123 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !123, line: 89, size: 448, align: 64, elements: !125)
!125 = !{!126, !133, !134, !135, !136, !137}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !124, file: !123, line: 90, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !123, line: 84, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131, !132, !106}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !124, file: !123, line: 91, baseType: !108, size: 128, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !124, file: !123, line: 92, baseType: !108, size: 128, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !124, file: !123, line: 93, baseType: !106, size: 32, align: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !124, file: !123, line: 94, baseType: !106, size: 32, align: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !124, file: !123, line: 95, baseType: !116, size: 32, align: 32, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !102, file: !16, line: 1482, baseType: !106, size: 32, align: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !102, file: !16, line: 1482, baseType: !106, size: 32, align: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !102, file: !16, line: 1482, baseType: !142, size: 320, align: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !123, line: 129, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !144, line: 127, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!145 = !DICompositeType(tag: DW_TAG_union_type, file: !144, line: 90, size: 320, align: 64, elements: !146)
!146 = !{!147, !165, !170}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !145, file: !144, line: 124, baseType: !148, size: 320, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !144, line: 92, size: 320, align: 64, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !157, !158}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !148, file: !144, line: 94, baseType: !116, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !148, file: !144, line: 95, baseType: !106, size: 32, align: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !148, file: !144, line: 96, baseType: !116, size: 32, align: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !148, file: !144, line: 98, baseType: !106, size: 32, align: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !148, file: !144, line: 102, baseType: !116, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !148, file: !144, line: 104, baseType: !156, size: 16, align: 16, offset: 160)
!156 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !148, file: !144, line: 105, baseType: !156, size: 16, align: 16, offset: 176)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !148, file: !144, line: 106, baseType: !159, size: 128, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !144, line: 79, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !144, line: 75, size: 128, align: 64, elements: !161)
!161 = !{!162, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !160, file: !144, line: 77, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !160, file: !144, line: 78, baseType: !163, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !145, file: !144, line: 125, baseType: !166, size: 320, align: 8)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, align: 8, elements: !168)
!167 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!168 = !{!169}
!169 = !DISubrange(count: 40)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !145, file: !144, line: 126, baseType: !171, size: 64, align: 64)
!171 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !102, file: !16, line: 1482, baseType: !173, size: 1024, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !16, line: 216, baseType: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !16, line: 767, size: 1024, align: 64, elements: !175)
!175 = !{!176, !177, !178, !180, !185, !186, !194, !195, !196, !202, !203}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !16, line: 768, baseType: !93, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !174, file: !16, line: 768, baseType: !100, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !16, line: 768, baseType: !179, size: 32, align: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !16, line: 191, baseType: !15)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !174, file: !16, line: 768, baseType: !181, size: 64, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !16, line: 306, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !94}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !174, file: !16, line: 768, baseType: !108, size: 128, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !174, file: !16, line: 768, baseType: !187, size: 256, align: 64, offset: 384)
!187 = !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !16, line: 768, size: 256, align: 64, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !187, file: !16, line: 768, baseType: !116, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !187, file: !16, line: 768, baseType: !191, size: 256, align: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 256, align: 64, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 4)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !174, file: !16, line: 768, baseType: !94, size: 64, align: 64, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !16, line: 768, baseType: !106, size: 32, align: 32, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !174, file: !16, line: 769, baseType: !197, size: 64, align: 64, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !16, line: 309, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !174, file: !16, line: 769, baseType: !108, size: 128, align: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !174, file: !16, line: 769, baseType: !116, size: 32, align: 32, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !102, file: !16, line: 1482, baseType: !205, size: 448, align: 64, offset: 2432)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !123, line: 130, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !144, line: 213, baseType: !207)
!207 = !DICompositeType(tag: DW_TAG_union_type, file: !144, line: 173, size: 448, align: 64, elements: !208)
!208 = !{!209, !223, !227}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !207, file: !144, line: 192, baseType: !210, size: 448, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, scope: !207, file: !144, line: 176, size: 448, align: 64, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !210, file: !144, line: 178, baseType: !116, size: 32, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !210, file: !144, line: 179, baseType: !106, size: 32, align: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !210, file: !144, line: 180, baseType: !106, size: 32, align: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !210, file: !144, line: 181, baseType: !106, size: 32, align: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !210, file: !144, line: 182, baseType: !106, size: 32, align: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !210, file: !144, line: 183, baseType: !106, size: 32, align: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !210, file: !144, line: 184, baseType: !116, size: 32, align: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !210, file: !144, line: 185, baseType: !116, size: 32, align: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !210, file: !144, line: 186, baseType: !114, size: 64, align: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !210, file: !144, line: 187, baseType: !114, size: 64, align: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !210, file: !144, line: 190, baseType: !106, size: 32, align: 32, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !207, file: !144, line: 211, baseType: !224, size: 448, align: 8)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 448, align: 8, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 56)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !207, file: !144, line: 212, baseType: !171, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !102, file: !16, line: 1482, baseType: !94, size: 64, align: 64, offset: 2880)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 2944)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 3072)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 3200)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 3328)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !102, file: !16, line: 1482, baseType: !108, size: 128, align: 64, offset: 3456)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !102, file: !16, line: 1482, baseType: !235, size: 64, align: 64, offset: 3584)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !102, file: !16, line: 1482, baseType: !122, size: 448, align: 64, offset: 3648)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !102, file: !16, line: 1482, baseType: !116, size: 32, align: 32, offset: 4096)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !102, file: !16, line: 1482, baseType: !241, size: 128, align: 64, offset: 4160)
!241 = !DICompositeType(tag: DW_TAG_structure_type, scope: !102, file: !16, line: 1482, size: 128, align: 64, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !241, file: !16, line: 1482, baseType: !93, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !241, file: !16, line: 1482, baseType: !106, size: 32, align: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !102, file: !16, line: 1482, baseType: !246, size: 64, align: 64, offset: 4288)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !247, line: 55, baseType: !114)
!247 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !102, file: !16, line: 1482, baseType: !246, size: 64, align: 64, offset: 4352)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !102, file: !16, line: 1482, baseType: !250, size: 64, align: 32, offset: 4416)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, align: 32, elements: !109)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !102, file: !16, line: 1482, baseType: !122, size: 448, align: 64, offset: 4480)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !102, file: !16, line: 1482, baseType: !253, size: 1216, align: 64, offset: 4928)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !16, line: 220, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !16, line: 1325, size: 1216, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !266, !267, !268, !274, !275, !283, !284}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !16, line: 1326, baseType: !93, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !254, file: !16, line: 1326, baseType: !100, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !16, line: 1326, baseType: !179, size: 32, align: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !254, file: !16, line: 1326, baseType: !181, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !254, file: !16, line: 1326, baseType: !108, size: 128, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !254, file: !16, line: 1326, baseType: !262, size: 256, align: 64, offset: 384)
!262 = !DICompositeType(tag: DW_TAG_union_type, scope: !254, file: !16, line: 1326, size: 256, align: 64, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !262, file: !16, line: 1326, baseType: !116, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !262, file: !16, line: 1326, baseType: !191, size: 256, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !254, file: !16, line: 1326, baseType: !94, size: 64, align: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !16, line: 1326, baseType: !106, size: 32, align: 32, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !254, file: !16, line: 1327, baseType: !269, size: 64, align: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !16, line: 362, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !273, !116}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !254, file: !16, line: 1328, baseType: !116, size: 32, align: 32, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !254, file: !16, line: 1329, baseType: !276, size: 256, align: 64, offset: 896)
!276 = !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !16, line: 1329, size: 256, align: 64, elements: !277)
!277 = !{!278, !280, !281, !282}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !276, file: !16, line: 1329, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !276, file: !16, line: 1329, baseType: !279, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !276, file: !16, line: 1329, baseType: !279, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !276, file: !16, line: 1329, baseType: !116, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !254, file: !16, line: 1329, baseType: !106, size: 32, align: 32, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !254, file: !16, line: 1329, baseType: !106, size: 32, align: 32, offset: 1184)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !102, file: !16, line: 1482, baseType: !116, size: 32, align: 32, offset: 6144)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !102, file: !16, line: 1482, baseType: !122, size: 448, align: 64, offset: 6208)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !102, file: !16, line: 1482, baseType: !93, size: 64, align: 64, offset: 6656)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !102, file: !16, line: 1482, baseType: !116, size: 32, align: 32, offset: 6720)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !16, line: 426, baseType: !179, size: 32, align: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !96, file: !16, line: 426, baseType: !181, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !96, file: !16, line: 426, baseType: !108, size: 128, align: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !96, file: !16, line: 426, baseType: !293, size: 256, align: 64, offset: 384)
!293 = !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !16, line: 426, size: 256, align: 64, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !293, file: !16, line: 426, baseType: !116, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !293, file: !16, line: 426, baseType: !191, size: 256, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !96, file: !16, line: 426, baseType: !94, size: 64, align: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !16, line: 426, baseType: !106, size: 32, align: 32, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !302, line: 21, baseType: !108)
!302 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_process_t", file: !16, line: 217, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_process_s", file: !16, line: 953, size: 1088, align: 64, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !319, !320, !321, !327, !328, !329}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !16, line: 954, baseType: !93, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !307, file: !16, line: 954, baseType: !100, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !16, line: 954, baseType: !179, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !307, file: !16, line: 954, baseType: !181, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !307, file: !16, line: 954, baseType: !108, size: 128, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !307, file: !16, line: 954, baseType: !315, size: 256, align: 64, offset: 384)
!315 = !DICompositeType(tag: DW_TAG_union_type, scope: !307, file: !16, line: 954, size: 256, align: 64, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !315, file: !16, line: 954, baseType: !116, size: 32, align: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !315, file: !16, line: 954, baseType: !191, size: 256, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !307, file: !16, line: 954, baseType: !94, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !16, line: 954, baseType: !106, size: 32, align: 32, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "exit_cb", scope: !307, file: !16, line: 955, baseType: !322, size: 64, align: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_exit_cb", file: !16, line: 313, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !305, !326, !116}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !247, line: 40, baseType: !171)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !307, file: !16, line: 956, baseType: !116, size: 32, align: 32, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !307, file: !16, line: 957, baseType: !108, size: 128, align: 64, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !307, file: !16, line: 957, baseType: !116, size: 32, align: 32, offset: 1024)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!331 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_pipe_t", file: !16, line: 209, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_pipe_s", file: !16, line: 692, size: 2112, align: 64, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !346, !347, !348, !351, !362, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !16, line: 693, baseType: !93, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !334, file: !16, line: 693, baseType: !100, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !16, line: 693, baseType: !179, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !334, file: !16, line: 693, baseType: !181, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !334, file: !16, line: 693, baseType: !108, size: 128, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !334, file: !16, line: 693, baseType: !342, size: 256, align: 64, offset: 384)
!342 = !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !16, line: 693, size: 256, align: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !342, file: !16, line: 693, baseType: !116, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !342, file: !16, line: 693, baseType: !191, size: 256, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !334, file: !16, line: 693, baseType: !94, size: 64, align: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !16, line: 693, baseType: !106, size: 32, align: 32, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !334, file: !16, line: 694, baseType: !349, size: 64, align: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !350, line: 62, baseType: !114)
!350 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !334, file: !16, line: 694, baseType: !352, size: 64, align: 64, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_alloc_cb", file: !16, line: 296, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !94, !349, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !123, line: 119, baseType: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !123, line: 116, size: 128, align: 64, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !358, file: !123, line: 117, baseType: !330, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !358, file: !123, line: 118, baseType: !349, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !334, file: !16, line: 694, baseType: !363, size: 64, align: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_read_cb", file: !16, line: 299, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367, !429, !433}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stream_t", file: !16, line: 206, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_stream_s", file: !16, line: 465, size: 1984, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !381, !382, !383, !384, !385, !386, !403, !418, !419, !420, !421, !426, !427, !428}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !16, line: 466, baseType: !93, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !369, file: !16, line: 466, baseType: !100, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !16, line: 466, baseType: !179, size: 32, align: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !369, file: !16, line: 466, baseType: !181, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !369, file: !16, line: 466, baseType: !108, size: 128, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !369, file: !16, line: 466, baseType: !377, size: 256, align: 64, offset: 384)
!377 = !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !16, line: 466, size: 256, align: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !377, file: !16, line: 466, baseType: !116, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !377, file: !16, line: 466, baseType: !191, size: 256, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !369, file: !16, line: 466, baseType: !94, size: 64, align: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !16, line: 466, baseType: !106, size: 32, align: 32, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !369, file: !16, line: 467, baseType: !349, size: 64, align: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !369, file: !16, line: 467, baseType: !352, size: 64, align: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !369, file: !16, line: 467, baseType: !363, size: 64, align: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !369, file: !16, line: 467, baseType: !387, size: 64, align: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_t", file: !16, line: 228, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_connect_s", file: !16, line: 551, size: 768, align: 64, elements: !390)
!390 = !{!391, !392, !394, !395, !396, !401, !402}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !389, file: !16, line: 552, baseType: !93, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !16, line: 552, baseType: !393, size: 32, align: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !16, line: 200, baseType: !45)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !389, file: !16, line: 552, baseType: !108, size: 128, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !389, file: !16, line: 552, baseType: !191, size: 256, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !389, file: !16, line: 553, baseType: !397, size: 64, align: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_cb", file: !16, line: 303, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !387, !116}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !389, file: !16, line: 554, baseType: !367, size: 64, align: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !389, file: !16, line: 555, baseType: !108, size: 128, align: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !369, file: !16, line: 467, baseType: !404, size: 64, align: 64, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_t", file: !16, line: 226, baseType: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_shutdown_s", file: !16, line: 401, size: 640, align: 64, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !406, file: !16, line: 402, baseType: !93, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !16, line: 402, baseType: !393, size: 32, align: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !406, file: !16, line: 402, baseType: !108, size: 128, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !406, file: !16, line: 402, baseType: !191, size: 256, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !406, file: !16, line: 403, baseType: !367, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !406, file: !16, line: 404, baseType: !414, size: 64, align: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_cb", file: !16, line: 304, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !404, !116}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !369, file: !16, line: 467, baseType: !122, size: 448, align: 64, offset: 1088)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !369, file: !16, line: 467, baseType: !108, size: 128, align: 64, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !369, file: !16, line: 467, baseType: !108, size: 128, align: 64, offset: 1664)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !369, file: !16, line: 467, baseType: !422, size: 64, align: 64, offset: 1792)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connection_cb", file: !16, line: 305, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !367, !116}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !369, file: !16, line: 467, baseType: !116, size: 32, align: 32, offset: 1856)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !369, file: !16, line: 467, baseType: !116, size: 32, align: 32, offset: 1888)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !369, file: !16, line: 467, baseType: !93, size: 64, align: 64, offset: 1920)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !430, line: 102, baseType: !431)
!430 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !432, line: 172, baseType: !171)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !334, file: !16, line: 694, baseType: !387, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !334, file: !16, line: 694, baseType: !404, size: 64, align: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !334, file: !16, line: 694, baseType: !122, size: 448, align: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !334, file: !16, line: 694, baseType: !108, size: 128, align: 64, offset: 1536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !334, file: !16, line: 694, baseType: !108, size: 128, align: 64, offset: 1664)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !334, file: !16, line: 694, baseType: !422, size: 64, align: 64, offset: 1792)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !334, file: !16, line: 694, baseType: !116, size: 32, align: 32, offset: 1856)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !334, file: !16, line: 694, baseType: !116, size: 32, align: 32, offset: 1888)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !334, file: !16, line: 694, baseType: !93, size: 64, align: 64, offset: 1920)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ipc", scope: !334, file: !16, line: 695, baseType: !116, size: 32, align: 32, offset: 1984)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fname", scope: !334, file: !16, line: 696, baseType: !446, size: 64, align: 64, offset: 2048)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!448 = !{!449, !454, !455, !492, !495, !498, !501, !504, !505, !509, !512, !515}
!449 = distinct !DISubprogram(name: "uv__make_socketpair", scope: !1, file: !1, line: 115, type: !450, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!450 = !DISubroutineType(types: !451)
!451 = !{!116, !452, !116}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!453 = !{}
!454 = distinct !DISubprogram(name: "uv__make_pipe", scope: !1, file: !1, line: 151, type: !450, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!455 = distinct !DISubprogram(name: "uv_spawn", scope: !1, file: !1, line: 386, type: !456, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!456 = !DISubroutineType(types: !457)
!457 = !{!116, !100, !305, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_process_options_t", file: !16, line: 910, baseType: !461)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_process_options_s", file: !16, line: 867, size: 512, align: 64, elements: !462)
!462 = !{!463, !464, !465, !467, !468, !469, !470, !471, !483, !488}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "exit_cb", scope: !461, file: !16, line: 868, baseType: !322, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !461, file: !16, line: 869, baseType: !446, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !461, file: !16, line: 876, baseType: !466, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !461, file: !16, line: 881, baseType: !466, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !461, file: !16, line: 886, baseType: !446, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !16, line: 891, baseType: !106, size: 32, align: 32, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "stdio_count", scope: !461, file: !16, line: 901, baseType: !116, size: 32, align: 32, offset: 352)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stdio", scope: !461, file: !16, line: 902, baseType: !472, size: 64, align: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stdio_container_t", file: !16, line: 865, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_stdio_container_s", file: !16, line: 858, size: 128, align: 64, elements: !475)
!475 = !{!476, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !16, line: 859, baseType: !477, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stdio_flags", file: !16, line: 856, baseType: !37)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !16, line: 864, baseType: !479, size: 64, align: 64, offset: 64)
!479 = !DICompositeType(tag: DW_TAG_union_type, scope: !474, file: !16, line: 861, size: 64, align: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !479, file: !16, line: 862, baseType: !367, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !479, file: !16, line: 863, baseType: !116, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !461, file: !16, line: 908, baseType: !484, size: 32, align: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_uid_t", file: !123, line: 139, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !486, line: 80, baseType: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !432, line: 125, baseType: !106)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !461, file: !16, line: 909, baseType: !489, size: 32, align: 32, offset: 480)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_gid_t", file: !123, line: 138, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !486, line: 65, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !432, line: 126, baseType: !106)
!492 = distinct !DISubprogram(name: "uv_process_kill", scope: !1, file: !1, line: 545, type: !493, isLocal: false, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!493 = !DISubroutineType(types: !494)
!494 = !{!116, !305, !116}
!495 = distinct !DISubprogram(name: "uv_kill", scope: !1, file: !1, line: 550, type: !496, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!496 = !DISubroutineType(types: !497)
!497 = !{!116, !116, !116}
!498 = distinct !DISubprogram(name: "uv__process_close", scope: !1, file: !1, line: 558, type: !499, isLocal: false, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !305}
!501 = distinct !DISubprogram(name: "uv__process_init_stdio", scope: !1, file: !1, line: 188, type: !502, isLocal: true, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!502 = !DISubroutineType(types: !503)
!503 = !{!116, !472, !452}
!504 = distinct !DISubprogram(name: "uv__chld", scope: !1, file: !1, line: 48, type: !271, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!505 = distinct !DISubprogram(name: "uv__process_child_init", scope: !1, file: !1, line: 278, type: !506, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !458, !116, !508, !116}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!509 = distinct !DISubprogram(name: "uv__write_int", scope: !1, file: !1, line: 259, type: !510, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !116, !116}
!512 = distinct !DISubprogram(name: "uv__process_open_stream", scope: !1, file: !1, line: 225, type: !513, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!513 = !DISubroutineType(types: !514)
!514 = !{!116, !472, !452, !116}
!515 = distinct !DISubprogram(name: "uv__process_close_stream", scope: !1, file: !1, line: 253, type: !516, isLocal: true, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false, variables: !453)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !472}
!518 = !{!519, !520}
!519 = !DIGlobalVariable(name: "no_cloexec", scope: !449, file: !1, line: 117, type: !116, isLocal: true, isDefinition: true, variable: i32* @uv__make_socketpair.no_cloexec)
!520 = !DIGlobalVariable(name: "no_pipe2", scope: !454, file: !1, line: 153, type: !116, isLocal: true, isDefinition: true, variable: i32* @uv__make_pipe.no_pipe2)
!521 = !{i32 2, !"Dwarf Version", i32 4}
!522 = !{i32 2, !"Debug Info Version", i32 3}
!523 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!524 = !DILocalVariable(name: "fds", arg: 1, scope: !449, file: !1, line: 115, type: !452)
!525 = !DIExpression()
!526 = !DILocation(line: 115, column: 29, scope: !449)
!527 = !DILocalVariable(name: "flags", arg: 2, scope: !449, file: !1, line: 115, type: !116)
!528 = !DILocation(line: 115, column: 41, scope: !449)
!529 = !DILocation(line: 119, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !449, file: !1, line: 119, column: 7)
!531 = !DILocation(line: 119, column: 7, scope: !449)
