; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/signal.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv__signal_tree_s = type { %struct.uv_signal_s* }
%struct.uv_signal_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.2, %struct.uv_handle_s*, i32, void (%struct.uv_signal_s*, i32)*, i32, %struct.anon.3, i32, i32 }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !52, subprograms: !275, globals: !355)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/signal.c", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!2 = !{!3, !25, !33}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 184, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "UV_UNKNOWN_HANDLE", value: 0)
!7 = !DIEnumerator(name: "UV_ASYNC", value: 1)
!8 = !DIEnumerator(name: "UV_CHECK", value: 2)
!9 = !DIEnumerator(name: "UV_FS_EVENT", value: 3)
!10 = !DIEnumerator(name: "UV_FS_POLL", value: 4)
!11 = !DIEnumerator(name: "UV_HANDLE", value: 5)
!12 = !DIEnumerator(name: "UV_IDLE", value: 6)
!13 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!14 = !DIEnumerator(name: "UV_POLL", value: 8)
!15 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!16 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!17 = !DIEnumerator(name: "UV_STREAM", value: 11)
!18 = !DIEnumerator(name: "UV_TCP", value: 12)
!19 = !DIEnumerator(name: "UV_TIMER", value: 13)
!20 = !DIEnumerator(name: "UV_TTY", value: 14)
!21 = !DIEnumerator(name: "UV_UDP", value: 15)
!22 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!23 = !DIEnumerator(name: "UV_FILE", value: 17)
!24 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/uv-common.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "UV__SIGNAL_ONE_SHOT", value: 524288)
!29 = !DIEnumerator(name: "UV__HANDLE_INTERNAL", value: 32768)
!30 = !DIEnumerator(name: "UV__HANDLE_ACTIVE", value: 16384)
!31 = !DIEnumerator(name: "UV__HANDLE_REF", value: 8192)
!32 = !DIEnumerator(name: "UV__HANDLE_CLOSING", value: 0)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 124, size: 32, align: 32, elements: !35)
!34 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/internal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!36 = !DIEnumerator(name: "UV_CLOSING", value: 1)
!37 = !DIEnumerator(name: "UV_CLOSED", value: 2)
!38 = !DIEnumerator(name: "UV_STREAM_READING", value: 4)
!39 = !DIEnumerator(name: "UV_STREAM_SHUTTING", value: 8)
!40 = !DIEnumerator(name: "UV_STREAM_SHUT", value: 16)
!41 = !DIEnumerator(name: "UV_STREAM_READABLE", value: 32)
!42 = !DIEnumerator(name: "UV_STREAM_WRITABLE", value: 64)
!43 = !DIEnumerator(name: "UV_STREAM_BLOCKING", value: 128)
!44 = !DIEnumerator(name: "UV_STREAM_READ_PARTIAL", value: 256)
!45 = !DIEnumerator(name: "UV_STREAM_READ_EOF", value: 512)
!46 = !DIEnumerator(name: "UV_TCP_NODELAY", value: 1024)
!47 = !DIEnumerator(name: "UV_TCP_KEEPALIVE", value: 2048)
!48 = !DIEnumerator(name: "UV_TCP_SINGLE_ACCEPT", value: 4096)
!49 = !DIEnumerator(name: "UV_HANDLE_IPV6", value: 65536)
!50 = !DIEnumerator(name: "UV_UDP_PROCESSING", value: 131072)
!51 = !DIEnumerator(name: "UV_HANDLE_BOUND", value: 262144)
!52 = !{!53, !61, !263, !237, !264, !58, !270}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !56, line: 21, baseType: !57)
!56 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, align: 64, elements: !59)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!59 = !{!60}
!60 = !DISubrange(count: 2)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !64)
!64 = !{!65, !66, !253, !254, !255, !256, !261, !262}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !4, line: 426, baseType: !58, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !63, file: !4, line: 426, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !70)
!70 = !{!71, !72, !74, !75, !76, !77, !79, !81, !82, !83, !102, !103, !104, !105, !136, !168, !192, !193, !194, !195, !196, !197, !198, !202, !203, !204, !209, !212, !213, !215, !216, !249, !250, !251, !252}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !4, line: 1475, baseType: !58, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !69, file: !4, line: 1477, baseType: !73, size: 32, align: 32, offset: 64)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !69, file: !4, line: 1478, baseType: !57, size: 128, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !69, file: !4, line: 1479, baseType: !57, size: 128, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !69, file: !4, line: 1481, baseType: !73, size: 32, align: 32, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !4, line: 1482, baseType: !78, size: 64, align: 64, offset: 448)
!78 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !69, file: !4, line: 1482, baseType: !80, size: 32, align: 32, offset: 512)
!80 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !69, file: !4, line: 1482, baseType: !84, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !87, line: 87, baseType: !88)
!87 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !87, line: 89, size: 448, align: 64, elements: !89)
!89 = !{!90, !97, !98, !99, !100, !101}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !88, file: !87, line: 90, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !87, line: 84, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !96, !73}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !88, file: !87, line: 91, baseType: !57, size: 128, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !88, file: !87, line: 92, baseType: !57, size: 128, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !88, file: !87, line: 93, baseType: !73, size: 32, align: 32, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !88, file: !87, line: 94, baseType: !73, size: 32, align: 32, offset: 352)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !88, file: !87, line: 95, baseType: !80, size: 32, align: 32, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !69, file: !4, line: 1482, baseType: !73, size: 32, align: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !69, file: !4, line: 1482, baseType: !73, size: 32, align: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !69, file: !4, line: 1482, baseType: !106, size: 320, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !87, line: 129, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !108, line: 127, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!109 = !DICompositeType(tag: DW_TAG_union_type, file: !108, line: 90, size: 320, align: 64, elements: !110)
!110 = !{!111, !129, !134}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !109, file: !108, line: 124, baseType: !112, size: 320, align: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !108, line: 92, size: 320, align: 64, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !112, file: !108, line: 94, baseType: !80, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !112, file: !108, line: 95, baseType: !73, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !112, file: !108, line: 96, baseType: !80, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !112, file: !108, line: 98, baseType: !73, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !112, file: !108, line: 102, baseType: !80, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !112, file: !108, line: 104, baseType: !120, size: 16, align: 16, offset: 160)
!120 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !112, file: !108, line: 105, baseType: !120, size: 16, align: 16, offset: 176)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !112, file: !108, line: 106, baseType: !123, size: 128, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !108, line: 79, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !108, line: 75, size: 128, align: 64, elements: !125)
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !124, file: !108, line: 77, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !124, file: !108, line: 78, baseType: !127, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !109, file: !108, line: 125, baseType: !130, size: 320, align: 8)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 320, align: 8, elements: !132)
!131 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!132 = !{!133}
!133 = !DISubrange(count: 40)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !109, file: !108, line: 126, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !69, file: !4, line: 1482, baseType: !137, size: 1024, align: 64, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !139)
!139 = !{!140, !141, !142, !144, !149, !150, !158, !159, !160, !166, !167}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !4, line: 768, baseType: !58, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !138, file: !4, line: 768, baseType: !67, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !4, line: 768, baseType: !143, size: 32, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !138, file: !4, line: 768, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !61}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !138, file: !4, line: 768, baseType: !57, size: 128, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !138, file: !4, line: 768, baseType: !151, size: 256, align: 64, offset: 384)
!151 = !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !4, line: 768, size: 256, align: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !151, file: !4, line: 768, baseType: !80, size: 32, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !151, file: !4, line: 768, baseType: !155, size: 256, align: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 256, align: 64, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 4)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !138, file: !4, line: 768, baseType: !61, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !4, line: 768, baseType: !73, size: 32, align: 32, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !138, file: !4, line: 769, baseType: !161, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !138, file: !4, line: 769, baseType: !57, size: 128, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !138, file: !4, line: 769, baseType: !80, size: 32, align: 32, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !69, file: !4, line: 1482, baseType: !169, size: 448, align: 64, offset: 2432)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !87, line: 130, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !108, line: 213, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_union_type, file: !108, line: 173, size: 448, align: 64, elements: !172)
!172 = !{!173, !187, !191}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !171, file: !108, line: 192, baseType: !174, size: 448, align: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !108, line: 176, size: 448, align: 64, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !174, file: !108, line: 178, baseType: !80, size: 32, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !174, file: !108, line: 179, baseType: !73, size: 32, align: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !174, file: !108, line: 180, baseType: !73, size: 32, align: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !174, file: !108, line: 181, baseType: !73, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !174, file: !108, line: 182, baseType: !73, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !174, file: !108, line: 183, baseType: !73, size: 32, align: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !174, file: !108, line: 184, baseType: !80, size: 32, align: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !174, file: !108, line: 185, baseType: !80, size: 32, align: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !174, file: !108, line: 186, baseType: !78, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !174, file: !108, line: 187, baseType: !78, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !174, file: !108, line: 190, baseType: !73, size: 32, align: 32, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !171, file: !108, line: 211, baseType: !188, size: 448, align: 8)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 448, align: 8, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 56)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !171, file: !108, line: 212, baseType: !135, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !69, file: !4, line: 1482, baseType: !61, size: 64, align: 64, offset: 2880)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 2944)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 3072)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 3200)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 3328)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !69, file: !4, line: 1482, baseType: !57, size: 128, align: 64, offset: 3456)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !69, file: !4, line: 1482, baseType: !199, size: 64, align: 64, offset: 3584)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !69, file: !4, line: 1482, baseType: !86, size: 448, align: 64, offset: 3648)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !69, file: !4, line: 1482, baseType: !80, size: 32, align: 32, offset: 4096)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !69, file: !4, line: 1482, baseType: !205, size: 128, align: 64, offset: 4160)
!205 = !DICompositeType(tag: DW_TAG_structure_type, scope: !69, file: !4, line: 1482, size: 128, align: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !205, file: !4, line: 1482, baseType: !58, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !205, file: !4, line: 1482, baseType: !73, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !69, file: !4, line: 1482, baseType: !210, size: 64, align: 64, offset: 4288)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !211, line: 55, baseType: !78)
!211 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !69, file: !4, line: 1482, baseType: !210, size: 64, align: 64, offset: 4352)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !69, file: !4, line: 1482, baseType: !214, size: 64, align: 32, offset: 4416)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, align: 32, elements: !59)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !69, file: !4, line: 1482, baseType: !86, size: 448, align: 64, offset: 4480)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !69, file: !4, line: 1482, baseType: !217, size: 1216, align: 64, offset: 4928)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !230, !231, !232, !238, !239, !247, !248}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !4, line: 1326, baseType: !58, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !218, file: !4, line: 1326, baseType: !67, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, file: !4, line: 1326, baseType: !143, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !218, file: !4, line: 1326, baseType: !145, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !218, file: !4, line: 1326, baseType: !57, size: 128, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !218, file: !4, line: 1326, baseType: !226, size: 256, align: 64, offset: 384)
!226 = !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !4, line: 1326, size: 256, align: 64, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !226, file: !4, line: 1326, baseType: !80, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !226, file: !4, line: 1326, baseType: !155, size: 256, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !218, file: !4, line: 1326, baseType: !61, size: 64, align: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !218, file: !4, line: 1326, baseType: !73, size: 32, align: 32, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !218, file: !4, line: 1327, baseType: !233, size: 64, align: 64, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !80}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !218, file: !4, line: 1328, baseType: !80, size: 32, align: 32, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !218, file: !4, line: 1329, baseType: !240, size: 256, align: 64, offset: 896)
!240 = !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !4, line: 1329, size: 256, align: 64, elements: !241)
!241 = !{!242, !244, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !240, file: !4, line: 1329, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !240, file: !4, line: 1329, baseType: !243, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !240, file: !4, line: 1329, baseType: !243, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !240, file: !4, line: 1329, baseType: !80, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !218, file: !4, line: 1329, baseType: !73, size: 32, align: 32, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !218, file: !4, line: 1329, baseType: !73, size: 32, align: 32, offset: 1184)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !69, file: !4, line: 1482, baseType: !80, size: 32, align: 32, offset: 6144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !69, file: !4, line: 1482, baseType: !86, size: 448, align: 64, offset: 6208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !69, file: !4, line: 1482, baseType: !58, size: 64, align: 64, offset: 6656)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !69, file: !4, line: 1482, baseType: !80, size: 32, align: 32, offset: 6720)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !4, line: 426, baseType: !143, size: 32, align: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !63, file: !4, line: 426, baseType: !145, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !63, file: !4, line: 426, baseType: !57, size: 128, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !63, file: !4, line: 426, baseType: !257, size: 256, align: 64, offset: 384)
!257 = !DICompositeType(tag: DW_TAG_union_type, scope: !63, file: !4, line: 426, size: 256, align: 64, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !257, file: !4, line: 426, baseType: !80, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !257, file: !4, line: 426, baseType: !155, size: 256, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !63, file: !4, line: 426, baseType: !61, size: 64, align: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !4, line: 426, baseType: !73, size: 32, align: 32, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__signal_msg_t", file: !1, line: 35, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 32, size: 128, align: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !266, file: !1, line: 33, baseType: !237, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !266, file: !1, line: 34, baseType: !80, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !271, line: 85, baseType: !272)
!271 = !DIFile(filename: "/usr/include/signal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !80}
!275 = !{!276, !278, !281, !284, !287, !290, !293, !294, !297, !298, !299, !302, !303, !306, !309, !323, !324, !327, !334, !337, !340, !341, !344, !345, !346, !349, !350, !351, !354}
!276 = distinct !DISubprogram(name: "uv__signal_global_once_init", scope: !1, file: !1, line: 98, type: !200, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!277 = !{}
!278 = distinct !DISubprogram(name: "uv__signal_loop_fork", scope: !1, file: !1, line: 265, type: !279, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!279 = !DISubroutineType(types: !280)
!280 = !{!80, !67}
!281 = distinct !DISubprogram(name: "uv__signal_loop_cleanup", scope: !1, file: !1, line: 275, type: !282, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !67}
!284 = distinct !DISubprogram(name: "uv_signal_init", scope: !1, file: !1, line: 303, type: !285, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!285 = !DISubroutineType(types: !286)
!286 = !{!80, !67, !237}
!287 = distinct !DISubprogram(name: "uv__signal_close", scope: !1, file: !1, line: 319, type: !288, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !237}
!290 = distinct !DISubprogram(name: "uv_signal_start", scope: !1, file: !1, line: 333, type: !291, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!291 = !DISubroutineType(types: !292)
!292 = !{!80, !237, !233, !80}
!293 = distinct !DISubprogram(name: "uv_signal_start_oneshot", scope: !1, file: !1, line: 338, type: !291, isLocal: false, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!294 = distinct !DISubprogram(name: "uv_signal_stop", scope: !1, file: !1, line: 515, type: !295, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!295 = !DISubroutineType(types: !296)
!296 = !{!80, !237}
!297 = distinct !DISubprogram(name: "uv__signal_global_init", scope: !1, file: !1, line: 63, type: !200, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!298 = distinct !DISubprogram(name: "uv__signal_global_reinit", scope: !1, file: !1, line: 82, type: !200, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!299 = distinct !DISubprogram(name: "uv__signal_unlock", scope: !1, file: !1, line: 116, type: !300, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!300 = !DISubroutineType(types: !301)
!301 = !{!80}
!302 = distinct !DISubprogram(name: "uv__signal_loop_once_init", scope: !1, file: !1, line: 245, type: !279, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!303 = distinct !DISubprogram(name: "uv__signal_event", scope: !1, file: !1, line: 409, type: !304, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !67, !85, !73}
!306 = distinct !DISubprogram(name: "uv__signal_start", scope: !1, file: !1, line: 345, type: !307, isLocal: true, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!307 = !DISubroutineType(types: !308)
!308 = !{!80, !237, !233, !80, !80}
!309 = distinct !DISubprogram(name: "uv__signal_block_and_lock", scope: !1, file: !1, line: 128, type: !310, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !314, line: 37, baseType: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !316, line: 30, baseType: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!317 = !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 27, size: 1024, align: 64, elements: !318)
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !317, file: !316, line: 29, baseType: !320, size: 1024, align: 64)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1024, align: 64, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 16)
!323 = distinct !DISubprogram(name: "uv__signal_lock", scope: !1, file: !1, line: 104, type: !300, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!324 = distinct !DISubprogram(name: "uv__signal_first_handle", scope: !1, file: !1, line: 151, type: !325, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!325 = !DISubroutineType(types: !326)
!326 = !{!237, !80}
!327 = distinct !DISubprogram(name: "uv__signal_tree_s_RB_NFIND", scope: !1, file: !1, line: 57, type: !328, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!328 = !DISubroutineType(types: !329)
!329 = !{!243, !330, !243}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__signal_tree_s", file: !1, line: 37, size: 64, align: 64, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rbh_root", scope: !331, file: !1, line: 37, baseType: !243, size: 64, align: 64)
!334 = distinct !DISubprogram(name: "uv__signal_compare", scope: !1, file: !1, line: 485, type: !335, isLocal: true, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!335 = !DISubroutineType(types: !336)
!336 = !{!80, !237, !237}
!337 = distinct !DISubprogram(name: "uv__signal_register_handler", scope: !1, file: !1, line: 210, type: !338, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!338 = !DISubroutineType(types: !339)
!339 = !{!80, !80, !80}
!340 = distinct !DISubprogram(name: "uv__signal_handler", scope: !1, file: !1, line: 169, type: !273, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!341 = distinct !DISubprogram(name: "uv__signal_tree_s_RB_NEXT", scope: !1, file: !1, line: 57, type: !342, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!342 = !DISubroutineType(types: !343)
!343 = !{!243, !243}
!344 = distinct !DISubprogram(name: "uv__signal_unlock_and_unblock", scope: !1, file: !1, line: 142, type: !310, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!345 = distinct !DISubprogram(name: "uv__signal_tree_s_RB_INSERT", scope: !1, file: !1, line: 57, type: !328, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!346 = distinct !DISubprogram(name: "uv__signal_tree_s_RB_INSERT_COLOR", scope: !1, file: !1, line: 57, type: !347, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !330, !243}
!349 = distinct !DISubprogram(name: "uv__signal_stop", scope: !1, file: !1, line: 522, type: !288, isLocal: true, isDefinition: true, scopeLine: 522, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!350 = distinct !DISubprogram(name: "uv__signal_tree_s_RB_REMOVE", scope: !1, file: !1, line: 57, type: !328, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!351 = distinct !DISubprogram(name: "uv__signal_tree_s_RB_REMOVE_COLOR", scope: !1, file: !1, line: 57, type: !352, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !330, !243, !243}
!354 = distinct !DISubprogram(name: "uv__signal_unregister_handler", scope: !1, file: !1, line: 229, type: !273, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, variables: !277)
!355 = !{!356, !359, !360}
!356 = !DIGlobalVariable(name: "uv__signal_global_init_guard", scope: !0, file: !1, line: 51, type: !357, isLocal: true, isDefinition: true, variable: i32* @uv__signal_global_init_guard)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_once_t", file: !87, line: 127, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !108, line: 167, baseType: !80)
!359 = !DIGlobalVariable(name: "uv__signal_lock_pipefd", scope: !0, file: !1, line: 54, type: !214, isLocal: true, isDefinition: true, variable: [2 x i32]* @uv__signal_lock_pipefd)
!360 = !DIGlobalVariable(name: "uv__signal_tree", scope: !0, file: !1, line: 52, type: !331, isLocal: true, isDefinition: true, variable: %struct.uv__signal_tree_s* @uv__signal_tree)
!361 = !{i32 2, !"Dwarf Version", i32 4}
!362 = !{i32 2, !"Debug Info Version", i32 3}
!363 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!364 = !DILocation(line: 99, column: 3, scope: !276)
!365 = !DILocation(line: 100, column: 1, scope: !276)
!366 = !DILocation(line: 64, column: 8, scope: !367)
!367 = distinct !DILexicalBlock(scope: !297, file: !1, line: 64, column: 7)
!368 = !DILocation(line: 64, column: 7, scope: !297)
!369 = !DILocation(line: 71, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !367, file: !1, line: 71, column: 9)
!371 = !DILocation(line: 71, column: 9, scope: !367)
!372 = !DILocation(line: 72, column: 7, scope: !370)
!373 = !DILocation(line: 71, column: 61, scope: !374)
!374 = !DILexicalBlockFile(scope: !370, file: !1, discriminator: 1)
!375 = !DILocation(line: 74, column: 7, scope: !376)
!376 = distinct !DILexicalBlock(scope: !297, file: !1, line: 74, column: 7)
!377 = !DILocation(line: 74, column: 7, scope: !297)
!378 = !DILocation(line: 75, column: 5, scope: !376)
!379 = !DILocation(line: 77, column: 7, scope: !380)
!380 = distinct !DILexicalBlock(scope: !297, file: !1, line: 77, column: 7)
!381 = !DILocation(line: 77, column: 7, scope: !297)
!382 = !DILocation(line: 78, column: 5, scope: !380)
!383 = !DILocation(line: 79, column: 1, scope: !297)
!384 = !DILocalVariable(name: "loop", arg: 1, scope: !278, file: !1, line: 265, type: !67)
!385 = !DIExpression()
!386 = !DILocation(line: 265, column: 37, scope: !278)
!387 = !DILocation(line: 266, column: 15, scope: !278)
!388 = !DILocation(line: 266, column: 22, scope: !278)
!389 = !DILocation(line: 266, column: 28, scope: !278)
!390 = !DILocation(line: 266, column: 3, scope: !278)
!391 = !DILocation(line: 267, column: 13, scope: !278)
!392 = !DILocation(line: 267, column: 19, scope: !278)
!393 = !DILocation(line: 267, column: 3, scope: !278)
!394 = !DILocation(line: 268, column: 13, scope: !278)
!395 = !DILocation(line: 268, column: 19, scope: !278)
!396 = !DILocation(line: 268, column: 3, scope: !278)
!397 = !DILocation(line: 269, column: 3, scope: !278)
!398 = !DILocation(line: 269, column: 9, scope: !278)
!399 = !DILocation(line: 269, column: 26, scope: !278)
!400 = !DILocation(line: 270, column: 3, scope: !278)
!401 = !DILocation(line: 270, column: 9, scope: !278)
!402 = !DILocation(line: 270, column: 26, scope: !278)
!403 = !DILocation(line: 271, column: 36, scope: !278)
!404 = !DILocation(line: 271, column: 10, scope: !278)
!405 = !DILocation(line: 271, column: 3, scope: !278)
!406 = !DILocalVariable(name: "loop", arg: 1, scope: !302, file: !1, line: 245, type: !67)
!407 = !DILocation(line: 245, column: 49, scope: !302)
!408 = !DILocalVariable(name: "err", scope: !302, file: !1, line: 246, type: !80)
!409 = !DILocation(line: 246, column: 7, scope: !302)
!410 = !DILocation(line: 249, column: 7, scope: !411)
!411 = distinct !DILexicalBlock(scope: !302, file: !1, line: 249, column: 7)
!412 = !DILocation(line: 249, column: 13, scope: !411)
!413 = !DILocation(line: 249, column: 30, scope: !411)
!414 = !DILocation(line: 249, column: 7, scope: !302)
!415 = !DILocation(line: 250, column: 5, scope: !411)
!416 = !DILocation(line: 252, column: 23, scope: !302)
!417 = !DILocation(line: 252, column: 29, scope: !302)
!418 = !DILocation(line: 252, column: 9, scope: !302)
!419 = !DILocation(line: 252, column: 7, scope: !302)
!420 = !DILocation(line: 253, column: 7, scope: !421)
!421 = distinct !DILexicalBlock(scope: !302, file: !1, line: 253, column: 7)
!422 = !DILocation(line: 253, column: 7, scope: !302)
!423 = !DILocation(line: 254, column: 12, scope: !421)
!424 = !DILocation(line: 254, column: 5, scope: !421)
!425 = !DILocation(line: 256, column: 16, scope: !302)
!426 = !DILocation(line: 256, column: 22, scope: !302)
!427 = !DILocation(line: 258, column: 15, scope: !302)
!428 = !DILocation(line: 258, column: 21, scope: !302)
!429 = !DILocation(line: 256, column: 3, scope: !302)
!430 = !DILocation(line: 259, column: 16, scope: !302)
!431 = !DILocation(line: 259, column: 23, scope: !302)
!432 = !DILocation(line: 259, column: 29, scope: !302)
!433 = !DILocation(line: 259, column: 3, scope: !302)
!434 = !DILocation(line: 261, column: 3, scope: !302)
!435 = !DILocation(line: 262, column: 1, scope: !302)
!436 = !DILocalVariable(name: "loop", arg: 1, scope: !281, file: !1, line: 275, type: !67)
!437 = !DILocation(line: 275, column: 41, scope: !281)
!438 = !DILocalVariable(name: "q", scope: !281, file: !1, line: 276, type: !54)
!439 = !DILocation(line: 276, column: 10, scope: !281)
!440 = !DILocation(line: 284, column: 3, scope: !441)
!441 = distinct !DILexicalBlock(scope: !281, file: !1, line: 284, column: 3)
!442 = !DILocation(line: 284, column: 3, scope: !443)
!443 = !DILexicalBlockFile(scope: !444, file: !1, discriminator: 1)
!444 = distinct !DILexicalBlock(scope: !441, file: !1, line: 284, column: 3)
!445 = !DILocalVariable(name: "handle", scope: !446, file: !1, line: 285, type: !61)
!446 = distinct !DILexicalBlock(scope: !444, file: !1, line: 284, column: 41)
!447 = !DILocation(line: 285, column: 18, scope: !446)
!448 = !DILocation(line: 285, column: 27, scope: !446)
!449 = !DILocation(line: 287, column: 9, scope: !450)
!450 = distinct !DILexicalBlock(scope: !446, file: !1, line: 287, column: 9)
!451 = !DILocation(line: 287, column: 17, scope: !450)
!452 = !DILocation(line: 287, column: 22, scope: !450)
!453 = !DILocation(line: 287, column: 9, scope: !446)
!454 = !DILocation(line: 288, column: 38, scope: !450)
!455 = !DILocation(line: 288, column: 23, scope: !450)
!456 = !DILocation(line: 288, column: 7, scope: !450)
!457 = !DILocation(line: 289, column: 3, scope: !446)
!458 = !DILocation(line: 284, column: 3, scope: !459)
!459 = !DILexicalBlockFile(scope: !444, file: !1, discriminator: 2)
!460 = !DILocation(line: 291, column: 7, scope: !461)
!461 = distinct !DILexicalBlock(scope: !281, file: !1, line: 291, column: 7)
!462 = !DILocation(line: 291, column: 13, scope: !461)
!463 = !DILocation(line: 291, column: 30, scope: !461)
!464 = !DILocation(line: 291, column: 7, scope: !281)
!465 = !DILocation(line: 292, column: 15, scope: !466)
!466 = distinct !DILexicalBlock(scope: !461, file: !1, line: 291, column: 37)
!467 = !DILocation(line: 292, column: 21, scope: !466)
!468 = !DILocation(line: 292, column: 5, scope: !466)
!469 = !DILocation(line: 293, column: 5, scope: !466)
!470 = !DILocation(line: 293, column: 11, scope: !466)
!471 = !DILocation(line: 293, column: 28, scope: !466)
!472 = !DILocation(line: 294, column: 3, scope: !466)
!473 = !DILocation(line: 296, column: 7, scope: !474)
!474 = distinct !DILexicalBlock(scope: !281, file: !1, line: 296, column: 7)
!475 = !DILocation(line: 296, column: 13, scope: !474)
!476 = !DILocation(line: 296, column: 30, scope: !474)
!477 = !DILocation(line: 296, column: 7, scope: !281)
!478 = !DILocation(line: 297, column: 15, scope: !479)
!479 = distinct !DILexicalBlock(scope: !474, file: !1, line: 296, column: 37)
!480 = !DILocation(line: 297, column: 21, scope: !479)
!481 = !DILocation(line: 297, column: 5, scope: !479)
!482 = !DILocation(line: 298, column: 5, scope: !479)
!483 = !DILocation(line: 298, column: 11, scope: !479)
!484 = !DILocation(line: 298, column: 28, scope: !479)
!485 = !DILocation(line: 299, column: 3, scope: !479)
!486 = !DILocation(line: 300, column: 1, scope: !281)
!487 = !DILocalVariable(name: "handle", arg: 1, scope: !349, file: !1, line: 522, type: !237)
!488 = !DILocation(line: 522, column: 42, scope: !349)
!489 = !DILocalVariable(name: "removed_handle", scope: !349, file: !1, line: 523, type: !237)
!490 = !DILocation(line: 523, column: 16, scope: !349)
!491 = !DILocalVariable(name: "saved_sigmask", scope: !349, file: !1, line: 524, type: !313)
!492 = !DILocation(line: 524, column: 12, scope: !349)
!493 = !DILocalVariable(name: "first_handle", scope: !349, file: !1, line: 525, type: !237)
!494 = !DILocation(line: 525, column: 16, scope: !349)
!495 = !DILocalVariable(name: "rem_oneshot", scope: !349, file: !1, line: 526, type: !80)
!496 = !DILocation(line: 526, column: 7, scope: !349)
!497 = !DILocalVariable(name: "first_oneshot", scope: !349, file: !1, line: 527, type: !80)
!498 = !DILocation(line: 527, column: 7, scope: !349)
!499 = !DILocalVariable(name: "ret", scope: !349, file: !1, line: 528, type: !80)
!500 = !DILocation(line: 528, column: 7, scope: !349)
!501 = !DILocation(line: 531, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !349, file: !1, line: 531, column: 7)
!503 = !DILocation(line: 531, column: 15, scope: !502)
!504 = !DILocation(line: 531, column: 22, scope: !502)
!505 = !DILocation(line: 531, column: 7, scope: !349)
!506 = !DILocation(line: 532, column: 5, scope: !502)
!507 = !DILocation(line: 534, column: 3, scope: !349)
!508 = !DILocation(line: 536, column: 20, scope: !349)
!509 = !DILocation(line: 536, column: 18, scope: !349)
!510 = !DILocation(line: 537, column: 3, scope: !349)
!511 = !DILocation(line: 537, column: 3, scope: !512)
!512 = !DILexicalBlockFile(scope: !349, file: !1, discriminator: 1)
!513 = !DILocation(line: 537, column: 3, scope: !514)
!514 = !DILexicalBlockFile(scope: !349, file: !1, discriminator: 2)
!515 = !DILocation(line: 537, column: 3, scope: !516)
!516 = !DILexicalBlockFile(scope: !349, file: !1, discriminator: 3)
!517 = !DILocation(line: 538, column: 10, scope: !349)
!518 = !DILocation(line: 543, column: 42, scope: !349)
!519 = !DILocation(line: 543, column: 50, scope: !349)
!520 = !DILocation(line: 543, column: 18, scope: !349)
!521 = !DILocation(line: 543, column: 16, scope: !349)
!522 = !DILocation(line: 544, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !349, file: !1, line: 544, column: 7)
!524 = !DILocation(line: 544, column: 20, scope: !523)
!525 = !DILocation(line: 544, column: 7, scope: !349)
!526 = !DILocation(line: 545, column: 35, scope: !527)
!527 = distinct !DILexicalBlock(scope: !523, file: !1, line: 544, column: 29)
!528 = !DILocation(line: 545, column: 43, scope: !527)
!529 = !DILocation(line: 545, column: 5, scope: !527)
!530 = !DILocation(line: 546, column: 3, scope: !527)
!531 = !DILocation(line: 547, column: 19, scope: !532)
!532 = distinct !DILexicalBlock(scope: !523, file: !1, line: 546, column: 10)
!533 = !DILocation(line: 547, column: 27, scope: !532)
!534 = !DILocation(line: 547, column: 33, scope: !532)
!535 = !DILocation(line: 547, column: 17, scope: !532)
!536 = !DILocation(line: 548, column: 21, scope: !532)
!537 = !DILocation(line: 548, column: 35, scope: !532)
!538 = !DILocation(line: 548, column: 41, scope: !532)
!539 = !DILocation(line: 548, column: 19, scope: !532)
!540 = !DILocation(line: 549, column: 9, scope: !541)
!541 = distinct !DILexicalBlock(scope: !532, file: !1, line: 549, column: 9)
!542 = !DILocation(line: 549, column: 23, scope: !541)
!543 = !DILocation(line: 549, column: 27, scope: !544)
!544 = !DILexicalBlockFile(scope: !541, file: !1, discriminator: 1)
!545 = !DILocation(line: 549, column: 9, scope: !544)
!546 = !DILocation(line: 550, column: 41, scope: !547)
!547 = distinct !DILexicalBlock(scope: !541, file: !1, line: 549, column: 40)
!548 = !DILocation(line: 550, column: 49, scope: !547)
!549 = !DILocation(line: 550, column: 13, scope: !547)
!550 = !DILocation(line: 550, column: 11, scope: !547)
!551 = !DILocation(line: 551, column: 7, scope: !547)
!552 = !DILocation(line: 551, column: 7, scope: !553)
!553 = !DILexicalBlockFile(scope: !547, file: !1, discriminator: 1)
!554 = !DILocation(line: 551, column: 7, scope: !555)
!555 = !DILexicalBlockFile(scope: !547, file: !1, discriminator: 2)
!556 = !DILocation(line: 551, column: 7, scope: !557)
!557 = !DILexicalBlockFile(scope: !547, file: !1, discriminator: 3)
!558 = !DILocation(line: 552, column: 5, scope: !547)
!559 = !DILocation(line: 555, column: 3, scope: !349)
!560 = !DILocation(line: 557, column: 3, scope: !349)
!561 = !DILocation(line: 557, column: 11, scope: !349)
!562 = !DILocation(line: 557, column: 18, scope: !349)
!563 = !DILocation(line: 558, column: 3, scope: !349)
!564 = !DILocation(line: 558, column: 3, scope: !565)
!565 = !DILexicalBlockFile(scope: !566, file: !1, discriminator: 1)
!566 = distinct !DILexicalBlock(scope: !349, file: !1, line: 558, column: 3)
!567 = !DILocation(line: 558, column: 3, scope: !568)
!568 = !DILexicalBlockFile(scope: !566, file: !1, discriminator: 2)
!569 = !DILocation(line: 558, column: 3, scope: !570)
!570 = !DILexicalBlockFile(scope: !566, file: !1, discriminator: 3)
!571 = !DILocation(line: 558, column: 3, scope: !572)
!572 = !DILexicalBlockFile(scope: !566, file: !1, discriminator: 4)
!573 = !DILocation(line: 558, column: 3, scope: !574)
!574 = !DILexicalBlockFile(scope: !575, file: !1, discriminator: 5)
!575 = distinct !DILexicalBlock(scope: !566, file: !1, line: 558, column: 3)
!576 = !DILocation(line: 558, column: 3, scope: !577)
!577 = !DILexicalBlockFile(scope: !575, file: !1, discriminator: 6)
!578 = !DILocation(line: 558, column: 3, scope: !579)
!579 = !DILexicalBlockFile(scope: !566, file: !1, discriminator: 7)
!580 = !DILocation(line: 558, column: 3, scope: !581)
!581 = !DILexicalBlockFile(scope: !582, file: !1, discriminator: 8)
!582 = distinct !DILexicalBlock(scope: !566, file: !1, line: 558, column: 3)
!583 = !DILocation(line: 558, column: 3, scope: !584)
!584 = !DILexicalBlockFile(scope: !585, file: !1, discriminator: 9)
!585 = distinct !DILexicalBlock(scope: !582, file: !1, line: 558, column: 3)
!586 = !DILocation(line: 558, column: 3, scope: !587)
!587 = !DILexicalBlockFile(scope: !585, file: !1, discriminator: 10)
!588 = !DILocation(line: 558, column: 3, scope: !589)
!589 = !DILexicalBlockFile(scope: !566, file: !1, discriminator: 11)
!590 = !DILocation(line: 559, column: 1, scope: !349)
!591 = !DILocalVariable(name: "loop", arg: 1, scope: !284, file: !1, line: 303, type: !67)
!592 = !DILocation(line: 303, column: 31, scope: !284)
!593 = !DILocalVariable(name: "handle", arg: 2, scope: !284, file: !1, line: 303, type: !237)
!594 = !DILocation(line: 303, column: 50, scope: !284)
!595 = !DILocalVariable(name: "err", scope: !284, file: !1, line: 304, type: !80)
!596 = !DILocation(line: 304, column: 7, scope: !284)
!597 = !DILocation(line: 306, column: 35, scope: !284)
!598 = !DILocation(line: 306, column: 9, scope: !284)
!599 = !DILocation(line: 306, column: 7, scope: !284)
!600 = !DILocation(line: 307, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !284, file: !1, line: 307, column: 7)
!602 = !DILocation(line: 307, column: 7, scope: !284)
!603 = !DILocation(line: 308, column: 12, scope: !601)
!604 = !DILocation(line: 308, column: 5, scope: !601)
!605 = !DILocation(line: 310, column: 3, scope: !284)
!606 = !DILocation(line: 310, column: 3, scope: !607)
!607 = !DILexicalBlockFile(scope: !608, file: !1, discriminator: 1)
!608 = distinct !DILexicalBlock(scope: !284, file: !1, line: 310, column: 3)
!609 = !DILocation(line: 310, column: 3, scope: !610)
!610 = !DILexicalBlockFile(scope: !611, file: !1, discriminator: 2)
!611 = distinct !DILexicalBlock(scope: !608, file: !1, line: 310, column: 3)
!612 = !DILocation(line: 310, column: 3, scope: !613)
!613 = !DILexicalBlockFile(scope: !608, file: !1, discriminator: 3)
!614 = !DILocation(line: 311, column: 3, scope: !284)
!615 = !DILocation(line: 311, column: 11, scope: !284)
!616 = !DILocation(line: 311, column: 18, scope: !284)
!617 = !DILocation(line: 312, column: 3, scope: !284)
!618 = !DILocation(line: 312, column: 11, scope: !284)
!619 = !DILocation(line: 312, column: 26, scope: !284)
!620 = !DILocation(line: 313, column: 3, scope: !284)
!621 = !DILocation(line: 313, column: 11, scope: !284)
!622 = !DILocation(line: 313, column: 30, scope: !284)
!623 = !DILocation(line: 315, column: 3, scope: !284)
!624 = !DILocation(line: 316, column: 1, scope: !284)
!625 = !DILocalVariable(name: "handle", arg: 1, scope: !287, file: !1, line: 319, type: !237)
!626 = !DILocation(line: 319, column: 36, scope: !287)
!627 = !DILocation(line: 321, column: 19, scope: !287)
!628 = !DILocation(line: 321, column: 3, scope: !287)
!629 = !DILocation(line: 327, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !287, file: !1, line: 327, column: 7)
!631 = !DILocation(line: 327, column: 15, scope: !630)
!632 = !DILocation(line: 327, column: 33, scope: !630)
!633 = !DILocation(line: 327, column: 41, scope: !630)
!634 = !DILocation(line: 327, column: 30, scope: !630)
!635 = !DILocation(line: 327, column: 7, scope: !287)
!636 = !DILocation(line: 328, column: 43, scope: !637)
!637 = distinct !DILexicalBlock(scope: !630, file: !1, line: 327, column: 61)
!638 = !DILocation(line: 328, column: 28, scope: !637)
!639 = !DILocation(line: 328, column: 5, scope: !637)
!640 = !DILocation(line: 329, column: 3, scope: !637)
!641 = !DILocation(line: 330, column: 1, scope: !287)
!642 = !DILocalVariable(name: "handle", arg: 1, scope: !290, file: !1, line: 333, type: !237)
!643 = !DILocation(line: 333, column: 34, scope: !290)
!644 = !DILocalVariable(name: "signal_cb", arg: 2, scope: !290, file: !1, line: 333, type: !233)
!645 = !DILocation(line: 333, column: 55, scope: !290)
!646 = !DILocalVariable(name: "signum", arg: 3, scope: !290, file: !1, line: 333, type: !80)
!647 = !DILocation(line: 333, column: 70, scope: !290)
!648 = !DILocation(line: 334, column: 27, scope: !290)
!649 = !DILocation(line: 334, column: 35, scope: !290)
!650 = !DILocation(line: 334, column: 46, scope: !290)
!651 = !DILocation(line: 334, column: 10, scope: !290)
!652 = !DILocation(line: 334, column: 3, scope: !290)
!653 = !DILocalVariable(name: "handle", arg: 1, scope: !306, file: !1, line: 345, type: !237)
!654 = !DILocation(line: 345, column: 42, scope: !306)
!655 = !DILocalVariable(name: "signal_cb", arg: 2, scope: !306, file: !1, line: 346, type: !233)
!656 = !DILocation(line: 346, column: 42, scope: !306)
!657 = !DILocalVariable(name: "signum", arg: 3, scope: !306, file: !1, line: 347, type: !80)
!658 = !DILocation(line: 347, column: 33, scope: !306)
!659 = !DILocalVariable(name: "oneshot", arg: 4, scope: !306, file: !1, line: 348, type: !80)
!660 = !DILocation(line: 348, column: 33, scope: !306)
!661 = !DILocalVariable(name: "saved_sigmask", scope: !306, file: !1, line: 349, type: !313)
!662 = !DILocation(line: 349, column: 12, scope: !306)
!663 = !DILocalVariable(name: "err", scope: !306, file: !1, line: 350, type: !80)
!664 = !DILocation(line: 350, column: 7, scope: !306)
!665 = !DILocalVariable(name: "first_handle", scope: !306, file: !1, line: 351, type: !237)
!666 = !DILocation(line: 351, column: 16, scope: !306)
!667 = !DILocation(line: 353, column: 3, scope: !306)
!668 = !DILocation(line: 353, column: 3, scope: !669)
!669 = !DILexicalBlockFile(scope: !306, file: !1, discriminator: 1)
!670 = !DILocation(line: 353, column: 3, scope: !671)
!671 = !DILexicalBlockFile(scope: !306, file: !1, discriminator: 2)
!672 = !DILocation(line: 353, column: 3, scope: !673)
!673 = !DILexicalBlockFile(scope: !306, file: !1, discriminator: 3)
!674 = !DILocation(line: 359, column: 7, scope: !675)
!675 = distinct !DILexicalBlock(scope: !306, file: !1, line: 359, column: 7)
!676 = !DILocation(line: 359, column: 14, scope: !675)
!677 = !DILocation(line: 359, column: 7, scope: !306)
!678 = !DILocation(line: 360, column: 5, scope: !675)
!679 = !DILocation(line: 367, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !306, file: !1, line: 367, column: 7)
!681 = !DILocation(line: 367, column: 17, scope: !680)
!682 = !DILocation(line: 367, column: 25, scope: !680)
!683 = !DILocation(line: 367, column: 14, scope: !680)
!684 = !DILocation(line: 367, column: 7, scope: !306)
!685 = !DILocation(line: 368, column: 25, scope: !686)
!686 = distinct !DILexicalBlock(scope: !680, file: !1, line: 367, column: 33)
!687 = !DILocation(line: 368, column: 5, scope: !686)
!688 = !DILocation(line: 368, column: 13, scope: !686)
!689 = !DILocation(line: 368, column: 23, scope: !686)
!690 = !DILocation(line: 369, column: 5, scope: !686)
!691 = !DILocation(line: 373, column: 7, scope: !692)
!692 = distinct !DILexicalBlock(scope: !306, file: !1, line: 373, column: 7)
!693 = !DILocation(line: 373, column: 15, scope: !692)
!694 = !DILocation(line: 373, column: 22, scope: !692)
!695 = !DILocation(line: 373, column: 7, scope: !306)
!696 = !DILocation(line: 374, column: 21, scope: !697)
!697 = distinct !DILexicalBlock(scope: !692, file: !1, line: 373, column: 28)
!698 = !DILocation(line: 374, column: 5, scope: !697)
!699 = !DILocation(line: 375, column: 3, scope: !697)
!700 = !DILocation(line: 377, column: 3, scope: !306)
!701 = !DILocation(line: 383, column: 42, scope: !306)
!702 = !DILocation(line: 383, column: 18, scope: !306)
!703 = !DILocation(line: 383, column: 16, scope: !306)
!704 = !DILocation(line: 384, column: 7, scope: !705)
!705 = distinct !DILexicalBlock(scope: !306, file: !1, line: 384, column: 7)
!706 = !DILocation(line: 384, column: 20, scope: !705)
!707 = !DILocation(line: 384, column: 28, scope: !705)
!708 = !DILocation(line: 385, column: 9, scope: !705)
!709 = !DILocation(line: 385, column: 17, scope: !705)
!710 = !DILocation(line: 385, column: 21, scope: !711)
!711 = !DILexicalBlockFile(scope: !705, file: !1, discriminator: 1)
!712 = !DILocation(line: 385, column: 35, scope: !711)
!713 = !DILocation(line: 385, column: 41, scope: !711)
!714 = !DILocation(line: 384, column: 7, scope: !669)
!715 = !DILocation(line: 386, column: 39, scope: !716)
!716 = distinct !DILexicalBlock(scope: !705, file: !1, line: 385, column: 66)
!717 = !DILocation(line: 386, column: 47, scope: !716)
!718 = !DILocation(line: 386, column: 11, scope: !716)
!719 = !DILocation(line: 386, column: 9, scope: !716)
!720 = !DILocation(line: 387, column: 9, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !1, line: 387, column: 9)
!722 = !DILocation(line: 387, column: 9, scope: !716)
!723 = !DILocation(line: 389, column: 7, scope: !724)
!724 = distinct !DILexicalBlock(scope: !721, file: !1, line: 387, column: 14)
!725 = !DILocation(line: 390, column: 14, scope: !724)
!726 = !DILocation(line: 390, column: 7, scope: !724)
!727 = !DILocation(line: 392, column: 3, scope: !716)
!728 = !DILocation(line: 394, column: 20, scope: !306)
!729 = !DILocation(line: 394, column: 3, scope: !306)
!730 = !DILocation(line: 394, column: 11, scope: !306)
!731 = !DILocation(line: 394, column: 18, scope: !306)
!732 = !DILocation(line: 395, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !306, file: !1, line: 395, column: 7)
!734 = !DILocation(line: 395, column: 7, scope: !306)
!735 = !DILocation(line: 396, column: 5, scope: !733)
!736 = !DILocation(line: 396, column: 13, scope: !733)
!737 = !DILocation(line: 396, column: 19, scope: !733)
!738 = !DILocation(line: 398, column: 3, scope: !306)
!739 = !DILocation(line: 400, column: 3, scope: !306)
!740 = !DILocation(line: 402, column: 23, scope: !306)
!741 = !DILocation(line: 402, column: 3, scope: !306)
!742 = !DILocation(line: 402, column: 11, scope: !306)
!743 = !DILocation(line: 402, column: 21, scope: !306)
!744 = !DILocation(line: 403, column: 3, scope: !306)
!745 = !DILocation(line: 403, column: 3, scope: !746)
!746 = !DILexicalBlockFile(scope: !747, file: !1, discriminator: 1)
!747 = distinct !DILexicalBlock(scope: !306, file: !1, line: 403, column: 3)
!748 = !DILocation(line: 403, column: 3, scope: !749)
!749 = !DILexicalBlockFile(scope: !747, file: !1, discriminator: 2)
!750 = !DILocation(line: 403, column: 3, scope: !751)
!751 = !DILexicalBlockFile(scope: !747, file: !1, discriminator: 3)
!752 = !DILocation(line: 403, column: 3, scope: !753)
!753 = !DILexicalBlockFile(scope: !747, file: !1, discriminator: 4)
!754 = !DILocation(line: 403, column: 3, scope: !755)
!755 = !DILexicalBlockFile(scope: !756, file: !1, discriminator: 5)
!756 = distinct !DILexicalBlock(scope: !747, file: !1, line: 403, column: 3)
!757 = !DILocation(line: 403, column: 3, scope: !758)
!758 = !DILexicalBlockFile(scope: !756, file: !1, discriminator: 6)
!759 = !DILocation(line: 403, column: 3, scope: !760)
!760 = !DILexicalBlockFile(scope: !747, file: !1, discriminator: 7)
!761 = !DILocation(line: 403, column: 3, scope: !762)
!762 = !DILexicalBlockFile(scope: !763, file: !1, discriminator: 8)
!763 = distinct !DILexicalBlock(scope: !747, file: !1, line: 403, column: 3)
!764 = !DILocation(line: 403, column: 3, scope: !765)
!765 = !DILexicalBlockFile(scope: !766, file: !1, discriminator: 9)
!766 = distinct !DILexicalBlock(scope: !763, file: !1, line: 403, column: 3)
!767 = !DILocation(line: 403, column: 3, scope: !768)
!768 = !DILexicalBlockFile(scope: !766, file: !1, discriminator: 10)
!769 = !DILocation(line: 403, column: 3, scope: !770)
!770 = !DILexicalBlockFile(scope: !747, file: !1, discriminator: 11)
!771 = !DILocation(line: 405, column: 3, scope: !306)
!772 = !DILocation(line: 406, column: 1, scope: !306)
!773 = !DILocalVariable(name: "handle", arg: 1, scope: !293, file: !1, line: 338, type: !237)
!774 = !DILocation(line: 338, column: 42, scope: !293)
!775 = !DILocalVariable(name: "signal_cb", arg: 2, scope: !293, file: !1, line: 339, type: !233)
!776 = !DILocation(line: 339, column: 42, scope: !293)
!777 = !DILocalVariable(name: "signum", arg: 3, scope: !293, file: !1, line: 340, type: !80)
!778 = !DILocation(line: 340, column: 33, scope: !293)
!779 = !DILocation(line: 341, column: 27, scope: !293)
!780 = !DILocation(line: 341, column: 35, scope: !293)
!781 = !DILocation(line: 341, column: 46, scope: !293)
!782 = !DILocation(line: 341, column: 10, scope: !293)
!783 = !DILocation(line: 341, column: 3, scope: !293)
!784 = !DILocalVariable(name: "handle", arg: 1, scope: !294, file: !1, line: 515, type: !237)
!785 = !DILocation(line: 515, column: 33, scope: !294)
!786 = !DILocation(line: 516, column: 3, scope: !294)
!787 = !DILocation(line: 516, column: 3, scope: !788)
!788 = !DILexicalBlockFile(scope: !294, file: !1, discriminator: 1)
!789 = !DILocation(line: 516, column: 3, scope: !790)
!790 = !DILexicalBlockFile(scope: !294, file: !1, discriminator: 2)
!791 = !DILocation(line: 516, column: 3, scope: !792)
!792 = !DILexicalBlockFile(scope: !294, file: !1, discriminator: 3)
!793 = !DILocation(line: 517, column: 19, scope: !294)
!794 = !DILocation(line: 517, column: 3, scope: !294)
!795 = !DILocation(line: 518, column: 3, scope: !294)
!796 = !DILocation(line: 90, column: 13, scope: !298)
!797 = !DILocation(line: 90, column: 3, scope: !298)
!798 = !DILocation(line: 91, column: 29, scope: !298)
!799 = !DILocation(line: 92, column: 13, scope: !298)
!800 = !DILocation(line: 92, column: 3, scope: !298)
!801 = !DILocation(line: 93, column: 29, scope: !298)
!802 = !DILocation(line: 94, column: 3, scope: !298)
!803 = !DILocation(line: 95, column: 1, scope: !298)
!804 = !DILocalVariable(name: "r", scope: !299, file: !1, line: 117, type: !80)
!805 = !DILocation(line: 117, column: 7, scope: !299)
!806 = !DILocalVariable(name: "data", scope: !299, file: !1, line: 118, type: !131)
!807 = !DILocation(line: 118, column: 8, scope: !299)
!808 = !DILocation(line: 120, column: 3, scope: !299)
!809 = !DILocation(line: 121, column: 15, scope: !810)
!810 = distinct !DILexicalBlock(scope: !299, file: !1, line: 120, column: 6)
!811 = !DILocation(line: 121, column: 9, scope: !810)
!812 = !DILocation(line: 121, column: 7, scope: !810)
!813 = !DILocation(line: 122, column: 3, scope: !810)
!814 = !DILocation(line: 122, column: 12, scope: !815)
!815 = !DILexicalBlockFile(scope: !299, file: !1, discriminator: 1)
!816 = !DILocation(line: 122, column: 14, scope: !815)
!817 = !DILocation(line: 122, column: 18, scope: !815)
!818 = !DILocation(line: 122, column: 21, scope: !819)
!819 = !DILexicalBlockFile(scope: !299, file: !1, discriminator: 2)
!820 = !DILocation(line: 122, column: 27, scope: !819)
!821 = !DILocation(line: 122, column: 3, scope: !822)
!822 = !DILexicalBlockFile(scope: !810, file: !1, discriminator: 3)
!823 = !DILocation(line: 124, column: 11, scope: !299)
!824 = !DILocation(line: 124, column: 13, scope: !299)
!825 = !DILocation(line: 124, column: 10, scope: !299)
!826 = !DILocation(line: 124, column: 3, scope: !299)
!827 = !DILocalVariable(name: "loop", arg: 1, scope: !303, file: !1, line: 409, type: !67)
!828 = !DILocation(line: 409, column: 41, scope: !303)
!829 = !DILocalVariable(name: "w", arg: 2, scope: !303, file: !1, line: 410, type: !85)
!830 = !DILocation(line: 410, column: 40, scope: !303)
!831 = !DILocalVariable(name: "events", arg: 3, scope: !303, file: !1, line: 411, type: !73)
!832 = !DILocation(line: 411, column: 43, scope: !303)
!833 = !DILocalVariable(name: "msg", scope: !303, file: !1, line: 412, type: !264)
!834 = !DILocation(line: 412, column: 21, scope: !303)
!835 = !DILocalVariable(name: "handle", scope: !303, file: !1, line: 413, type: !237)
!836 = !DILocation(line: 413, column: 16, scope: !303)
!837 = !DILocalVariable(name: "buf", scope: !303, file: !1, line: 414, type: !838)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 4096, align: 8, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 512)
!841 = !DILocation(line: 414, column: 8, scope: !303)
!842 = !DILocalVariable(name: "bytes", scope: !303, file: !1, line: 415, type: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !844, line: 62, baseType: !78)
!844 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!845 = !DILocation(line: 415, column: 10, scope: !303)
!846 = !DILocalVariable(name: "end", scope: !303, file: !1, line: 415, type: !843)
!847 = !DILocation(line: 415, column: 17, scope: !303)
!848 = !DILocalVariable(name: "i", scope: !303, file: !1, line: 415, type: !843)
!849 = !DILocation(line: 415, column: 22, scope: !303)
!850 = !DILocalVariable(name: "r", scope: !303, file: !1, line: 416, type: !80)
!851 = !DILocation(line: 416, column: 7, scope: !303)
!852 = !DILocation(line: 418, column: 9, scope: !303)
!853 = !DILocation(line: 419, column: 7, scope: !303)
!854 = !DILocation(line: 421, column: 3, scope: !303)
!855 = !DILocation(line: 422, column: 14, scope: !856)
!856 = distinct !DILexicalBlock(scope: !303, file: !1, line: 421, column: 6)
!857 = !DILocation(line: 422, column: 20, scope: !856)
!858 = !DILocation(line: 422, column: 38, scope: !856)
!859 = !DILocation(line: 422, column: 44, scope: !856)
!860 = !DILocation(line: 422, column: 42, scope: !856)
!861 = !DILocation(line: 422, column: 65, scope: !856)
!862 = !DILocation(line: 422, column: 63, scope: !856)
!863 = !DILocation(line: 422, column: 9, scope: !856)
!864 = !DILocation(line: 422, column: 7, scope: !856)
!865 = !DILocation(line: 424, column: 9, scope: !866)
!866 = distinct !DILexicalBlock(scope: !856, file: !1, line: 424, column: 9)
!867 = !DILocation(line: 424, column: 11, scope: !866)
!868 = !DILocation(line: 424, column: 17, scope: !866)
!869 = !DILocation(line: 424, column: 20, scope: !870)
!870 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 1)
!871 = !DILocation(line: 424, column: 26, scope: !870)
!872 = !DILocation(line: 424, column: 9, scope: !870)
!873 = !DILocation(line: 425, column: 7, scope: !866)
!874 = !DILocation(line: 427, column: 9, scope: !875)
!875 = distinct !DILexicalBlock(scope: !856, file: !1, line: 427, column: 9)
!876 = !DILocation(line: 427, column: 11, scope: !875)
!877 = !DILocation(line: 427, column: 17, scope: !875)
!878 = !DILocation(line: 427, column: 21, scope: !879)
!879 = !DILexicalBlockFile(scope: !875, file: !1, discriminator: 1)
!880 = !DILocation(line: 427, column: 27, scope: !879)
!881 = !DILocation(line: 427, column: 37, scope: !879)
!882 = !DILocation(line: 427, column: 40, scope: !883)
!883 = !DILexicalBlockFile(scope: !875, file: !1, discriminator: 2)
!884 = !DILocation(line: 427, column: 46, scope: !883)
!885 = !DILocation(line: 427, column: 9, scope: !883)
!886 = !DILocation(line: 432, column: 11, scope: !887)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 432, column: 11)
!888 = distinct !DILexicalBlock(scope: !875, file: !1, line: 427, column: 63)
!889 = !DILocation(line: 432, column: 17, scope: !887)
!890 = !DILocation(line: 432, column: 11, scope: !888)
!891 = !DILocation(line: 433, column: 9, scope: !887)
!892 = !DILocation(line: 436, column: 7, scope: !888)
!893 = !DILocation(line: 440, column: 9, scope: !894)
!894 = distinct !DILexicalBlock(scope: !856, file: !1, line: 440, column: 9)
!895 = !DILocation(line: 440, column: 11, scope: !894)
!896 = !DILocation(line: 440, column: 9, scope: !856)
!897 = !DILocation(line: 441, column: 7, scope: !894)
!898 = !DILocation(line: 443, column: 14, scope: !856)
!899 = !DILocation(line: 443, column: 11, scope: !856)
!900 = !DILocation(line: 446, column: 12, scope: !856)
!901 = !DILocation(line: 446, column: 18, scope: !856)
!902 = !DILocation(line: 446, column: 46, scope: !856)
!903 = !DILocation(line: 446, column: 9, scope: !856)
!904 = !DILocation(line: 448, column: 12, scope: !905)
!905 = distinct !DILexicalBlock(scope: !856, file: !1, line: 448, column: 5)
!906 = !DILocation(line: 448, column: 10, scope: !905)
!907 = !DILocation(line: 448, column: 17, scope: !908)
!908 = !DILexicalBlockFile(scope: !909, file: !1, discriminator: 1)
!909 = distinct !DILexicalBlock(scope: !905, file: !1, line: 448, column: 5)
!910 = !DILocation(line: 448, column: 21, scope: !908)
!911 = !DILocation(line: 448, column: 19, scope: !908)
!912 = !DILocation(line: 448, column: 5, scope: !908)
!913 = !DILocation(line: 449, column: 34, scope: !914)
!914 = distinct !DILexicalBlock(scope: !909, file: !1, line: 448, column: 57)
!915 = !DILocation(line: 449, column: 40, scope: !914)
!916 = !DILocation(line: 449, column: 38, scope: !914)
!917 = !DILocation(line: 449, column: 13, scope: !914)
!918 = !DILocation(line: 449, column: 11, scope: !914)
!919 = !DILocation(line: 450, column: 16, scope: !914)
!920 = !DILocation(line: 450, column: 21, scope: !914)
!921 = !DILocation(line: 450, column: 14, scope: !914)
!922 = !DILocation(line: 452, column: 11, scope: !923)
!923 = distinct !DILexicalBlock(scope: !914, file: !1, line: 452, column: 11)
!924 = !DILocation(line: 452, column: 16, scope: !923)
!925 = !DILocation(line: 452, column: 26, scope: !923)
!926 = !DILocation(line: 452, column: 34, scope: !923)
!927 = !DILocation(line: 452, column: 23, scope: !923)
!928 = !DILocation(line: 452, column: 11, scope: !914)
!929 = !DILocation(line: 453, column: 9, scope: !930)
!930 = distinct !DILexicalBlock(scope: !923, file: !1, line: 452, column: 42)
!931 = !DILocation(line: 453, column: 9, scope: !932)
!932 = !DILexicalBlockFile(scope: !930, file: !1, discriminator: 1)
!933 = !DILocation(line: 453, column: 9, scope: !934)
!934 = !DILexicalBlockFile(scope: !930, file: !1, discriminator: 2)
!935 = !DILocation(line: 453, column: 9, scope: !936)
!936 = !DILexicalBlockFile(scope: !930, file: !1, discriminator: 3)
!937 = !DILocation(line: 454, column: 9, scope: !930)
!938 = !DILocation(line: 454, column: 17, scope: !930)
!939 = !DILocation(line: 454, column: 27, scope: !930)
!940 = !DILocation(line: 454, column: 35, scope: !930)
!941 = !DILocation(line: 454, column: 43, scope: !930)
!942 = !DILocation(line: 455, column: 7, scope: !930)
!943 = !DILocation(line: 457, column: 7, scope: !914)
!944 = !DILocation(line: 457, column: 15, scope: !914)
!945 = !DILocation(line: 457, column: 33, scope: !914)
!946 = !DILocation(line: 459, column: 11, scope: !947)
!947 = distinct !DILexicalBlock(scope: !914, file: !1, line: 459, column: 11)
!948 = !DILocation(line: 459, column: 19, scope: !947)
!949 = !DILocation(line: 459, column: 25, scope: !947)
!950 = !DILocation(line: 459, column: 11, scope: !914)
!951 = !DILocation(line: 460, column: 25, scope: !947)
!952 = !DILocation(line: 460, column: 9, scope: !947)
!953 = !DILocation(line: 466, column: 12, scope: !954)
!954 = distinct !DILexicalBlock(scope: !914, file: !1, line: 466, column: 11)
!955 = !DILocation(line: 466, column: 20, scope: !954)
!956 = !DILocation(line: 466, column: 26, scope: !954)
!957 = !DILocation(line: 466, column: 40, scope: !954)
!958 = !DILocation(line: 467, column: 12, scope: !954)
!959 = !DILocation(line: 467, column: 20, scope: !954)
!960 = !DILocation(line: 467, column: 38, scope: !954)
!961 = !DILocation(line: 467, column: 46, scope: !954)
!962 = !DILocation(line: 467, column: 35, scope: !954)
!963 = !DILocation(line: 466, column: 11, scope: !964)
!964 = !DILexicalBlockFile(scope: !914, file: !1, discriminator: 1)
!965 = !DILocation(line: 468, column: 47, scope: !966)
!966 = distinct !DILexicalBlock(scope: !954, file: !1, line: 467, column: 67)
!967 = !DILocation(line: 468, column: 32, scope: !966)
!968 = !DILocation(line: 468, column: 9, scope: !966)
!969 = !DILocation(line: 469, column: 7, scope: !966)
!970 = !DILocation(line: 470, column: 5, scope: !914)
!971 = !DILocation(line: 448, column: 28, scope: !972)
!972 = !DILexicalBlockFile(scope: !909, file: !1, discriminator: 2)
!973 = !DILocation(line: 448, column: 5, scope: !972)
!974 = !DILocation(line: 472, column: 14, scope: !856)
!975 = !DILocation(line: 472, column: 11, scope: !856)
!976 = !DILocation(line: 477, column: 9, scope: !977)
!977 = distinct !DILexicalBlock(scope: !856, file: !1, line: 477, column: 9)
!978 = !DILocation(line: 477, column: 9, scope: !856)
!979 = !DILocation(line: 478, column: 7, scope: !980)
!980 = distinct !DILexicalBlock(scope: !977, file: !1, line: 477, column: 16)
!981 = !DILocation(line: 478, column: 20, scope: !980)
!982 = !DILocation(line: 478, column: 26, scope: !980)
!983 = !DILocation(line: 478, column: 24, scope: !980)
!984 = !DILocation(line: 478, column: 31, scope: !980)
!985 = !DILocation(line: 479, column: 7, scope: !980)
!986 = !DILocation(line: 481, column: 3, scope: !856)
!987 = !DILocation(line: 481, column: 12, scope: !988)
!988 = !DILexicalBlockFile(scope: !303, file: !1, discriminator: 1)
!989 = !DILocation(line: 481, column: 16, scope: !988)
!990 = !DILocation(line: 481, column: 3, scope: !988)
!991 = !DILocation(line: 482, column: 1, scope: !303)
!992 = !DILocalVariable(name: "saved_sigmask", arg: 1, scope: !309, file: !1, line: 128, type: !312)
!993 = !DILocation(line: 128, column: 49, scope: !309)
!994 = !DILocalVariable(name: "new_mask", scope: !309, file: !1, line: 129, type: !313)
!995 = !DILocation(line: 129, column: 12, scope: !309)
!996 = !DILocation(line: 131, column: 7, scope: !997)
!997 = distinct !DILexicalBlock(scope: !309, file: !1, line: 131, column: 7)
!998 = !DILocation(line: 131, column: 7, scope: !309)
!999 = !DILocation(line: 132, column: 5, scope: !997)
!1000 = !DILocation(line: 134, column: 47, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !309, file: !1, line: 134, column: 7)
!1002 = !DILocation(line: 134, column: 7, scope: !1001)
!1003 = !DILocation(line: 134, column: 7, scope: !309)
!1004 = !DILocation(line: 135, column: 5, scope: !1001)
!1005 = !DILocation(line: 137, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !309, file: !1, line: 137, column: 7)
!1007 = !DILocation(line: 137, column: 7, scope: !309)
!1008 = !DILocation(line: 138, column: 5, scope: !1006)
!1009 = !DILocation(line: 139, column: 1, scope: !309)
!1010 = !DILocalVariable(name: "signum", arg: 1, scope: !324, file: !1, line: 151, type: !80)
!1011 = !DILocation(line: 151, column: 49, scope: !324)
!1012 = !DILocalVariable(name: "lookup", scope: !324, file: !1, line: 153, type: !217)
!1013 = !DILocation(line: 153, column: 15, scope: !324)
!1014 = !DILocalVariable(name: "handle", scope: !324, file: !1, line: 154, type: !237)
!1015 = !DILocation(line: 154, column: 16, scope: !324)
!1016 = !DILocation(line: 156, column: 19, scope: !324)
!1017 = !DILocation(line: 156, column: 10, scope: !324)
!1018 = !DILocation(line: 156, column: 17, scope: !324)
!1019 = !DILocation(line: 157, column: 10, scope: !324)
!1020 = !DILocation(line: 157, column: 16, scope: !324)
!1021 = !DILocation(line: 158, column: 10, scope: !324)
!1022 = !DILocation(line: 158, column: 15, scope: !324)
!1023 = !DILocation(line: 160, column: 12, scope: !324)
!1024 = !DILocation(line: 160, column: 10, scope: !324)
!1025 = !DILocation(line: 162, column: 7, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !324, file: !1, line: 162, column: 7)
!1027 = !DILocation(line: 162, column: 14, scope: !1026)
!1028 = !DILocation(line: 162, column: 22, scope: !1026)
!1029 = !DILocation(line: 162, column: 25, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1026, file: !1, discriminator: 1)
!1031 = !DILocation(line: 162, column: 33, scope: !1030)
!1032 = !DILocation(line: 162, column: 43, scope: !1030)
!1033 = !DILocation(line: 162, column: 40, scope: !1030)
!1034 = !DILocation(line: 162, column: 7, scope: !1030)
!1035 = !DILocation(line: 163, column: 12, scope: !1026)
!1036 = !DILocation(line: 163, column: 5, scope: !1026)
!1037 = !DILocation(line: 165, column: 3, scope: !324)
!1038 = !DILocation(line: 166, column: 1, scope: !324)
!1039 = !DILocalVariable(name: "signum", arg: 1, scope: !337, file: !1, line: 210, type: !80)
!1040 = !DILocation(line: 210, column: 44, scope: !337)
!1041 = !DILocalVariable(name: "oneshot", arg: 2, scope: !337, file: !1, line: 210, type: !80)
!1042 = !DILocation(line: 210, column: 56, scope: !337)
!1043 = !DILocalVariable(name: "sa", scope: !337, file: !1, line: 212, type: !1044)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1045, line: 24, size: 1216, align: 64, elements: !1046)
!1045 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!1046 = !{!1047, !1121, !1122, !1123}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1044, file: !1045, line: 35, baseType: !1048, size: 64, align: 64)
!1048 = !DICompositeType(tag: DW_TAG_union_type, scope: !1044, file: !1045, line: 28, size: 64, align: 64, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1048, file: !1045, line: 31, baseType: !270, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1048, file: !1045, line: 33, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !80, !1055, !58}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1057, line: 128, baseType: !1058)
!1057 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!1058 = !DICompositeType(tag: DW_TAG_structure_type, file: !1057, line: 62, size: 1024, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1058, file: !1057, line: 64, baseType: !80, size: 32, align: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1058, file: !1057, line: 65, baseType: !80, size: 32, align: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1058, file: !1057, line: 67, baseType: !80, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1058, file: !1057, line: 127, baseType: !1064, size: 896, align: 64, offset: 128)
!1064 = !DICompositeType(tag: DW_TAG_union_type, scope: !1058, file: !1057, line: 69, size: 896, align: 64, elements: !1065)
!1065 = !{!1066, !1070, !1078, !1089, !1095, !1105, !1110, !1115}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1064, file: !1057, line: 71, baseType: !1067, size: 896, align: 32)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 896, align: 32, elements: !1068)
!1068 = !{!1069}
!1069 = !DISubrange(count: 28)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1064, file: !1057, line: 78, baseType: !1071, size: 64, align: 32)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 74, size: 64, align: 32, elements: !1072)
!1072 = !{!1073, !1076}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1071, file: !1057, line: 76, baseType: !1074, size: 32, align: 32)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !1075, line: 133, baseType: !80)
!1075 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1071, file: !1057, line: 77, baseType: !1077, size: 32, align: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !1075, line: 125, baseType: !73)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1064, file: !1057, line: 86, baseType: !1079, size: 128, align: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 81, size: 128, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1079, file: !1057, line: 83, baseType: !80, size: 32, align: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1079, file: !1057, line: 84, baseType: !80, size: 32, align: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1079, file: !1057, line: 85, baseType: !1084, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1057, line: 36, baseType: !1085)
!1085 = !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1057, line: 32, size: 64, align: 64, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1085, file: !1057, line: 34, baseType: !80, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1085, file: !1057, line: 35, baseType: !58, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1064, file: !1057, line: 94, baseType: !1090, size: 128, align: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 89, size: 128, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1090, file: !1057, line: 91, baseType: !1074, size: 32, align: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1090, file: !1057, line: 92, baseType: !1077, size: 32, align: 32, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1090, file: !1057, line: 93, baseType: !1084, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1064, file: !1057, line: 104, baseType: !1096, size: 256, align: 64)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 97, size: 256, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1104}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1096, file: !1057, line: 99, baseType: !1074, size: 32, align: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1096, file: !1057, line: 100, baseType: !1077, size: 32, align: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1096, file: !1057, line: 101, baseType: !80, size: 32, align: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1096, file: !1057, line: 102, baseType: !1102, size: 64, align: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !1057, line: 58, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !1075, line: 135, baseType: !135)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1096, file: !1057, line: 103, baseType: !1102, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !1064, file: !1057, line: 111, baseType: !1106, size: 128, align: 64)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 107, size: 128, align: 64, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !1106, file: !1057, line: 109, baseType: !58, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !1106, file: !1057, line: 110, baseType: !120, size: 16, align: 16, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !1064, file: !1057, line: 118, baseType: !1111, size: 128, align: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 114, size: 128, align: 64, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !1111, file: !1057, line: 116, baseType: !135, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !1111, file: !1057, line: 117, baseType: !80, size: 32, align: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !1064, file: !1057, line: 126, baseType: !1116, size: 128, align: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1064, file: !1057, line: 121, size: 128, align: 64, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1116, file: !1057, line: 123, baseType: !58, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1116, file: !1057, line: 124, baseType: !80, size: 32, align: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1116, file: !1057, line: 125, baseType: !73, size: 32, align: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !1044, file: !1045, line: 43, baseType: !315, size: 1024, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !1044, file: !1045, line: 46, baseType: !80, size: 32, align: 32, offset: 1088)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !1044, file: !1045, line: 49, baseType: !199, size: 64, align: 64, offset: 1152)
!1124 = !DILocation(line: 212, column: 20, scope: !337)
!1125 = !DILocation(line: 215, column: 3, scope: !337)
!1126 = !DILocation(line: 216, column: 22, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !337, file: !1, line: 216, column: 7)
!1128 = !DILocation(line: 216, column: 7, scope: !1127)
!1129 = !DILocation(line: 216, column: 7, scope: !337)
!1130 = !DILocation(line: 217, column: 5, scope: !1127)
!1131 = !DILocation(line: 218, column: 6, scope: !337)
!1132 = !DILocation(line: 218, column: 17, scope: !337)
!1133 = !DILocation(line: 219, column: 17, scope: !337)
!1134 = !DILocation(line: 219, column: 6, scope: !337)
!1135 = !DILocation(line: 219, column: 15, scope: !337)
!1136 = !DILocation(line: 222, column: 17, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !337, file: !1, line: 222, column: 7)
!1138 = !DILocation(line: 222, column: 7, scope: !1137)
!1139 = !DILocation(line: 222, column: 7, scope: !337)
!1140 = !DILocation(line: 223, column: 13, scope: !1137)
!1141 = !DILocation(line: 223, column: 12, scope: !1137)
!1142 = !DILocation(line: 223, column: 5, scope: !1137)
!1143 = !DILocation(line: 225, column: 3, scope: !337)
!1144 = !DILocation(line: 226, column: 1, scope: !337)
!1145 = !DILocalVariable(name: "saved_sigmask", arg: 1, scope: !344, file: !1, line: 142, type: !312)
!1146 = !DILocation(line: 142, column: 53, scope: !344)
!1147 = !DILocation(line: 143, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !344, file: !1, line: 143, column: 7)
!1149 = !DILocation(line: 143, column: 7, scope: !344)
!1150 = !DILocation(line: 144, column: 5, scope: !1148)
!1151 = !DILocation(line: 146, column: 36, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !344, file: !1, line: 146, column: 7)
!1153 = !DILocation(line: 146, column: 7, scope: !1152)
!1154 = !DILocation(line: 146, column: 7, scope: !344)
!1155 = !DILocation(line: 147, column: 5, scope: !1152)
!1156 = !DILocation(line: 148, column: 1, scope: !344)
!1157 = !DILocalVariable(name: "head", arg: 1, scope: !345, file: !1, line: 57, type: !330)
!1158 = !DILocation(line: 57, column: 1, scope: !345)
!1159 = !DILocalVariable(name: "elm", arg: 2, scope: !345, file: !1, line: 57, type: !243)
!1160 = !DILocalVariable(name: "tmp", scope: !345, file: !1, line: 57, type: !243)
!1161 = !DILocalVariable(name: "parent", scope: !345, file: !1, line: 57, type: !243)
!1162 = !DILocalVariable(name: "comp", scope: !345, file: !1, line: 57, type: !80)
!1163 = !DILocation(line: 57, column: 1, scope: !1164)
!1164 = !DILexicalBlockFile(scope: !345, file: !1, discriminator: 1)
!1165 = !DILocation(line: 57, column: 1, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1167, file: !1, discriminator: 2)
!1167 = distinct !DILexicalBlock(scope: !345, file: !1, line: 57, column: 1)
!1168 = !DILocation(line: 57, column: 1, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1170, file: !1, discriminator: 3)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !1, line: 57, column: 1)
!1171 = !DILocation(line: 57, column: 1, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1173, file: !1, discriminator: 4)
!1173 = distinct !DILexicalBlock(scope: !1170, file: !1, line: 57, column: 1)
!1174 = !DILocation(line: 57, column: 1, scope: !1175)
!1175 = !DILexicalBlockFile(scope: !1173, file: !1, discriminator: 5)
!1176 = !DILocation(line: 57, column: 1, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1173, file: !1, discriminator: 6)
!1178 = !DILocation(line: 57, column: 1, scope: !1179)
!1179 = !DILexicalBlockFile(scope: !345, file: !1, discriminator: 7)
!1180 = !DILocation(line: 57, column: 1, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !345, file: !1, discriminator: 8)
!1182 = !DILocation(line: 57, column: 1, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1184, file: !1, discriminator: 9)
