; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/stream.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }

!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!79 = !DIEnumerator(name: "UV_E2BIG", value: -7)
!80 = !DIEnumerator(name: "UV_EACCES", value: -13)
!81 = !DIEnumerator(name: "UV_EADDRINUSE", value: -98)
!82 = !DIEnumerator(name: "UV_EADDRNOTAVAIL", value: -99)
!83 = !DIEnumerator(name: "UV_EAFNOSUPPORT", value: -97)
!84 = !DIEnumerator(name: "UV_EAGAIN", value: -11)
!85 = !DIEnumerator(name: "UV_EAI_ADDRFAMILY", value: -3000)
!86 = !DIEnumerator(name: "UV_EAI_AGAIN", value: -3001)
!87 = !DIEnumerator(name: "UV_EAI_BADFLAGS", value: -3002)
!88 = !DIEnumerator(name: "UV_EAI_BADHINTS", value: -3013)
!89 = !DIEnumerator(name: "UV_EAI_CANCELED", value: -3003)
!90 = !DIEnumerator(name: "UV_EAI_FAIL", value: -3004)
!91 = !DIEnumerator(name: "UV_EAI_FAMILY", value: -3005)
!92 = !DIEnumerator(name: "UV_EAI_MEMORY", value: -3006)
!93 = !DIEnumerator(name: "UV_EAI_NODATA", value: -3007)
!94 = !DIEnumerator(name: "UV_EAI_NONAME", value: -3008)
!95 = !DIEnumerator(name: "UV_EAI_OVERFLOW", value: -3009)
!96 = !DIEnumerator(name: "UV_EAI_PROTOCOL", value: -3014)
!97 = !DIEnumerator(name: "UV_EAI_SERVICE", value: -3010)
!98 = !DIEnumerator(name: "UV_EAI_SOCKTYPE", value: -3011)
!99 = !DIEnumerator(name: "UV_EALREADY", value: -114)
!100 = !DIEnumerator(name: "UV_EBADF", value: -9)
!101 = !DIEnumerator(name: "UV_EBUSY", value: -16)
!102 = !DIEnumerator(name: "UV_ECANCELED", value: -125)
!103 = !DIEnumerator(name: "UV_ECHARSET", value: -4080)
!104 = !DIEnumerator(name: "UV_ECONNABORTED", value: -103)
!105 = !DIEnumerator(name: "UV_ECONNREFUSED", value: -111)
!106 = !DIEnumerator(name: "UV_ECONNRESET", value: -104)
!107 = !DIEnumerator(name: "UV_EDESTADDRREQ", value: -89)
!108 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!109 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!110 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!111 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!112 = !DIEnumerator(name: "UV_EINTR", value: -4)
!113 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!114 = !DIEnumerator(name: "UV_EIO", value: -5)
!115 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!116 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!117 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!118 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!119 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!120 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!121 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!122 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!123 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!124 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!125 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!126 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!127 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!128 = !DIEnumerator(name: "UV_ENONET", value: -64)
!129 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!130 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!131 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!132 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!133 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!134 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!135 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!136 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!137 = !DIEnumerator(name: "UV_EPERM", value: -1)
!138 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!139 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!140 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!141 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!142 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!143 = !DIEnumerator(name: "UV_EROFS", value: -30)
!144 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!145 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!146 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!147 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!148 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!149 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!150 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!151 = !DIEnumerator(name: "UV_EOF", value: -4095)
!152 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!153 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!154 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!155 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 299, size: 32, align: 32, elements: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!158 = !{!159, !160}
!159 = !DIEnumerator(name: "SCM_RIGHTS", value: 1)
!160 = !DIEnumerator(name: "SCM_CREDENTIALS", value: 2)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !162, line: 52, size: 32, align: 32, elements: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!163 = !{!164, !165, !166}
!164 = !DIEnumerator(name: "SHUT_RD", value: 0)
!165 = !DIEnumerator(name: "SHUT_WR", value: 1)
!166 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!167 = !{!168, !374, !173, !378, !380, !424, !395, !487, !526, !554, !586, !587, !412, !593}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !171)
!171 = !{!172, !174, !364, !365, !366, !367, !372, !373}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !170, file: !4, line: 426, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !170, file: !4, line: 426, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !178)
!178 = !{!179, !180, !182, !186, !187, !188, !190, !192, !193, !194, !213, !214, !215, !216, !247, !279, !303, !304, !305, !306, !307, !308, !309, !313, !314, !315, !320, !323, !324, !326, !327, !360, !361, !362, !363}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !4, line: 1475, baseType: !173, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !177, file: !4, line: 1477, baseType: !181, size: 32, align: 32, offset: 64)
!181 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !177, file: !4, line: 1478, baseType: !183, size: 128, align: 64, offset: 128)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 128, align: 64, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !177, file: !4, line: 1479, baseType: !183, size: 128, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !177, file: !4, line: 1481, baseType: !181, size: 32, align: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !4, line: 1482, baseType: !189, size: 64, align: 64, offset: 448)
!189 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !177, file: !4, line: 1482, baseType: !191, size: 32, align: 32, offset: 512)
!191 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !177, file: !4, line: 1482, baseType: !195, size: 64, align: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !198, line: 87, baseType: !199)
!198 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !198, line: 89, size: 448, align: 64, elements: !200)
!200 = !{!201, !208, !209, !210, !211, !212}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !199, file: !198, line: 90, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !198, line: 84, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206, !207, !181}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !199, file: !198, line: 91, baseType: !183, size: 128, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !199, file: !198, line: 92, baseType: !183, size: 128, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !199, file: !198, line: 93, baseType: !181, size: 32, align: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !199, file: !198, line: 94, baseType: !181, size: 32, align: 32, offset: 352)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !199, file: !198, line: 95, baseType: !191, size: 32, align: 32, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !177, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !177, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 928)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !177, file: !4, line: 1482, baseType: !217, size: 320, align: 64, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !198, line: 129, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !219, line: 127, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!220 = !DICompositeType(tag: DW_TAG_union_type, file: !219, line: 90, size: 320, align: 64, elements: !221)
!221 = !{!222, !240, !245}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !220, file: !219, line: 124, baseType: !223, size: 320, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !219, line: 92, size: 320, align: 64, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !232, !233}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !223, file: !219, line: 94, baseType: !191, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !223, file: !219, line: 95, baseType: !181, size: 32, align: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !223, file: !219, line: 96, baseType: !191, size: 32, align: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !223, file: !219, line: 98, baseType: !181, size: 32, align: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !223, file: !219, line: 102, baseType: !191, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !223, file: !219, line: 104, baseType: !231, size: 16, align: 16, offset: 160)
!231 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !223, file: !219, line: 105, baseType: !231, size: 16, align: 16, offset: 176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !223, file: !219, line: 106, baseType: !234, size: 128, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !219, line: 79, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !219, line: 75, size: 128, align: 64, elements: !236)
!236 = !{!237, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !235, file: !219, line: 77, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !235, file: !219, line: 78, baseType: !238, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !220, file: !219, line: 125, baseType: !241, size: 320, align: 8)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 320, align: 8, elements: !243)
!242 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!243 = !{!244}
!244 = !DISubrange(count: 40)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !220, file: !219, line: 126, baseType: !246, size: 64, align: 64)
!246 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !177, file: !4, line: 1482, baseType: !248, size: 1024, align: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !250)
!250 = !{!251, !252, !253, !255, !260, !261, !269, !270, !271, !277, !278}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !4, line: 768, baseType: !173, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !249, file: !4, line: 768, baseType: !175, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !4, line: 768, baseType: !254, size: 32, align: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !249, file: !4, line: 768, baseType: !256, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !168}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !249, file: !4, line: 768, baseType: !183, size: 128, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !249, file: !4, line: 768, baseType: !262, size: 256, align: 64, offset: 384)
!262 = !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !4, line: 768, size: 256, align: 64, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !262, file: !4, line: 768, baseType: !191, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !262, file: !4, line: 768, baseType: !266, size: 256, align: 64)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 256, align: 64, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !249, file: !4, line: 768, baseType: !168, size: 64, align: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !249, file: !4, line: 768, baseType: !181, size: 32, align: 32, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !249, file: !4, line: 769, baseType: !272, size: 64, align: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !249, file: !4, line: 769, baseType: !183, size: 128, align: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !249, file: !4, line: 769, baseType: !191, size: 32, align: 32, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !177, file: !4, line: 1482, baseType: !280, size: 448, align: 64, offset: 2432)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !198, line: 130, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !219, line: 213, baseType: !282)
!282 = !DICompositeType(tag: DW_TAG_union_type, file: !219, line: 173, size: 448, align: 64, elements: !283)
!283 = !{!284, !298, !302}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !282, file: !219, line: 192, baseType: !285, size: 448, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, scope: !282, file: !219, line: 176, size: 448, align: 64, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !285, file: !219, line: 178, baseType: !191, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !285, file: !219, line: 179, baseType: !181, size: 32, align: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !285, file: !219, line: 180, baseType: !181, size: 32, align: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !285, file: !219, line: 181, baseType: !181, size: 32, align: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !285, file: !219, line: 182, baseType: !181, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !285, file: !219, line: 183, baseType: !181, size: 32, align: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !285, file: !219, line: 184, baseType: !191, size: 32, align: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !285, file: !219, line: 185, baseType: !191, size: 32, align: 32, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !285, file: !219, line: 186, baseType: !189, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !285, file: !219, line: 187, baseType: !189, size: 64, align: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !285, file: !219, line: 190, baseType: !181, size: 32, align: 32, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !282, file: !219, line: 211, baseType: !299, size: 448, align: 8)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 448, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 56)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !282, file: !219, line: 212, baseType: !246, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !177, file: !4, line: 1482, baseType: !168, size: 64, align: 64, offset: 2880)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 2944)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 3072)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 3328)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !177, file: !4, line: 1482, baseType: !183, size: 128, align: 64, offset: 3456)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !177, file: !4, line: 1482, baseType: !310, size: 64, align: 64, offset: 3584)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{null}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !177, file: !4, line: 1482, baseType: !197, size: 448, align: 64, offset: 3648)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !177, file: !4, line: 1482, baseType: !191, size: 32, align: 32, offset: 4096)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !177, file: !4, line: 1482, baseType: !316, size: 128, align: 64, offset: 4160)
!316 = !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !4, line: 1482, size: 128, align: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !316, file: !4, line: 1482, baseType: !173, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !316, file: !4, line: 1482, baseType: !181, size: 32, align: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !177, file: !4, line: 1482, baseType: !321, size: 64, align: 64, offset: 4288)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !322, line: 55, baseType: !189)
!322 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!323 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !177, file: !4, line: 1482, baseType: !321, size: 64, align: 64, offset: 4352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !177, file: !4, line: 1482, baseType: !325, size: 64, align: 32, offset: 4416)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 64, align: 32, elements: !184)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !177, file: !4, line: 1482, baseType: !197, size: 448, align: 64, offset: 4480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !177, file: !4, line: 1482, baseType: !328, size: 1216, align: 64, offset: 4928)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !329)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !341, !342, !343, !349, !350, !358, !359}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !329, file: !4, line: 1326, baseType: !173, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !329, file: !4, line: 1326, baseType: !175, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !4, line: 1326, baseType: !254, size: 32, align: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !329, file: !4, line: 1326, baseType: !256, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !329, file: !4, line: 1326, baseType: !183, size: 128, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !329, file: !4, line: 1326, baseType: !337, size: 256, align: 64, offset: 384)
!337 = !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !4, line: 1326, size: 256, align: 64, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !337, file: !4, line: 1326, baseType: !191, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !337, file: !4, line: 1326, baseType: !266, size: 256, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !329, file: !4, line: 1326, baseType: !168, size: 64, align: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !329, file: !4, line: 1326, baseType: !181, size: 32, align: 32, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !329, file: !4, line: 1327, baseType: !344, size: 64, align: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348, !191}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !329, file: !4, line: 1328, baseType: !191, size: 32, align: 32, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !329, file: !4, line: 1329, baseType: !351, size: 256, align: 64, offset: 896)
!351 = !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !4, line: 1329, size: 256, align: 64, elements: !352)
!352 = !{!353, !355, !356, !357}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !351, file: !4, line: 1329, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !351, file: !4, line: 1329, baseType: !354, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !351, file: !4, line: 1329, baseType: !354, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !351, file: !4, line: 1329, baseType: !191, size: 32, align: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !329, file: !4, line: 1329, baseType: !181, size: 32, align: 32, offset: 1152)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !329, file: !4, line: 1329, baseType: !181, size: 32, align: 32, offset: 1184)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !177, file: !4, line: 1482, baseType: !191, size: 32, align: 32, offset: 6144)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !177, file: !4, line: 1482, baseType: !197, size: 448, align: 64, offset: 6208)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !177, file: !4, line: 1482, baseType: !173, size: 64, align: 64, offset: 6656)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !177, file: !4, line: 1482, baseType: !191, size: 32, align: 32, offset: 6720)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !4, line: 426, baseType: !254, size: 32, align: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !170, file: !4, line: 426, baseType: !256, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !170, file: !4, line: 426, baseType: !183, size: 128, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !170, file: !4, line: 426, baseType: !368, size: 256, align: 64, offset: 384)
!368 = !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !4, line: 426, size: 256, align: 64, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !368, file: !4, line: 426, baseType: !191, size: 32, align: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !368, file: !4, line: 426, baseType: !266, size: 256, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !170, file: !4, line: 426, baseType: !168, size: 64, align: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !4, line: 426, baseType: !181, size: 32, align: 32, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !377, line: 21, baseType: !183)
!377 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_write_t", file: !4, line: 227, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_write_s", file: !4, line: 494, size: 1536, align: 64, elements: !383)
!383 = !{!384, !385, !387, !388, !389, !394, !479, !480, !481, !482, !483, !484, !485}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !4, line: 495, baseType: !173, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !382, file: !4, line: 495, baseType: !386, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !25)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !382, file: !4, line: 495, baseType: !183, size: 128, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !382, file: !4, line: 495, baseType: !266, size: 256, align: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !382, file: !4, line: 496, baseType: !390, size: 64, align: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_write_cb", file: !4, line: 302, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !380, !191}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "send_handle", scope: !382, file: !4, line: 497, baseType: !395, size: 64, align: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stream_t", file: !4, line: 206, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_stream_s", file: !4, line: 465, size: 1984, align: 64, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !409, !410, !411, !414, !426, !437, !453, !468, !469, !470, !471, !476, !477, !478}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !397, file: !4, line: 466, baseType: !173, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !397, file: !4, line: 466, baseType: !175, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !4, line: 466, baseType: !254, size: 32, align: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !397, file: !4, line: 466, baseType: !256, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !397, file: !4, line: 466, baseType: !183, size: 128, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !397, file: !4, line: 466, baseType: !405, size: 256, align: 64, offset: 384)
!405 = !DICompositeType(tag: DW_TAG_union_type, scope: !397, file: !4, line: 466, size: 256, align: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !405, file: !4, line: 466, baseType: !191, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !405, file: !4, line: 466, baseType: !266, size: 256, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !397, file: !4, line: 466, baseType: !168, size: 64, align: 64, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !4, line: 466, baseType: !181, size: 32, align: 32, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !397, file: !4, line: 467, baseType: !412, size: 64, align: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !413, line: 62, baseType: !189)
!413 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !397, file: !4, line: 467, baseType: !415, size: 64, align: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_alloc_cb", file: !4, line: 296, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !168, !412, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !198, line: 119, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !198, line: 116, size: 128, align: 64, elements: !422)
!422 = !{!423, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !421, file: !198, line: 117, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !421, file: !198, line: 118, baseType: !412, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !397, file: !4, line: 467, baseType: !427, size: 64, align: 64, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_read_cb", file: !4, line: 299, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !395, !431, !435}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !432, line: 102, baseType: !433)
!432 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !434, line: 172, baseType: !246)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !397, file: !4, line: 467, baseType: !438, size: 64, align: 64, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_t", file: !4, line: 228, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_connect_s", file: !4, line: 551, size: 768, align: 64, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !451, !452}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !4, line: 552, baseType: !173, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !440, file: !4, line: 552, baseType: !386, size: 32, align: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !440, file: !4, line: 552, baseType: !183, size: 128, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !440, file: !4, line: 552, baseType: !266, size: 256, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !440, file: !4, line: 553, baseType: !447, size: 64, align: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_cb", file: !4, line: 303, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !438, !191}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !440, file: !4, line: 554, baseType: !395, size: 64, align: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !440, file: !4, line: 555, baseType: !183, size: 128, align: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !397, file: !4, line: 467, baseType: !454, size: 64, align: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_t", file: !4, line: 226, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_shutdown_s", file: !4, line: 401, size: 640, align: 64, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !456, file: !4, line: 402, baseType: !173, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !456, file: !4, line: 402, baseType: !386, size: 32, align: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !456, file: !4, line: 402, baseType: !183, size: 128, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !456, file: !4, line: 402, baseType: !266, size: 256, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !456, file: !4, line: 403, baseType: !395, size: 64, align: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !456, file: !4, line: 404, baseType: !464, size: 64, align: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_cb", file: !4, line: 304, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !454, !191}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !397, file: !4, line: 467, baseType: !197, size: 448, align: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !397, file: !4, line: 467, baseType: !183, size: 128, align: 64, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !397, file: !4, line: 467, baseType: !183, size: 128, align: 64, offset: 1664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !397, file: !4, line: 467, baseType: !472, size: 64, align: 64, offset: 1792)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connection_cb", file: !4, line: 305, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !395, !191}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !397, file: !4, line: 467, baseType: !191, size: 32, align: 32, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !397, file: !4, line: 467, baseType: !191, size: 32, align: 32, offset: 1888)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !397, file: !4, line: 467, baseType: !173, size: 64, align: 64, offset: 1920)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !382, file: !4, line: 498, baseType: !395, size: 64, align: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !382, file: !4, line: 499, baseType: !183, size: 128, align: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "write_index", scope: !382, file: !4, line: 499, baseType: !181, size: 32, align: 32, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !382, file: !4, line: 499, baseType: !419, size: 64, align: 64, offset: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !382, file: !4, line: 499, baseType: !181, size: 32, align: 32, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !382, file: !4, line: 499, baseType: !191, size: 32, align: 32, offset: 992)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !382, file: !4, line: 499, baseType: !486, size: 512, align: 64, offset: 1024)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 512, align: 64, elements: !267)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_t", file: !4, line: 208, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_udp_s", file: !4, line: 590, size: 1728, align: 64, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !501, !502, !503, !504, !505, !506, !523, !524, !525}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !4, line: 591, baseType: !173, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !489, file: !4, line: 591, baseType: !175, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !4, line: 591, baseType: !254, size: 32, align: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !489, file: !4, line: 591, baseType: !256, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !489, file: !4, line: 591, baseType: !183, size: 128, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !489, file: !4, line: 591, baseType: !497, size: 256, align: 64, offset: 384)
!497 = !DICompositeType(tag: DW_TAG_union_type, scope: !489, file: !4, line: 591, size: 256, align: 64, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !497, file: !4, line: 591, baseType: !191, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !497, file: !4, line: 591, baseType: !266, size: 256, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !489, file: !4, line: 591, baseType: !168, size: 64, align: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !489, file: !4, line: 591, baseType: !181, size: 32, align: 32, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_size", scope: !489, file: !4, line: 597, baseType: !412, size: 64, align: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_count", scope: !489, file: !4, line: 601, baseType: !412, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !489, file: !4, line: 602, baseType: !415, size: 64, align: 64, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "recv_cb", scope: !489, file: !4, line: 602, baseType: !507, size: 64, align: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_recv_cb", file: !4, line: 583, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !487, !431, !435, !511, !181}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !157, line: 149, size: 128, align: 16, elements: !514)
!514 = !{!515, !519}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !513, file: !157, line: 151, baseType: !516, size: 16, align: 16)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !517, line: 28, baseType: !518)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!518 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !513, file: !157, line: 152, baseType: !520, size: 112, align: 8, offset: 16)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 112, align: 8, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 14)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !489, file: !4, line: 602, baseType: !197, size: 448, align: 64, offset: 1024)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !489, file: !4, line: 602, baseType: !183, size: 128, align: 64, offset: 1472)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !489, file: !4, line: 602, baseType: !183, size: 128, align: 64, offset: 1600)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_tcp_t", file: !4, line: 207, baseType: !528)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_tcp_s", file: !4, line: 516, size: 1984, align: 64, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !528, file: !4, line: 517, baseType: !173, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !528, file: !4, line: 517, baseType: !175, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !4, line: 517, baseType: !254, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !528, file: !4, line: 517, baseType: !256, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !528, file: !4, line: 517, baseType: !183, size: 128, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !528, file: !4, line: 517, baseType: !536, size: 256, align: 64, offset: 384)
!536 = !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !4, line: 517, size: 256, align: 64, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !536, file: !4, line: 517, baseType: !191, size: 32, align: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !536, file: !4, line: 517, baseType: !266, size: 256, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !528, file: !4, line: 517, baseType: !168, size: 64, align: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !528, file: !4, line: 517, baseType: !181, size: 32, align: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !528, file: !4, line: 518, baseType: !412, size: 64, align: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !528, file: !4, line: 518, baseType: !415, size: 64, align: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !528, file: !4, line: 518, baseType: !427, size: 64, align: 64, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !528, file: !4, line: 518, baseType: !438, size: 64, align: 64, offset: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !528, file: !4, line: 518, baseType: !454, size: 64, align: 64, offset: 1024)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !528, file: !4, line: 518, baseType: !197, size: 448, align: 64, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !528, file: !4, line: 518, baseType: !183, size: 128, align: 64, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !528, file: !4, line: 518, baseType: !183, size: 128, align: 64, offset: 1664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !528, file: !4, line: 518, baseType: !472, size: 64, align: 64, offset: 1792)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !528, file: !4, line: 518, baseType: !191, size: 32, align: 32, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !528, file: !4, line: 518, baseType: !191, size: 32, align: 32, offset: 1888)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !528, file: !4, line: 518, baseType: !173, size: 64, align: 64, offset: 1920)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_pipe_t", file: !4, line: 209, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_pipe_s", file: !4, line: 692, size: 2112, align: 64, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !556, file: !4, line: 693, baseType: !173, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !556, file: !4, line: 693, baseType: !175, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !4, line: 693, baseType: !254, size: 32, align: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !556, file: !4, line: 693, baseType: !256, size: 64, align: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !556, file: !4, line: 693, baseType: !183, size: 128, align: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !556, file: !4, line: 693, baseType: !564, size: 256, align: 64, offset: 384)
!564 = !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !4, line: 693, size: 256, align: 64, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !564, file: !4, line: 693, baseType: !191, size: 32, align: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !564, file: !4, line: 693, baseType: !266, size: 256, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !556, file: !4, line: 693, baseType: !168, size: 64, align: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !556, file: !4, line: 693, baseType: !181, size: 32, align: 32, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !556, file: !4, line: 694, baseType: !412, size: 64, align: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !556, file: !4, line: 694, baseType: !415, size: 64, align: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !556, file: !4, line: 694, baseType: !427, size: 64, align: 64, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !556, file: !4, line: 694, baseType: !438, size: 64, align: 64, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !556, file: !4, line: 694, baseType: !454, size: 64, align: 64, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !556, file: !4, line: 694, baseType: !197, size: 448, align: 64, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !556, file: !4, line: 694, baseType: !183, size: 128, align: 64, offset: 1536)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !556, file: !4, line: 694, baseType: !183, size: 128, align: 64, offset: 1664)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !556, file: !4, line: 694, baseType: !472, size: 64, align: 64, offset: 1792)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !556, file: !4, line: 694, baseType: !191, size: 32, align: 32, offset: 1856)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !556, file: !4, line: 694, baseType: !191, size: 32, align: 32, offset: 1888)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !556, file: !4, line: 694, baseType: !173, size: 64, align: 64, offset: 1920)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ipc", scope: !556, file: !4, line: 695, baseType: !191, size: 32, align: 32, offset: 1984)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fname", scope: !556, file: !4, line: 696, baseType: !584, size: 64, align: 64, offset: 2048)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !589, line: 43, size: 128, align: 64, elements: !590)
!589 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !588, file: !589, line: 45, baseType: !173, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !588, file: !589, line: 46, baseType: !412, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !157, line: 242, size: 128, align: 64, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !594, file: !157, line: 244, baseType: !412, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !594, file: !157, line: 249, baseType: !191, size: 32, align: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !594, file: !157, line: 250, baseType: !191, size: 32, align: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !594, file: !157, line: 252, baseType: !600, offset: 128)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, align: 8, elements: !602)
!601 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!602 = !{!603}
!603 = !DISubrange(count: -1)
!604 = !{!605, !609, !612, !613, !616, !619, !622, !625, !628, !631, !634, !637, !638, !641, !644, !647, !652, !653, !654, !657, !660, !661, !662, !663, !664, !665, !680, !681, !684, !685, !688, !689, !692}
!605 = distinct !DISubprogram(name: "uv__stream_init", scope: !1, file: !1, line: 71, type: !606, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !175, !395, !254}
!608 = !{}
!609 = distinct !DISubprogram(name: "uv__stream_open", scope: !1, file: !1, line: 392, type: !610, isLocal: false, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!610 = !DISubroutineType(types: !611)
!611 = !{!191, !395, !191, !191}
!612 = distinct !DISubprogram(name: "uv__stream_flush_write_queue", scope: !1, file: !1, line: 427, type: !474, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!613 = distinct !DISubprogram(name: "uv__stream_destroy", scope: !1, file: !1, line: 442, type: !614, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !395}
!616 = distinct !DISubprogram(name: "uv__server_io", scope: !1, file: !1, line: 512, type: !617, isLocal: false, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !175, !196, !181}
!619 = distinct !DISubprogram(name: "uv_accept", scope: !1, file: !1, line: 574, type: !620, isLocal: false, isDefinition: true, scopeLine: 574, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!620 = !DISubroutineType(types: !621)
!621 = !{!191, !395, !395}
!622 = distinct !DISubprogram(name: "uv_listen", scope: !1, file: !1, line: 639, type: !623, isLocal: false, isDefinition: true, scopeLine: 639, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!623 = !DISubroutineType(types: !624)
!624 = !{!191, !395, !191, !472}
!625 = distinct !DISubprogram(name: "uv__handle_type", scope: !1, file: !1, line: 956, type: !626, isLocal: false, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!626 = !DISubroutineType(types: !627)
!627 = !{!254, !191}
!628 = distinct !DISubprogram(name: "uv_shutdown", scope: !1, file: !1, line: 1246, type: !629, isLocal: false, isDefinition: true, scopeLine: 1246, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!629 = !DISubroutineType(types: !630)
!630 = !{!191, !454, !395, !464}
!631 = distinct !DISubprogram(name: "uv_write2", scope: !1, file: !1, line: 1379, type: !632, isLocal: false, isDefinition: true, scopeLine: 1384, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!632 = !DISubroutineType(types: !633)
!633 = !{!191, !380, !395, !435, !181, !395, !390}
!634 = distinct !DISubprogram(name: "uv_write", scope: !1, file: !1, line: 1469, type: !635, isLocal: false, isDefinition: true, scopeLine: 1473, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!635 = !DISubroutineType(types: !636)
!636 = !{!191, !380, !395, !435, !181, !390}
!637 = distinct !DISubprogram(name: "uv_try_write_cb", scope: !1, file: !1, line: 1478, type: !392, isLocal: false, isDefinition: true, scopeLine: 1478, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!638 = distinct !DISubprogram(name: "uv_try_write", scope: !1, file: !1, line: 1484, type: !639, isLocal: false, isDefinition: true, scopeLine: 1486, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!639 = !DISubroutineType(types: !640)
!640 = !{!191, !395, !435, !181}
!641 = distinct !DISubprogram(name: "uv_read_start", scope: !1, file: !1, line: 1532, type: !642, isLocal: false, isDefinition: true, scopeLine: 1534, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!642 = !DISubroutineType(types: !643)
!643 = !{!191, !395, !415, !427}
!644 = distinct !DISubprogram(name: "uv_read_stop", scope: !1, file: !1, line: 1564, type: !645, isLocal: false, isDefinition: true, scopeLine: 1564, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!645 = !DISubroutineType(types: !646)
!646 = !{!191, !395}
!647 = distinct !DISubprogram(name: "uv_is_readable", scope: !1, file: !1, line: 1580, type: !648, isLocal: false, isDefinition: true, scopeLine: 1580, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!648 = !DISubroutineType(types: !649)
!649 = !{!191, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!652 = distinct !DISubprogram(name: "uv_is_writable", scope: !1, file: !1, line: 1585, type: !648, isLocal: false, isDefinition: true, scopeLine: 1585, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!653 = distinct !DISubprogram(name: "uv__stream_close", scope: !1, file: !1, line: 1607, type: !614, isLocal: false, isDefinition: true, scopeLine: 1607, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!654 = distinct !DISubprogram(name: "uv_stream_set_blocking", scope: !1, file: !1, line: 1661, type: !655, isLocal: false, isDefinition: true, scopeLine: 1661, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!655 = !DISubroutineType(types: !656)
!656 = !{!191, !395, !191}
!657 = distinct !DISubprogram(name: "uv__emfile_trick", scope: !1, file: !1, line: 481, type: !658, isLocal: true, isDefinition: true, scopeLine: 481, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!658 = !DISubroutineType(types: !659)
!659 = !{!191, !175, !191}
!660 = distinct !DISubprogram(name: "uv__write_callbacks", scope: !1, file: !1, line: 929, type: !614, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!661 = distinct !DISubprogram(name: "uv__stream_osx_interrupt_select", scope: !1, file: !1, line: 109, type: !614, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!662 = distinct !DISubprogram(name: "uv__stream_io", scope: !1, file: !1, line: 1273, type: !617, isLocal: true, isDefinition: true, scopeLine: 1273, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!663 = distinct !DISubprogram(name: "uv__stream_connect", scope: !1, file: !1, line: 1330, type: !614, isLocal: true, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!664 = distinct !DISubprogram(name: "uv__read", scope: !1, file: !1, line: 1108, type: !614, isLocal: true, isDefinition: true, scopeLine: 1108, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!665 = distinct !DISubprogram(name: "uv__stream_recv_cmsg", scope: !1, file: !1, line: 1053, type: !666, isLocal: true, isDefinition: true, scopeLine: 1053, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!666 = !DISubroutineType(types: !667)
!667 = !{!191, !395, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !157, line: 224, size: 448, align: 64, elements: !670)
!670 = !{!671, !672, !675, !676, !677, !678, !679}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !669, file: !157, line: 226, baseType: !173, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !669, file: !157, line: 227, baseType: !673, size: 32, align: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !157, line: 33, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !434, line: 189, baseType: !181)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !669, file: !157, line: 229, baseType: !587, size: 64, align: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !669, file: !157, line: 230, baseType: !412, size: 64, align: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !669, file: !157, line: 232, baseType: !173, size: 64, align: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !669, file: !157, line: 233, baseType: !412, size: 64, align: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !669, file: !157, line: 238, baseType: !191, size: 32, align: 32, offset: 384)
!680 = distinct !DISubprogram(name: "uv__stream_queue_fd", scope: !1, file: !1, line: 1010, type: !655, isLocal: true, isDefinition: true, scopeLine: 1010, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!681 = distinct !DISubprogram(name: "uv__stream_eof", scope: !1, file: !1, line: 999, type: !682, isLocal: true, isDefinition: true, scopeLine: 999, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !395, !435}
!684 = distinct !DISubprogram(name: "uv__drain", scope: !1, file: !1, line: 662, type: !614, isLocal: true, isDefinition: true, scopeLine: 662, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!685 = distinct !DISubprogram(name: "uv__handle_fd", scope: !1, file: !1, line: 732, type: !686, isLocal: true, isDefinition: true, scopeLine: 732, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!686 = !DISubroutineType(types: !687)
!687 = !{!191, !168}
!688 = distinct !DISubprogram(name: "uv__write", scope: !1, file: !1, line: 746, type: !614, isLocal: true, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!689 = distinct !DISubprogram(name: "uv__write_req_finish", scope: !1, file: !1, line: 706, type: !690, isLocal: true, isDefinition: true, scopeLine: 706, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !380}
!692 = distinct !DISubprogram(name: "uv__write_req_size", scope: !1, file: !1, line: 694, type: !693, isLocal: true, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: false, variables: !608)
!693 = !DISubroutineType(types: !694)
!694 = !{!412, !380}
!695 = !{i32 2, !"Dwarf Version", i32 4}
!696 = !{i32 2, !"Debug Info Version", i32 3}
!697 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!698 = !DILocalVariable(name: "loop", arg: 1, scope: !605, file: !1, line: 71, type: !175)
!699 = !DIExpression()
!700 = !DILocation(line: 71, column: 33, scope: !605)
!701 = !DILocalVariable(name: "stream", arg: 2, scope: !605, file: !1, line: 72, type: !395)
!702 = !DILocation(line: 72, column: 35, scope: !605)
!703 = !DILocalVariable(name: "type", arg: 3, scope: !605, file: !1, line: 73, type: !254)
!704 = !DILocation(line: 73, column: 37, scope: !605)
!705 = !DILocalVariable(name: "err", scope: !605, file: !1, line: 74, type: !191)
!706 = !DILocation(line: 74, column: 7, scope: !605)
!707 = !DILocation(line: 76, column: 3, scope: !605)
!708 = !DILocation(line: 76, column: 3, scope: !709)
!709 = !DILexicalBlockFile(scope: !710, file: !1, discriminator: 1)
!710 = distinct !DILexicalBlock(scope: !605, file: !1, line: 76, column: 3)
!711 = !DILocation(line: 76, column: 3, scope: !712)
!712 = !DILexicalBlockFile(scope: !713, file: !1, discriminator: 2)
!713 = distinct !DILexicalBlock(scope: !710, file: !1, line: 76, column: 3)
!714 = !DILocation(line: 76, column: 3, scope: !715)
!715 = !DILexicalBlockFile(scope: !710, file: !1, discriminator: 3)
!716 = !DILocation(line: 77, column: 3, scope: !605)
!717 = !DILocation(line: 77, column: 11, scope: !605)
!718 = !DILocation(line: 77, column: 19, scope: !605)
!719 = !DILocation(line: 78, column: 3, scope: !605)
!720 = !DILocation(line: 78, column: 11, scope: !605)
!721 = !DILocation(line: 78, column: 20, scope: !605)
!722 = !DILocation(line: 79, column: 3, scope: !605)
!723 = !DILocation(line: 79, column: 11, scope: !605)
!724 = !DILocation(line: 79, column: 20, scope: !605)
!725 = !DILocation(line: 80, column: 3, scope: !605)
!726 = !DILocation(line: 80, column: 11, scope: !605)
!727 = !DILocation(line: 80, column: 25, scope: !605)
!728 = !DILocation(line: 81, column: 3, scope: !605)
!729 = !DILocation(line: 81, column: 11, scope: !605)
!730 = !DILocation(line: 81, column: 23, scope: !605)
!731 = !DILocation(line: 82, column: 3, scope: !605)
!732 = !DILocation(line: 82, column: 11, scope: !605)
!733 = !DILocation(line: 82, column: 24, scope: !605)
!734 = !DILocation(line: 83, column: 3, scope: !605)
!735 = !DILocation(line: 83, column: 11, scope: !605)
!736 = !DILocation(line: 83, column: 23, scope: !605)
!737 = !DILocation(line: 84, column: 3, scope: !605)
!738 = !DILocation(line: 84, column: 11, scope: !605)
!739 = !DILocation(line: 84, column: 22, scope: !605)
!740 = !DILocation(line: 85, column: 3, scope: !605)
!741 = !DILocation(line: 85, column: 11, scope: !605)
!742 = !DILocation(line: 85, column: 25, scope: !605)
!743 = !DILocation(line: 86, column: 3, scope: !605)
!744 = !DILocation(line: 86, column: 3, scope: !745)
!745 = !DILexicalBlockFile(scope: !746, file: !1, discriminator: 1)
!746 = distinct !DILexicalBlock(scope: !605, file: !1, line: 86, column: 3)
!747 = !DILocation(line: 87, column: 3, scope: !605)
!748 = !DILocation(line: 87, column: 3, scope: !749)
!749 = !DILexicalBlockFile(scope: !750, file: !1, discriminator: 1)
!750 = distinct !DILexicalBlock(scope: !605, file: !1, line: 87, column: 3)
!751 = !DILocation(line: 88, column: 3, scope: !605)
!752 = !DILocation(line: 88, column: 11, scope: !605)
!753 = !DILocation(line: 88, column: 28, scope: !605)
!754 = !DILocation(line: 90, column: 7, scope: !755)
!755 = distinct !DILexicalBlock(scope: !605, file: !1, line: 90, column: 7)
!756 = !DILocation(line: 90, column: 13, scope: !755)
!757 = !DILocation(line: 90, column: 23, scope: !755)
!758 = !DILocation(line: 90, column: 7, scope: !605)
!759 = !DILocation(line: 91, column: 11, scope: !760)
!760 = distinct !DILexicalBlock(scope: !755, file: !1, line: 90, column: 30)
!761 = !DILocation(line: 91, column: 9, scope: !760)
!762 = !DILocation(line: 92, column: 9, scope: !763)
!763 = distinct !DILexicalBlock(scope: !760, file: !1, line: 92, column: 9)
!764 = !DILocation(line: 92, column: 13, scope: !763)
!765 = !DILocation(line: 92, column: 9, scope: !760)
!766 = !DILocation(line: 96, column: 15, scope: !763)
!767 = !DILocation(line: 96, column: 13, scope: !763)
!768 = !DILocation(line: 96, column: 9, scope: !763)
!769 = !DILocation(line: 97, column: 9, scope: !770)
!770 = distinct !DILexicalBlock(scope: !760, file: !1, line: 97, column: 9)
!771 = !DILocation(line: 97, column: 13, scope: !770)
!772 = !DILocation(line: 97, column: 9, scope: !760)
!773 = !DILocation(line: 98, column: 25, scope: !770)
!774 = !DILocation(line: 98, column: 7, scope: !770)
!775 = !DILocation(line: 98, column: 13, scope: !770)
!776 = !DILocation(line: 98, column: 23, scope: !770)
!777 = !DILocation(line: 99, column: 3, scope: !760)
!778 = !DILocation(line: 105, column: 16, scope: !605)
!779 = !DILocation(line: 105, column: 24, scope: !605)
!780 = !DILocation(line: 105, column: 3, scope: !605)
!781 = !DILocation(line: 106, column: 1, scope: !605)
!782 = !DILocalVariable(name: "loop", arg: 1, scope: !662, file: !1, line: 1273, type: !175)
!783 = !DILocation(line: 1273, column: 38, scope: !662)
!784 = !DILocalVariable(name: "w", arg: 2, scope: !662, file: !1, line: 1273, type: !196)
!785 = !DILocation(line: 1273, column: 54, scope: !662)
!786 = !DILocalVariable(name: "events", arg: 3, scope: !662, file: !1, line: 1273, type: !181)
!787 = !DILocation(line: 1273, column: 70, scope: !662)
!788 = !DILocalVariable(name: "stream", scope: !662, file: !1, line: 1274, type: !395)
!789 = !DILocation(line: 1274, column: 16, scope: !662)
!790 = !DILocation(line: 1276, column: 12, scope: !662)
!791 = !DILocation(line: 1276, column: 10, scope: !662)
!792 = !DILocation(line: 1278, column: 3, scope: !662)
!793 = !DILocation(line: 1278, column: 3, scope: !794)
!794 = !DILexicalBlockFile(scope: !662, file: !1, discriminator: 1)
!795 = !DILocation(line: 1278, column: 3, scope: !796)
!796 = !DILexicalBlockFile(scope: !662, file: !1, discriminator: 2)
!797 = !DILocation(line: 1278, column: 3, scope: !798)
!798 = !DILexicalBlockFile(scope: !662, file: !1, discriminator: 3)
!799 = !DILocation(line: 1278, column: 3, scope: !800)
!800 = !DILexicalBlockFile(scope: !662, file: !1, discriminator: 4)
!801 = !DILocation(line: 1278, column: 3, scope: !802)
!802 = !DILexicalBlockFile(scope: !662, file: !1, discriminator: 5)
!803 = !DILocation(line: 1281, column: 3, scope: !662)
!804 = !DILocation(line: 1281, column: 3, scope: !794)
!805 = !DILocation(line: 1281, column: 3, scope: !796)
!806 = !DILocation(line: 1281, column: 3, scope: !798)
!807 = !DILocation(line: 1283, column: 7, scope: !808)
!808 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1283, column: 7)
!809 = !DILocation(line: 1283, column: 15, scope: !808)
!810 = !DILocation(line: 1283, column: 7, scope: !662)
!811 = !DILocation(line: 1284, column: 24, scope: !812)
!812 = distinct !DILexicalBlock(scope: !808, file: !1, line: 1283, column: 28)
!813 = !DILocation(line: 1284, column: 5, scope: !812)
!814 = !DILocation(line: 1285, column: 5, scope: !812)
!815 = !DILocation(line: 1288, column: 3, scope: !662)
!816 = !DILocation(line: 1288, column: 3, scope: !794)
!817 = !DILocation(line: 1288, column: 3, scope: !796)
!818 = !DILocation(line: 1288, column: 3, scope: !798)
!819 = !DILocation(line: 1291, column: 7, scope: !820)
!820 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1291, column: 7)
!821 = !DILocation(line: 1291, column: 14, scope: !820)
!822 = !DILocation(line: 1291, column: 7, scope: !662)
!823 = !DILocation(line: 1292, column: 14, scope: !820)
!824 = !DILocation(line: 1292, column: 5, scope: !820)
!825 = !DILocation(line: 1294, column: 7, scope: !826)
!826 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1294, column: 7)
!827 = !DILocation(line: 1294, column: 29, scope: !826)
!828 = !DILocation(line: 1294, column: 7, scope: !662)
!829 = !DILocation(line: 1295, column: 5, scope: !826)
!830 = !DILocation(line: 1303, column: 8, scope: !831)
!831 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1303, column: 7)
!832 = !DILocation(line: 1303, column: 15, scope: !831)
!833 = !DILocation(line: 1303, column: 26, scope: !831)
!834 = !DILocation(line: 1304, column: 8, scope: !831)
!835 = !DILocation(line: 1304, column: 16, scope: !831)
!836 = !DILocation(line: 1304, column: 22, scope: !831)
!837 = !DILocation(line: 1304, column: 43, scope: !831)
!838 = !DILocation(line: 1305, column: 8, scope: !831)
!839 = !DILocation(line: 1305, column: 16, scope: !831)
!840 = !DILocation(line: 1305, column: 22, scope: !831)
!841 = !DILocation(line: 1305, column: 48, scope: !831)
!842 = !DILocation(line: 1306, column: 9, scope: !831)
!843 = !DILocation(line: 1306, column: 17, scope: !831)
!844 = !DILocation(line: 1306, column: 23, scope: !831)
!845 = !DILocation(line: 1303, column: 7, scope: !794)
!846 = !DILocalVariable(name: "buf", scope: !847, file: !1, line: 1307, type: !420)
!847 = distinct !DILexicalBlock(scope: !831, file: !1, line: 1306, column: 46)
!848 = !DILocation(line: 1307, column: 14, scope: !847)
!849 = !DILocation(line: 1308, column: 20, scope: !847)
!850 = !DILocation(line: 1308, column: 5, scope: !847)
!851 = !DILocation(line: 1309, column: 3, scope: !847)
!852 = !DILocation(line: 1311, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1311, column: 7)
!854 = !DILocation(line: 1311, column: 29, scope: !853)
!855 = !DILocation(line: 1311, column: 7, scope: !662)
!856 = !DILocation(line: 1312, column: 5, scope: !853)
!857 = !DILocation(line: 1314, column: 7, scope: !858)
!858 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1314, column: 7)
!859 = !DILocation(line: 1314, column: 14, scope: !858)
!860 = !DILocation(line: 1314, column: 7, scope: !662)
!861 = !DILocation(line: 1315, column: 15, scope: !862)
!862 = distinct !DILexicalBlock(scope: !858, file: !1, line: 1314, column: 47)
!863 = !DILocation(line: 1315, column: 5, scope: !862)
!864 = !DILocation(line: 1316, column: 25, scope: !862)
!865 = !DILocation(line: 1316, column: 5, scope: !862)
!866 = !DILocation(line: 1319, column: 9, scope: !867)
!867 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1319, column: 9)
!868 = !DILocation(line: 1319, column: 9, scope: !862)
!869 = !DILocation(line: 1320, column: 17, scope: !867)
!870 = !DILocation(line: 1320, column: 7, scope: !867)
!871 = !DILocation(line: 1321, column: 3, scope: !862)
!872 = !DILocation(line: 1322, column: 1, scope: !662)
!873 = !DILocalVariable(name: "stream", arg: 1, scope: !609, file: !1, line: 392, type: !395)
!874 = !DILocation(line: 392, column: 34, scope: !609)
!875 = !DILocalVariable(name: "fd", arg: 2, scope: !609, file: !1, line: 392, type: !191)
!876 = !DILocation(line: 392, column: 46, scope: !609)
!877 = !DILocalVariable(name: "flags", arg: 3, scope: !609, file: !1, line: 392, type: !191)
!878 = !DILocation(line: 392, column: 54, scope: !609)
!879 = !DILocation(line: 397, column: 9, scope: !880)
!880 = distinct !DILexicalBlock(scope: !609, file: !1, line: 397, column: 7)
!881 = !DILocation(line: 397, column: 17, scope: !880)
!882 = !DILocation(line: 397, column: 28, scope: !880)
!883 = !DILocation(line: 397, column: 31, scope: !880)
!884 = !DILocation(line: 397, column: 37, scope: !880)
!885 = !DILocation(line: 397, column: 40, scope: !886)
!886 = !DILexicalBlockFile(scope: !880, file: !1, discriminator: 1)
!887 = !DILocation(line: 397, column: 48, scope: !886)
!888 = !DILocation(line: 397, column: 59, scope: !886)
!889 = !DILocation(line: 397, column: 65, scope: !886)
!890 = !DILocation(line: 397, column: 62, scope: !886)
!891 = !DILocation(line: 397, column: 7, scope: !886)
!892 = !DILocation(line: 398, column: 5, scope: !880)
!893 = !DILocation(line: 400, column: 3, scope: !609)
!894 = !DILocation(line: 400, column: 3, scope: !895)
!895 = !DILexicalBlockFile(scope: !609, file: !1, discriminator: 1)
!896 = !DILocation(line: 400, column: 3, scope: !897)
!897 = !DILexicalBlockFile(scope: !609, file: !1, discriminator: 2)
!898 = !DILocation(line: 400, column: 3, scope: !899)
!899 = !DILexicalBlockFile(scope: !609, file: !1, discriminator: 3)
!900 = !DILocation(line: 401, column: 20, scope: !609)
!901 = !DILocation(line: 401, column: 3, scope: !609)
!902 = !DILocation(line: 401, column: 11, scope: !609)
!903 = !DILocation(line: 401, column: 17, scope: !609)
!904 = !DILocation(line: 403, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !609, file: !1, line: 403, column: 7)
!906 = !DILocation(line: 403, column: 15, scope: !905)
!907 = !DILocation(line: 403, column: 20, scope: !905)
!908 = !DILocation(line: 403, column: 7, scope: !609)
!909 = !DILocation(line: 404, column: 10, scope: !910)
!910 = distinct !DILexicalBlock(scope: !911, file: !1, line: 404, column: 9)
!911 = distinct !DILexicalBlock(scope: !905, file: !1, line: 403, column: 31)
!912 = !DILocation(line: 404, column: 18, scope: !910)
!913 = !DILocation(line: 404, column: 24, scope: !910)
!914 = !DILocation(line: 404, column: 42, scope: !910)
!915 = !DILocation(line: 404, column: 61, scope: !916)
!916 = !DILexicalBlockFile(scope: !910, file: !1, discriminator: 1)
!917 = !DILocation(line: 404, column: 45, scope: !916)
!918 = !DILocation(line: 404, column: 9, scope: !916)
!919 = !DILocation(line: 405, column: 15, scope: !910)
!920 = !DILocation(line: 405, column: 14, scope: !910)
!921 = !DILocation(line: 405, column: 7, scope: !910)
!922 = !DILocation(line: 408, column: 10, scope: !923)
!923 = distinct !DILexicalBlock(scope: !911, file: !1, line: 408, column: 9)
!924 = !DILocation(line: 408, column: 18, scope: !923)
!925 = !DILocation(line: 408, column: 24, scope: !923)
!926 = !DILocation(line: 408, column: 44, scope: !923)
!927 = !DILocation(line: 408, column: 65, scope: !928)
!928 = !DILexicalBlockFile(scope: !923, file: !1, discriminator: 1)
!929 = !DILocation(line: 408, column: 47, scope: !928)
!930 = !DILocation(line: 408, column: 9, scope: !928)
!931 = !DILocation(line: 409, column: 15, scope: !923)
!932 = !DILocation(line: 409, column: 14, scope: !923)
!933 = !DILocation(line: 409, column: 7, scope: !923)
!934 = !DILocation(line: 410, column: 3, scope: !911)
!935 = !DILocation(line: 421, column: 27, scope: !609)
!936 = !DILocation(line: 421, column: 3, scope: !609)
!937 = !DILocation(line: 421, column: 11, scope: !609)
!938 = !DILocation(line: 421, column: 22, scope: !609)
!939 = !DILocation(line: 421, column: 25, scope: !609)
!940 = !DILocation(line: 423, column: 3, scope: !609)
!941 = !DILocation(line: 424, column: 1, scope: !609)
!942 = !DILocalVariable(name: "stream", arg: 1, scope: !612, file: !1, line: 427, type: !395)
!943 = !DILocation(line: 427, column: 48, scope: !612)
!944 = !DILocalVariable(name: "error", arg: 2, scope: !612, file: !1, line: 427, type: !191)
!945 = !DILocation(line: 427, column: 60, scope: !612)
!946 = !DILocalVariable(name: "req", scope: !612, file: !1, line: 428, type: !380)
!947 = !DILocation(line: 428, column: 15, scope: !612)
!948 = !DILocalVariable(name: "q", scope: !612, file: !1, line: 429, type: !375)
!949 = !DILocation(line: 429, column: 10, scope: !612)
!950 = !DILocation(line: 430, column: 3, scope: !612)
!951 = !DILocation(line: 430, column: 11, scope: !952)
!952 = !DILexicalBlockFile(scope: !612, file: !1, discriminator: 1)
!953 = !DILocation(line: 430, column: 10, scope: !952)
!954 = !DILocation(line: 430, column: 3, scope: !952)
!955 = !DILocation(line: 431, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !612, file: !1, line: 430, column: 46)
!957 = !DILocation(line: 431, column: 7, scope: !956)
!958 = !DILocation(line: 432, column: 5, scope: !956)
!959 = !DILocation(line: 432, column: 5, scope: !960)
!960 = !DILexicalBlockFile(scope: !961, file: !1, discriminator: 1)
!961 = distinct !DILexicalBlock(scope: !956, file: !1, line: 432, column: 5)
!962 = !DILocation(line: 434, column: 11, scope: !956)
!963 = !DILocation(line: 434, column: 9, scope: !956)
!964 = !DILocation(line: 435, column: 18, scope: !956)
!965 = !DILocation(line: 435, column: 5, scope: !956)
!966 = !DILocation(line: 435, column: 10, scope: !956)
!967 = !DILocation(line: 435, column: 16, scope: !956)
!968 = !DILocation(line: 437, column: 5, scope: !956)
!969 = !DILocation(line: 437, column: 5, scope: !970)
!970 = !DILexicalBlockFile(scope: !971, file: !1, discriminator: 1)
!971 = distinct !DILexicalBlock(scope: !956, file: !1, line: 437, column: 5)
!972 = !DILocation(line: 430, column: 3, scope: !973)
!973 = !DILexicalBlockFile(scope: !612, file: !1, discriminator: 2)
!974 = !DILocation(line: 439, column: 1, scope: !612)
!975 = !DILocalVariable(name: "stream", arg: 1, scope: !613, file: !1, line: 442, type: !395)
!976 = !DILocation(line: 442, column: 38, scope: !613)
!977 = !DILocation(line: 443, column: 3, scope: !613)
!978 = !DILocation(line: 443, column: 3, scope: !979)
!979 = !DILexicalBlockFile(scope: !613, file: !1, discriminator: 1)
!980 = !DILocation(line: 443, column: 3, scope: !981)
!981 = !DILexicalBlockFile(scope: !613, file: !1, discriminator: 2)
!982 = !DILocation(line: 443, column: 3, scope: !983)
!983 = !DILexicalBlockFile(scope: !613, file: !1, discriminator: 3)
!984 = !DILocation(line: 444, column: 3, scope: !613)
!985 = !DILocation(line: 444, column: 3, scope: !979)
!986 = !DILocation(line: 444, column: 3, scope: !981)
!987 = !DILocation(line: 444, column: 3, scope: !983)
!988 = !DILocation(line: 446, column: 7, scope: !989)
!989 = distinct !DILexicalBlock(scope: !613, file: !1, line: 446, column: 7)
!990 = !DILocation(line: 446, column: 15, scope: !989)
!991 = !DILocation(line: 446, column: 7, scope: !613)
!992 = !DILocation(line: 447, column: 5, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !1, line: 446, column: 28)
!994 = !DILocation(line: 447, column: 5, scope: !995)
!995 = !DILexicalBlockFile(scope: !996, file: !1, discriminator: 1)
!996 = distinct !DILexicalBlock(scope: !993, file: !1, line: 447, column: 5)
!997 = !DILocation(line: 447, column: 5, scope: !998)
!998 = !DILexicalBlockFile(scope: !996, file: !1, discriminator: 2)
!999 = !DILocation(line: 447, column: 5, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !996, file: !1, discriminator: 3)
!1001 = !DILocation(line: 447, column: 5, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !996, file: !1, discriminator: 4)
!1003 = !DILocation(line: 447, column: 5, scope: !1004)
!1004 = !DILexicalBlockFile(scope: !996, file: !1, discriminator: 5)
!1005 = !DILocation(line: 447, column: 5, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !1007, file: !1, discriminator: 6)
!1007 = distinct !DILexicalBlock(scope: !996, file: !1, line: 447, column: 5)
!1008 = !DILocation(line: 447, column: 5, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !996, file: !1, discriminator: 7)
!1010 = !DILocation(line: 448, column: 5, scope: !993)
!1011 = !DILocation(line: 448, column: 13, scope: !993)
!1012 = !DILocation(line: 448, column: 26, scope: !993)
!1013 = !DILocation(line: 448, column: 29, scope: !993)
!1014 = !DILocation(line: 448, column: 37, scope: !993)
!1015 = !DILocation(line: 449, column: 5, scope: !993)
!1016 = !DILocation(line: 449, column: 13, scope: !993)
!1017 = !DILocation(line: 449, column: 25, scope: !993)
!1018 = !DILocation(line: 450, column: 3, scope: !993)
!1019 = !DILocation(line: 452, column: 32, scope: !613)
!1020 = !DILocation(line: 452, column: 3, scope: !613)
!1021 = !DILocation(line: 453, column: 23, scope: !613)
!1022 = !DILocation(line: 453, column: 3, scope: !613)
!1023 = !DILocation(line: 455, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !613, file: !1, line: 455, column: 7)
!1025 = !DILocation(line: 455, column: 15, scope: !1024)
!1026 = !DILocation(line: 455, column: 7, scope: !613)
!1027 = !DILocation(line: 461, column: 5, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 455, column: 29)
!1029 = !DILocation(line: 461, column: 5, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1031, file: !1, discriminator: 1)
!1031 = distinct !DILexicalBlock(scope: !1028, file: !1, line: 461, column: 5)
!1032 = !DILocation(line: 461, column: 5, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1031, file: !1, discriminator: 2)
!1034 = !DILocation(line: 461, column: 5, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1031, file: !1, discriminator: 3)
!1036 = !DILocation(line: 461, column: 5, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1031, file: !1, discriminator: 4)
!1038 = !DILocation(line: 461, column: 5, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1031, file: !1, discriminator: 5)
!1040 = !DILocation(line: 461, column: 5, scope: !1041)
!1041 = !DILexicalBlockFile(scope: !1042, file: !1, discriminator: 6)
!1042 = distinct !DILexicalBlock(scope: !1031, file: !1, line: 461, column: 5)
!1043 = !DILocation(line: 461, column: 5, scope: !1044)
!1044 = !DILexicalBlockFile(scope: !1031, file: !1, discriminator: 7)
!1045 = !DILocation(line: 462, column: 5, scope: !1028)
!1046 = !DILocation(line: 462, column: 13, scope: !1028)
!1047 = !DILocation(line: 462, column: 27, scope: !1028)
!1048 = !DILocation(line: 462, column: 30, scope: !1028)
!1049 = !DILocation(line: 462, column: 38, scope: !1028)
!1050 = !DILocation(line: 463, column: 5, scope: !1028)
!1051 = !DILocation(line: 463, column: 13, scope: !1028)
!1052 = !DILocation(line: 463, column: 26, scope: !1028)
!1053 = !DILocation(line: 464, column: 3, scope: !1028)
!1054 = !DILocation(line: 466, column: 3, scope: !613)
!1055 = !DILocation(line: 466, column: 3, scope: !979)
!1056 = !DILocation(line: 466, column: 3, scope: !981)
!1057 = !DILocation(line: 466, column: 3, scope: !983)
!1058 = !DILocation(line: 467, column: 1, scope: !613)
!1059 = !DILocalVariable(name: "stream", arg: 1, scope: !660, file: !1, line: 929, type: !395)
!1060 = !DILocation(line: 929, column: 46, scope: !660)
!1061 = !DILocalVariable(name: "req", scope: !660, file: !1, line: 930, type: !380)
!1062 = !DILocation(line: 930, column: 15, scope: !660)
!1063 = !DILocalVariable(name: "q", scope: !660, file: !1, line: 931, type: !375)
!1064 = !DILocation(line: 931, column: 10, scope: !660)
!1065 = !DILocation(line: 933, column: 3, scope: !660)
!1066 = !DILocation(line: 933, column: 11, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !660, file: !1, discriminator: 1)
!1068 = !DILocation(line: 933, column: 10, scope: !1067)
!1069 = !DILocation(line: 933, column: 3, scope: !1067)
!1070 = !DILocation(line: 935, column: 9, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !660, file: !1, line: 933, column: 56)
!1072 = !DILocation(line: 935, column: 7, scope: !1071)
!1073 = !DILocation(line: 936, column: 11, scope: !1071)
!1074 = !DILocation(line: 936, column: 9, scope: !1071)
!1075 = !DILocation(line: 937, column: 5, scope: !1071)
!1076 = !DILocation(line: 937, column: 5, scope: !1077)
!1077 = !DILexicalBlockFile(scope: !1078, file: !1, discriminator: 1)
!1078 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 937, column: 5)
!1079 = !DILocation(line: 938, column: 5, scope: !1071)
!1080 = !DILocation(line: 938, column: 5, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 1)
!1082 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 938, column: 5)
!1083 = !DILocation(line: 938, column: 5, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 2)
!1085 = !DILocation(line: 938, column: 5, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 3)
!1087 = !DILocation(line: 938, column: 5, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 4)
!1089 = !DILocation(line: 938, column: 5, scope: !1090)
!1090 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 5)
!1091 = !DILocation(line: 938, column: 5, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1093, file: !1, discriminator: 6)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 938, column: 5)
!1094 = !DILocation(line: 938, column: 5, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 7)
!1096 = !DILocation(line: 940, column: 9, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 940, column: 9)
!1098 = !DILocation(line: 940, column: 14, scope: !1097)
!1099 = !DILocation(line: 940, column: 19, scope: !1097)
!1100 = !DILocation(line: 940, column: 9, scope: !1071)
!1101 = !DILocation(line: 941, column: 54, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1097, file: !1, line: 940, column: 28)
!1103 = !DILocation(line: 941, column: 35, scope: !1102)
!1104 = !DILocation(line: 941, column: 7, scope: !1102)
!1105 = !DILocation(line: 941, column: 15, scope: !1102)
!1106 = !DILocation(line: 941, column: 32, scope: !1102)
!1107 = !DILocation(line: 942, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1102, file: !1, line: 942, column: 11)
!1109 = !DILocation(line: 942, column: 16, scope: !1108)
!1110 = !DILocation(line: 942, column: 24, scope: !1108)
!1111 = !DILocation(line: 942, column: 29, scope: !1108)
!1112 = !DILocation(line: 942, column: 21, scope: !1108)
!1113 = !DILocation(line: 942, column: 11, scope: !1102)
!1114 = !DILocation(line: 943, column: 18, scope: !1108)
!1115 = !DILocation(line: 943, column: 23, scope: !1108)
!1116 = !DILocation(line: 943, column: 9, scope: !1108)
!1117 = !DILocation(line: 944, column: 7, scope: !1102)
!1118 = !DILocation(line: 944, column: 12, scope: !1102)
!1119 = !DILocation(line: 944, column: 17, scope: !1102)
!1120 = !DILocation(line: 945, column: 5, scope: !1102)
!1121 = !DILocation(line: 948, column: 9, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 948, column: 9)
!1123 = !DILocation(line: 948, column: 14, scope: !1122)
!1124 = !DILocation(line: 948, column: 9, scope: !1071)
!1125 = !DILocation(line: 949, column: 7, scope: !1122)
!1126 = !DILocation(line: 949, column: 12, scope: !1122)
!1127 = !DILocation(line: 949, column: 15, scope: !1122)
!1128 = !DILocation(line: 949, column: 20, scope: !1122)
!1129 = !DILocation(line: 949, column: 25, scope: !1122)
!1130 = !DILocation(line: 933, column: 3, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !660, file: !1, discriminator: 2)
!1132 = !DILocation(line: 952, column: 3, scope: !660)
!1133 = !DILocation(line: 952, column: 3, scope: !1067)
!1134 = !DILocation(line: 952, column: 3, scope: !1131)
!1135 = !DILocation(line: 952, column: 3, scope: !1136)
!1136 = !DILexicalBlockFile(scope: !660, file: !1, discriminator: 3)
!1137 = !DILocation(line: 953, column: 1, scope: !660)
!1138 = !DILocalVariable(name: "loop", arg: 1, scope: !616, file: !1, line: 512, type: !175)
!1139 = !DILocation(line: 512, column: 31, scope: !616)
!1140 = !DILocalVariable(name: "w", arg: 2, scope: !616, file: !1, line: 512, type: !196)
!1141 = !DILocation(line: 512, column: 47, scope: !616)
!1142 = !DILocalVariable(name: "events", arg: 3, scope: !616, file: !1, line: 512, type: !181)
!1143 = !DILocation(line: 512, column: 63, scope: !616)
!1144 = !DILocalVariable(name: "stream", scope: !616, file: !1, line: 513, type: !395)
!1145 = !DILocation(line: 513, column: 16, scope: !616)
!1146 = !DILocalVariable(name: "err", scope: !616, file: !1, line: 514, type: !191)
!1147 = !DILocation(line: 514, column: 7, scope: !616)
!1148 = !DILocation(line: 516, column: 12, scope: !616)
!1149 = !DILocation(line: 516, column: 10, scope: !616)
!1150 = !DILocation(line: 517, column: 3, scope: !616)
!1151 = !DILocation(line: 517, column: 3, scope: !1152)
!1152 = !DILexicalBlockFile(scope: !616, file: !1, discriminator: 1)
!1153 = !DILocation(line: 517, column: 3, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !616, file: !1, discriminator: 2)
!1155 = !DILocation(line: 517, column: 3, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !616, file: !1, discriminator: 3)
!1157 = !DILocation(line: 518, column: 3, scope: !616)
!1158 = !DILocation(line: 518, column: 3, scope: !1152)
!1159 = !DILocation(line: 518, column: 3, scope: !1154)
!1160 = !DILocation(line: 518, column: 3, scope: !1156)
!1161 = !DILocation(line: 519, column: 3, scope: !616)
!1162 = !DILocation(line: 519, column: 3, scope: !1152)
!1163 = !DILocation(line: 519, column: 3, scope: !1154)
!1164 = !DILocation(line: 519, column: 3, scope: !1156)
!1165 = !DILocation(line: 521, column: 16, scope: !616)
!1166 = !DILocation(line: 521, column: 24, scope: !616)
!1167 = !DILocation(line: 521, column: 31, scope: !616)
!1168 = !DILocation(line: 521, column: 39, scope: !616)
!1169 = !DILocation(line: 521, column: 3, scope: !616)
!1170 = !DILocation(line: 526, column: 3, scope: !616)
!1171 = !DILocation(line: 526, column: 10, scope: !1152)
!1172 = !DILocation(line: 526, column: 32, scope: !1152)
!1173 = !DILocation(line: 526, column: 3, scope: !1152)
!1174 = !DILocation(line: 527, column: 5, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !616, file: !1, line: 526, column: 39)
!1176 = !DILocation(line: 527, column: 5, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1175, file: !1, discriminator: 1)
!1178 = !DILocation(line: 527, column: 5, scope: !1179)
!1179 = !DILexicalBlockFile(scope: !1175, file: !1, discriminator: 2)
!1180 = !DILocation(line: 527, column: 5, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1175, file: !1, discriminator: 3)
!1182 = !DILocation(line: 534, column: 22, scope: !1175)
!1183 = !DILocation(line: 534, column: 11, scope: !1175)
!1184 = !DILocation(line: 534, column: 9, scope: !1175)
!1185 = !DILocation(line: 535, column: 9, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1175, file: !1, line: 535, column: 9)
!1187 = !DILocation(line: 535, column: 13, scope: !1186)
!1188 = !DILocation(line: 535, column: 9, scope: !1175)
!1189 = !DILocation(line: 536, column: 11, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 536, column: 11)
!1191 = distinct !DILexicalBlock(scope: !1186, file: !1, line: 535, column: 18)
!1192 = !DILocation(line: 536, column: 15, scope: !1190)
!1193 = !DILocation(line: 536, column: 26, scope: !1190)
!1194 = !DILocation(line: 536, column: 29, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1190, file: !1, discriminator: 1)
!1196 = !DILocation(line: 536, column: 33, scope: !1195)
!1197 = !DILocation(line: 536, column: 11, scope: !1195)
!1198 = !DILocation(line: 537, column: 9, scope: !1190)
!1199 = !DILocation(line: 539, column: 11, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 539, column: 11)
!1201 = !DILocation(line: 539, column: 15, scope: !1200)
!1202 = !DILocation(line: 539, column: 11, scope: !1191)
!1203 = !DILocation(line: 540, column: 9, scope: !1200)
!1204 = !DILocation(line: 542, column: 11, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 542, column: 11)
!1206 = !DILocation(line: 542, column: 15, scope: !1205)
!1207 = !DILocation(line: 542, column: 26, scope: !1205)
!1208 = !DILocation(line: 542, column: 29, scope: !1209)
!1209 = !DILexicalBlockFile(scope: !1205, file: !1, discriminator: 1)
!1210 = !DILocation(line: 542, column: 33, scope: !1209)
!1211 = !DILocation(line: 542, column: 11, scope: !1209)
!1212 = !DILocation(line: 543, column: 32, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 542, column: 45)
!1214 = !DILocation(line: 543, column: 38, scope: !1213)
!1215 = !DILocation(line: 543, column: 15, scope: !1213)
!1216 = !DILocation(line: 543, column: 13, scope: !1213)
!1217 = !DILocation(line: 544, column: 13, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1213, file: !1, line: 544, column: 13)
!1219 = !DILocation(line: 544, column: 17, scope: !1218)
!1220 = !DILocation(line: 544, column: 28, scope: !1218)
!1221 = !DILocation(line: 544, column: 31, scope: !1222)
!1222 = !DILexicalBlockFile(scope: !1218, file: !1, discriminator: 1)
!1223 = !DILocation(line: 544, column: 35, scope: !1222)
!1224 = !DILocation(line: 544, column: 13, scope: !1222)
!1225 = !DILocation(line: 545, column: 11, scope: !1218)
!1226 = !DILocation(line: 546, column: 7, scope: !1213)
!1227 = !DILocation(line: 548, column: 7, scope: !1191)
!1228 = !DILocation(line: 548, column: 15, scope: !1191)
!1229 = !DILocation(line: 548, column: 29, scope: !1191)
!1230 = !DILocation(line: 548, column: 37, scope: !1191)
!1231 = !DILocation(line: 549, column: 7, scope: !1191)
!1232 = !DILocation(line: 553, column: 27, scope: !1175)
!1233 = !DILocation(line: 553, column: 5, scope: !1175)
