; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/tcp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }
%union.anon.0 = type { [4 x i8*] }
%union.pthread_rwlock_t = type { %struct.anon }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i32 }
%struct.uv_handle_s = type { i8*, %struct.uv_loop_s*, i32, {}*, [2 x i8*], %union.anon, %struct.uv_handle_s*, i32 }
%union.anon = type { [4 x i8*] }
%struct.anon.1 = type { i8*, i32 }

!13 = !DIEnumerator(name: "UV_NAMED_PIPE", value: 7)
!14 = !DIEnumerator(name: "UV_POLL", value: 8)
!15 = !DIEnumerator(name: "UV_PREPARE", value: 9)
!16 = !DIEnumerator(name: "UV_PROCESS", value: 10)
!17 = !DIEnumerator(name: "UV_STREAM", value: 11)
!18 = !DIEnumerator(name: "UV_TCP", value: 12)
!19 = !DIEnumerator(name: "UV_TIMER", value: 13)
!20 = !DIEnumerator(name: "UV_TTY", value: 14)
!21 = !DIEnumerator(name: "UV_UDP", value: 15)
!22 = !DIEnumerator(name: "UV_SIGNAL", value: 16)
!23 = !DIEnumerator(name: "UV_FILE", value: 17)
!24 = !DIEnumerator(name: "UV_HANDLE_TYPE_MAX", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 193, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!27 = !DIEnumerator(name: "UV_UNKNOWN_REQ", value: 0)
!28 = !DIEnumerator(name: "UV_REQ", value: 1)
!29 = !DIEnumerator(name: "UV_CONNECT", value: 2)
!30 = !DIEnumerator(name: "UV_WRITE", value: 3)
!31 = !DIEnumerator(name: "UV_SHUTDOWN", value: 4)
!32 = !DIEnumerator(name: "UV_UDP_SEND", value: 5)
!33 = !DIEnumerator(name: "UV_FS", value: 6)
!34 = !DIEnumerator(name: "UV_WORK", value: 7)
!35 = !DIEnumerator(name: "UV_GETADDRINFO", value: 8)
!36 = !DIEnumerator(name: "UV_GETNAMEINFO", value: 9)
!37 = !DIEnumerator(name: "UV_REQ_TYPE_MAX", value: 10)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uv_tcp_flags", file: !4, line: 531, size: 32, align: 32, elements: !39)
!39 = !{!40}
!40 = !DIEnumerator(name: "UV_TCP_IPV6ONLY", value: 1)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 124, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/internal.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!44 = !DIEnumerator(name: "UV_CLOSING", value: 1)
!45 = !DIEnumerator(name: "UV_CLOSED", value: 2)
!46 = !DIEnumerator(name: "UV_STREAM_READING", value: 4)
!47 = !DIEnumerator(name: "UV_STREAM_SHUTTING", value: 8)
!48 = !DIEnumerator(name: "UV_STREAM_SHUT", value: 16)
!49 = !DIEnumerator(name: "UV_STREAM_READABLE", value: 32)
!50 = !DIEnumerator(name: "UV_STREAM_WRITABLE", value: 64)
!51 = !DIEnumerator(name: "UV_STREAM_BLOCKING", value: 128)
!52 = !DIEnumerator(name: "UV_STREAM_READ_PARTIAL", value: 256)
!53 = !DIEnumerator(name: "UV_STREAM_READ_EOF", value: 512)
!54 = !DIEnumerator(name: "UV_TCP_NODELAY", value: 1024)
!55 = !DIEnumerator(name: "UV_TCP_KEEPALIVE", value: 2048)
!56 = !DIEnumerator(name: "UV_TCP_SINGLE_ACCEPT", value: 4096)
!57 = !DIEnumerator(name: "UV_HANDLE_IPV6", value: 65536)
!58 = !DIEnumerator(name: "UV_UDP_PROCESSING", value: 131072)
!59 = !DIEnumerator(name: "UV_HANDLE_BOUND", value: 262144)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 40, size: 32, align: 32, elements: !62)
!61 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!63 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!64 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!65 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!66 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!67 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!68 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!69 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!70 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!71 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!72 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!73 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!74 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!75 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!76 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!77 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!78 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!79 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!80 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!81 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!82 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!83 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!84 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!85 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!86 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!87 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !89, line: 24, size: 32, align: 32, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99}
!91 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!92 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!93 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!94 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!95 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!96 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!97 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!98 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!99 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!100 = !{!101, !392, !106, !396, !124}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_stream_t", file: !4, line: 206, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_stream_s", file: !4, line: 465, size: 1984, align: 64, elements: !104)
!104 = !{!105, !107, !313, !314, !315, !316, !321, !322, !323, !326, !338, !349, !366, !381, !382, !383, !384, !389, !390, !391}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !4, line: 466, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !103, file: !4, line: 466, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !111)
!111 = !{!112, !113, !115, !119, !120, !121, !123, !125, !126, !127, !146, !147, !148, !149, !180, !228, !252, !253, !254, !255, !256, !257, !258, !262, !263, !264, !269, !272, !273, !275, !276, !309, !310, !311, !312}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !4, line: 1475, baseType: !106, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !110, file: !4, line: 1477, baseType: !114, size: 32, align: 32, offset: 64)
!114 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !110, file: !4, line: 1478, baseType: !116, size: 128, align: 64, offset: 128)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, align: 64, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 2)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !110, file: !4, line: 1479, baseType: !116, size: 128, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !110, file: !4, line: 1481, baseType: !114, size: 32, align: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !4, line: 1482, baseType: !122, size: 64, align: 64, offset: 448)
!122 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !110, file: !4, line: 1482, baseType: !124, size: 32, align: 32, offset: 512)
!124 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !110, file: !4, line: 1482, baseType: !128, size: 64, align: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !131, line: 87, baseType: !132)
!131 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !131, line: 89, size: 448, align: 64, elements: !133)
!133 = !{!134, !141, !142, !143, !144, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !132, file: !131, line: 90, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !131, line: 84, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !139, !140, !114}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !132, file: !131, line: 91, baseType: !116, size: 128, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !132, file: !131, line: 92, baseType: !116, size: 128, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !132, file: !131, line: 93, baseType: !114, size: 32, align: 32, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !132, file: !131, line: 94, baseType: !114, size: 32, align: 32, offset: 352)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !132, file: !131, line: 95, baseType: !124, size: 32, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !110, file: !4, line: 1482, baseType: !114, size: 32, align: 32, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !110, file: !4, line: 1482, baseType: !114, size: 32, align: 32, offset: 928)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !110, file: !4, line: 1482, baseType: !150, size: 320, align: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !131, line: 129, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !152, line: 127, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!153 = !DICompositeType(tag: DW_TAG_union_type, file: !152, line: 90, size: 320, align: 64, elements: !154)
!154 = !{!155, !173, !178}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !153, file: !152, line: 124, baseType: !156, size: 320, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !152, line: 92, size: 320, align: 64, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !165, !166}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !156, file: !152, line: 94, baseType: !124, size: 32, align: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !156, file: !152, line: 95, baseType: !114, size: 32, align: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !156, file: !152, line: 96, baseType: !124, size: 32, align: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !156, file: !152, line: 98, baseType: !114, size: 32, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !156, file: !152, line: 102, baseType: !124, size: 32, align: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !156, file: !152, line: 104, baseType: !164, size: 16, align: 16, offset: 160)
!164 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !156, file: !152, line: 105, baseType: !164, size: 16, align: 16, offset: 176)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !156, file: !152, line: 106, baseType: !167, size: 128, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !152, line: 79, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !152, line: 75, size: 128, align: 64, elements: !169)
!169 = !{!170, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !168, file: !152, line: 77, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !168, file: !152, line: 78, baseType: !171, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !153, file: !152, line: 125, baseType: !174, size: 320, align: 8)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 320, align: 8, elements: !176)
!175 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!176 = !{!177}
!177 = !DISubrange(count: 40)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !153, file: !152, line: 126, baseType: !179, size: 64, align: 64)
!179 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !110, file: !4, line: 1482, baseType: !181, size: 1024, align: 64, offset: 1408)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !183)
!183 = !{!184, !185, !186, !188, !212, !213, !218, !219, !220, !226, !227}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !4, line: 768, baseType: !106, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !182, file: !4, line: 768, baseType: !108, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !4, line: 768, baseType: !187, size: 32, align: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !182, file: !4, line: 768, baseType: !189, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !210, !211}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !4, line: 426, baseType: !106, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !195, file: !4, line: 426, baseType: !108, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !4, line: 426, baseType: !187, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !195, file: !4, line: 426, baseType: !189, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !195, file: !4, line: 426, baseType: !116, size: 128, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !195, file: !4, line: 426, baseType: !203, size: 256, align: 64, offset: 384)
!203 = !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !4, line: 426, size: 256, align: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !203, file: !4, line: 426, baseType: !124, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !203, file: !4, line: 426, baseType: !207, size: 256, align: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 256, align: 64, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 4)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !195, file: !4, line: 426, baseType: !193, size: 64, align: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !4, line: 426, baseType: !114, size: 32, align: 32, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !182, file: !4, line: 768, baseType: !116, size: 128, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !182, file: !4, line: 768, baseType: !214, size: 256, align: 64, offset: 384)
!214 = !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !4, line: 768, size: 256, align: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !214, file: !4, line: 768, baseType: !124, size: 32, align: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !214, file: !4, line: 768, baseType: !207, size: 256, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !182, file: !4, line: 768, baseType: !193, size: 64, align: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !4, line: 768, baseType: !114, size: 32, align: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !182, file: !4, line: 769, baseType: !221, size: 64, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !182, file: !4, line: 769, baseType: !116, size: 128, align: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !182, file: !4, line: 769, baseType: !124, size: 32, align: 32, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !110, file: !4, line: 1482, baseType: !229, size: 448, align: 64, offset: 2432)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !131, line: 130, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !152, line: 213, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_union_type, file: !152, line: 173, size: 448, align: 64, elements: !232)
!232 = !{!233, !247, !251}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !231, file: !152, line: 192, baseType: !234, size: 448, align: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !152, line: 176, size: 448, align: 64, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !234, file: !152, line: 178, baseType: !124, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !234, file: !152, line: 179, baseType: !114, size: 32, align: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !234, file: !152, line: 180, baseType: !114, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !234, file: !152, line: 181, baseType: !114, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !234, file: !152, line: 182, baseType: !114, size: 32, align: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !234, file: !152, line: 183, baseType: !114, size: 32, align: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !234, file: !152, line: 184, baseType: !124, size: 32, align: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !234, file: !152, line: 185, baseType: !124, size: 32, align: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !234, file: !152, line: 186, baseType: !122, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !234, file: !152, line: 187, baseType: !122, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !234, file: !152, line: 190, baseType: !114, size: 32, align: 32, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !231, file: !152, line: 211, baseType: !248, size: 448, align: 8)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 448, align: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 56)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !231, file: !152, line: 212, baseType: !179, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !110, file: !4, line: 1482, baseType: !193, size: 64, align: 64, offset: 2880)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 2944)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 3072)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 3200)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 3328)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !110, file: !4, line: 1482, baseType: !116, size: 128, align: 64, offset: 3456)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !110, file: !4, line: 1482, baseType: !259, size: 64, align: 64, offset: 3584)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !110, file: !4, line: 1482, baseType: !130, size: 448, align: 64, offset: 3648)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !110, file: !4, line: 1482, baseType: !124, size: 32, align: 32, offset: 4096)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !110, file: !4, line: 1482, baseType: !265, size: 128, align: 64, offset: 4160)
!265 = !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !4, line: 1482, size: 128, align: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !265, file: !4, line: 1482, baseType: !106, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !265, file: !4, line: 1482, baseType: !114, size: 32, align: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !110, file: !4, line: 1482, baseType: !270, size: 64, align: 64, offset: 4288)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !271, line: 55, baseType: !122)
!271 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !110, file: !4, line: 1482, baseType: !270, size: 64, align: 64, offset: 4352)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !110, file: !4, line: 1482, baseType: !274, size: 64, align: 32, offset: 4416)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 64, align: 32, elements: !117)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !110, file: !4, line: 1482, baseType: !130, size: 448, align: 64, offset: 4480)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !110, file: !4, line: 1482, baseType: !277, size: 1216, align: 64, offset: 4928)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !290, !291, !292, !298, !299, !307, !308}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !4, line: 1326, baseType: !106, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !278, file: !4, line: 1326, baseType: !108, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !4, line: 1326, baseType: !187, size: 32, align: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !278, file: !4, line: 1326, baseType: !189, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !278, file: !4, line: 1326, baseType: !116, size: 128, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !278, file: !4, line: 1326, baseType: !286, size: 256, align: 64, offset: 384)
!286 = !DICompositeType(tag: DW_TAG_union_type, scope: !278, file: !4, line: 1326, size: 256, align: 64, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !286, file: !4, line: 1326, baseType: !124, size: 32, align: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !286, file: !4, line: 1326, baseType: !207, size: 256, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !278, file: !4, line: 1326, baseType: !193, size: 64, align: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !278, file: !4, line: 1326, baseType: !114, size: 32, align: 32, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !278, file: !4, line: 1327, baseType: !293, size: 64, align: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297, !124}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !278, file: !4, line: 1328, baseType: !124, size: 32, align: 32, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !278, file: !4, line: 1329, baseType: !300, size: 256, align: 64, offset: 896)
!300 = !DICompositeType(tag: DW_TAG_structure_type, scope: !278, file: !4, line: 1329, size: 256, align: 64, elements: !301)
!301 = !{!302, !304, !305, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !300, file: !4, line: 1329, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !300, file: !4, line: 1329, baseType: !303, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !300, file: !4, line: 1329, baseType: !303, size: 64, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !300, file: !4, line: 1329, baseType: !124, size: 32, align: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !278, file: !4, line: 1329, baseType: !114, size: 32, align: 32, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !278, file: !4, line: 1329, baseType: !114, size: 32, align: 32, offset: 1184)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !110, file: !4, line: 1482, baseType: !124, size: 32, align: 32, offset: 6144)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !110, file: !4, line: 1482, baseType: !130, size: 448, align: 64, offset: 6208)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !110, file: !4, line: 1482, baseType: !106, size: 64, align: 64, offset: 6656)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !110, file: !4, line: 1482, baseType: !124, size: 32, align: 32, offset: 6720)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !4, line: 466, baseType: !187, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !103, file: !4, line: 466, baseType: !189, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !103, file: !4, line: 466, baseType: !116, size: 128, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !103, file: !4, line: 466, baseType: !317, size: 256, align: 64, offset: 384)
!317 = !DICompositeType(tag: DW_TAG_union_type, scope: !103, file: !4, line: 466, size: 256, align: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !317, file: !4, line: 466, baseType: !124, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !317, file: !4, line: 466, baseType: !207, size: 256, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !103, file: !4, line: 466, baseType: !193, size: 64, align: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !103, file: !4, line: 466, baseType: !114, size: 32, align: 32, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !103, file: !4, line: 467, baseType: !324, size: 64, align: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !325, line: 62, baseType: !122)
!325 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !103, file: !4, line: 467, baseType: !327, size: 64, align: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_alloc_cb", file: !4, line: 296, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !193, !324, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !131, line: 119, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !131, line: 116, size: 128, align: 64, elements: !334)
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !333, file: !131, line: 117, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !333, file: !131, line: 118, baseType: !324, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !103, file: !4, line: 467, baseType: !339, size: 64, align: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_read_cb", file: !4, line: 299, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !101, !343, !347}
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !344, line: 102, baseType: !345)
!344 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !346, line: 172, baseType: !179)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !103, file: !4, line: 467, baseType: !350, size: 64, align: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_t", file: !4, line: 228, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_connect_s", file: !4, line: 551, size: 768, align: 64, elements: !353)
!353 = !{!354, !355, !357, !358, !359, !364, !365}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !4, line: 552, baseType: !106, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !4, line: 552, baseType: !356, size: 32, align: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !25)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !352, file: !4, line: 552, baseType: !116, size: 128, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !352, file: !4, line: 552, baseType: !207, size: 256, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !352, file: !4, line: 553, baseType: !360, size: 64, align: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connect_cb", file: !4, line: 303, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !350, !124}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !352, file: !4, line: 554, baseType: !101, size: 64, align: 64, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !352, file: !4, line: 555, baseType: !116, size: 128, align: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !103, file: !4, line: 467, baseType: !367, size: 64, align: 64, offset: 1024)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_t", file: !4, line: 226, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_shutdown_s", file: !4, line: 401, size: 640, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !4, line: 402, baseType: !106, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !4, line: 402, baseType: !356, size: 32, align: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !369, file: !4, line: 402, baseType: !116, size: 128, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !369, file: !4, line: 402, baseType: !207, size: 256, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !369, file: !4, line: 403, baseType: !101, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !369, file: !4, line: 404, baseType: !377, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_shutdown_cb", file: !4, line: 304, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !367, !124}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !103, file: !4, line: 467, baseType: !130, size: 448, align: 64, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !103, file: !4, line: 467, baseType: !116, size: 128, align: 64, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !103, file: !4, line: 467, baseType: !116, size: 128, align: 64, offset: 1664)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !103, file: !4, line: 467, baseType: !385, size: 64, align: 64, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_connection_cb", file: !4, line: 305, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !101, !124}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !103, file: !4, line: 467, baseType: !124, size: 32, align: 32, offset: 1856)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !103, file: !4, line: 467, baseType: !124, size: 32, align: 32, offset: 1888)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !103, file: !4, line: 467, baseType: !106, size: 64, align: 64, offset: 1920)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !395, line: 21, baseType: !116)
!395 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !397, line: 33, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !346, line: 189, baseType: !114)
!399 = !{!400, !432, !435, !450, !453, !457, !464, !465, !468, !471, !474, !477, !480, !481, !484}
!400 = distinct !DISubprogram(name: "uv_tcp_init_ex", scope: !1, file: !1, line: 55, type: !401, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!401 = !DISubroutineType(types: !402)
!402 = !{!124, !108, !403, !114}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_tcp_t", file: !4, line: 207, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_tcp_s", file: !4, line: 516, size: 1984, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !4, line: 517, baseType: !106, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !405, file: !4, line: 517, baseType: !108, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !4, line: 517, baseType: !187, size: 32, align: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !405, file: !4, line: 517, baseType: !189, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !405, file: !4, line: 517, baseType: !116, size: 128, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !405, file: !4, line: 517, baseType: !413, size: 256, align: 64, offset: 384)
!413 = !DICompositeType(tag: DW_TAG_union_type, scope: !405, file: !4, line: 517, size: 256, align: 64, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !413, file: !4, line: 517, baseType: !124, size: 32, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !413, file: !4, line: 517, baseType: !207, size: 256, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !405, file: !4, line: 517, baseType: !193, size: 64, align: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !4, line: 517, baseType: !114, size: 32, align: 32, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue_size", scope: !405, file: !4, line: 518, baseType: !324, size: 64, align: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !405, file: !4, line: 518, baseType: !327, size: 64, align: 64, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !405, file: !4, line: 518, baseType: !339, size: 64, align: 64, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "connect_req", scope: !405, file: !4, line: 518, baseType: !350, size: 64, align: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_req", scope: !405, file: !4, line: 518, baseType: !367, size: 64, align: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !405, file: !4, line: 518, baseType: !130, size: 448, align: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !405, file: !4, line: 518, baseType: !116, size: 128, align: 64, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !405, file: !4, line: 518, baseType: !116, size: 128, align: 64, offset: 1664)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "connection_cb", scope: !405, file: !4, line: 518, baseType: !385, size: 64, align: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_error", scope: !405, file: !4, line: 518, baseType: !124, size: 32, align: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "accepted_fd", scope: !405, file: !4, line: 518, baseType: !124, size: 32, align: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "queued_fds", scope: !405, file: !4, line: 518, baseType: !106, size: 64, align: 64, offset: 1920)
!431 = !{}
!432 = distinct !DISubprogram(name: "uv_tcp_init", scope: !1, file: !1, line: 84, type: !433, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!433 = !DISubroutineType(types: !434)
!434 = !{!124, !108, !403}
!435 = distinct !DISubprogram(name: "uv__tcp_bind", scope: !1, file: !1, line: 89, type: !436, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!436 = !DISubroutineType(types: !437)
!437 = !{!124, !403, !438, !114, !114}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !397, line: 149, size: 128, align: 16, elements: !441)
!441 = !{!442, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !440, file: !397, line: 151, baseType: !443, size: 16, align: 16)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !444, line: 28, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!445 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !440, file: !397, line: 152, baseType: !447, size: 112, align: 8, offset: 16)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 112, align: 8, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 14)
!450 = distinct !DISubprogram(name: "uv__tcp_connect", scope: !1, file: !1, line: 145, type: !451, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!451 = !DISubroutineType(types: !452)
!452 = !{!124, !350, !403, !438, !114, !360}
!453 = distinct !DISubprogram(name: "uv_tcp_open", scope: !1, file: !1, line: 204, type: !454, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!454 = !DISubroutineType(types: !455)
!455 = !{!124, !403, !456}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_os_sock_t", file: !131, line: 122, baseType: !124)
!457 = distinct !DISubprogram(name: "uv_tcp_getsockname", scope: !1, file: !1, line: 217, type: !458, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!458 = !DISubroutineType(types: !459)
!459 = !{!124, !460, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!464 = distinct !DISubprogram(name: "uv_tcp_getpeername", scope: !1, file: !1, line: 239, type: !458, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!465 = distinct !DISubprogram(name: "uv_tcp_listen", scope: !1, file: !1, line: 261, type: !466, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!466 = !DISubroutineType(types: !467)
!467 = !{!124, !403, !124, !385}
!468 = distinct !DISubprogram(name: "uv__tcp_nodelay", scope: !1, file: !1, line: 315, type: !469, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!469 = !DISubroutineType(types: !470)
!470 = !{!124, !124, !124}
!471 = distinct !DISubprogram(name: "uv__tcp_keepalive", scope: !1, file: !1, line: 322, type: !472, isLocal: false, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!472 = !DISubroutineType(types: !473)
!473 = !{!124, !124, !124, !114}
!474 = distinct !DISubprogram(name: "uv_tcp_nodelay", scope: !1, file: !1, line: 344, type: !475, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!475 = !DISubroutineType(types: !476)
!476 = !{!124, !403, !124}
!477 = distinct !DISubprogram(name: "uv_tcp_keepalive", scope: !1, file: !1, line: 362, type: !478, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!478 = !DISubroutineType(types: !479)
!479 = !{!124, !403, !124, !114}
!480 = distinct !DISubprogram(name: "uv_tcp_simultaneous_accepts", scope: !1, file: !1, line: 384, type: !475, isLocal: false, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!481 = distinct !DISubprogram(name: "uv__tcp_close", scope: !1, file: !1, line: 393, type: !482, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !403}
!484 = distinct !DISubprogram(name: "maybe_new_socket", scope: !1, file: !1, line: 31, type: !485, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, variables: !431)
!485 = !DISubroutineType(types: !486)
!486 = !{!124, !403, !124, !124}
!487 = !{!488}
