; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmlibuv/src/unix/udp.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.in6_addr = type { %union.anon.5 }
%union.anon.5 = type { [4 x i32] }
%struct.uv_udp_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.4, %struct.uv_handle_s*, i32, i64, i64, void (%struct.uv_handle_s*, i64, %struct.uv_buf_t*)*, void (%struct.uv_udp_s*, i64, %struct.uv_buf_t*, %struct.sockaddr*, i32)*, %struct.uv__io_s, [2 x i8*], [2 x i8*] }
%struct.uv_loop_s = type { i8*, i32, [2 x i8*], [2 x i8*], i32, i64, i32, [2 x i8*], [2 x i8*], %struct.uv__io_s**, i32, i32, [2 x i8*], %union.pthread_mutex_t, %struct.uv_async_s, %union.pthread_rwlock_t, %struct.uv_handle_s*, [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], [2 x i8*], void ()*, %struct.uv__io_s, i32, %struct.anon.1, i64, i64, [2 x i32], %struct.uv__io_s, %struct.uv_signal_s, i32, %struct.uv__io_s, i8*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.uv_async_s = type { i8*, %struct.uv_loop_s*, i32, void (%struct.uv_handle_s*)*, [2 x i8*], %union.anon.0, %struct.uv_handle_s*, i32, void (%struct.uv_async_s*)*, [2 x i8*], i32 }

!135 = !DIEnumerator(name: "UV_EAI_SOCKTYPE", value: -3011)
!136 = !DIEnumerator(name: "UV_EALREADY", value: -114)
!137 = !DIEnumerator(name: "UV_EBADF", value: -9)
!138 = !DIEnumerator(name: "UV_EBUSY", value: -16)
!139 = !DIEnumerator(name: "UV_ECANCELED", value: -125)
!140 = !DIEnumerator(name: "UV_ECHARSET", value: -4080)
!141 = !DIEnumerator(name: "UV_ECONNABORTED", value: -103)
!142 = !DIEnumerator(name: "UV_ECONNREFUSED", value: -111)
!143 = !DIEnumerator(name: "UV_ECONNRESET", value: -104)
!144 = !DIEnumerator(name: "UV_EDESTADDRREQ", value: -89)
!145 = !DIEnumerator(name: "UV_EEXIST", value: -17)
!146 = !DIEnumerator(name: "UV_EFAULT", value: -14)
!147 = !DIEnumerator(name: "UV_EFBIG", value: -27)
!148 = !DIEnumerator(name: "UV_EHOSTUNREACH", value: -113)
!149 = !DIEnumerator(name: "UV_EINTR", value: -4)
!150 = !DIEnumerator(name: "UV_EINVAL", value: -22)
!151 = !DIEnumerator(name: "UV_EIO", value: -5)
!152 = !DIEnumerator(name: "UV_EISCONN", value: -106)
!153 = !DIEnumerator(name: "UV_EISDIR", value: -21)
!154 = !DIEnumerator(name: "UV_ELOOP", value: -40)
!155 = !DIEnumerator(name: "UV_EMFILE", value: -24)
!156 = !DIEnumerator(name: "UV_EMSGSIZE", value: -90)
!157 = !DIEnumerator(name: "UV_ENAMETOOLONG", value: -36)
!158 = !DIEnumerator(name: "UV_ENETDOWN", value: -100)
!159 = !DIEnumerator(name: "UV_ENETUNREACH", value: -101)
!160 = !DIEnumerator(name: "UV_ENFILE", value: -23)
!161 = !DIEnumerator(name: "UV_ENOBUFS", value: -105)
!162 = !DIEnumerator(name: "UV_ENODEV", value: -19)
!163 = !DIEnumerator(name: "UV_ENOENT", value: -2)
!164 = !DIEnumerator(name: "UV_ENOMEM", value: -12)
!165 = !DIEnumerator(name: "UV_ENONET", value: -64)
!166 = !DIEnumerator(name: "UV_ENOPROTOOPT", value: -92)
!167 = !DIEnumerator(name: "UV_ENOSPC", value: -28)
!168 = !DIEnumerator(name: "UV_ENOSYS", value: -38)
!169 = !DIEnumerator(name: "UV_ENOTCONN", value: -107)
!170 = !DIEnumerator(name: "UV_ENOTDIR", value: -20)
!171 = !DIEnumerator(name: "UV_ENOTEMPTY", value: -39)
!172 = !DIEnumerator(name: "UV_ENOTSOCK", value: -88)
!173 = !DIEnumerator(name: "UV_ENOTSUP", value: -95)
!174 = !DIEnumerator(name: "UV_EPERM", value: -1)
!175 = !DIEnumerator(name: "UV_EPIPE", value: -32)
!176 = !DIEnumerator(name: "UV_EPROTO", value: -71)
!177 = !DIEnumerator(name: "UV_EPROTONOSUPPORT", value: -93)
!178 = !DIEnumerator(name: "UV_EPROTOTYPE", value: -91)
!179 = !DIEnumerator(name: "UV_ERANGE", value: -34)
!180 = !DIEnumerator(name: "UV_EROFS", value: -30)
!181 = !DIEnumerator(name: "UV_ESHUTDOWN", value: -108)
!182 = !DIEnumerator(name: "UV_ESPIPE", value: -29)
!183 = !DIEnumerator(name: "UV_ESRCH", value: -3)
!184 = !DIEnumerator(name: "UV_ETIMEDOUT", value: -110)
!185 = !DIEnumerator(name: "UV_ETXTBSY", value: -26)
!186 = !DIEnumerator(name: "UV_EXDEV", value: -18)
!187 = !DIEnumerator(name: "UV_UNKNOWN", value: -4094)
!188 = !DIEnumerator(name: "UV_EOF", value: -4095)
!189 = !DIEnumerator(name: "UV_ENXIO", value: -6)
!190 = !DIEnumerator(name: "UV_EMLINK", value: -31)
!191 = !DIEnumerator(name: "UV_EHOSTDOWN", value: -112)
!192 = !DIEnumerator(name: "UV_ERRNO_MAX", value: -4096)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !194, line: 171, size: 32, align: 32, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215}
!196 = !DIEnumerator(name: "MSG_OOB", value: 1)
!197 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!198 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!199 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!200 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!201 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!202 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!203 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!204 = !DIEnumerator(name: "MSG_EOR", value: 128)
!205 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!206 = !DIEnumerator(name: "MSG_FIN", value: 512)
!207 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!208 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!209 = !DIEnumerator(name: "MSG_RST", value: 4096)
!210 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!211 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!212 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!213 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!214 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!215 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!216 = !{!217, !225, !227, !469, !222, !518, !519, !328, !525, !543, !536, !565, !259, !240, !482}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUEUE", file: !220, line: 21, baseType: !221)
!220 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/src/queue.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, align: 64, elements: !223)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!223 = !{!224}
!224 = !DISubrange(count: 2)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_send_t", file: !4, line: 229, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_udp_send_s", file: !4, line: 606, size: 2560, align: 64, elements: !230)
!230 = !{!231, !232, !234, !235, !239, !497, !502, !503, !512, !513, !514, !515, !516}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !4, line: 607, baseType: !222, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !4, line: 607, baseType: !233, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_req_type", file: !4, line: 200, baseType: !33)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_queue", scope: !229, file: !4, line: 607, baseType: !221, size: 128, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !229, file: !4, line: 607, baseType: !236, size: 256, align: 64, offset: 256)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, align: 64, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 4)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !229, file: !4, line: 608, baseType: !240, size: 64, align: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_t", file: !4, line: 208, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_udp_s", file: !4, line: 590, size: 1728, align: 64, elements: !243)
!243 = !{!244, !245, !445, !446, !447, !448, !453, !454, !455, !458, !459, !471, !494, !495, !496}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !4, line: 591, baseType: !222, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !242, file: !4, line: 591, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_loop_t", file: !4, line: 204, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_loop_s", file: !4, line: 1473, size: 6784, align: 64, elements: !249)
!249 = !{!250, !251, !253, !254, !255, !256, !258, !260, !261, !262, !281, !282, !283, !284, !315, !360, !384, !385, !386, !387, !388, !389, !390, !394, !395, !396, !401, !404, !405, !407, !408, !441, !442, !443, !444}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !4, line: 1475, baseType: !222, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "active_handles", scope: !248, file: !4, line: 1477, baseType: !252, size: 32, align: 32, offset: 64)
!252 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !248, file: !4, line: 1478, baseType: !221, size: 128, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "active_reqs", scope: !248, file: !4, line: 1479, baseType: !221, size: 128, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "stop_flag", scope: !248, file: !4, line: 1481, baseType: !252, size: 32, align: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !4, line: 1482, baseType: !257, size: 64, align: 64, offset: 448)
!257 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "backend_fd", scope: !248, file: !4, line: 1482, baseType: !259, size: 32, align: 32, offset: 512)
!259 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "watchers", scope: !248, file: !4, line: 1482, baseType: !263, size: 64, align: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_t", file: !266, line: 87, baseType: !267)
!266 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmlibuv/include/uv-unix.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv__io_s", file: !266, line: 89, size: 448, align: 64, elements: !268)
!268 = !{!269, !276, !277, !278, !279, !280}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !267, file: !266, line: 90, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv__io_cb", file: !266, line: 84, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !274, !275, !252}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pending_queue", scope: !267, file: !266, line: 91, baseType: !221, size: 128, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "watcher_queue", scope: !267, file: !266, line: 92, baseType: !221, size: 128, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pevents", scope: !267, file: !266, line: 93, baseType: !252, size: 32, align: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !267, file: !266, line: 94, baseType: !252, size: 32, align: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !267, file: !266, line: 95, baseType: !259, size: 32, align: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nwatchers", scope: !248, file: !4, line: 1482, baseType: !252, size: 32, align: 32, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !248, file: !4, line: 1482, baseType: !252, size: 32, align: 32, offset: 928)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "wq_mutex", scope: !248, file: !4, line: 1482, baseType: !285, size: 320, align: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_mutex_t", file: !266, line: 129, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !287, line: 127, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!288 = !DICompositeType(tag: DW_TAG_union_type, file: !287, line: 90, size: 320, align: 64, elements: !289)
!289 = !{!290, !308, !313}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !288, file: !287, line: 124, baseType: !291, size: 320, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !287, line: 92, size: 320, align: 64, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !300, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !291, file: !287, line: 94, baseType: !259, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !291, file: !287, line: 95, baseType: !252, size: 32, align: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !291, file: !287, line: 96, baseType: !259, size: 32, align: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !291, file: !287, line: 98, baseType: !252, size: 32, align: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !291, file: !287, line: 102, baseType: !259, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !291, file: !287, line: 104, baseType: !299, size: 16, align: 16, offset: 160)
!299 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !291, file: !287, line: 105, baseType: !299, size: 16, align: 16, offset: 176)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !291, file: !287, line: 106, baseType: !302, size: 128, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !287, line: 79, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !287, line: 75, size: 128, align: 64, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !303, file: !287, line: 77, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !303, file: !287, line: 78, baseType: !306, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !288, file: !287, line: 125, baseType: !309, size: 320, align: 8)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 320, align: 8, elements: !311)
!310 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!311 = !{!312}
!312 = !DISubrange(count: 40)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !288, file: !287, line: 126, baseType: !314, size: 64, align: 64)
!314 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "wq_async", scope: !248, file: !4, line: 1482, baseType: !316, size: 1024, align: 64, offset: 1408)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_t", file: !4, line: 216, baseType: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_async_s", file: !4, line: 767, size: 1024, align: 64, elements: !318)
!318 = !{!319, !320, !321, !323, !344, !345, !350, !351, !352, !358, !359}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !4, line: 768, baseType: !222, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !317, file: !4, line: 768, baseType: !246, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !4, line: 768, baseType: !322, size: 32, align: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_type", file: !4, line: 191, baseType: !3)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !317, file: !4, line: 768, baseType: !324, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_close_cb", file: !4, line: 306, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_handle_t", file: !4, line: 205, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_handle_s", file: !4, line: 425, size: 768, align: 64, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !342, !343}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !4, line: 426, baseType: !222, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !330, file: !4, line: 426, baseType: !246, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !4, line: 426, baseType: !322, size: 32, align: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !330, file: !4, line: 426, baseType: !324, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !330, file: !4, line: 426, baseType: !221, size: 128, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !330, file: !4, line: 426, baseType: !338, size: 256, align: 64, offset: 384)
!338 = !DICompositeType(tag: DW_TAG_union_type, scope: !330, file: !4, line: 426, size: 256, align: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !338, file: !4, line: 426, baseType: !259, size: 32, align: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !338, file: !4, line: 426, baseType: !236, size: 256, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !330, file: !4, line: 426, baseType: !328, size: 64, align: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !4, line: 426, baseType: !252, size: 32, align: 32, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !317, file: !4, line: 768, baseType: !221, size: 128, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !317, file: !4, line: 768, baseType: !346, size: 256, align: 64, offset: 384)
!346 = !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !4, line: 768, size: 256, align: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !346, file: !4, line: 768, baseType: !259, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !346, file: !4, line: 768, baseType: !236, size: 256, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !317, file: !4, line: 768, baseType: !328, size: 64, align: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !4, line: 768, baseType: !252, size: 32, align: 32, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "async_cb", scope: !317, file: !4, line: 769, baseType: !353, size: 64, align: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_async_cb", file: !4, line: 309, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !317, file: !4, line: 769, baseType: !221, size: 128, align: 64, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !317, file: !4, line: 769, baseType: !259, size: 32, align: 32, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cloexec_lock", scope: !248, file: !4, line: 1482, baseType: !361, size: 448, align: 64, offset: 2432)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_rwlock_t", file: !266, line: 130, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !287, line: 213, baseType: !363)
!363 = !DICompositeType(tag: DW_TAG_union_type, file: !287, line: 173, size: 448, align: 64, elements: !364)
!364 = !{!365, !379, !383}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !363, file: !287, line: 192, baseType: !366, size: 448, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !287, line: 176, size: 448, align: 64, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !366, file: !287, line: 178, baseType: !259, size: 32, align: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !366, file: !287, line: 179, baseType: !252, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !366, file: !287, line: 180, baseType: !252, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !366, file: !287, line: 181, baseType: !252, size: 32, align: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !366, file: !287, line: 182, baseType: !252, size: 32, align: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !366, file: !287, line: 183, baseType: !252, size: 32, align: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !366, file: !287, line: 184, baseType: !259, size: 32, align: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !366, file: !287, line: 185, baseType: !259, size: 32, align: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !366, file: !287, line: 186, baseType: !257, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !366, file: !287, line: 187, baseType: !257, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !366, file: !287, line: 190, baseType: !252, size: 32, align: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !363, file: !287, line: 211, baseType: !380, size: 448, align: 8)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 448, align: 8, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 56)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !363, file: !287, line: 212, baseType: !314, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "closing_handles", scope: !248, file: !4, line: 1482, baseType: !328, size: 64, align: 64, offset: 2880)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "process_handles", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 2944)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_handles", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 3072)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "check_handles", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 3200)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "idle_handles", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 3328)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "async_handles", scope: !248, file: !4, line: 1482, baseType: !221, size: 128, align: 64, offset: 3456)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "async_unused", scope: !248, file: !4, line: 1482, baseType: !391, size: 64, align: 64, offset: 3584)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "async_io_watcher", scope: !248, file: !4, line: 1482, baseType: !265, size: 448, align: 64, offset: 3648)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "async_wfd", scope: !248, file: !4, line: 1482, baseType: !259, size: 32, align: 32, offset: 4096)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "timer_heap", scope: !248, file: !4, line: 1482, baseType: !397, size: 128, align: 64, offset: 4160)
!397 = !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !4, line: 1482, size: 128, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !397, file: !4, line: 1482, baseType: !222, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !397, file: !4, line: 1482, baseType: !252, size: 32, align: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "timer_counter", scope: !248, file: !4, line: 1482, baseType: !402, size: 64, align: 64, offset: 4288)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !403, line: 55, baseType: !257)
!403 = !DIFile(filename: "/usr/include/stdint.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !248, file: !4, line: 1482, baseType: !402, size: 64, align: 64, offset: 4352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "signal_pipefd", scope: !248, file: !4, line: 1482, baseType: !406, size: 64, align: 32, offset: 4416)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 64, align: 32, elements: !223)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "signal_io_watcher", scope: !248, file: !4, line: 1482, baseType: !265, size: 448, align: 64, offset: 4480)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "child_watcher", scope: !248, file: !4, line: 1482, baseType: !409, size: 1216, align: 64, offset: 4928)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_t", file: !4, line: 220, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_signal_s", file: !4, line: 1325, size: 1216, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !422, !423, !424, !430, !431, !439, !440}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !4, line: 1326, baseType: !222, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !410, file: !4, line: 1326, baseType: !246, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !4, line: 1326, baseType: !322, size: 32, align: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !410, file: !4, line: 1326, baseType: !324, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !410, file: !4, line: 1326, baseType: !221, size: 128, align: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !410, file: !4, line: 1326, baseType: !418, size: 256, align: 64, offset: 384)
!418 = !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !4, line: 1326, size: 256, align: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !418, file: !4, line: 1326, baseType: !259, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !418, file: !4, line: 1326, baseType: !236, size: 256, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !410, file: !4, line: 1326, baseType: !328, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !410, file: !4, line: 1326, baseType: !252, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "signal_cb", scope: !410, file: !4, line: 1327, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_signal_cb", file: !4, line: 362, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429, !259}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !410, file: !4, line: 1328, baseType: !259, size: 32, align: 32, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tree_entry", scope: !410, file: !4, line: 1329, baseType: !432, size: 256, align: 64, offset: 896)
!432 = !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !4, line: 1329, size: 256, align: 64, elements: !433)
!433 = !{!434, !436, !437, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_left", scope: !432, file: !4, line: 1329, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_right", scope: !432, file: !4, line: 1329, baseType: !435, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_parent", scope: !432, file: !4, line: 1329, baseType: !435, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rbe_color", scope: !432, file: !4, line: 1329, baseType: !259, size: 32, align: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "caught_signals", scope: !410, file: !4, line: 1329, baseType: !252, size: 32, align: 32, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dispatched_signals", scope: !410, file: !4, line: 1329, baseType: !252, size: 32, align: 32, offset: 1184)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "emfile_fd", scope: !248, file: !4, line: 1482, baseType: !259, size: 32, align: 32, offset: 6144)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_read_watcher", scope: !248, file: !4, line: 1482, baseType: !265, size: 448, align: 64, offset: 6208)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_watchers", scope: !248, file: !4, line: 1482, baseType: !222, size: 64, align: 64, offset: 6656)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "inotify_fd", scope: !248, file: !4, line: 1482, baseType: !259, size: 32, align: 32, offset: 6720)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !4, line: 591, baseType: !322, size: 32, align: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "close_cb", scope: !242, file: !4, line: 591, baseType: !324, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "handle_queue", scope: !242, file: !4, line: 591, baseType: !221, size: 128, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !242, file: !4, line: 591, baseType: !449, size: 256, align: 64, offset: 384)
!449 = !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !4, line: 591, size: 256, align: 64, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !449, file: !4, line: 591, baseType: !259, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !449, file: !4, line: 591, baseType: !236, size: 256, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next_closing", scope: !242, file: !4, line: 591, baseType: !328, size: 64, align: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !242, file: !4, line: 591, baseType: !252, size: 32, align: 32, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_size", scope: !242, file: !4, line: 597, baseType: !456, size: 64, align: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !457, line: 62, baseType: !257)
!457 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "send_queue_count", scope: !242, file: !4, line: 601, baseType: !456, size: 64, align: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_cb", scope: !242, file: !4, line: 602, baseType: !460, size: 64, align: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_alloc_cb", file: !4, line: 296, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !328, !456, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_buf_t", file: !266, line: 119, baseType: !466)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "uv_buf_t", file: !266, line: 116, size: 128, align: 64, elements: !467)
!467 = !{!468, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !466, file: !266, line: 117, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !466, file: !266, line: 118, baseType: !456, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "recv_cb", scope: !242, file: !4, line: 602, baseType: !472, size: 64, align: 64, offset: 960)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_recv_cb", file: !4, line: 583, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !240, !476, !480, !482, !252}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !477, line: 102, baseType: !478)
!477 = !DIFile(filename: "/usr/include/stdio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !479, line: 172, baseType: !314)
!479 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !194, line: 149, size: 128, align: 16, elements: !485)
!485 = !{!486, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !484, file: !194, line: 151, baseType: !487, size: 16, align: 16)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !488, line: 28, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!489 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !484, file: !194, line: 152, baseType: !491, size: 112, align: 8, offset: 16)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 112, align: 8, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 14)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "io_watcher", scope: !242, file: !4, line: 602, baseType: !265, size: 448, align: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write_queue", scope: !242, file: !4, line: 602, baseType: !221, size: 128, align: 64, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "write_completed_queue", scope: !242, file: !4, line: 602, baseType: !221, size: 128, align: 64, offset: 1600)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !229, file: !4, line: 609, baseType: !498, size: 64, align: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_udp_send_cb", file: !4, line: 582, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !227, !259}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !229, file: !4, line: 610, baseType: !221, size: 128, align: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !229, file: !4, line: 610, baseType: !504, size: 1024, align: 64, offset: 768)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !194, line: 162, size: 1024, align: 64, elements: !505)
!505 = !{!506, !507, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !504, file: !194, line: 164, baseType: !487, size: 16, align: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !504, file: !194, line: 165, baseType: !257, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !504, file: !194, line: 166, baseType: !509, size: 896, align: 8, offset: 128)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 896, align: 8, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 112)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "nbufs", scope: !229, file: !4, line: 610, baseType: !252, size: 32, align: 32, offset: 1792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !229, file: !4, line: 610, baseType: !464, size: 64, align: 64, offset: 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !229, file: !4, line: 610, baseType: !476, size: 64, align: 64, offset: 1920)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "send_cb", scope: !229, file: !4, line: 610, baseType: !498, size: 64, align: 64, offset: 1984)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bufsml", scope: !229, file: !4, line: 610, baseType: !517, size: 512, align: 64, offset: 2048)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 512, align: 64, elements: !237)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !521, line: 43, size: 128, align: 64, elements: !522)
!521 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "/data/download/cmake/cmake-master/Utilities/cmlibuv")
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !520, file: !521, line: 45, baseType: !222, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !520, file: !521, line: 46, baseType: !456, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !64, line: 237, size: 128, align: 32, elements: !527)
!527 = !{!528, !529, !532, !538}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !526, file: !64, line: 239, baseType: !487, size: 16, align: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !526, file: !64, line: 240, baseType: !530, size: 16, align: 16, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !64, line: 117, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !403, line: 49, baseType: !489)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !526, file: !64, line: 241, baseType: !533, size: 32, align: 32, offset: 32)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !64, line: 31, size: 32, align: 32, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !533, file: !64, line: 33, baseType: !536, size: 32, align: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !64, line: 30, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !403, line: 51, baseType: !252)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !526, file: !64, line: 244, baseType: !539, size: 64, align: 8, offset: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 64, align: 8, elements: !541)
!540 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!541 = !{!542}
!542 = !DISubrange(count: 8)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !64, line: 252, size: 224, align: 32, elements: !545)
!545 = !{!546, !547, !548, !549, !564}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !544, file: !64, line: 254, baseType: !487, size: 16, align: 16)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !544, file: !64, line: 255, baseType: !530, size: 16, align: 16, offset: 16)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !544, file: !64, line: 256, baseType: !537, size: 32, align: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !544, file: !64, line: 257, baseType: !550, size: 128, align: 32, offset: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !64, line: 209, size: 128, align: 32, elements: !551)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !550, file: !64, line: 218, baseType: !553, size: 128, align: 32)
!553 = !DICompositeType(tag: DW_TAG_union_type, scope: !550, file: !64, line: 211, size: 128, align: 32, elements: !554)
!554 = !{!555, !560, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !553, file: !64, line: 213, baseType: !556, size: 128, align: 8)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 128, align: 8, elements: !558)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !403, line: 48, baseType: !540)
!558 = !{!559}
!559 = !DISubrange(count: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !553, file: !64, line: 215, baseType: !561, size: 128, align: 16)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 128, align: 16, elements: !541)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !553, file: !64, line: 216, baseType: !563, size: 128, align: 32)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 128, align: 32, elements: !237)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !544, file: !64, line: 258, baseType: !537, size: 32, align: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !194, line: 33, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !479, line: 189, baseType: !252)
!567 = !{!568, !572, !573, !576, !579, !582, !585, !588, !592, !598, !601, !602, !603, !604, !607, !613, !616, !619, !620, !623, !626, !627, !630, !631, !636, !641, !644}
!568 = distinct !DISubprogram(name: "uv__udp_close", scope: !1, file: !1, line: 52, type: !569, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !240}
!571 = !{}
!572 = distinct !DISubprogram(name: "uv__udp_finish_close", scope: !1, file: !1, line: 63, type: !569, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!573 = distinct !DISubprogram(name: "uv__udp_bind", scope: !1, file: !1, line: 282, type: !574, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!574 = !DISubroutineType(types: !575)
!575 = !{!259, !240, !482, !252, !252}
!576 = distinct !DISubprogram(name: "uv__udp_send", scope: !1, file: !1, line: 384, type: !577, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!577 = !DISubroutineType(types: !578)
!578 = !{!259, !227, !240, !480, !252, !482, !252, !498}
!579 = distinct !DISubprogram(name: "uv__udp_try_send", scope: !1, file: !1, line: 445, type: !580, isLocal: false, isDefinition: true, scopeLine: 449, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!580 = !DISubroutineType(types: !581)
!581 = !{!259, !240, !480, !252, !482, !252}
!582 = distinct !DISubprogram(name: "uv_udp_init_ex", scope: !1, file: !1, line: 579, type: !583, isLocal: false, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!583 = !DISubroutineType(types: !584)
!584 = !{!259, !246, !240, !252}
!585 = distinct !DISubprogram(name: "uv_udp_init", scope: !1, file: !1, line: 613, type: !586, isLocal: false, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!586 = !DISubroutineType(types: !587)
!587 = !{!259, !246, !240}
!588 = distinct !DISubprogram(name: "uv_udp_open", scope: !1, file: !1, line: 618, type: !589, isLocal: false, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!589 = !DISubroutineType(types: !590)
!590 = !{!259, !240, !591}
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_os_sock_t", file: !266, line: 122, baseType: !259)
!592 = distinct !DISubprogram(name: "uv_udp_set_membership", scope: !1, file: !1, line: 638, type: !593, isLocal: false, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!593 = !DISubroutineType(types: !594)
!594 = !{!259, !240, !595, !595, !597}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "uv_membership", file: !4, line: 368, baseType: !110)
!598 = distinct !DISubprogram(name: "uv_udp_set_broadcast", scope: !1, file: !1, line: 705, type: !599, isLocal: false, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!599 = !DISubroutineType(types: !600)
!600 = !{!259, !240, !259}
!601 = distinct !DISubprogram(name: "uv_udp_set_ttl", scope: !1, file: !1, line: 718, type: !599, isLocal: false, isDefinition: true, scopeLine: 718, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!602 = distinct !DISubprogram(name: "uv_udp_set_multicast_ttl", scope: !1, file: !1, line: 751, type: !599, isLocal: false, isDefinition: true, scopeLine: 751, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!603 = distinct !DISubprogram(name: "uv_udp_set_multicast_loop", scope: !1, file: !1, line: 774, type: !599, isLocal: false, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!604 = distinct !DISubprogram(name: "uv_udp_set_multicast_interface", scope: !1, file: !1, line: 796, type: !605, isLocal: false, isDefinition: true, scopeLine: 796, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!605 = !DISubroutineType(types: !606)
!606 = !{!259, !240, !595}
!607 = distinct !DISubprogram(name: "uv_udp_getsockname", scope: !1, file: !1, line: 846, type: !608, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!608 = !DISubroutineType(types: !609)
!609 = !{!259, !610, !518, !612}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!613 = distinct !DISubprogram(name: "uv__udp_recv_start", scope: !1, file: !1, line: 865, type: !614, isLocal: false, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!614 = !DISubroutineType(types: !615)
!615 = !{!259, !240, !460, !472}
!616 = distinct !DISubprogram(name: "uv__udp_recv_stop", scope: !1, file: !1, line: 890, type: !617, isLocal: false, isDefinition: true, scopeLine: 890, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!617 = !DISubroutineType(types: !618)
!618 = !{!259, !240}
!619 = distinct !DISubprogram(name: "uv__udp_run_completed", scope: !1, file: !1, line: 91, type: !569, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!620 = distinct !DISubprogram(name: "uv__set_reuse", scope: !1, file: !1, line: 265, type: !621, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!621 = !DISubroutineType(types: !622)
!622 = !{!259, !259}
!623 = distinct !DISubprogram(name: "uv__udp_maybe_deferred_bind", scope: !1, file: !1, line: 343, type: !624, isLocal: true, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!624 = !DISubroutineType(types: !625)
!625 = !{!259, !240, !259, !252}
!626 = distinct !DISubprogram(name: "uv__udp_sendmsg", scope: !1, file: !1, line: 216, type: !569, isLocal: true, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!627 = distinct !DISubprogram(name: "uv__udp_io", scope: !1, file: !1, line: 135, type: !628, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !246, !264, !252}
!630 = distinct !DISubprogram(name: "uv__udp_recvmsg", scope: !1, file: !1, line: 151, type: !569, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!631 = distinct !DISubprogram(name: "uv__udp_set_membership4", scope: !1, file: !1, line: 485, type: !632, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!632 = !DISubroutineType(types: !633)
!633 = !{!259, !240, !634, !595, !597}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!636 = distinct !DISubprogram(name: "uv__udp_set_membership6", scope: !1, file: !1, line: 532, type: !637, isLocal: true, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!637 = !DISubroutineType(types: !638)
!638 = !{!259, !240, !639, !595, !597}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!641 = distinct !DISubprogram(name: "uv__setsockopt_maybe_char", scope: !1, file: !1, line: 686, type: !642, isLocal: true, isDefinition: true, scopeLine: 689, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!642 = !DISubroutineType(types: !643)
!643 = !{!259, !240, !259, !259, !259}
!644 = distinct !DISubprogram(name: "uv__setsockopt", scope: !1, file: !1, line: 661, type: !645, isLocal: true, isDefinition: true, scopeLine: 665, flags: DIFlagPrototyped, isOptimized: false, variables: !571)
!645 = !DISubroutineType(types: !646)
!646 = !{!259, !240, !259, !259, !647, !456}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!649 = !{i32 2, !"Dwarf Version", i32 4}
!650 = !{i32 2, !"Debug Info Version", i32 3}
!651 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!652 = !DILocalVariable(name: "handle", arg: 1, scope: !568, file: !1, line: 52, type: !240)
!653 = !DIExpression()
!654 = !DILocation(line: 52, column: 30, scope: !568)
!655 = !DILocation(line: 53, column: 16, scope: !568)
!656 = !DILocation(line: 53, column: 24, scope: !568)
!657 = !DILocation(line: 53, column: 31, scope: !568)
!658 = !DILocation(line: 53, column: 39, scope: !568)
!659 = !DILocation(line: 53, column: 3, scope: !568)
!660 = !DILocation(line: 54, column: 3, scope: !568)
!661 = !DILocation(line: 54, column: 3, scope: !662)
!662 = !DILexicalBlockFile(scope: !663, file: !1, discriminator: 1)
!663 = distinct !DILexicalBlock(scope: !568, file: !1, line: 54, column: 3)
!664 = !DILocation(line: 54, column: 3, scope: !665)
!665 = !DILexicalBlockFile(scope: !663, file: !1, discriminator: 2)
!666 = !DILocation(line: 54, column: 3, scope: !667)
!667 = !DILexicalBlockFile(scope: !663, file: !1, discriminator: 3)
!668 = !DILocation(line: 54, column: 3, scope: !669)
!669 = !DILexicalBlockFile(scope: !663, file: !1, discriminator: 4)
!670 = !DILocation(line: 54, column: 3, scope: !671)
!671 = !DILexicalBlockFile(scope: !672, file: !1, discriminator: 5)
!672 = distinct !DILexicalBlock(scope: !663, file: !1, line: 54, column: 3)
!673 = !DILocation(line: 54, column: 3, scope: !674)
!674 = !DILexicalBlockFile(scope: !672, file: !1, discriminator: 6)
!675 = !DILocation(line: 54, column: 3, scope: !676)
!676 = !DILexicalBlockFile(scope: !663, file: !1, discriminator: 7)
!677 = !DILocation(line: 54, column: 3, scope: !678)
!678 = !DILexicalBlockFile(scope: !679, file: !1, discriminator: 8)
!679 = distinct !DILexicalBlock(scope: !663, file: !1, line: 54, column: 3)
!680 = !DILocation(line: 54, column: 3, scope: !681)
!681 = !DILexicalBlockFile(scope: !682, file: !1, discriminator: 9)
!682 = distinct !DILexicalBlock(scope: !679, file: !1, line: 54, column: 3)
!683 = !DILocation(line: 54, column: 3, scope: !684)
!684 = !DILexicalBlockFile(scope: !682, file: !1, discriminator: 10)
!685 = !DILocation(line: 54, column: 3, scope: !686)
!686 = !DILexicalBlockFile(scope: !663, file: !1, discriminator: 11)
!687 = !DILocation(line: 56, column: 7, scope: !688)
!688 = distinct !DILexicalBlock(scope: !568, file: !1, line: 56, column: 7)
!689 = !DILocation(line: 56, column: 15, scope: !688)
!690 = !DILocation(line: 56, column: 26, scope: !688)
!691 = !DILocation(line: 56, column: 29, scope: !688)
!692 = !DILocation(line: 56, column: 7, scope: !568)
!693 = !DILocation(line: 57, column: 15, scope: !694)
!694 = distinct !DILexicalBlock(scope: !688, file: !1, line: 56, column: 36)
!695 = !DILocation(line: 57, column: 23, scope: !694)
!696 = !DILocation(line: 57, column: 34, scope: !694)
!697 = !DILocation(line: 57, column: 5, scope: !694)
!698 = !DILocation(line: 58, column: 5, scope: !694)
!699 = !DILocation(line: 58, column: 13, scope: !694)
!700 = !DILocation(line: 58, column: 24, scope: !694)
!701 = !DILocation(line: 58, column: 27, scope: !694)
!702 = !DILocation(line: 59, column: 3, scope: !694)
!703 = !DILocation(line: 60, column: 1, scope: !568)
!704 = !DILocalVariable(name: "handle", arg: 1, scope: !572, file: !1, line: 63, type: !240)
!705 = !DILocation(line: 63, column: 37, scope: !572)
!706 = !DILocalVariable(name: "req", scope: !572, file: !1, line: 64, type: !227)
!707 = !DILocation(line: 64, column: 18, scope: !572)
!708 = !DILocalVariable(name: "q", scope: !572, file: !1, line: 65, type: !226)
!709 = !DILocation(line: 65, column: 10, scope: !572)
!710 = !DILocation(line: 67, column: 3, scope: !572)
!711 = !DILocation(line: 67, column: 3, scope: !712)
!712 = !DILexicalBlockFile(scope: !572, file: !1, discriminator: 1)
!713 = !DILocation(line: 67, column: 3, scope: !714)
!714 = !DILexicalBlockFile(scope: !572, file: !1, discriminator: 2)
!715 = !DILocation(line: 67, column: 3, scope: !716)
!716 = !DILexicalBlockFile(scope: !572, file: !1, discriminator: 3)
!717 = !DILocation(line: 68, column: 3, scope: !572)
!718 = !DILocation(line: 68, column: 3, scope: !712)
!719 = !DILocation(line: 68, column: 3, scope: !714)
!720 = !DILocation(line: 68, column: 3, scope: !716)
!721 = !DILocation(line: 70, column: 3, scope: !572)
!722 = !DILocation(line: 70, column: 11, scope: !712)
!723 = !DILocation(line: 70, column: 10, scope: !712)
!724 = !DILocation(line: 70, column: 3, scope: !712)
!725 = !DILocation(line: 71, column: 9, scope: !726)
!726 = distinct !DILexicalBlock(scope: !572, file: !1, line: 70, column: 46)
!727 = !DILocation(line: 71, column: 7, scope: !726)
!728 = !DILocation(line: 72, column: 5, scope: !726)
!729 = !DILocation(line: 72, column: 5, scope: !730)
!730 = !DILexicalBlockFile(scope: !731, file: !1, discriminator: 1)
!731 = distinct !DILexicalBlock(scope: !726, file: !1, line: 72, column: 5)
!732 = !DILocation(line: 74, column: 11, scope: !726)
!733 = !DILocation(line: 74, column: 9, scope: !726)
!734 = !DILocation(line: 75, column: 5, scope: !726)
!735 = !DILocation(line: 75, column: 10, scope: !726)
!736 = !DILocation(line: 75, column: 17, scope: !726)
!737 = !DILocation(line: 76, column: 5, scope: !726)
!738 = !DILocation(line: 76, column: 5, scope: !739)
!739 = !DILexicalBlockFile(scope: !740, file: !1, discriminator: 1)
!740 = distinct !DILexicalBlock(scope: !726, file: !1, line: 76, column: 5)
!741 = !DILocation(line: 70, column: 3, scope: !714)
!742 = !DILocation(line: 79, column: 25, scope: !572)
!743 = !DILocation(line: 79, column: 3, scope: !572)
!744 = !DILocation(line: 81, column: 3, scope: !572)
!745 = !DILocation(line: 81, column: 3, scope: !712)
!746 = !DILocation(line: 81, column: 3, scope: !714)
!747 = !DILocation(line: 81, column: 3, scope: !716)
!748 = !DILocation(line: 82, column: 3, scope: !572)
!749 = !DILocation(line: 82, column: 3, scope: !712)
!750 = !DILocation(line: 82, column: 3, scope: !714)
!751 = !DILocation(line: 82, column: 3, scope: !716)
!752 = !DILocation(line: 85, column: 3, scope: !572)
!753 = !DILocation(line: 85, column: 11, scope: !572)
!754 = !DILocation(line: 85, column: 19, scope: !572)
!755 = !DILocation(line: 86, column: 3, scope: !572)
!756 = !DILocation(line: 86, column: 11, scope: !572)
!757 = !DILocation(line: 86, column: 20, scope: !572)
!758 = !DILocation(line: 88, column: 1, scope: !572)
!759 = !DILocalVariable(name: "handle", arg: 1, scope: !619, file: !1, line: 91, type: !240)
!760 = !DILocation(line: 91, column: 45, scope: !619)
!761 = !DILocalVariable(name: "req", scope: !619, file: !1, line: 92, type: !227)
!762 = !DILocation(line: 92, column: 18, scope: !619)
!763 = !DILocalVariable(name: "q", scope: !619, file: !1, line: 93, type: !226)
!764 = !DILocation(line: 93, column: 10, scope: !619)
!765 = !DILocation(line: 95, column: 3, scope: !619)
!766 = !DILocation(line: 95, column: 3, scope: !767)
!767 = !DILexicalBlockFile(scope: !619, file: !1, discriminator: 1)
!768 = !DILocation(line: 95, column: 3, scope: !769)
!769 = !DILexicalBlockFile(scope: !619, file: !1, discriminator: 2)
!770 = !DILocation(line: 95, column: 3, scope: !771)
!771 = !DILexicalBlockFile(scope: !619, file: !1, discriminator: 3)
!772 = !DILocation(line: 96, column: 3, scope: !619)
!773 = !DILocation(line: 96, column: 11, scope: !619)
!774 = !DILocation(line: 96, column: 17, scope: !619)
!775 = !DILocation(line: 98, column: 3, scope: !619)
!776 = !DILocation(line: 98, column: 11, scope: !767)
!777 = !DILocation(line: 98, column: 10, scope: !767)
!778 = !DILocation(line: 98, column: 3, scope: !767)
!779 = !DILocation(line: 99, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !619, file: !1, line: 98, column: 56)
!781 = !DILocation(line: 99, column: 7, scope: !780)
!782 = !DILocation(line: 100, column: 5, scope: !780)
!783 = !DILocation(line: 100, column: 5, scope: !784)
!784 = !DILexicalBlockFile(scope: !785, file: !1, discriminator: 1)
!785 = distinct !DILexicalBlock(scope: !780, file: !1, line: 100, column: 5)
!786 = !DILocation(line: 102, column: 11, scope: !780)
!787 = !DILocation(line: 102, column: 9, scope: !780)
!788 = !DILocation(line: 103, column: 5, scope: !780)
!789 = !DILocation(line: 103, column: 5, scope: !790)
!790 = !DILexicalBlockFile(scope: !791, file: !1, discriminator: 1)
!791 = distinct !DILexicalBlock(scope: !780, file: !1, line: 103, column: 5)
!792 = !DILocation(line: 103, column: 5, scope: !793)
!793 = !DILexicalBlockFile(scope: !791, file: !1, discriminator: 2)
!794 = !DILocation(line: 103, column: 5, scope: !795)
!795 = !DILexicalBlockFile(scope: !791, file: !1, discriminator: 3)
!796 = !DILocation(line: 103, column: 5, scope: !797)
!797 = !DILexicalBlockFile(scope: !791, file: !1, discriminator: 4)
!798 = !DILocation(line: 103, column: 5, scope: !799)
!799 = !DILexicalBlockFile(scope: !791, file: !1, discriminator: 5)
!800 = !DILocation(line: 103, column: 5, scope: !801)
!801 = !DILexicalBlockFile(scope: !802, file: !1, discriminator: 6)
!802 = distinct !DILexicalBlock(scope: !791, file: !1, line: 103, column: 5)
!803 = !DILocation(line: 103, column: 5, scope: !804)
!804 = !DILexicalBlockFile(scope: !791, file: !1, discriminator: 7)
!805 = !DILocation(line: 105, column: 47, scope: !780)
!806 = !DILocation(line: 105, column: 52, scope: !780)
!807 = !DILocation(line: 105, column: 58, scope: !780)
!808 = !DILocation(line: 105, column: 63, scope: !780)
!809 = !DILocation(line: 105, column: 32, scope: !780)
!810 = !DILocation(line: 105, column: 5, scope: !780)
!811 = !DILocation(line: 105, column: 13, scope: !780)
!812 = !DILocation(line: 105, column: 29, scope: !780)
!813 = !DILocation(line: 106, column: 5, scope: !780)
!814 = !DILocation(line: 106, column: 13, scope: !780)
!815 = !DILocation(line: 106, column: 29, scope: !780)
!816 = !DILocation(line: 108, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !780, file: !1, line: 108, column: 9)
!818 = !DILocation(line: 108, column: 14, scope: !817)
!819 = !DILocation(line: 108, column: 22, scope: !817)
!820 = !DILocation(line: 108, column: 27, scope: !817)
!821 = !DILocation(line: 108, column: 19, scope: !817)
!822 = !DILocation(line: 108, column: 9, scope: !780)
!823 = !DILocation(line: 109, column: 16, scope: !817)
!824 = !DILocation(line: 109, column: 21, scope: !817)
!825 = !DILocation(line: 109, column: 7, scope: !817)
!826 = !DILocation(line: 110, column: 5, scope: !780)
!827 = !DILocation(line: 110, column: 10, scope: !780)
!828 = !DILocation(line: 110, column: 15, scope: !780)
!829 = !DILocation(line: 112, column: 9, scope: !830)
!830 = distinct !DILexicalBlock(scope: !780, file: !1, line: 112, column: 9)
!831 = !DILocation(line: 112, column: 14, scope: !830)
!832 = !DILocation(line: 112, column: 22, scope: !830)
!833 = !DILocation(line: 112, column: 9, scope: !780)
!834 = !DILocation(line: 113, column: 7, scope: !830)
!835 = !DILocation(line: 118, column: 9, scope: !836)
!836 = distinct !DILexicalBlock(scope: !780, file: !1, line: 118, column: 9)
!837 = !DILocation(line: 118, column: 14, scope: !836)
!838 = !DILocation(line: 118, column: 21, scope: !836)
!839 = !DILocation(line: 118, column: 9, scope: !780)
!840 = !DILocation(line: 119, column: 7, scope: !836)
!841 = !DILocation(line: 119, column: 12, scope: !836)
!842 = !DILocation(line: 119, column: 20, scope: !836)
!843 = !DILocation(line: 121, column: 7, scope: !836)
!844 = !DILocation(line: 121, column: 12, scope: !836)
!845 = !DILocation(line: 121, column: 20, scope: !836)
!846 = !DILocation(line: 121, column: 25, scope: !836)
!847 = !DILocation(line: 121, column: 30, scope: !836)
!848 = !DILocation(line: 98, column: 3, scope: !769)
!849 = !DILocation(line: 124, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !619, file: !1, line: 124, column: 7)
!851 = !DILocation(line: 124, column: 7, scope: !619)
!852 = !DILocation(line: 126, column: 17, scope: !853)
!853 = distinct !DILexicalBlock(scope: !850, file: !1, line: 124, column: 42)
!854 = !DILocation(line: 126, column: 25, scope: !853)
!855 = !DILocation(line: 126, column: 32, scope: !853)
!856 = !DILocation(line: 126, column: 40, scope: !853)
!857 = !DILocation(line: 126, column: 5, scope: !853)
!858 = !DILocation(line: 127, column: 25, scope: !859)
!859 = distinct !DILexicalBlock(scope: !853, file: !1, line: 127, column: 9)
!860 = !DILocation(line: 127, column: 33, scope: !859)
!861 = !DILocation(line: 127, column: 10, scope: !859)
!862 = !DILocation(line: 127, column: 9, scope: !853)
!863 = !DILocation(line: 128, column: 7, scope: !859)
!864 = !DILocation(line: 128, column: 7, scope: !865)
!865 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 1)
!866 = distinct !DILexicalBlock(scope: !859, file: !1, line: 128, column: 7)
!867 = !DILocation(line: 128, column: 7, scope: !868)
!868 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 2)
!869 = !DILocation(line: 128, column: 7, scope: !870)
!870 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 3)
!871 = !DILocation(line: 128, column: 7, scope: !872)
!872 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 4)
!873 = !DILocation(line: 128, column: 7, scope: !874)
!874 = !DILexicalBlockFile(scope: !875, file: !1, discriminator: 5)
!875 = distinct !DILexicalBlock(scope: !866, file: !1, line: 128, column: 7)
!876 = !DILocation(line: 128, column: 7, scope: !877)
!877 = !DILexicalBlockFile(scope: !875, file: !1, discriminator: 6)
!878 = !DILocation(line: 128, column: 7, scope: !879)
!879 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 7)
!880 = !DILocation(line: 128, column: 7, scope: !881)
!881 = !DILexicalBlockFile(scope: !882, file: !1, discriminator: 8)
!882 = distinct !DILexicalBlock(scope: !866, file: !1, line: 128, column: 7)
!883 = !DILocation(line: 128, column: 7, scope: !884)
!884 = !DILexicalBlockFile(scope: !885, file: !1, discriminator: 9)
!885 = distinct !DILexicalBlock(scope: !882, file: !1, line: 128, column: 7)
!886 = !DILocation(line: 128, column: 7, scope: !887)
!887 = !DILexicalBlockFile(scope: !885, file: !1, discriminator: 10)
!888 = !DILocation(line: 128, column: 7, scope: !889)
!889 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 11)
!890 = !DILocation(line: 128, column: 7, scope: !891)
!891 = !DILexicalBlockFile(scope: !866, file: !1, discriminator: 12)
!892 = !DILocation(line: 129, column: 3, scope: !853)
!893 = !DILocation(line: 131, column: 3, scope: !619)
!894 = !DILocation(line: 131, column: 11, scope: !619)
!895 = !DILocation(line: 131, column: 17, scope: !619)
!896 = !DILocation(line: 132, column: 1, scope: !619)
!897 = !DILocalVariable(name: "handle", arg: 1, scope: !573, file: !1, line: 282, type: !240)
!898 = !DILocation(line: 282, column: 28, scope: !573)
!899 = !DILocalVariable(name: "addr", arg: 2, scope: !573, file: !1, line: 283, type: !482)
!900 = !DILocation(line: 283, column: 41, scope: !573)
!901 = !DILocalVariable(name: "addrlen", arg: 3, scope: !573, file: !1, line: 284, type: !252)
!902 = !DILocation(line: 284, column: 31, scope: !573)
!903 = !DILocalVariable(name: "flags", arg: 4, scope: !573, file: !1, line: 285, type: !252)
!904 = !DILocation(line: 285, column: 31, scope: !573)
!905 = !DILocalVariable(name: "err", scope: !573, file: !1, line: 286, type: !259)
!906 = !DILocation(line: 286, column: 7, scope: !573)
!907 = !DILocalVariable(name: "yes", scope: !573, file: !1, line: 287, type: !259)
!908 = !DILocation(line: 287, column: 7, scope: !573)
!909 = !DILocalVariable(name: "fd", scope: !573, file: !1, line: 288, type: !259)
!910 = !DILocation(line: 288, column: 7, scope: !573)
!911 = !DILocation(line: 291, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !573, file: !1, line: 291, column: 7)
!913 = !DILocation(line: 291, column: 13, scope: !912)
!914 = !DILocation(line: 291, column: 7, scope: !573)
!915 = !DILocation(line: 292, column: 5, scope: !912)
!916 = !DILocation(line: 295, column: 8, scope: !917)
!917 = distinct !DILexicalBlock(scope: !573, file: !1, line: 295, column: 7)
!918 = !DILocation(line: 295, column: 14, scope: !917)
!919 = !DILocation(line: 295, column: 33, scope: !917)
!920 = !DILocation(line: 295, column: 36, scope: !921)
!921 = !DILexicalBlockFile(scope: !917, file: !1, discriminator: 1)
!922 = !DILocation(line: 295, column: 42, scope: !921)
!923 = !DILocation(line: 295, column: 52, scope: !921)
!924 = !DILocation(line: 295, column: 7, scope: !921)
!925 = !DILocation(line: 296, column: 5, scope: !917)
!926 = !DILocation(line: 298, column: 8, scope: !573)
!927 = !DILocation(line: 298, column: 16, scope: !573)
!928 = !DILocation(line: 298, column: 27, scope: !573)
!929 = !DILocation(line: 298, column: 6, scope: !573)
!930 = !DILocation(line: 299, column: 7, scope: !931)
!931 = distinct !DILexicalBlock(scope: !573, file: !1, line: 299, column: 7)
!932 = !DILocation(line: 299, column: 10, scope: !931)
!933 = !DILocation(line: 299, column: 7, scope: !573)
!934 = !DILocation(line: 300, column: 22, scope: !935)
!935 = distinct !DILexicalBlock(scope: !931, file: !1, line: 299, column: 17)
!936 = !DILocation(line: 300, column: 28, scope: !935)
!937 = !DILocation(line: 300, column: 11, scope: !935)
!938 = !DILocation(line: 300, column: 9, scope: !935)
!939 = !DILocation(line: 301, column: 9, scope: !940)
!940 = distinct !DILexicalBlock(scope: !935, file: !1, line: 301, column: 9)
!941 = !DILocation(line: 301, column: 13, scope: !940)
!942 = !DILocation(line: 301, column: 9, scope: !935)
!943 = !DILocation(line: 302, column: 14, scope: !940)
!944 = !DILocation(line: 302, column: 7, scope: !940)
!945 = !DILocation(line: 303, column: 10, scope: !935)
!946 = !DILocation(line: 303, column: 8, scope: !935)
!947 = !DILocation(line: 304, column: 29, scope: !935)
!948 = !DILocation(line: 304, column: 5, scope: !935)
!949 = !DILocation(line: 304, column: 13, scope: !935)
!950 = !DILocation(line: 304, column: 24, scope: !935)
!951 = !DILocation(line: 304, column: 27, scope: !935)
!952 = !DILocation(line: 305, column: 3, scope: !935)
!953 = !DILocation(line: 307, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !573, file: !1, line: 307, column: 7)
!955 = !DILocation(line: 307, column: 13, scope: !954)
!956 = !DILocation(line: 307, column: 7, scope: !573)
!957 = !DILocation(line: 308, column: 25, scope: !958)
!958 = distinct !DILexicalBlock(scope: !954, file: !1, line: 307, column: 33)
!959 = !DILocation(line: 308, column: 11, scope: !958)
!960 = !DILocation(line: 308, column: 9, scope: !958)
!961 = !DILocation(line: 309, column: 9, scope: !962)
!962 = distinct !DILexicalBlock(scope: !958, file: !1, line: 309, column: 9)
!963 = !DILocation(line: 309, column: 9, scope: !958)
!964 = !DILocation(line: 310, column: 14, scope: !962)
!965 = !DILocation(line: 310, column: 7, scope: !962)
!966 = !DILocation(line: 311, column: 3, scope: !958)
!967 = !DILocation(line: 313, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !573, file: !1, line: 313, column: 7)
!969 = !DILocation(line: 313, column: 13, scope: !968)
!970 = !DILocation(line: 313, column: 7, scope: !573)
!971 = !DILocation(line: 315, column: 9, scope: !972)
!972 = distinct !DILexicalBlock(scope: !968, file: !1, line: 313, column: 32)
!973 = !DILocation(line: 316, column: 20, scope: !974)
!974 = distinct !DILexicalBlock(scope: !972, file: !1, line: 316, column: 9)
!975 = !DILocation(line: 316, column: 51, scope: !974)
!976 = !DILocation(line: 316, column: 9, scope: !974)
!977 = !DILocation(line: 316, column: 69, scope: !974)
!978 = !DILocation(line: 316, column: 9, scope: !972)
!979 = !DILocation(line: 317, column: 14, scope: !980)
!980 = distinct !DILexicalBlock(scope: !974, file: !1, line: 316, column: 76)
!981 = !DILocation(line: 317, column: 13, scope: !980)
!982 = !DILocation(line: 317, column: 11, scope: !980)
!983 = !DILocation(line: 318, column: 14, scope: !980)
!984 = !DILocation(line: 318, column: 7, scope: !980)
!985 = !DILocation(line: 324, column: 3, scope: !972)
!986 = !DILocation(line: 326, column: 12, scope: !987)
!987 = distinct !DILexicalBlock(scope: !573, file: !1, line: 326, column: 7)
!988 = !DILocation(line: 326, column: 16, scope: !987)
!989 = !DILocation(line: 326, column: 22, scope: !987)
!990 = !DILocation(line: 326, column: 7, scope: !987)
!991 = !DILocation(line: 326, column: 7, scope: !573)
!992 = !DILocation(line: 327, column: 12, scope: !993)
!993 = distinct !DILexicalBlock(scope: !987, file: !1, line: 326, column: 32)
!994 = !DILocation(line: 327, column: 11, scope: !993)
!995 = !DILocation(line: 327, column: 9, scope: !993)
!996 = !DILocation(line: 328, column: 9, scope: !997)
!997 = distinct !DILexicalBlock(scope: !993, file: !1, line: 328, column: 9)
!998 = !DILocation(line: 328, column: 15, scope: !997)
!999 = !DILocation(line: 328, column: 9, scope: !993)
!1000 = !DILocation(line: 331, column: 11, scope: !997)
!1001 = !DILocation(line: 331, column: 7, scope: !997)
!1002 = !DILocation(line: 332, column: 12, scope: !993)
!1003 = !DILocation(line: 332, column: 5, scope: !993)
!1004 = !DILocation(line: 335, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !573, file: !1, line: 335, column: 7)
!1006 = !DILocation(line: 335, column: 13, scope: !1005)
!1007 = !DILocation(line: 335, column: 23, scope: !1005)
!1008 = !DILocation(line: 335, column: 7, scope: !573)
!1009 = !DILocation(line: 336, column: 5, scope: !1005)
!1010 = !DILocation(line: 336, column: 13, scope: !1005)
!1011 = !DILocation(line: 336, column: 19, scope: !1005)
!1012 = !DILocation(line: 338, column: 3, scope: !573)
!1013 = !DILocation(line: 338, column: 11, scope: !573)
!1014 = !DILocation(line: 338, column: 17, scope: !573)
!1015 = !DILocation(line: 339, column: 3, scope: !573)
!1016 = !DILocation(line: 340, column: 1, scope: !573)
!1017 = !DILocalVariable(name: "fd", arg: 1, scope: !620, file: !1, line: 265, type: !259)
!1018 = !DILocation(line: 265, column: 30, scope: !620)
!1019 = !DILocalVariable(name: "yes", scope: !620, file: !1, line: 266, type: !259)
!1020 = !DILocation(line: 266, column: 7, scope: !620)
!1021 = !DILocation(line: 273, column: 7, scope: !620)
!1022 = !DILocation(line: 274, column: 18, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !620, file: !1, line: 274, column: 7)
!1024 = !DILocation(line: 274, column: 48, scope: !1023)
!1025 = !DILocation(line: 274, column: 7, scope: !1023)
!1026 = !DILocation(line: 274, column: 7, scope: !620)
!1027 = !DILocation(line: 275, column: 13, scope: !1023)
!1028 = !DILocation(line: 275, column: 12, scope: !1023)
!1029 = !DILocation(line: 275, column: 5, scope: !1023)
!1030 = !DILocation(line: 278, column: 3, scope: !620)
!1031 = !DILocation(line: 279, column: 1, scope: !620)
!1032 = !DILocalVariable(name: "req", arg: 1, scope: !576, file: !1, line: 384, type: !227)
!1033 = !DILocation(line: 384, column: 33, scope: !576)
!1034 = !DILocalVariable(name: "handle", arg: 2, scope: !576, file: !1, line: 385, type: !240)
!1035 = !DILocation(line: 385, column: 28, scope: !576)
!1036 = !DILocalVariable(name: "bufs", arg: 3, scope: !576, file: !1, line: 386, type: !480)
!1037 = !DILocation(line: 386, column: 33, scope: !576)
!1038 = !DILocalVariable(name: "nbufs", arg: 4, scope: !576, file: !1, line: 387, type: !252)
!1039 = !DILocation(line: 387, column: 31, scope: !576)
!1040 = !DILocalVariable(name: "addr", arg: 5, scope: !576, file: !1, line: 388, type: !482)
!1041 = !DILocation(line: 388, column: 41, scope: !576)
!1042 = !DILocalVariable(name: "addrlen", arg: 6, scope: !576, file: !1, line: 389, type: !252)
!1043 = !DILocation(line: 389, column: 31, scope: !576)
!1044 = !DILocalVariable(name: "send_cb", arg: 7, scope: !576, file: !1, line: 390, type: !498)
!1045 = !DILocation(line: 390, column: 33, scope: !576)
!1046 = !DILocalVariable(name: "err", scope: !576, file: !1, line: 391, type: !259)
!1047 = !DILocation(line: 391, column: 7, scope: !576)
!1048 = !DILocalVariable(name: "empty_queue", scope: !576, file: !1, line: 392, type: !259)
!1049 = !DILocation(line: 392, column: 7, scope: !576)
!1050 = !DILocation(line: 394, column: 3, scope: !576)
!1051 = !DILocation(line: 394, column: 3, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !576, file: !1, discriminator: 1)
!1053 = !DILocation(line: 394, column: 3, scope: !1054)
!1054 = !DILexicalBlockFile(scope: !576, file: !1, discriminator: 2)
!1055 = !DILocation(line: 394, column: 3, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !576, file: !1, discriminator: 3)
!1057 = !DILocation(line: 396, column: 37, scope: !576)
!1058 = !DILocation(line: 396, column: 45, scope: !576)
!1059 = !DILocation(line: 396, column: 51, scope: !576)
!1060 = !DILocation(line: 396, column: 9, scope: !576)
!1061 = !DILocation(line: 396, column: 7, scope: !576)
!1062 = !DILocation(line: 397, column: 7, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !576, file: !1, line: 397, column: 7)
!1064 = !DILocation(line: 397, column: 7, scope: !576)
!1065 = !DILocation(line: 398, column: 12, scope: !1063)
!1066 = !DILocation(line: 398, column: 5, scope: !1063)
!1067 = !DILocation(line: 404, column: 18, scope: !576)
!1068 = !DILocation(line: 404, column: 26, scope: !576)
!1069 = !DILocation(line: 404, column: 43, scope: !576)
!1070 = !DILocation(line: 404, column: 15, scope: !576)
!1071 = !DILocation(line: 406, column: 3, scope: !576)
!1072 = !DILocation(line: 406, column: 3, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1074, file: !1, discriminator: 1)
!1074 = distinct !DILexicalBlock(scope: !576, file: !1, line: 406, column: 3)
!1075 = !DILocation(line: 406, column: 3, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1077, file: !1, discriminator: 2)
!1077 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 406, column: 3)
!1078 = !DILocation(line: 406, column: 3, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1074, file: !1, discriminator: 3)
!1080 = !DILocation(line: 406, column: 3, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 4)
!1082 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 406, column: 3)
!1083 = !DILocation(line: 406, column: 3, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1085, file: !1, discriminator: 5)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 406, column: 3)
!1086 = !DILocation(line: 406, column: 3, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1082, file: !1, discriminator: 6)
!1088 = !DILocation(line: 406, column: 3, scope: !1089)
!1089 = !DILexicalBlockFile(scope: !1074, file: !1, discriminator: 7)
!1090 = !DILocation(line: 407, column: 3, scope: !576)
!1091 = !DILocation(line: 407, column: 3, scope: !1052)
!1092 = !DILocation(line: 407, column: 3, scope: !1054)
!1093 = !DILocation(line: 407, column: 3, scope: !1056)
!1094 = !DILocation(line: 408, column: 11, scope: !576)
!1095 = !DILocation(line: 408, column: 16, scope: !576)
!1096 = !DILocation(line: 408, column: 3, scope: !576)
!1097 = !DILocation(line: 408, column: 22, scope: !576)
!1098 = !DILocation(line: 408, column: 28, scope: !576)
!1099 = !DILocation(line: 409, column: 18, scope: !576)
!1100 = !DILocation(line: 409, column: 3, scope: !576)
!1101 = !DILocation(line: 409, column: 8, scope: !576)
!1102 = !DILocation(line: 409, column: 16, scope: !576)
!1103 = !DILocation(line: 410, column: 17, scope: !576)
!1104 = !DILocation(line: 410, column: 3, scope: !576)
!1105 = !DILocation(line: 410, column: 8, scope: !576)
!1106 = !DILocation(line: 410, column: 15, scope: !576)
!1107 = !DILocation(line: 411, column: 16, scope: !576)
!1108 = !DILocation(line: 411, column: 3, scope: !576)
!1109 = !DILocation(line: 411, column: 8, scope: !576)
!1110 = !DILocation(line: 411, column: 14, scope: !576)
!1111 = !DILocation(line: 413, column: 15, scope: !576)
!1112 = !DILocation(line: 413, column: 20, scope: !576)
!1113 = !DILocation(line: 413, column: 3, scope: !576)
!1114 = !DILocation(line: 413, column: 8, scope: !576)
!1115 = !DILocation(line: 413, column: 13, scope: !576)
!1116 = !DILocation(line: 414, column: 7, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !576, file: !1, line: 414, column: 7)
!1118 = !DILocation(line: 414, column: 13, scope: !1117)
!1119 = !DILocation(line: 414, column: 7, scope: !576)
!1120 = !DILocation(line: 415, column: 28, scope: !1117)
!1121 = !DILocation(line: 415, column: 34, scope: !1117)
!1122 = !DILocation(line: 415, column: 17, scope: !1117)
!1123 = !DILocation(line: 415, column: 5, scope: !1117)
!1124 = !DILocation(line: 415, column: 10, scope: !1117)
!1125 = !DILocation(line: 415, column: 15, scope: !1117)
!1126 = !DILocation(line: 417, column: 7, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !576, file: !1, line: 417, column: 7)
!1128 = !DILocation(line: 417, column: 12, scope: !1127)
!1129 = !DILocation(line: 417, column: 17, scope: !1127)
!1130 = !DILocation(line: 417, column: 7, scope: !576)
!1131 = !DILocation(line: 418, column: 5, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 417, column: 26)
!1133 = !DILocation(line: 418, column: 5, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1135, file: !1, discriminator: 1)
!1135 = distinct !DILexicalBlock(scope: !1132, file: !1, line: 418, column: 5)
!1136 = !DILocation(line: 418, column: 5, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1135, file: !1, discriminator: 2)
!1138 = !DILocation(line: 418, column: 5, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1135, file: !1, discriminator: 3)
!1140 = !DILocation(line: 418, column: 5, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1135, file: !1, discriminator: 4)
!1142 = !DILocation(line: 418, column: 5, scope: !1143)
!1143 = !DILexicalBlockFile(scope: !1135, file: !1, discriminator: 5)
!1144 = !DILocation(line: 418, column: 5, scope: !1145)
!1145 = !DILexicalBlockFile(scope: !1146, file: !1, discriminator: 6)
!1146 = distinct !DILexicalBlock(scope: !1135, file: !1, line: 418, column: 5)
!1147 = !DILocation(line: 418, column: 5, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1135, file: !1, discriminator: 7)
!1149 = !DILocation(line: 419, column: 5, scope: !1132)
!1150 = !DILocation(line: 422, column: 10, scope: !576)
!1151 = !DILocation(line: 422, column: 15, scope: !576)
!1152 = !DILocation(line: 422, column: 3, scope: !576)
!1153 = !DILocation(line: 422, column: 21, scope: !576)
!1154 = !DILocation(line: 422, column: 27, scope: !576)
!1155 = !DILocation(line: 422, column: 33, scope: !576)
!1156 = !DILocation(line: 423, column: 45, scope: !576)
!1157 = !DILocation(line: 423, column: 50, scope: !576)
!1158 = !DILocation(line: 423, column: 56, scope: !576)
!1159 = !DILocation(line: 423, column: 61, scope: !576)
!1160 = !DILocation(line: 423, column: 30, scope: !576)
!1161 = !DILocation(line: 423, column: 3, scope: !576)
!1162 = !DILocation(line: 423, column: 11, scope: !576)
!1163 = !DILocation(line: 423, column: 27, scope: !576)
!1164 = !DILocation(line: 424, column: 3, scope: !576)
!1165 = !DILocation(line: 424, column: 11, scope: !576)
!1166 = !DILocation(line: 424, column: 27, scope: !576)
!1167 = !DILocation(line: 425, column: 3, scope: !576)
!1168 = !DILocation(line: 425, column: 3, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1170, file: !1, discriminator: 1)
!1170 = distinct !DILexicalBlock(scope: !576, file: !1, line: 425, column: 3)
!1171 = !DILocation(line: 426, column: 3, scope: !576)
!1172 = !DILocation(line: 426, column: 3, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1174, file: !1, discriminator: 1)
!1174 = distinct !DILexicalBlock(scope: !576, file: !1, line: 426, column: 3)
!1175 = !DILocation(line: 426, column: 3, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1174, file: !1, discriminator: 2)
!1177 = !DILocation(line: 426, column: 3, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1174, file: !1, discriminator: 3)
!1179 = !DILocation(line: 426, column: 3, scope: !1180)
!1180 = !DILexicalBlockFile(scope: !1174, file: !1, discriminator: 4)
!1181 = !DILocation(line: 426, column: 3, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1183, file: !1, discriminator: 5)
!1183 = distinct !DILexicalBlock(scope: !1174, file: !1, line: 426, column: 3)
!1184 = !DILocation(line: 426, column: 3, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1183, file: !1, discriminator: 6)
!1186 = !DILocation(line: 426, column: 3, scope: !1187)
!1187 = !DILexicalBlockFile(scope: !1174, file: !1, discriminator: 7)
!1188 = !DILocation(line: 426, column: 3, scope: !1189)
!1189 = !DILexicalBlockFile(scope: !1190, file: !1, discriminator: 8)
!1190 = distinct !DILexicalBlock(scope: !1174, file: !1, line: 426, column: 3)
!1191 = !DILocation(line: 426, column: 3, scope: !1192)
!1192 = !DILexicalBlockFile(scope: !1193, file: !1, discriminator: 9)
!1193 = distinct !DILexicalBlock(scope: !1190, file: !1, line: 426, column: 3)
!1194 = !DILocation(line: 426, column: 3, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1193, file: !1, discriminator: 10)
!1196 = !DILocation(line: 426, column: 3, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1174, file: !1, discriminator: 11)
!1198 = !DILocation(line: 428, column: 7, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !576, file: !1, line: 428, column: 7)
!1200 = !DILocation(line: 428, column: 19, scope: !1199)
!1201 = !DILocation(line: 428, column: 24, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1199, file: !1, discriminator: 1)
!1203 = !DILocation(line: 428, column: 32, scope: !1202)
!1204 = !DILocation(line: 428, column: 38, scope: !1202)
!1205 = !DILocation(line: 428, column: 7, scope: !1202)
!1206 = !DILocation(line: 429, column: 21, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1199, file: !1, line: 428, column: 60)
!1208 = !DILocation(line: 429, column: 5, scope: !1207)
!1209 = !DILocation(line: 435, column: 10, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1207, file: !1, line: 435, column: 9)
!1211 = !DILocation(line: 435, column: 9, scope: !1207)
!1212 = !DILocation(line: 436, column: 20, scope: !1210)
!1213 = !DILocation(line: 436, column: 28, scope: !1210)
!1214 = !DILocation(line: 436, column: 35, scope: !1210)
!1215 = !DILocation(line: 436, column: 43, scope: !1210)
!1216 = !DILocation(line: 436, column: 7, scope: !1210)
!1217 = !DILocation(line: 437, column: 3, scope: !1207)
!1218 = !DILocation(line: 438, column: 18, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1199, file: !1, line: 437, column: 10)
!1220 = !DILocation(line: 438, column: 26, scope: !1219)
!1221 = !DILocation(line: 438, column: 33, scope: !1219)
!1222 = !DILocation(line: 438, column: 41, scope: !1219)
!1223 = !DILocation(line: 438, column: 5, scope: !1219)
!1224 = !DILocation(line: 441, column: 3, scope: !576)
!1225 = !DILocation(line: 442, column: 1, scope: !576)
!1226 = !DILocalVariable(name: "handle", arg: 1, scope: !623, file: !1, line: 343, type: !240)
!1227 = !DILocation(line: 343, column: 50, scope: !623)
!1228 = !DILocalVariable(name: "domain", arg: 2, scope: !623, file: !1, line: 344, type: !259)
!1229 = !DILocation(line: 344, column: 44, scope: !623)
!1230 = !DILocalVariable(name: "flags", arg: 3, scope: !623, file: !1, line: 345, type: !252)
!1231 = !DILocation(line: 345, column: 53, scope: !623)
!1232 = !DILocalVariable(name: "taddr", scope: !623, file: !1, line: 350, type: !1233)
!1233 = !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !1, line: 346, size: 224, align: 32, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1233, file: !1, line: 347, baseType: !544, size: 224, align: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1233, file: !1, line: 348, baseType: !526, size: 128, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !1233, file: !1, line: 349, baseType: !484, size: 128, align: 16)
!1238 = !DILocation(line: 350, column: 5, scope: !623)
!1239 = !DILocalVariable(name: "addrlen", scope: !623, file: !1, line: 351, type: !565)
!1240 = !DILocation(line: 351, column: 13, scope: !623)
!1241 = !DILocation(line: 353, column: 7, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !623, file: !1, line: 353, column: 7)
!1243 = !DILocation(line: 353, column: 15, scope: !1242)
!1244 = !DILocation(line: 353, column: 26, scope: !1242)
!1245 = !DILocation(line: 353, column: 29, scope: !1242)
!1246 = !DILocation(line: 353, column: 7, scope: !623)
!1247 = !DILocation(line: 354, column: 5, scope: !1242)
!1248 = !DILocation(line: 356, column: 11, scope: !623)
!1249 = !DILocation(line: 356, column: 3, scope: !623)
!1250 = !DILocalVariable(name: "addr", scope: !1251, file: !1, line: 359, type: !525)
!1251 = distinct !DILexicalBlock(scope: !1252, file: !1, line: 358, column: 3)
!1252 = distinct !DILexicalBlock(scope: !623, file: !1, line: 356, column: 19)
!1253 = !DILocation(line: 359, column: 25, scope: !1251)
!1254 = !DILocation(line: 359, column: 39, scope: !1251)
!1255 = !DILocation(line: 360, column: 12, scope: !1251)
!1256 = !DILocation(line: 360, column: 5, scope: !1251)
!1257 = !DILocation(line: 361, column: 5, scope: !1251)
!1258 = !DILocation(line: 361, column: 11, scope: !1251)
!1259 = !DILocation(line: 361, column: 22, scope: !1251)
!1260 = !DILocation(line: 362, column: 5, scope: !1251)
!1261 = !DILocation(line: 362, column: 11, scope: !1251)
!1262 = !DILocation(line: 362, column: 20, scope: !1251)
!1263 = !DILocation(line: 362, column: 27, scope: !1251)
!1264 = !DILocation(line: 363, column: 13, scope: !1251)
!1265 = !DILocation(line: 364, column: 5, scope: !1251)
!1266 = !DILocalVariable(name: "addr", scope: !1267, file: !1, line: 368, type: !543)
!1267 = distinct !DILexicalBlock(scope: !1252, file: !1, line: 367, column: 3)
!1268 = !DILocation(line: 368, column: 26, scope: !1267)
!1269 = !DILocation(line: 368, column: 40, scope: !1267)
!1270 = !DILocation(line: 369, column: 12, scope: !1267)
!1271 = !DILocation(line: 369, column: 5, scope: !1267)
!1272 = !DILocation(line: 370, column: 5, scope: !1267)
!1273 = !DILocation(line: 370, column: 11, scope: !1267)
!1274 = !DILocation(line: 370, column: 23, scope: !1267)
!1275 = !DILocation(line: 371, column: 5, scope: !1267)
!1276 = !DILocation(line: 371, column: 11, scope: !1267)
!1277 = !DILocation(line: 371, column: 23, scope: !1267)
!1278 = !DILocation(line: 372, column: 13, scope: !1267)
!1279 = !DILocation(line: 373, column: 5, scope: !1267)
!1280 = !DILocation(line: 376, column: 5, scope: !1252)
!1281 = !DILocation(line: 380, column: 23, scope: !623)
!1282 = !DILocation(line: 380, column: 38, scope: !623)
!1283 = !DILocation(line: 380, column: 44, scope: !623)
!1284 = !DILocation(line: 380, column: 53, scope: !623)
!1285 = !DILocation(line: 380, column: 10, scope: !623)
!1286 = !DILocation(line: 380, column: 3, scope: !623)
!1287 = !DILocation(line: 381, column: 1, scope: !623)
!1288 = !DILocalVariable(name: "handle", arg: 1, scope: !626, file: !1, line: 216, type: !240)
!1289 = !DILocation(line: 216, column: 39, scope: !626)
!1290 = !DILocalVariable(name: "req", scope: !626, file: !1, line: 217, type: !227)
!1291 = !DILocation(line: 217, column: 18, scope: !626)
!1292 = !DILocalVariable(name: "q", scope: !626, file: !1, line: 218, type: !226)
!1293 = !DILocation(line: 218, column: 10, scope: !626)
!1294 = !DILocalVariable(name: "h", scope: !626, file: !1, line: 219, type: !1295)
!1295 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !194, line: 224, size: 448, align: 64, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302, !1303}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !1295, file: !194, line: 226, baseType: !222, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !1295, file: !194, line: 227, baseType: !565, size: 32, align: 32, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !1295, file: !194, line: 229, baseType: !519, size: 64, align: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !1295, file: !194, line: 230, baseType: !456, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !1295, file: !194, line: 232, baseType: !222, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !1295, file: !194, line: 233, baseType: !456, size: 64, align: 64, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !1295, file: !194, line: 238, baseType: !259, size: 32, align: 32, offset: 384)
!1304 = !DILocation(line: 219, column: 17, scope: !626)
!1305 = !DILocalVariable(name: "size", scope: !626, file: !1, line: 220, type: !476)
!1306 = !DILocation(line: 220, column: 11, scope: !626)
!1307 = !DILocation(line: 222, column: 3, scope: !626)
!1308 = !DILocation(line: 222, column: 11, scope: !1309)
!1309 = !DILexicalBlockFile(scope: !626, file: !1, discriminator: 1)
!1310 = !DILocation(line: 222, column: 10, scope: !1309)
!1311 = !DILocation(line: 222, column: 3, scope: !1309)
!1312 = !DILocation(line: 223, column: 9, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !626, file: !1, line: 222, column: 46)
!1314 = !DILocation(line: 223, column: 7, scope: !1313)
!1315 = !DILocation(line: 224, column: 5, scope: !1313)
!1316 = !DILocation(line: 224, column: 5, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !1313, file: !1, discriminator: 1)
!1318 = !DILocation(line: 224, column: 5, scope: !1319)
!1319 = !DILexicalBlockFile(scope: !1313, file: !1, discriminator: 2)
!1320 = !DILocation(line: 224, column: 5, scope: !1321)
!1321 = !DILexicalBlockFile(scope: !1313, file: !1, discriminator: 3)
!1322 = !DILocation(line: 226, column: 11, scope: !1313)
!1323 = !DILocation(line: 226, column: 9, scope: !1313)
!1324 = !DILocation(line: 227, column: 5, scope: !1313)
!1325 = !DILocation(line: 227, column: 5, scope: !1317)
!1326 = !DILocation(line: 227, column: 5, scope: !1319)
!1327 = !DILocation(line: 227, column: 5, scope: !1321)
!1328 = !DILocation(line: 229, column: 5, scope: !1313)
!1329 = !DILocation(line: 230, column: 19, scope: !1313)
!1330 = !DILocation(line: 230, column: 24, scope: !1313)
!1331 = !DILocation(line: 230, column: 18, scope: !1313)
!1332 = !DILocation(line: 230, column: 7, scope: !1313)
!1333 = !DILocation(line: 230, column: 16, scope: !1313)
!1334 = !DILocation(line: 231, column: 22, scope: !1313)
!1335 = !DILocation(line: 231, column: 27, scope: !1313)
!1336 = !DILocation(line: 231, column: 32, scope: !1313)
!1337 = !DILocation(line: 231, column: 42, scope: !1313)
!1338 = !DILocation(line: 231, column: 21, scope: !1313)
!1339 = !DILocation(line: 231, column: 7, scope: !1313)
!1340 = !DILocation(line: 231, column: 19, scope: !1313)
!1341 = !DILocation(line: 233, column: 33, scope: !1313)
!1342 = !DILocation(line: 233, column: 38, scope: !1313)
!1343 = !DILocation(line: 233, column: 17, scope: !1313)
!1344 = !DILocation(line: 233, column: 7, scope: !1313)
!1345 = !DILocation(line: 233, column: 15, scope: !1313)
!1346 = !DILocation(line: 234, column: 20, scope: !1313)
!1347 = !DILocation(line: 234, column: 25, scope: !1313)
!1348 = !DILocation(line: 234, column: 7, scope: !1313)
!1349 = !DILocation(line: 234, column: 18, scope: !1313)
!1350 = !DILocation(line: 236, column: 5, scope: !1313)
!1351 = !DILocation(line: 237, column: 22, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1313, file: !1, line: 236, column: 8)
!1353 = !DILocation(line: 237, column: 30, scope: !1352)
!1354 = !DILocation(line: 237, column: 41, scope: !1352)
!1355 = !DILocation(line: 237, column: 14, scope: !1352)
!1356 = !DILocation(line: 237, column: 12, scope: !1352)
!1357 = !DILocation(line: 238, column: 5, scope: !1352)
!1358 = !DILocation(line: 238, column: 14, scope: !1317)
!1359 = !DILocation(line: 238, column: 19, scope: !1317)
!1360 = !DILocation(line: 238, column: 25, scope: !1317)
!1361 = !DILocation(line: 238, column: 28, scope: !1319)
!1362 = !DILocation(line: 238, column: 34, scope: !1319)
!1363 = !DILocation(line: 238, column: 5, scope: !1364)
!1364 = !DILexicalBlockFile(scope: !1352, file: !1, discriminator: 3)
!1365 = !DILocation(line: 240, column: 9, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1313, file: !1, line: 240, column: 9)
!1367 = !DILocation(line: 240, column: 14, scope: !1366)
!1368 = !DILocation(line: 240, column: 20, scope: !1366)
!1369 = !DILocation(line: 240, column: 24, scope: !1370)
!1370 = !DILexicalBlockFile(scope: !1366, file: !1, discriminator: 1)
!1371 = !DILocation(line: 240, column: 30, scope: !1370)
!1372 = !DILocation(line: 240, column: 40, scope: !1370)
!1373 = !DILocation(line: 240, column: 43, scope: !1374)
!1374 = !DILexicalBlockFile(scope: !1366, file: !1, discriminator: 2)
!1375 = !DILocation(line: 240, column: 49, scope: !1374)
!1376 = !DILocation(line: 240, column: 9, scope: !1374)
!1377 = !DILocation(line: 241, column: 7, scope: !1366)
!1378 = !DILocation(line: 243, column: 20, scope: !1313)
!1379 = !DILocation(line: 243, column: 25, scope: !1313)
!1380 = !DILocation(line: 243, column: 34, scope: !1317)
!1381 = !DILocation(line: 243, column: 33, scope: !1317)
!1382 = !DILocation(line: 243, column: 20, scope: !1317)
!1383 = !DILocation(line: 243, column: 42, scope: !1319)
!1384 = !DILocation(line: 243, column: 20, scope: !1319)
!1385 = !DILocation(line: 243, column: 20, scope: !1321)
!1386 = !DILocation(line: 243, column: 5, scope: !1321)
!1387 = !DILocation(line: 243, column: 10, scope: !1321)
!1388 = !DILocation(line: 243, column: 17, scope: !1321)
!1389 = !DILocation(line: 250, column: 5, scope: !1313)
!1390 = !DILocation(line: 250, column: 5, scope: !1391)
!1391 = !DILexicalBlockFile(scope: !1392, file: !1, discriminator: 1)
!1392 = distinct !DILexicalBlock(scope: !1313, file: !1, line: 250, column: 5)
!1393 = !DILocation(line: 251, column: 5, scope: !1313)
!1394 = !DILocation(line: 251, column: 5, scope: !1395)
!1395 = !DILexicalBlockFile(scope: !1396, file: !1, discriminator: 1)
!1396 = distinct !DILexicalBlock(scope: !1313, file: !1, line: 251, column: 5)
!1397 = !DILocation(line: 252, column: 17, scope: !1313)
!1398 = !DILocation(line: 252, column: 25, scope: !1313)
!1399 = !DILocation(line: 252, column: 32, scope: !1313)
!1400 = !DILocation(line: 252, column: 40, scope: !1313)
!1401 = !DILocation(line: 252, column: 5, scope: !1313)
!1402 = !DILocation(line: 222, column: 3, scope: !1403)
!1403 = !DILexicalBlockFile(scope: !626, file: !1, discriminator: 2)
!1404 = !DILocation(line: 254, column: 1, scope: !626)
!1405 = !DILocalVariable(name: "handle", arg: 1, scope: !579, file: !1, line: 445, type: !240)
