; ModuleID = '/data/download/cmake/cmake-master/Utilities/cmcompress/cmcompress.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.cmcompress_stream = type { i32, i32, i64, i64, [69001 x i64], [69001 x i16], i64, i64, i32, i32, i32, i64, i64, i32, i64, i64, i64, i64, i64, i32, i64, i32, i32 (i8*)*, i32 (i8*, i8*, i32)*, i8* }

@lmask = global [9 x i8] c"\FF\FE\FC\F8\F0\E0\C0\80\00", align 1
@rmask = global [9 x i8] c"\00\01\03\07\0F\1F?\7F\FF", align 1
@magic_header = internal constant [3 x i8] c"\1F\9D\00", align 1
@stdout = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [10 x i8] c"Error...\0A\00", align 1
@buf = internal global [16 x i8] zeroinitializer, align 16

; Function Attrs: nounwind uwtable
define i32 @cmcompress_compress_initialize(%struct.cmcompress_stream* %cdata) #0 !dbg !16 {
entry:
  %cdata.addr = alloca %struct.cmcompress_stream*, align 8
  store %struct.cmcompress_stream* %cdata, %struct.cmcompress_stream** %cdata.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.cmcompress_stream** %cdata.addr, metadata !92, metadata !93), !dbg !94

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !73)
!1 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcompress/cmcompress.c", directory: "/data/download/cmake/cmake-master/Utilities/cmcompress")
!2 = !{}
!3 = !{!4, !5, !7, !8, !10, !12, !13, !14}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!7 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "count_int", file: !9, line: 126, baseType: !7)
!9 = !DIFile(filename: "/data/download/cmake/cmake-master/Utilities/cmcompress/cmcompress.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcompress")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "code_int", file: !9, line: 117, baseType: !7)
!14 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!15 = !{!16, !58, !59, !65, !66, !69, !72}
!16 = distinct !DISubprogram(name: "cmcompress_compress_initialize", scope: !1, file: !1, line: 74, type: !17, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "cmcompress_stream", file: !9, line: 137, size: 5521472, align: 64, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !30, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !53, !57}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "n_bits", scope: !20, file: !9, line: 139, baseType: !12, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "maxbits", scope: !20, file: !9, line: 140, baseType: !12, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "maxcode", scope: !20, file: !9, line: 141, baseType: !13, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "maxmaxcode", scope: !20, file: !9, line: 142, baseType: !13, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "htab", scope: !20, file: !9, line: 144, baseType: !27, size: 4416064, align: 64, offset: 192)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 4416064, align: 64, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 69001)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "codetab", scope: !20, file: !9, line: 145, baseType: !31, size: 1104016, align: 16, offset: 4416256)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1104016, align: 16, elements: !28)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hsize", scope: !20, file: !9, line: 147, baseType: !13, size: 64, align: 64, offset: 5520320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "free_ent", scope: !20, file: !9, line: 148, baseType: !13, size: 64, align: 64, offset: 5520384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nomagic", scope: !20, file: !9, line: 149, baseType: !12, size: 32, align: 32, offset: 5520448)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "block_compress", scope: !20, file: !9, line: 155, baseType: !12, size: 32, align: 32, offset: 5520480)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "clear_flg", scope: !20, file: !9, line: 156, baseType: !12, size: 32, align: 32, offset: 5520512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ratio", scope: !20, file: !9, line: 157, baseType: !7, size: 64, align: 64, offset: 5520576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint", scope: !20, file: !9, line: 158, baseType: !8, size: 64, align: 64, offset: 5520640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !20, file: !9, line: 166, baseType: !12, size: 32, align: 32, offset: 5520704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "in_count", scope: !20, file: !9, line: 167, baseType: !7, size: 64, align: 64, offset: 5520768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_out", scope: !20, file: !9, line: 168, baseType: !7, size: 64, align: 64, offset: 5520832)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "out_count", scope: !20, file: !9, line: 169, baseType: !7, size: 64, align: 64, offset: 5520896)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !20, file: !9, line: 172, baseType: !13, size: 64, align: 64, offset: 5520960)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hsize_reg", scope: !20, file: !9, line: 173, baseType: !13, size: 64, align: 64, offset: 5521024)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hshift", scope: !20, file: !9, line: 174, baseType: !12, size: 32, align: 32, offset: 5521088)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fcode", scope: !20, file: !9, line: 176, baseType: !7, size: 64, align: 64, offset: 5521152)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "first_pass", scope: !20, file: !9, line: 177, baseType: !12, size: 32, align: 32, offset: 5521216)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "input_stream", scope: !20, file: !9, line: 180, baseType: !49, size: 64, align: 64, offset: 5521280)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!12, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "output_stream", scope: !20, file: !9, line: 181, baseType: !54, size: 64, align: 64, offset: 5521344)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!12, !52, !5, !12}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !20, file: !9, line: 182, baseType: !52, size: 64, align: 64, offset: 5521408)
!58 = distinct !DISubprogram(name: "cmcompress_compress_start", scope: !1, file: !1, line: 320, type: !17, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!59 = distinct !DISubprogram(name: "cmcompress_compress", scope: !1, file: !1, line: 421, type: !60, isLocal: false, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{!12, !19, !52, !62}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 62, baseType: !64)
!63 = !DIFile(filename: "/opt/llvm-build/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/data/download/cmake/cmake-master/Utilities/cmcompress")
!64 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!65 = distinct !DISubprogram(name: "cmcompress_compress_finalize", scope: !1, file: !1, line: 507, type: !17, isLocal: false, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!66 = distinct !DISubprogram(name: "cl_hash", scope: !1, file: !1, line: 92, type: !67, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !19, !8}
!69 = distinct !DISubprogram(name: "output", scope: !1, file: !1, line: 148, type: !70, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!70 = !DISubroutineType(types: !71)
!71 = !{!12, !19, !13}
!72 = distinct !DISubprogram(name: "cl_block", scope: !1, file: !1, line: 360, type: !17, isLocal: true, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!73 = !{!74, !79, !80, !85}
!74 = !DIGlobalVariable(name: "lmask", scope: !0, file: !1, line: 144, type: !75, isLocal: false, isDefinition: true, variable: [9 x i8]* @lmask)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 72, align: 8, elements: !77)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", file: !9, line: 132, baseType: !11)
!77 = !{!78}
!78 = !DISubrange(count: 9)
!79 = !DIGlobalVariable(name: "rmask", scope: !0, file: !1, line: 145, type: !75, isLocal: false, isDefinition: true, variable: [9 x i8]* @rmask)
!80 = !DIGlobalVariable(name: "magic_header", scope: !0, file: !1, line: 43, type: !81, isLocal: true, isDefinition: true, variable: [3 x i8]* @magic_header)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, align: 8, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!83 = !{!84}
!84 = !DISubrange(count: 3)
!85 = !DIGlobalVariable(name: "buf", scope: !0, file: !1, line: 141, type: !86, isLocal: true, isDefinition: true, variable: [16 x i8]* @buf)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 16)
!89 = !{i32 2, !"Dwarf Version", i32 4}
!90 = !{i32 2, !"Debug Info Version", i32 3}
!91 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!92 = !DILocalVariable(name: "cdata", arg: 1, scope: !16, file: !1, line: 74, type: !19)
!93 = !DIExpression()
!94 = !DILocation(line: 74, column: 62, scope: !16)
!95 = !DILocation(line: 76, column: 3, scope: !16)
!96 = !DILocation(line: 76, column: 10, scope: !16)
!97 = !DILocation(line: 76, column: 18, scope: !16)
!98 = !DILocation(line: 77, column: 3, scope: !16)
!99 = !DILocation(line: 77, column: 10, scope: !16)
!100 = !DILocation(line: 77, column: 21, scope: !16)
!101 = !DILocation(line: 78, column: 3, scope: !16)
!102 = !DILocation(line: 78, column: 10, scope: !16)
!103 = !DILocation(line: 78, column: 16, scope: !16)
!104 = !DILocation(line: 79, column: 3, scope: !16)
!105 = !DILocation(line: 79, column: 10, scope: !16)
